# This Python file uses the following encoding: utf-8

from requests import post

def translate(text:str) -> str:
    endpoint = "http://127.0.0.1:5000/translate"
    response = post(
        endpoint,
        params={
            'q':text,
            'source':'ar',
            'target':'en',
            'format':'text',
            'api_key':''
        }
    )
    if response.ok:
        return response.json()['translatedText']
    raise Exception(response.status_code)

text = "\nقلت: { الحمد } مبتدأ، و { الله } خبر، وأصله النصب، وقرئ به، والأصل: أحمد الله حمداً، وإنما عدل عنه إلى الرفع ليدل على عموم الحمد وثباته، دون تجدده وحدوثه، وفيه تعليم اللفظ مع تعريض الاستغناء\n أي: الحمد لله وإن لم تحمدوه\n ولو قال أحمد الله لما أفاد هذا المعنى، وهو من المصادر التي تُنْصَب بأفعال مضمرة لا تكاد تذكر معها\n والتعريف للجنس أي: للحقيقة من حيث هي، من غير قيد شيوعها، ومعناه: الإشارة إلى ما يَعْرِفه كل أحد أن الحمد ما هو\n أو للاستغراق إذ الحمد في الحقيقة كُلُّه لله إذ ما من خير إلا وهو مُولِيهِ بواسطة وبغير واسطة\n كما قال:\n\n[النّحل: 53]، وقيل: للعهد، والمعهودُ حمدُه تعالى نَفْسَه في أزله\n وقُرِئ { الحمد لله } بإتباع الدال للام، وبالعكس، تنزيلاً لهما من حيث إنهما يستعملان معاً منزلة كلمة واحدة\n ومعناه في اللغة: الثناءُ بالجميل على قصد التعظيم والتبجيل، وفي العُرف: فعل يُنبئ عن تعظيم المُنعم بسبب كونه منعماً\n والشكر في اللغة: فعل يُشعر بتعظيم المنعم، فهو مرادف للحمد العرفي، وفي العرف: صرفُ العبد جميعَ ما أنعم الله عليه من السمع والبصر إلى ما خُلِقَ لأجله وأعطاه إياه\n وانظر شرحنا الكبير للفاتحة في النَّسَبِ التي بيناها نظماً ونثراً\n و { الله } اسم مُرْتَجَلٌ جامد، والألف واللام فيه لازمة لا للتعريف، قال الواحدي: اسم تفرِّد به الباري - سبحانه - يجري في وصفه مجرى الأسماء الأعلام، لا يُعرف له اشتقاق، وقال الأقْلِيشي: إن هذا الاسم مهما لم يكن مشتقّاً كان دليلاً على عين الذات، دون أن يُنظر فيها إلى صفة من الصفات، وليس باسمٍ مشتق من صفة، كالعالِم والحق والخالق والرازق، فالألف واللام على هذا في الله من نفس الكلمة، كالزاي من زيد، وذهب إلى هذا جماعة، واختاره الغزالي، وقال: كل ما قيل في اشتقاقه فهو تعسُّف\n وقيل: مشتق من التَّأَلُّهِ وهو التعبد، وقيل: من الوَلَهَان، وهو الحيرة؟ لتحيُّر العقول في شأنه\n وقيل: أصله: الإلهُ، ثم حذفت الهمزة ونقلت حركتها إلى اللام، ثم وقع الإدغام وفُخمت للتعظيم، إلا إذا كان قبلها كسر\n و { رب } نعت { لله } ، وهو في الأصل: مصدر بمعنى التربية، وهو تبليغ الشيء إلى كماله شيئاً فشيئاً، ثم وُصف به للمبالغة كالصوم والعدل\n وقيل: هو وصفٌ من رَبِّه يَرُبُّهُ، وأصله: رَبَبَ ثم أُدغم، سُمي به المالكُ لأنه يحفظ ما يملكه ويربيه، ولا يطلق على غيره تعالى إلا بقيد كقوله تعالى:\n\n[يُوسُف: 50]\n قال ابن جُزَيّ: ومعانيه أربعة: الإله والسيد والمالك والمصلح، وكلها تصلح في رب العالمين، إلا أن الأرجح في معناه، الإله لاختصاصه بالله تعالى\n\n"
for subtext in text.split('\n'):
    if not any(subtext.strip()):
        continue
    print(subtext)
    translated_text = translate(subtext)
    print(translated_text)
