{
  "one": "one (n): احد، انسان، فرد، مرء، واحد",
  "1": "1 (n): فرد، واحد",
  "i": "i (n): فرد، واحد",
  "single": "single (n): فرد، واحد\n\nsingle (a): فردي",
  "unity": "unity (n): فرد، واحد",
  "two": "two (n): اثنان",
  "2": "2 (n): اثنان",
  "three": "three (n): ثلاث، ثلاثة",
  "3": "3 (n): ثلاث، ثلاثة",
  "able": "able (a): قادر",
  "above": "above (r): اعلى، فوق",
  "academic": "academic (n): اكاديمي، جامعي\n\nacademic (a): اكاديمي، جامعي",
  "accept": "accept (v): اتخذ، احتل، اختار، اخذ، ادرك، استخدم، استعاد، استلم، استمر، استولى، اسر، اشترى، اشتمل، اضطر، اعترف، اقتضى، اقر، التزم، انتهز، بدا، تبنى، تحدى، تضمن، تطلب، تعود، تقبل، تناول، حاز، حقق، حمل، رافق، رضى، رضي، سلم، شارك، صدق، صور، فهم، قبل، قبول، لبي، ملك، نال، وافق",
  "take": "take (v): ابلغ، اتخذ، اجتذب، احتاج، احتل، احدث، احضر، اختار، اخذ، اخرج، ادرك، ادى، اراد، ارتد، ارشد، ازال، استاجر، استخدم، استدعى، استرد، استعاد، استعمل، استلزم، استلم، استمر، استهلك، استولى، اسر، اشار، اشترط، اشترك، اشترى، اشتمل، اصاب، اصطاد، اصطفى، اضطر، اطلق، اعترف، اعدم، اغرى، اقال، اقتضى، اقر، اكتتب، اكتشف، التزم، التمس، التهم، امر، امسك، انتخب، انتقى، انتهز، انزلق، انسحب، ايد، بحث، بدا، برز، تامل، تبرع، تبرعم، تبع، تبنى، تجبر، تحجب، تحدى، تراجع، تصرف، تضمن، تطلب، تعلم، تعود، تغشى، تقبل، تقهقر، تناول، تولى، جاء، جرح، جضر، جلب، حاز، حاول، حتم، حضر، حقق، حقن، حمل، حول، ختم، دبر، درس، دل، رافق، ربط، رحل، رضى، رغب، سال، ساهم، سحب، سدد، سرق، سلم، شارك، شمل، صدق، صرف، صوب، صور، طالب، طالع، طرد، طلب، علم، عنون، فرض، فسر، فصل، فضل، فهم، قاد، قبل، قتل، قرا، قرر، قضى، قنع، كشف، لبي، لزم، لقح، مسك، مطلوب، ملك، نال، نزع، نقل، نكص، نما، هدى، وافق، واكب، وجب، وجه، ورط، وصل، وقع",
  "have": "have (v): ابقى، اثار، احتفظ، احتل، احتوى، احدث، اختار، اخذ، اخرج، ادرك، ارسل، استخدم، استعاد، استعمل، استلم، استمال، استمر، استنتج، استهلك، استولى، اسر، اسعد، اشترى، اشتمل، اصاب، اضرم، اضطر، اطاق، اظهر، اعتبر، اعد، اعطى، اغرى، اقتضى، اقر، اقنع، التفت، التهم، القى، امسك، انتج، اندفع، ايد، بدا، بقي، بنى، تالم، تبقى، تجبر، تحمل، تدهور، ترك، تسلم، تصرف، تصور، تضمن، تطلب، تعود، تكبد، تلقى، تملق، تميز، تناول، جعل، جلب، حاز، حاكم، حث، حرر، حرك، حصل، حضر، حفز، حقق، حمل، حول، حيز، خطب، خلق، دعم، دعى، رافق، ربح، رضى، زار، ساند، سبب، سلم، سمح، شارك، شغل، شن، صدق، صمد، صنع، صور، طول، عاقب، عانى، عزز، عقد، عمل، عوض، عين، غذى، غضب، غلق، فاز، فعل، فهم، قاسى، قاضى، قاوم، قبل، قنع، قوى، كابد، كبت، كبح، كسب، لاقى، لبي، لزم، مدد، ملك، نال، نبه، نجح، نشر، نشط، نقذ، نقل، هيا، واصل، وافق، واكب، وزع، وصل، ولد",
  "agree": "agree (v): ابقى، اتفق، اتلف، احبط، احتفظ، احتوى، استمر، اعد، اقر، التقى، امسك، انحرف، انسجم، اوقف، بارى، تراسل، تزامن، تطابق، تعاون، تفاهم، تكيف، تماشى، تناسق، تهكم، توافق، جدول، جهز، حسب، حقق، حمل، دعم، دون، زود، سخر، سلم، شغل، صمد، ضبط، عبر، عد، عقد، عنف، فحص، قارن، قاوم، قمع، قيد، كافا، كبت، كبح، لاءم، لايم، لزم، ماثل، ملك، ناسب، ناغم، نسق، وازى، وافق، وبخ، ودع، وصل",
  "acting": "acting (n): تمثيل",
  "playing": "playing (n): تمثيل، عزف",
  "act": "act (v): اثار، احتال، ادى، ارتكب، استقر، انتج، انتهى، انهى، اهتم، بارى، باع، بذل، تجرا، تجول، تحرك، تسلى، تصرف، تصنع، تظاهر، تلاعب، تنافس، تنقل، خدع، خدم، راءى، رتب، رحل، زخرف، زعم، سلك، صادر، ضحك، عزف، عمل، فعل، قنع، لعب، مارس، مثل، نافق، نجز، نزل، نظف، نفذ، وضع\n\nact (n): تشريع، تظاهر، روتين، عمل، فصل، فعل، قانون",
  "move": "move (v): اثار، اثر، ادى، ازاح، استبدل، استقر، استمر، استهلك، اشتعل، اصاب، اصبح، اعتزم، اقتلع، اكتشف، الف، انتقل، انطلق، باع، تجبر، تجول، تحرك، تصرف، تظاهر، تكلف، تنقل، حدث، حرك، حول، ختم، خدم، خرج، دار، دمغ، ذهب، رحل، رن، زار، سافر، سمع، شرد، صدم، صرع، ضحك، ضرب، طاف، طعن، عجب، عزف، غادر، فصل، قال، قلد، قنع، كافح، لجا، لدغ، لعب، لكم، مثل، مشى، مضى، نزل، نشط، نفذ، هاجم، واصل، وقع\n\nmove (n): انتقال، تحرك، تنقل، حركة، خطوة، رحلة، سفر، مبادرة، مسيرة، هجرة",
  "do": "do (v): اجاب، احتال، احدث، ادى، ارتكب، استمر، اسعد، اضرم، اعتبر، اعدم، انتج، انتهى، انجز، اندفع، انهى، اهتم، بذل، بنى، تجبر، تدرب، تصرف، تمرن، تملق، تناول، جرى، جعل، حضر، حول، خدع، خدم، خلق، ربح، رتب، رد، رقص، زخرف، سبب، سلك، شن، صادر، صنع، عزف، عمل، عوض، عين، غلق، غنى، فعل، قاضى، قضى، كفى، مارس، مثل، نجح، نجز، نظف، نفد، نفذ، هيا، وصل، وضع\n\ndo (n): برولة",
  "play": "play (v): اتحد، اتخذ، اجتمع، استخدم، التزم، التقى، بارى، تبنى، تحدى، تسلى، تصادم، تعرف، تعود، تقابل، تلاعب، تلهى، تنافس، خاطر، خدع، خدم، راهن، صادف، عبث، عرض، عزف، قابل، قامر، لاعب، لاقى، لعب، لها، مثل، نفذ، واجه\n\nplay (n): تبارز، تحرر، تصرف، دور، شوط، عرض، قمار، لعب، مبارزة، مرح، مزاح، مزايدة، مسرحية، مقامرة، مناورة، ميسر",
  "active": "active (a): نشط",
  "advance": "advance (n): ارتفاع، ارتقاء، ازدياد، تحسن، تحسين، تصاعد، تطور، تقدم، سلفة\n\nadvance (v): احدث، احرز، ارتفع، ارتقى، ازداد، استمر، اسس، انتصر، انهض، ايقظ، برز، تحسن، تحصل، ترقى، تقدم، تويج، جمع، حابى، حاز، حسن، خمر، دعم، رب، ربح، ربى، رفع، رقى، روج، سبق، سير، شال، شجع، شيد، صعد، ضحك، طرح، طور، ظهر، عزز، عضد، فاز، قدم، كسب، مات، مر، مقدما، نال، نجز، نشط، نضج، نقل، نمى، نهض، هذب، واصل",
  "progress": "progress (n): تقدم\n\nprogress (v): احدث، ارتفع، ارتقى، استمر، تحسن، ترقى، تقدم، سير، صعد، ظهر، قدم، مات، مر، مقدما، نضج، نقل، واصل",
  "rise": "rise (n): ارتفاع، ازدياد، تصاعد، زيادة، صعود\n\nrise (v): اجتاز، ارتفع، ازداد، استيقظ، اشتهر، اشرق، اطل، اعتلى، اقتلع، الغى، انبعث، انتصب، انتقل، انقشع، بخصوص، بدي، بزغ، بعث، تجاوز، تسلق، تصاعد، تعاظم، تعالى، ثور، حدث، حكم، حلق، خلى، رفع، سبب، سرق، سطح، صعد، طار، طلع، ظهر، على، قام، قفز، كشف، نبع، نشا، نهض، وقف",
  "further": "further (v): دعم، رفع، روج، شجع، عزز",
  "gain": "gain (v): ابريه، اتصل، احدث، احرز، ارتطم، ارتفع، ازداد، استاهل، استحق، استفاد، استلم، اسعد، اصاب، اضرم، اعتبر، افاد، اكتسب، اكتشف، امتد، انتج، انتصر، انتفع، اندفع، بسط، بلغ، بنى، تاول، تجبر، تحصل، تصرف، تقدم، تملق، تناول، جعل، جنى، حاز، حضر، حقق، حول، خلق، ربح، زاد، سبق، سدد، سمن، شن، صد، صدم، صرف، صنع، ضرب، عوض، عين، غلق، فاز، فعل، قبض، قدم، كسب، مقدما، نال، نجح، نجز، هاجم، هيا، وجد، وصل\n\ngain (n): ربح، زيادة، كسب",
  "win": "win (v): احرز، استمال، استهوى، اكتسب، انتصر، تقدم، حاز، ربح، سبق، ظفر، فاز، كسب، نال، نجح، وفق\n\nwin (n): ربح، فايدة، فوز، كسب",
  "raise": "raise (v): اثار، اجج، احدث، احرق، ارتفع، استثار، استحث، استحضر، استفز، استيقظ، اسس، اشعل، اضرم، اطلق، اقتلع، الغى، انتج، انتقل، انشا، انقشع، انهض، اهاج، ايقظ، برز، تحرش، تحرك، تقدم، تويج، ثور، جلب، جمع، جند، حابى، حث، حرض، حرك، حسن، حشد، حمل، خلى، خمر، رب، ربى، رفع، رقى، زاد، زرع، سحر، سرق، شال، شجع، شعوذ، شيد، ضحك، طرح، طور، عرض، عزز، عضد، على، غضب، غيظ، فصل، قتل، قدم، كشف، مقدما، ناشد، نسا، نشط، نمى، نهض، هاج، هذب، هز، هيج\n\nraise (n): اعلاء، تعلية، رفع، زيادة",
  "hold": "hold (v): ابقى، اتسع، اتفق، احبط، احتجز، احتفظ، احتوى، اخذ، اخفى، استبقى، استحوذ، استضاف، استمر، استوعب، استولى، اسر، اشتمل، اضطر، اضمر، اطاق، اعاد، اعال، اعتبر، اعتصم، اعتقد، اعتقل، اعد، اعطى، اعلن، افترض، اقر، اكد، التفت، التقى، امسك، انتج، انذر، انفق، اهدا، اوقف، اوى، ايد، بقي، تحمل، تزامن، تصرف، تصور، تضمن، تطابق، تعاون، تعقب، تفاهم، تنشر، توافق، حاز، حافظ، حاكم، حبس، حجز، حرم، حسب، حصر، حفظ، حقق، حمل، حوى، دعم، دفع، راس، راعى، رافق، راقب، راى، ربى، رحل، ساوى، سلم، سند، سوق، سيطر، شغل، صان، صرح، صمد، ضام، ضبط، طعم، طول، ظل، ظهر، عانى، عبر، عتل، عزز، عقد، عمل، عنف، غضب، فحص، قاد، قاسى، قاوم، قبل، قرر، قمع، قوى، قيد، كافح، كبت، كبح، كتم، كتمان، كفى، لزم، لطف، لين، مسك، مشى، ملك، نشر، نظم، نقل، هدا، واصل، وافق، واكب، وبخ، وجه، ودع، وسع، وصل، وقف، وقى، ولد\n\nhold (n): احتجاز، اعتقال، امساك، انتظار، تاجيل، تاخير، توقف، حجز، سجن، قبض، كمش، مسك، مسكة، مقبض",
  "fit": "fit (v): اتحد، اتفق، اجتمع، احبط، اعد، اقر، التقى، انحرف، انسجم، اوقف، بارى، تراسل، تصادم، تطابق، تعرف، تقابل، تكيف، تماشى، تناغم، تهكم، توافق، جدول، جهز، حسب، حقق، دون، زود، سخر، سلم، صادف، ضبط، عبر، عد، عنف، فحص، قابل، قارن، قمع، قيد، كافا، كبت، كبح، كسا، لاءم، لايم، لبى، ماثل، ناسب، ناغم، نسق، واجه، وازى، وافق، وبخ، ودع، وصل\n\nfit (n): توافق، مطابقة",
  "check": "check (v): ابقى، اتسع، اتفق، احبط، احتفظ، احتوى، استمر، اشتمل، اعد، اقر، اكتشف، امسك، انحرف، انسجم، اهدا، اوقف، بارى، تاكد، تحرى، تراسل، تضمن، تطابق، تكيف، تماشى، تهكم، توافق، جدول، جهز، حسب، حفظ، حقق، حمل، دعم، دقق، دون، راس، راقب، راى، زود، ساوى، سخر، سلم، سيطر، شغل، صمد، ضام، ضبط، عبر، عد، عرف، عقد، علم، عنف، عنى، فحص، فهم، قارن، قاوم، قمع، قيد، كافا، كافح، كبت، كبح، كتم، كشف، لاءم، لايم، لزم، لطف، لين، ماثل، ملك، ناسب، ناغم، نسق، نظم، هدا، وازى، وافق، وبخ، وجه، ودع، وسع، وصل\n\ncheck (n): اثبات، برهان، تاكيد، تحقق، تدقيق، ضبط، فحص، كبح، لجم، مراجعة",
  "animal": "animal (n): بهيمة، حيوان، دابة، مخلوق، وحش",
  "use": "use (v): استخدم، استعمل، استفاد، استنزف، استنفد، استهلك، انتفع، تطبق، جرب، شغل، طبق، عامل، نشر، وضع، وظف\n\nuse (n): استخدام، استعمال، استغلال، استهلاك، انتفاع، تعود، توظيف، دور، طبع، عادة، عمل، فايدة، مهمة، نفع، وظيفة",
  "apply": "apply (v): استخدم، استعمل، استفاد، انتفع، تطبق، جرب، شغل، طبق، عامل، نشر، وضع، وظف",
  "practice": "practice (v): ابدى، استخدم، استعمل، اعاد، تدرب، تعاطى، تمرن، ثقب، جرب، حفر، درب، رياضة، زاول، طبق، ظهر، علم، كرر، مارس، نثر، نغب، نفذ\n\npractice (n): اسلوب، تدريب، تمرين، عادة، غرار، مارس، ممارسة، نمط، نموذج",
  "applied": "applied (a): مستخدم، مطبق",
  "allow": "allow (v): اتاح، اجاز، اجر، احتاط، ادخل، اذن، ارجا، استولى، اشترط، اعترف، اعطى، ايد، تاهب، تحفظ، ترك، تزود، جهز، حجز، حفظ، خصص، دخر، رخص، رصد، زود، سلم، سمح، شجع، صرح، عد، فرد، فرق، قبل، مد، منح، وافق، ودع",
  "appropriate": "appropriate (v): اجاز، احتاط، ادخل، ارجا، استولى، اعترف، تحفظ، حجز، حفظ، خصص، دخر، رصد، سلم، سمح، فرد، فرق، منح",
  "portion": "portion (v): تخلى، حدد، خص، خصص، رجع، عزا، عين، قسم، مجد، نسب، وزع\n\nportion (n): اوضاع، جزء، حصة، حظ، سهم، شطر، ظرف، ظروف، قدر، قسط، قسم، قسمة، نصيب",
  "put": "put (v): اخرج، اخمد، اربك، استثمر، استقر، استهل، اسس، اعتبر، اقترح، بدا، برم، بسط، تاهب، تخلى، تظاهر، تكلف، تلاءم، ثبت، جمد، حدث، حدد، حرض، خدع، خصص، دبر، دخر، دفن، راهن، ربط، رتب، رجع، رسم، رصع، ركب، زرع، صاغ، صنف، ضبط، طرح، طلب، عرض، عزا، عين، غرب، فتل، فرض، قرر، كمن، كون، مجد، نسب، نظم، وضع، وقع",
  "assume": "assume (v): اتخذ، احتسب، اختلق، اخذ، ارتدى، استولى، اسر، اصطنع، اضطلع، اعتبر، اعتقل، اغتصب، افترض، انتهز، انكمش، تبنى، تجعد، تصنع، تصور، تظاهر، تكلف، تولى، حاكى، حجز، حسب، دعا، زعم، ساد، سطا، سلم، صادر، قدر، قلد، لبس",
  "average": "average (n): معدل",
  "aside": "aside (r): جانبا",
  "by": "by (r): جانبا",
  "away": "away (r): جانبا",
  "back": "back (n): خلف، دبر، ظهر، عجيزة، قفا، موخرة\n\nback (v): احتمل، اعال، ايد، تحمل، دعم، ساعد، ساند، سند، شجع، قوى، ناصر",
  "rear": "rear (n): الخلف، خلف، دبر، ردف، طرف، ظهر، عجز، عجيزة، قفا، كفل، مقعد، موخرة\n\nrear (v): اجتاز، ارتفع، اشتهر، اشرق، اطل، اقتلع، الغى، انتقل، انقشع، بزغ، بعث، تجاوز، تصاعد، تعالى، ثور، حدث، حلق، خلى، ربى، رفع، سبب، سرق، صعد، طار، طلع، على، قام، كشف، نبع، نسا، نهض، وقف",
  "support": "support (v): ابتعد، اثبت، احتمل، استوعب، اصطف، اطاق، اعال، اعطى، اكد، التفت، امسك، انتج، انسجم، اوقف، ايد، برر، بقي، تالم، تحمل، تدهور، تراجع، تراسل، ترشح، ترك، تساهل، تصور، تطابق، تكبد، توافق، ثبت، جزم، حاكم، دعم، ساعد، سامح، ساند، سمح، سند، شجع، صبر، صدق، طول، عاقب، عانى، عزز، غذى، غضب، قاسى، قاوم، قرر، قوى، كابد، لاقى، مدد، مسك، ناصر، نشر، هضم، وازى، واصل، واقف، واكب، وثق، وقف، ولد\n\nsupport (n): اساس، امداد، تاييد، تعزيز، تقوية، دعامة، دعم، ركيزة، مساندة",
  "bad": "bad (n): الرديء، السوء، السيء، الطالح",
  "base": "base (n): اساس، اصل، جذر، قاعدة، مبدا، مبنى، نوكليوتيد\n\nbase (v): اسس، اقام، انشا، بنى",
  "foot": "foot (n): اساس، رجل، سفل، قاعدة، قدم، مشاة\n\nfoot (v): تمشى، سار، مشى",
  "basis": "basis (n): اساس، اصل، جذر، قاعدة، مبدا، مبنى",
  "stand": "stand (n): توقف، صمود، قاعدة، مقاومة، نظرة\n\nstand (v): ابتعد، احتمل، استوعب، اصطف، اطاق، اعال، اعطى، اقام، التفت، انتج، انتصب، اوقف، ايد، بقي، تالم، تحمل، تدهور، تراجع، ترشح، ترك، تزوج، تساهل، تصور، تكبد، حاكم، دعم، ساعد، سامح، سمح، سند، شجع، صبر، طول، عاقب، عانى، غضب، قاسى، قام، قاوم، قوى، كابد، لاقى، ناصر، نشر، نصب، نهض، هضم، واجه، واقف، واكب، وقف، ولد",
  "establish": "establish (v): اثبت، احدث، اختبر، استعرض، اسس، اسعد، اشار، اشتهر، اضرم، اظهر، اعتبر، اعلن، اقام، اكد، الف، انتج، اندفع، انشا، اوجد، بدا، برهن، بنى، بين، تجبر، تصرف، تظاهر، تملق، تناول، توطيد، ثبت، جعل، حضر، حول، خلق، ربح، رسخ، سبك، شرح، شكل، شن، صنع، طهر، ظهر، عرض، عوض، عين، غلق، فعل، قاد، قدم، قرر، مثل، نجح، نصب، هيا، وجب، وصف، وصل، وضح، وضع، وطد، وطن",
  "ground": "ground (v): اسس، اقام، انشا، بنى\n\nground (n): ارض، ارضية، الارض، اليابسة، بر، تراب، تربة",
  "found": "found (v): احدث، اسس، اشتهر، اقام، الف، انشا، اوجد، بدا، برهن، بنى، توطيد، ثبت، رسخ، سبك، شكل، عين، قرر، نصب، وجب، وطد، وطن",
  "beat": "beat (n): ضرب\n\nbeat (v): اجتاز، اجهد، ارهق، استنزف، استنفد، انفق، انهك، تشابه، تغلب، تفوق، تك، تكتك، جرش، جلد، حاز، خفق، دق، راس، رطم، رفرف، سحق، ضرب، ضنى، طرق، فاز، فني، فول، قرع، قهر، كد، لمع، نبض، نقر، نهك",
  "beautiful": "beautiful (a): جميل",
  "become": "become (v): اصبح، بات، صار",
  "go": "go (v): اثار، احدث، اخسر، اخمد، ادار، ادى، استقر، استمر، استهلك، اصبح، اضعف، اعتزم، اعد، اعطي، اعلن، امتد، امر، انتشر، انتمى، انتهى، انطلق، انقرض، انهار، اهمل، بات، باع، بدا، بقي، بهت، بوق، تبادل، تبرز، تجاوز، تجول، تحرك، تخلى، تخمد، تردد، تصرف، تعطل، تعفن، تغاضى، تغوط، تقدم، تنقضي، تنقل، توقف، ثبت، جهل، حدث، خذل، خرج، دار، ذهب، راح، رحل، رن، زار، زفر، سافر، سبر، سقط، سمع، سير، شرع، شغل، صار، صوت، ضحك، طاف، عاد، عبر، عمل، غادر، فحص، فشل، فقد، فلس، فني، قاد، قاضى، قال، قرع، قنع، كمل، لجا، لعب، مات، مر، مرر، مشى، مضى، منح، موت، ناسب، نجا، نجح، نزل، نشر، نفذ، هلك، واصل\n\ngo (n): تجربة، محاولة",
  "get": "get (v): ااشترى، ابلغ، اتى، اثار، اجتذب، احدث، احرز، احضر، اخرج، ادرك، ادى، ازداد، استثمر، استمال، استنتج، استهل، استولى، اسر، اسعد، اشتد، اشتمل، اصاب، اصبح، اضرم، اضطر، اطاق، اعتبر، اغرى، اقتنى، اقنع، اكتسب، امسك، انتج، اندفع، ايد، بات، بدا، بقي، بلغ، بنى، تالم، تجبر، تحمل، تدهور، ترك، تصرف، تضمن، تفشى، تكبد، تلقى، تملق، تناول، ثبت، جاء، جذب، جضر، جعل، جلب، حاز، حث، حدث، حرك، حصل، حضر، حفز، حقق، حول، حيز، خدع، خطر، خفق، خلق، دعى، راع، رافق، ربح، زاد، زار، زرع، ساند، ساوى، سبب، سبى، سحر، سرق، سمح، شرع، شرك، شن، صار، صنع، صياح، طور، ظهر، عاقب، عانى، عبر، عرض، عزز، عوض، عين، غذى، غلق، فاجا، فاز، فعل، فهم، قاسى، قاضى، قدم، قنع، قوى، كابد، كبر، كسب، لاقى، لحق، لفت، لقي، لمح، مدد، ملك، نال، نبت، نبه، نجح، نشا، نشط، نظرة، نقل، نما، نمى، هيا، واصل، واكب، وجد، وسع، وصل، وفق، وقع، ولد",
  "beginning": "beginning (n): ابتداء، اساس، استشهلال، استفتاح، استهلال، اصل، انطلاق، بدء، بداية، جذر، غرة، فاتحة، مبدا، مستهل، مصدر، مطلع، منشا، ينبوع",
  "first": "first (n): ابتداء، استشهلال، استفتاح، الاول، انطلاق، اول، بدء، بداية، غرة، فاتحة، مستهل، مطلع\n\nfirst (a): اول، اولى",
  "start": "start (n): ابتداء، استشهلال، استفتاح، استهلال، انطلاق، بدء، بداية، غرة، فاتحة، مستهل، مطلع\n\nstart (v): ابتدا، استهل، افتتح، انشا، انصرف، انطلق، بادر، باشر، بدء، بدا، ذهب، رحل، شرع، شغل، غادر، فارق",
  "source": "source (n): اساس، اصل، انطلاق، بدء، بداية، جذر، مبدا، مرجع، مصدر، منشا، ينبوع",
  "begin": "begin (v): ابتدا، استهل، بادر، بدا، شرع، وقع",
  "can": "can (n): حمام، ردف، صفيحة، طرف، عجز، علبة، قفا، كفل، كنيف، مرحاض، مقعد، موخرة\n\ncan (v): استطاع، اقال، اوقف، سجن، طرد، علب، فصل، قدر، قصدر، مكن، نبذ",
  "seat": "seat (n): ردف، طرف، عجز، قفا، كرسي، كفل، مقعد، مكان، موخرة\n\nseat (v): اجلس، استقر، اقعد، انعقد، بدل، بقي، جلس، حط، قعد",
  "bottom": "bottom (n): اسفل، ردف، طرف، عجز، قفا، كفل، مقعد، موخرة\n\nbottom (v): اذرك",
  "behind": "behind (n): ردف، طرف، عجز، قفا، كفل، مقعد، موخرة",
  "better": "better (v): استفاد، اصلح، اغتنم، تحسن، جمل، جود، حسن، طور، عدل",
  "large": "large (a): كبير",
  "big": "big (a): كبير",
  "negro": "negro (n): بلاك",
  "black": "black (a): اسود",
  "bear": "bear (v): ابتعد، ابري، ابعد، ابقى، اتسع، اثمر، احتفظ، احتمل، احتوى، ادخل، ادى، ارتدى، ارسل، استبقى، استحوذ، استمر، استوعب، استولى، اشتمل، اصطف، اضطر، اطاق، اعال، اعتمد، اعطى، التفت، القى، امسك، امل، انتج، انتظر، اوقف، ايد، بقي، تالم، تحمل، تخلى، تدهور، تراجع، ترشح، ترقب، ترك، تساهل، تصرف، تصور، تضمن، تعقب، تقلد، تكبد، تنازل، تنشر، توقع، تولى، حاز، حاكم، حرر، حصل، حل، حمل، حملت، حول، حوى، خضع، خطب، دبر، دعم، دفع، رافق، ربح، رحل، رد، ساعد، سامح، ساوى، سلك، سلم، سمح، سند، سوق، شجع، شغل، صادر، صبر، صرف، صمد، طرد، طول، عاقب، عانى، عبر، عتل، عزز، عقد، غضب، غل، قاد، قاسى، قاوم، قضى، قوى، كابد، كبت، كبح، كفى، لاقى، لبس، لزم، مشى، ملك، ناصر، نشر، نقذ، نقل، هضم، واقف، واكب، ودع، وزع، وسع، وصل، وضع، وفى، وقف، ولد، وهب\n\nbear (n): دب",
  "birth": "birth (v): ارسل، اشتمل، اضطر، اطاق، اعطى، التفت، القى، انتج، تحمل، تصور، تضمن، حاز، حاكم، حرر، حول، خطب، سلم، طول، عانى، غضب، قاسى، ملك، نشر، نقذ، نقل، واكب، وزع، ولد\n\nbirth (n): ذرية، مولد، وضع، ولادة",
  "carry": "carry (v): ابري، ابعد، ابقى، اتسع، اثار، احتفظ، احتوى، اخذ، ادى، استحوذ، استمر، استولى، اشتمل، اطاق، اعتمد، اعطى، اقنع، التفت، امال، امسك، امل، انتج، انتظر، تحمل، ترقب، تصرف، تصور، تضمن، تعقب، تنشر، توقع، تولى، جرف، حاكم، حل، حمل، حملت، حوى، دبر، دعم، دفع، رافق، رحل، ساوى، سلك، سوق، شغل، صادر، صمد، طرد، طول، عانى، عبر، عتل، عزز، عقد، غضب، قاد، قاسى، قاوم، كبت، كبح، كسب، كفى، لزم، مشى، ملك، نشر، نفى، نقل، واكب، وسع، وصل، وقف، ولد",
  "pay": "pay (v): اثمر، ادخل، ادى، اطاق، اعطى، التفت، انتج، تحمل، تخلى، تصور، تنازل، حاكم، حصل، خضع، دفع، ربح، رد، سدد، صرف، طول، عانى، عوض، غضب، غل، قاسى، قضى، نشر، واكب، ودع، وفى، ولد، وهب\n\npay (n): اجر، دخل، راتب، مرتب، مكافاة",
  "conduct": "conduct (v): ابري، ابعد، احتل، اختار، اخذ، ادار، ادرك، ادى، ارشد، استحوذ، استعاد، استلم، استمر، استولى، اسر، اشترى، اطاق، اعطى، اقتضى، التفت، انتج، انفع، بدا، تاجر، تحمل، ترقب، تصرف، تصور، تطلب، تعامل، تعقب، تعود، تناول، تنشر، تولى، حاكم، حقق، حل، حمل، دبر، دعم، دفع، رافق، رحل، سلك، سوق، شارك، صادر، صور، طرد، طول، عالج، عانى، عبر، عتل، عزز، عمل، غضب، قاد، قاسى، قبل، كفى، مشى، نال، نشر، نفذ، نقل، هدى، واصل، واكب، وجب، وجه، وزع، وصل، وقف، ولد\n\nconduct (n): تصرف، سلوك، سيرة",
  "expect": "expect (v): استحوذ، استولى، اطاق، اعتمد، اعطى، التفت، امل، انتج، انتظر، تحمل، ترقب، تصرف، تصور، تطلب، تطلع، تعقب، تنشر، توقع، حاكم، حمل، حملت، دعم، دفع، رافق، رحل، سوق، طلب، طول، عانى، عبر، عتل، عزز، غضب، قاد، قاسى، كفى، مشى، نشر، نقل، واكب، وقف، ولد",
  "born": "born (a): مولود",
  "break": "break (v): اباح، ابلغ، اخبر، اختتم، اخسر، اذاع، ارهق، استخلص، اضعف، اعاق، اعترض، اعلن، افترق، افشى، اقتحم، اكتشف، انتشر، انتهك، انسحب، انشق، انصرف، انطلق، انفجر، انفصل، انقرض، انقسم، انكسر، انهار، اهمل، اوقف، باح، بهت، تجزا، تخلى، تدهور، ترك، تساقط، تشعب، تشقق، تطور، تعرى، تعطل، تفتت، تفرق، تفكك، تفوق، تقطع، تكسر، تمزق، توقف، ثار، جرح، جزا، حطم، خالف، خان، خذل، خرق، دحض، ذاع، رحل، روض، سحق، سقط، شارك، شاع، شق، صدع، ظهر، عارض، عرض، عود، فاصل، فتت، فرق، فشل، فصل، فض، فضح، فك، فكك، فلس، فلق، قاطع، قدم، قسم، قطع، كسر، كشف، لفظ، منح، ميز، نشر، نصح، نفض، نقض، هجر، وزع\n\nbreak (n): ارجاء، استراحة، ايقاف، تحطيم، تعليق، تكسير، توقف، كسر",
  "separate": "separate (v): اخبر، اختتم، اذاع، ارهق، استخلص، اضعف، افترق، افشى، اقتحم، انتهك، انسحب، انشعب، انشق، انصرف، انطلق، انفجر، انفصل، انفك، انقسم، انكسر، انهار، اوقف، بوب، تجزا، تخالف، تخلق، تخلى، تدهور، ترتب، ترك، تساقط، تشعب، تطور، تفارق، تفتت، تفرق، تفكك، تفوق، تقاسم، تقطع، تكسر، تمزق، تميز، جرح، جزا، حصص، حطم، خان، خرق، خلق، دحض، رتب، رحل، روض، سحق، شارك، شرح، شق، صدع، صنف، عاشر، عرف، عزل، عنون، عود، فاصل، فتت، فرز، فرق، فصل، فض، فك، فكك، فلس، فلق، فهم، قسم، قطع، كسر، ميز، نصح، نظم، نفض، نقض، وزع\n\nseparate (a): مستقل، منفصل",
  "stop": "stop (v): احبط، اخرج، اربك، استقال، اعاق، اعترض، الغى، انتهى، انسد، انقضى، انقطع، انهى، اوقف، بقي، تحتجب، تخلى، تردد، ترك، تم، توقف، جمع، حاصر، حجز، حظر، حول، خدر، سد، عاق، علق، غادر، فاصل، فرغ، قتل، قطع، كف، منع، هجر، هزم\n\nstop (n): انسداد، انغلاق، ايقاف، توقف، محطة، وقفة",
  "die": "die (v): اخسر، اخمد، ادى، استهلك، اصبح، اضعف، اعتزم، اعد، انتهى، انطلق، انقرض، انهار، اهمل، بهت، تبادل، تبرز، تجاوز، تخلى، تخمد، تعطل، تعفن، تغاضى، تغوط، تنقضي، توقف، جهل، حدث، خذل، خرج، دار، ذهب، رحل، زفر، سافر، سقط، سير، عبر، غادر، فشل، فقد، فلس، فني، قال، لجا، لعن، مات، مر، مرر، مشى، مضى، موت، نجح، هلك\n\ndie (n): نرد",
  "part": "part (v): اختتم، اذاع، ارهق، استخلص، اضعف، افترق، افشى، اقتحم، انتهك، انسحب، انشعب، انشق، انصرف، انطلق، انفجر، انفصل، انفك، انقسم، اوقف، تجزا، تخلى، تدهور، ترك، تساقط، تشعب، تطور، تفارق، تفرق، تفكك، تفوق، تقاسم، تقطع، تكسر، تمزق، جرح، جزا، حصص، حطم، خان، خرق، دحض، ذهب، رحل، روض، سحق، شارك، شق، صدع، عود، غادر، فارق، فاصل، فتت، فرق، فصل، فض، فك، فكك، فلس، فلق، قسم، قطع، كسر، ميز، نصح، نفض، نقض، وزع\n\npart (n): اقليم، جانب، جزء، حصة، دور، سهم، شخصية، شطر، طرف، قسم، قطعة، منطقة، مهمة، نحو، نصيب، وظيفة",
  "broken": "broken (a): محطم، مكسور",
  "build": "build (v): اتكل، احدث، اسعد، اضرم، اطمح، اعتبر، اعتمد، اقام، انتج، اندفع، انشا، بنى، تجبر، تصرف، تملق، تناول، جعل، حضر، حول، خلق، ربح، رتب، ركب، شن، شيد، صنع، عزز، عوض، عين، غلق، فعل، نجح، نظم، هيا، وصل\n\nbuild (n): بدن، بنية، هيكل",
  "make": "make (v): ابتدع، ابدع، اتخذ، اتصل، اتكل، اثار، احتال، احدث، احرز، اخرج، ادى، ارتطم، ارتكب، ازداد، استاهل، استحق، استعد، استلم، استمال، استنتج، اسس، اسعد، اشتمل، اشتهر، اصاب، اصلح، اضرم، اضطر، اطمح، اعاق، اعتبر، اعتمد، اعد، اعطى، اغرى، اقام، اقنع، اكتسب، اكتشف، الف، امتد، انتج، انتصر، انتهى، انجز، اندفع، انشا، انهى، اهتم، بذل، برهن، بسط، بلغ، بنى، تالف، تاول، تجبر، تحصل، تصرف، تضمن، تلاعب، تملق، تناول، توطيد، ثبت، جعل، جلب، جنى، حاز، حث، حدد، حرك، حصل، حضر، حفز، حقق، حل، حول، حيز، خدع، خلق، دعى، ربح، رتب، رسخ، ركب، ركز، زار، زخرف، سبب، سدد، شفى، شكل، شن، شيد، صد، صدم، صرف، صنع، ضرب، طبخ، طها، ظهر، عالج، عدل، عرض، عزز، عقد، عمل، عوض، عين، غلق، فاز، فعل، قاضى، قبض، قدم، قرر، قنع، كسب، كون، لصق، لفق، ملك، نال، نبه، نجح، نجز، نشط، نظف، نظم، نفذ، هاجم، هيا، وجد، ورط، وصل، وضع، وطد، وطن، ولد",
  "busy": "busy (v): احتل، اخذ، استغرق، اشغل، اقام، سكن، شغل",
  "camp": "camp (n): زمرة، شلة، لجنة، مخيم، معسكر",
  "capable": "capable (a): قادر",
  "capital": "capital (n): عاصمة",
  "careful": "careful (a): حذر، منتبه",
  "center": "center (n): جوهر، خلاصة، صميم، فحوى، قلب، لب، مركز، منتصف، وسط\n\ncenter (v): برشم، بير، تبار، تجمع، تركز، تمركز، جذب، حدد، حشد، ركز، كثف، وسط",
  "middle": "middle (n): مركز",
  "heart": "heart (n): جوهر، حب، خلاصة، رغبة، صميم، فحوى، قلب، لب، مركز، مزاج، ميل",
  "eye": "eye (n): عين، مركز",
  "central": "central (n): بدالة، سنترال",
  "exchange": "exchange (n): ابدال، استبدال، بدالة، بورصة، تبادل، سنترال\n\nexchange (v): ابدل، استبدل، بادل، بدل، تبادل، تبدل، تغير، غير، قايض، قطع، قلب",
  "opportunity": "opportunity (n): فرصة",
  "chance": "chance (n): احتمال، امكان، امكانية، حظ، صدفة، فرصة، مصادفة\n\nchance (v): جازف، خاطر، راهن، صادف، ضارب، غامر، قابل، قامر، لاقى، لقي، وجد",
  "risk": "risk (v): جازف، خاطر، راهن، صادف، ضارب، غامر، قامر\n\nrisk (n): خطر، خطورة، محذور، مخافة",
  "find": "find (v): احس، ادان، استبان، استرجع، استرد، استعاد، اكتسب، اكتشف، انتهى، انهى، بلغ، تاكد، تحرى، تحقق، تلقى، توصل، حتم، حدد، حسم، حقق، حكم، شعر، صادف، صفى، عاد، فصل، قابل، قرر، كشف، لاحظ، لاقى، لحق، لقي، نال، وجد\n\nfind (n): اكتشاف، عثور، كشف",
  "happen": "happen (v): استمر، اصاب، اعد، اهمل، تبادل، تبرز، تجاوز، تجسد، تحقق، تغاضى، تغوط، جد، جرى، جسد، جمل، جهل، حدث، حصل، حقق، دار، رحل، سير، صادف، ظهر، عبر، قابل، لاقى، لقي، مر، مرر، مس، نجح، واصل، وجد، وقع، يوجد",
  "change": "change (v): ابدل، اختلف، استبدل، القى، انتقل، اهل، بادل، بدل، تبادل، تبدل، تحرك، تحفظ، تحول، تغير، تفاوت، تقلب، تنقل، تنوع، جلد، حدد، حسن، حور، حول، خصى، خفف، خول، رحل، سكن، عدل، غلظ، غير، قايض، قطع، قلب، قيد، كيف، لطف، نقل، نوع، وجه\n\nchange (n): تبديل، تعديل، تغير، تغيير",
  "characteristic": "characteristic (n): خاصية، صفة، طابع، مظهر، معلم، ميزة",
  "charge": "charge (v): ابعد، اتهم، اثقل، ادخل، ارتكب، ارسال، ارسل، استودع، اشبع، اعلن، اقترف، امن، اودع، بعث، جهز، حاسب، حجر، حدد، حشا، حمل، حول، خصص، سلم، شحن، طرد، عبا، عين، فرد، فرض، لقم، مرسل، منصب، نزل، نفذ، هاجم، هجم، واجب، ودع، ورط، وصى، وضع، وظف، وفد\n\ncharge (n): اتهام، اهتمام، بعثة، تذمر، تكلفة، تهمة، ثمن، حشوة، حماية، دين، رعاية، شحنة، شكاية، شكوى، فاتورة، مهمة، وقاية",
  "bill": "bill (v): اتهم، اثقل، ادخل، اشبع، اعلن، حاسب، حمل، منصب، هاجم، واجب، وصى\n\nbill (n): اعلان، بيان، ترفيه، حساب، فاتورة، قايمة، كشف، ملصق، ملصقة",
  "send": "send (v): ابعد، اتهم، اثقل، ارتكب، ارسال، ارسل، استثمر، اشبع، اطلق، اقترف، اودع، برق، بعث، حجر، حدث، حمل، حول، سلم، شحن، صنف، طرد، طلب، عين، فرض، مرسل، منصب، نزل، نفذ، نقل، هاجم، واجب، ودع، ورط، وصى، وضع، وفد، وقع",
  "chemical": "chemical (a): كيماوي، كيميايي",
  "head": "head (n): باب، دماغ، راس، رييس، زعيم، شيخ، عريف، عقل، عنوان، قضية، مسالة، مشكلة، مقدمة\n\nhead (v): ادار، ارشد، تراس، تزعم، تصدر، تقدم، توجه، حرك، حصد، ذهب، رحل، سافر، ساق، سير، قاد، مضى، هدى، واجه، وجه، وصل",
  "chief": "chief (n): رييس، زعيم، شيخ، عريف",
  "choice": "choice (n): اختيار، انتقاء، بديل، خيار",
  "pick": "pick (n): اختيار، انتقاء\n\npick (v): احتال، احتج، اختار، اخذ، اقتلع، التقط، انتخب، انتقى، تشجع، ثقت، جرد، جنى، رفع، سرق، ضايق، عزف، غسل، قضم، قطف، لقط، مص، نتف، نزع، نشل، نظف، هدم",
  "clean": "clean (v): ازال، استنفد، استهلك، رتب، طهر، غسل، مسح، نظف، نقى\n\nclean (a): طاهر، نظيف",
  "clear": "clear (v): ابري، اجاز، اخلى، ازال، استاهل، استحق، استلم، اعد، اعفا، اكتسب، انقشع، اهمل، اوضح، باع، برا، تبادل، تبرز، تجاوز، تغاضى، تغوط، تنحنح، جنى، جهل، حدث، حرر، حل، خلص، خول، ربح، رحل، رخص، سمح، سير، شرح، صحا، صرف، صفى، طالب، عبر، فسر، قبض، كسب، مر، مرر، مشرق، نجح، نجز، نظف، نور، واثق، وثب، وضح",
  "pass": "pass (v): ابري، اتصل، اجاز، اجتاز، اختفى، اخمد، ادرك، ادى، ازال، استخدم، استعمل، استمر، استن، استهلك، اصبح، اضعف، اعتزم، اعد، اعطى، امتد، امضى، انتشر، انتهى، انخفض، انطلق، انفق، انقشع، انقضى، انهار، اهمل، اوصل، باع، بدد، بذر، بذل، بز، بسط، بلغ، بهت، تاول، تبادل، تبرز، تجاوز، تخطى، تخمد، تضاءل، تعفن، تغاضى، تغوط، تفوق، تلاشى، تنقضي، توقف، جاوز، جد، جرى، جهل، حدث، حرر، حصل، خبر، خرج، خف، خلص، خول، دار، ذبل، ذهب، ربح، رحل، رخص، زفر، سافر، سحب، سلم، سمح، سير، شحب، شرع، صادف، صحا، صفى، ضنى، طالب، ظهر، عبر، غادر، غالب، غلط، فاق، فسر، فضل، فقد، فني، قاد، قال، قدم، قضى، لجا، مات، مر، مرر، مشرق، مشى، مضى، موت، نجح، نشر، نظف، نقل، نهك، نور، هلك، واثق، واصل، وثب، وصل، وقع، يوجد\n\npass (n): ازمة، تجربة، شدة، ضيق، عسر، كرب، محاولة",
  "realize": "realize (v): اتم، اخرج، ادرك، استاهل، استحق، استلم، استوعب، اكتسب، تيقن، جنى، حقق، ربح، صرف، عرف، فهم، قبض، كسب، لاحظ، ميز، نجز، نفذ، وعى",
  "last": "last (n): اجل، اختتام، اخر، انتهاء، خاتمة، ختام، ممات، منية، موت، نحب، نهاية، وفاة\n\nlast (v): استمر، بقي، ثبت، دام، نجا\n\nlast (a): اخر، اخير",
  "conclusion": "conclusion (n): اختتام، انتهاء، انهاء، خاتمة، ختام، ختم، فسخ، قرار، نهاية",
  "close": "close (n): اختتام، انتهاء، خاتمة، ختام\n\nclose (v): اتفق، اختتم، اشتبك، اغلق، اقفل، انثنى، انسد، انغلق، انهى، ثنى، حبس، حجز، ختم، راقب، سد، ضاعف، ضيق، طبق، طوى، عانق، عقد، غلق، غمض، فض، قفل، كسر\n\nclose (a): قريب",
  "end": "end (n): اخر، انتهاء، انهاء، باقية، بقية، حد، خاتمة، ختام، زايدة، طرف، غاية، موت، نهاية، هدف، هلاك\n\nend (v): اختتم، اربك، اعترض، الغى، انتهى، انسد، انقضى، انقطع، انهى، اوقف، بقي، تردد، تم، توقف، حجز، حول، سد، علق، فرغ، قتل، قصد، قطع، منع، هزم",
  "near": "near (a): قريب\n\nnear (v): اقترب، دنا، قرب",
  "cold": "cold (n): برد، برودة\n\ncold (a): بارد، فاتر",
  "color": "color (n): بريق، شكل، صباغ، صبغة، لمعان، لون، مظهر، ملونون\n\ncolor (v): خضب، دهن، شوه، صبغ، طلى، لون، يمجد\n\ncolor (a): ملون",
  "approach": "approach (n): سبيل، طريق، قرب، مدخل\n\napproach (v): اتصل، اقترب، اقترح، بدا، دنا، شرع، ضاهى، فاتح، قرب، ناقش، هاجم",
  "coming": "coming (n): قدوم، قرب، مجيء",
  "come": "come (v): اتى، اثار، احصى، اخرج، اصاب، اعتبر، بلغ، تلف، جاء، جلب، جمع، حدث، حسب، حصل، حضر، حيز، خطر، خفق، رقم، زار، ساوى، عادل، عبر، عد، فاز، قدم، كسب، نال، هدم، هيا، وصل، وفق، وقع",
  "total": "total (v): اتى، احصى، اصاب، اعتبر، بلغ، تلف، جاء، جمع، حدث، حسب، حضر، خطر، خفق، رقم، ساوى، عادل، عبر، عد، قدم، هدم، وصل، وفق، وقع\n\ntotal (n): اجمالي، مبلغ، مجموع",
  "number": "number (v): اتكل، اتى، اثر، احصى، اصاب، اعتبر، اعلن، بلغ، تلف، جاء، جمع، حدث، حسب، حضر، خطر، خفق، رقم، ساوى، سرد، صرف، عادل، عبر، عد، عدد، قدر، قدم، هدم، وصل، وفق، وقع\n\nnumber (n): اصدار، رقم، روتين، عدد، فصل",
  "amount": "amount (v): اتى، احصى، اصاب، اعتبر، بلغ، تلف، جاء، جمع، حدث، حسب، حضر، خطر، خفق، رقم، ساوى، عادل، عبر، عد، قدم، هدم، وصل، وفق، وقع\n\namount (n): قدر، كم، كمية، مبلغ، مجموع، مقدار، مقياس",
  "commercial": "commercial (a): تجاري",
  "common": "common (n): متنزه، منتزه\n\ncommon (a): شايع، عام، متداول، مشترك",
  "green": "green (n): خضار، خضر، متنزه، منتزه",
  "complete": "complete (v): اتم، اكمل، انتهى، انهى، عبا، فرغ، قتل، كمل، ملا، نجز، هزم",
  "complex": "complex (n): المركب، عقدة، مجمع، مركب",
  "concern": "concern (v): اتصل، احال، استشار، استلف، اشار، افاد، اقلق، تعلق، تورط، توقف، جس، حكى، حمل، حول، خص، ربط، روى، عزا، قص، لامس، لمس، مس، هذب، هم، وصل\n\nconcern (n): انزعاج، تجارة، حرص، خوف، شان، قلق، مبالاة، مراعاة، مشكلة، هم",
  "touch": "touch (v): اتحد، اتصل، اثر، اجتمع، احال، استشار، استلف، اشار، اصطدم، افاد، اقلق، التقى، الف، تصادم، تظاهر، تعرف، تعلق، تقابل، تكلف، تلمس، تورط، توقف، جاور، جس، حاذى، حكى، حمل، حول، خص، راجع، ربط، روى، صادف، ضرب، ضلع، عزا، غرز، فعم، قابل، قص، قلد، لامس، لمس، مس، هذب، هم، واجه، وصل\n\ntouch (n): لمس، لمسة، ملامسة",
  "concerned": "concerned (a): قلق",
  "see": "see (v): ابصر، اتحد، اتكل، اجتاز، اجتمع، اجل، احترم، اختبر، ادرك، استانف، استجوب، استنطق، اسقط، اصغى، اصلح، اضاف، اطلق، اعتبر، اعتقد، اعتقل، اعتمد، افترض، اقتنى، اكتشف، التقط، التقى، امتحن، بجل، بحث، برز، بصر، بلغ، تاكد، تامل، تجاوز، تحمل، تخيل، تدارس، تدبر، ترجم، تصادم، تصور، تعرف، تعلم، تعيش، تقابل، تلقى، تمثل، تواعد، توهم، تيقن، جرب، جسم، حسب، حفر، حقق، حكم، حلل، خطط، درس، راعى، رافق، راى، رسم، رفع، رمى، زار، زين، سمح، سمع، شاهد، صادف، صمم، صور، ظن، عاش، عانى، عايش، عرف، عزم، علا، علم، عمل، عنى، فتش، فحص، فسر، فكر، فهم، قابل، قاسى، قدر، قرر، قوم، كشف، لاحظ، لاقى، لمح، نتا، نشط، نظر، نوى، واجه، واعد، وجد، وقر",
  "consider": "consider (v): اتكل، اجل، احترم، ادرك، اصلح، اضاف، اعتبر، اعتقد، اعتمد، افترض، بجل، بحث، بصر، تامل، تبصر، تحمل، تخيل، تدارس، تدبر، تصور، تيقن، حسب، حقق، حكم، درس، راعى، رافق، راى، زار، سمح، شاهد، صدق، ظن، عرف، عمل، عنى، فحص، فكر، فهم، قدر، قوم، لاحظ، لمح، نظر، وثق، وقر",
  "view": "view (v): اتكل، اجل، احترم، ادرك، اصلح، اضاف، اعتبر، اعتقد، اعتمد، افترض، بجل، بحث، بصر، تامل، تحمل، تخيل، تدارس، تدبر، تصور، تيقن، حسب، حقق، حكم، درس، راعى، رافق، راى، زار، سمح، شاهد، ظن، عرف، عمل، عنى، فحص، فكر، فهم، قدر، قوم، لاحظ، لمح، نظر، وقر\n\nview (n): راي، قصد، منظور، نظرة، هدف",
  "regard": "regard (v): اتكل، اجل، احترم، ادرك، اصلح، اضاف، اعتبر، اعتقد، اعتمد، افترض، بجل، بحث، بصر، تامل، تبصر، تحمل، تخيل، تدارس، تدبر، تصور، تيقن، حسب، حقق، حكم، درس، راعى، رافق، راى، زار، سمح، شاهد، ظن، عرف، عمل، عنى، فحص، فكر، فهم، قدر، قوم، لاحظ، لمح، نظر، وقر\n\nregard (n): احترام، اعتناء، التفات، انتباه، تقدير، تنبه، خصوص، ناحية، نقطة",
  "study": "study (v): احتل، اختار، اختبر، اختصر، اخذ، ادرك، استجوب، استعاد، استلم، استمر، استنطق، استولى، اسر، اشار، اشترى، اقتضى، اكتشف، التمس، امتحن، بحث، بدا، تامل، تدارس، تطلب، تعلم، تعود، تناول، حاول، حقق، حلل، حمل، درس، دل، راعى، رافق، شارك، صور، طالع، عاين، علم، فتش، فحص، فهم، قبل، قرا، ناقش، نال\n\nstudy (n): تقرير، دراسة، فرع، موضوع",
  "think": "think (v): ااستدعى، احترم، اراد، استرجع، استرد، اعاد، اعتبر، اعتزم، اعتقد، اعتنى، افترض، بجل، تامل، تخيل، تدارس، تدبر، تذكر، تصور، تفكر، توقع، حسب، خمن، ذكر، راعى، راى، صدق، ضمر، ظن، عنى، فكر، قدر، قصد، قوم، نظر، نوى، وثق، وقر",
  "believe": "believe (v): احترم، اعتبر، اعتقد، امن، بجل، تامل، تخيل، تدارس، تصور، راعى، راى، صدق، ظن، فكر، قدر، نظر، وثق، وقر",
  "control": "control (v): ابقى، اتسع، احبط، احتفظ، احتوى، استمر، اشتمل، امسك، اهدا، اوقف، تحكم، تضمن، تمكن، حفظ، حقق، حمل، دعم، راس، راقب، ساوى، سيطر، شغل، صمد، ضام، ضبط، عقد، عنف، فحص، قاد، قاوم، قمع، قيد، كافح، كبت، كبح، كتم، لزم، لطف، لين، ملك، نظم، هدا، هيمن، وبخ، وجه، ودع، وسع، وصل\n\ncontrol (n): اجادة، تحكم، تمكن، حكم، سلطة، سيادة، سيطرة، ضبط، قيادة، هيمنة",
  "contemporary": "contemporary (n): ترب، معاصر",
  "content": "content (n): رسالة، سعة، مادة، محتوى، مخبر، مضمون، مفاد، موضوع",
  "message": "message (n): رسالة، مادة، محتوى، مضمون، مفاد، موضوع",
  "capacity": "capacity (n): سعة، صفة، طاقة، قابلية، قدرة، وصف، وظيفة",
  "subject": "subject (n): حالة، فرع، مسالة، مواطن، موضوع\n\nsubject (v): سلم، قدم",
  "continue": "continue (v): ابقى، اجتاز، اجل، احدث، ادار، استانف، استغرق، استكمل، استمر، اشترى، اطال، امتد، انتشر، انفع، بدا، بذل، بسط، بقي، تابع، تحرك، تحضن، ترقب، تصرف، تقدم، ثر، جامع، حافظ، حسن، حمل، حمى، خلل، دام، دوام، رحب، زاد، زود، سافر، ستر، شرع، شمل، صان، ضخم، ظل، عالج، عزز، علب، غطى، قاضى، قدم، كسا، كمل، لف، مد، مدد، مضى، مط، مكث، نشر، نفذ، هيمن، واصل، وسع، وقى",
  "keep": "keep (v): ابقى، احتفظ، احتفل، احتوى، احيا، اخفى، اخمد، ازال، استغرق، استمر، اطاق، اعاد، اعال، اعتصم، اعتقل، امسك، انفق، اوفى، ايد، بقي، تابع، تحمل، تكبد، حافظ، حجز، حرم، حظر، حفظ، حمل، خلل، دعم، راعى، راقب، ربى، رصد، ساند، سحق، سيطر، شغل، صان، صمد، طعم، ظل، عاق، عزز، عقد، علب، غذى، قاسى، قاوم، قمع، قوى، قيد، كبت، كبح، كتم، كتمان، لاحظ، لزم، مدد، ملك، منع، واصل، ودع، وقى",
  "stay": "stay (v): اقام، التزم، انتظر، اهدا، اوقف، بقى، بقي، تحمل، ثبت، سكن، صد، ظل، عطل، مكث، نزل، هدا، واصل\n\nstay (n): اقامة، بقاء، حلول، لبث، مكوث",
  "remain": "remain (v): بقى، بقي، ظل، مكث، هدا، واصل",
  "cover": "cover (v): اجتاز، استثمر، استغرق، اشترى، اطال، اعترض، اقتلع، امتد، امن، انتشر، بذل، بسط، تحضن، ثر، جامع، جرف، حرث، حسن، حفر، حمى، رحب، زاد، زود، سافر، ستر، شمل، صان، ضخم، عالج، عبر، عزز، غطى، قدم، قطع، كسا، لف، مد، مدد، مط، نشر، هيمن، وسع\n\ncover (n): حجاب، ستار، غطاء، غلاف",
  "continued": "continued (a): متتابع، متواصل، مستمر",
  "cool": "cool (v): ارتجف، برد، ثبط، سكن، فتر، قسى، قشعر، هدا",
  "correct": "correct (v): اخرج، استقر، استهل، اسس، اصلح، اعتبر، انصف، بدا، تاقلم، تاهب، تدارك، تكيف، تلاءم، ثبت، جمد، حدد، حرض، دبر، دخر، ربط، رتب، رصع، ركب، سوى، صحح، صوب، ضبط، عاقب، عالج، عدل، عرض، عير، غرب، قرر، قوم، كرر، كيف، لاءم، متفق، نظم، نقح، وضع\n\ncorrect (a): صادق، صحيح",
  "right": "right (v): اصلح، انصف، تدارك، صحح، صوب، عاقب، عالج، عدل، قوم، كرر، متفق، نظم، نقح\n\nright (a): سليم، صادق، صايب، صحيح، قويم\n\nright (n): حق، يمين",
  "set": "set (v): اخرج، اخمد، اربك، استثمر، استعد، استقر، استهل، اسس، اصلح، اعاق، اعتبر، اعد، اقترح، انشا، بدا، برم، بسط، تاقلم، تاهب، تسلل، تظاهر، تكلف، تكيف، تلاءم، ثبت، جمد، جهز، حدث، حدد، حرض، حقق، حل، خبا، خدع، دبر، دخر، دفن، راهن، ربط، رتب، رسخ، رسم، رصع، ركب، ركز، زرع، سجل، سوى، شتل، شفى، صاغ، صحح، صنف، ضبط، طرح، طلب، عاقب، عالج، عدل، عرض، عسكر، عير، عين، غرب، غرز، غرس، فتل، فرض، قرر، قوم، كمن، كيف، لاءم، لصق، متفق، نظم، هيا، ورط، وضع، وقع\n\nset (n): تصلب، تصليب، حلقة، مجموعة",
  "handle": "handle (v): اختلس، اخفى، ادار، اراد، استثمر، اعتبر، اعتنى، اقتصد، اقتلع، اكل، انتصر، اهتم، تاجر، تصرف، تعامل، جرف، حرث، حفر، رغب، روض، شحم، صافح، عالج، عامل، عنى، فاوض، قاد، لمس، مس، مسك، ناور، نجح، نشل، واجه، وارى، وجد، وزع\n\nhandle (n): مقبض",
  "deal": "deal (v): ادار، ادى، اراد، استثمر، اعتنى، اعطى، اقتصد، اقتلع، اكل، انفع، اهتم، باع، بصق، بوب، تاجر، ترقب، تسوق، تصرف، تعامل، تولى، جرف، حرث، حفر، حكم، حلف، حمل، خدع، خص، خصص، دبر، رغب، روض، ساوم، صنف، عاقب، عالج، عمل، عنى، غش، فرق، قاد، قايض، قسم، قنع، لمس، مس، منح، ناور، نثر، نجح، نشر، نفذ، واجه، واصل، وجد، وزع، وصل\n\ndeal (n): الكثير، اوراق، تقسيم، توزيع، صفقة، كثرة، معاملة",
  "address": "address (v): استثمر، اقتلع، تحدث، جرف، حرث، حفر، خاطب، خطب، عالج، فاتح\n\naddress (n): حديث، خطاب، عنوان، كلمة",
  "covered": "covered (a): محجب، مستور، مغطى، مكسو",
  "critical": "critical (a): حاسم، حرج، خطر، خطير",
  "current": "current (n): تيار",
  "cut": "cut (n): اقتطاع، حصة، شق، قطعة، لحمة\n\ncut (v): اختزل، اختصر، ازدرى، اضعف، اطفا، اقتطع، التقط، انقبض، انقص، انكمش، انهى، اهمل، اوجز، اوقف، بتر، تجاهل، تجبر، تقاصر، تقلص، تهيي، جرح، حرم، حلق، خضع، خطب، خطبة، خفض، دق، رتب، رصع، رفض، زجر، زخرف، زين، سجل، سحق، سكت، شذب، شق، صامد، صد، ضيق، طعن، عدى، عقد، فصل، قص، قصر، قطع، قطعة، قلص، قلل، قلم، قناة، لخص، نقص، هذب، هزل، وبخ",
  "cutting": "cutting (n): شق، قطع، نقش",
  "reduce": "reduce (v): اختزل، اختصر، ارتد، اضعف، اقتطع، التقط، انقبض، انقص، انكمش، انهى، اوجز، اوقف، تجبر، تجمع، تركز، تقاصر، تقلص، تملص، تهيي، جرح، حرم، حشد، حلق، خضع، خطب، خطبة، خفض، خفف، دق، رتب، رصع، رق، ركز، زخرف، زين، سجل، سحق، سكت، شذب، شق، صامد، صعف، صغر، ضيق، طعن، عدى، عقد، فصل، قص، قصر، قطع، قطعة، قلص، قلل، قلم، قناة، كثف، كمش، لخص، نحف، نحل، نقص، هذب، هزل",
  "contract": "contract (v): اختزل، اختصر، ادخل، ارتد، ارهق، ازدحم، استعجل، اضعف، اقتطع، اقحم، التقط، الح، انقبض، انكمش، انهى، اوجز، اوقف، باشر، تابع، تجبر، تجمع، تراكم، تعاقد، تعهد، تقاصر، تقلص، تملص، تولى، جذب، جرح، حاصر، حث، حدد، حرم، حشد، خضع، خطب، خطبة، خفض، دفع، دق، سجل، سحق، سطح، سكت، شذب، شرع، شق، صامد، صر، صغر، ضغط، ضيق، طعن، عانق، عدى، عصر، عقد، فصل، قبض، قص، قصر، قطع، قطعة، قلص، قلل، قلم، قناة، قولب، كبح، كبس، كمش، كوى، لخص، نقص، هاجم، هزل، واصل\n\ncontract (n): عقد",
  "dark": "dark (n): خسة، دهمة، سيية، شر، ظلام، ظلماء، ظلمة، عتمة، غلس، قتمة، لوم، ليل، نذالة\n\ndark (a): داكن، قاتم، مظلم، معتم",
  "night": "night (n): ظلام، ليل، ليلة",
  "dead": "dead (n): ميت\n\ndead (a): ميت",
  "determine": "determine (v): ادان، اكتشف، انتهى، انهى، بلغ، تاكد، تحرى، تحقق، توصل، جسد، حتم، حدد، حزم، حسم، حقق، حكم، راى، شكل، صاغ، صفى، ضبط، عرف، عزم، علم، عنى، عين، فحص، فصل، فهم، قرر، كشف، وجد، وضع",
  "deep": "deep (a): عميق",
  "draw": "draw (v): اجتذب، ازاح، استشف، استل، استنتج، استهوى، استوعب، اضطر، اطلق، اغتصب، اقتلع، امتص، انتزع، انسحب، تجبر، تحرك، تقاضى، تقدم، تلقى، تناول، توغل، جذب، جر، خسر، خط، خطط، ربح، رسم، سحب، سرع، شد، صور، عام، عبر، عقد، فرض، قاد، كره، مثل، مرر، وصف",
  "report": "report (v): ابلغ، اعلن، اورد، بلغ، تواجد، حضر، خبر، روى، قص، نقل، وصف\n\nreport (n): تقرير، دراسة، رواية",
  "account": "account (v): حسب، روى، نقل، وصف\n\naccount (n): ايضاح، تعليل، تفسير، تقرير، توضيح، حساب، حكاية، رواية، فاتورة، قصة",
  "line": "line (v): استشف، خط، خطط، رسم\n\nline (n): اسلوب، تجعد، تجعيد، ترنيمة، تغضن، ثنية، جدل، جملة، حبل، حرفة، خط، ذرية، رتل، سطر، سلالة، سيرة، شغل، صف، عمل، قناة، لحن، مسار، مسعى، مهنة، نسل، نغم، وظيفة",
  "key": "key (v): اكتشف، سمى، ميز، وصف\n\nkey (n): كغ، كيلو، مفتاح",
  "name": "name (v): اختار، استدعى، استرجع، استرد، استشهد، استنجد، اشار، اقتضى، اكتشف، اورد، تطلب، تلفن، حدد، دعا، ذكر، سال، سمى، شيد، صاح، صرخ، عرج، عين، لقب، مكالمة، ميز، نادى، نوه، وصف\n\nname (n): اسم، سمعة، شخصية، صيت",
  "design": "design (v): خطط، رسم، سم، سمم، صمم، عزم، فرد، فسد، وضع\n\ndesign (n): ابتكار، احداث، اختراع، بدعة، ترتيب، تصميم، تصور، رسم، زخرفة، زينة، عزم، غاية، غرض، قصد، مخطط، مرمى، مغزى، نموذج، نية",
  "desire": "desire (v): احتاج، اراد، اشتهى، تاق، تطلب، تعين، رغب، طارد، طلب، مطلوب\n\ndesire (n): توق، رغبة، ولع",
  "want": "want (v): احتاج، اراد، استلزم، اشتهى، تاق، تطلب، تعين، رغب، طارد، طلب، عاز، مطلوب\n\nwant (n): افتقار، انعدام، رغبة، عجز، مبتغى، مراد، مرام، نقص",
  "shape": "shape (v): اثار، احتال، ادار، اشتغل، الف، انشا، برز، تالف، تشكل، تطور، تعفن، تقدم، تكوين، جسد، حدث، حدد، حول، رتب، زور، زيف، سكب، شغل، شكل، صاغ، صمم، ضبط، عين، غير، فعل، كون، كيف، لفق، مثل، نظم\n\nshape (n): بدن، بنية، شكل، صورة، مظهر، نمط، هيكل، هيية",
  "influence": "influence (v): اثار، اثر، احتال، ادار، اشتغل، جسد، حدث، حدد، حول، شغل، شكل، صاغ، ضبط، عين، فعل\n\ninfluence (n): تاثير، سلطة، نفوذ",
  "watch": "watch (v): احترس، ادرك، ارتقب، اكتشف، انتظر، تاكد، تبع، تعقب، تنبه، تهجد، حذر، حرس، حقق، راقب، راى، سهر، شاهد، عرف، علم، عنى، فحص، فهم، لاحظ، لمح\n\nwatch (n): حارس، حرس، راقب، كشاف، مستطلع، مستكشف",
  "learn": "learn (v): احتل، اختار، اخذ، ادرك، ارشد، استانف، استعاد، استلم، استمر، استولى، اسر، اشار، اشترى، اصغى، اصلح، اعتبر، اعتقل، اقتضى، اقتنى، اكتسب، اكتشف، التقط، امر، بحث، بدا، بصر، بلغ، تاكد، تامل، تحمل، تخيل، تدبر، تصور، تطلب، تعلم، تعود، تعيش، تلقى، تناول، تيقن، ثقف، حاول، حفر، حفظ، حقق، حمل، درس، دل، رافق، راى، رفع، زار، سمح، سمع، شارك، شاهد، صور، طالع، عرف، علا، علم، عمل، عنى، فحص، فهم، قبل، قرا، كشف، لاحظ، لقن، لمح، نال، نشط، وجد، يخدع",
  "develop": "develop (v): اثار، اخرج، ازداد، استثمر، اشتد، اصاب، اكتسب، انتج، جلب، حصل، حقق، حمض، حيز، درب، راع، زاد، زار، زرع، صنع، طور، ظهر، عرض، فاز، قدم، كبر، كسب، نال، نبت، نشا، نما، نمى، هيا، وسع، ولد",
  "grow": "grow (v): اثار، اخرج، ازداد، استثمر، اشتد، اصاب، اكتسب، انتج، تبدل، جلب، حصل، حقق، حيز، راع، ربى، زاد، زار، زرع، صنع، طور، ظهر، عرض، فاز، قدم، كبر، كسب، نال، نبت، نشا، نضج، نما، نمى، هيا، وسع، ولد",
  "produce": "produce (v): ابتدع، ابدع، ابرز، اثار، احدث، اخرج، ادى، ازداد، استثمر، اسعد، اشتد، اصاب، اضرم، اظهر، اعتبر، اكتسب، انتج، اندفع، بنى، تالف، تجبر، تصرف، تملق، تناول، جعل، جلب، حصل، حضر، حقق، حول، حيز، خلق، راع، ربح، ربى، زاد، زار، زرع، سبب، شن، صنع، طور، ظهر، عرض، عوض، عين، غلق، فاز، فعل، قدم، كبر، كسب، لفق، مكن، نال، نبت، نجح، نشا، نما، نمى، هيا، وسع، وصل، ولد\n\nproduce (n): غلة",
  "train": "train (v): اخرج، ادب، ارشد، اقلم، امر، تبع، تدرب، ثقف، جر، درب، درس، ربى، ربي، روض، سحب، سدد، صوب، طرد، علم، عنون، فرض، قاد، مرن، هذب، وجه\n\ntrain (n): تسلسل، سلسلة، قطار",
  "development": "development (n): استثمار، استخدام، استغلال، تحميض، تسخير، تطور، تطوير، تظهير، تنمية، نضج، نضوج، نمو",
  "developing": "developing (n): تحميض، تظهير",
  "give": "give (v): اتصل، ارتكب، اعد، اعطى، اقترف، امتد، انتج، انقطع، اهدى، اهمل، بسط، بلغ، تاول، تبادل، تبرز، تبرع، تجاوز، تجلى، تحمل، ترشح، تغاضى، تغوط، تفانى، جهل، حدث، حضر، حول، خصص، دفع، ربح، رحل، رد، ساهم، سلم، سير، صرف، ضحى، عبر، عرض، عقد، عمل، فدى، فرض، قدر، قدس، قدم، قضى، قلد، كرس، مات، مر، مرر، ملك، منح، نجح، نفذ، نقل، هدى، ودع، ورط، وصل، وفى، وقف، وهب",
  "difficult": "difficult (a): صعب",
  "hard": "hard (a): صعب، صلب، قاس",
  "place": "place (v): اخرج، اخمد، اربك، استثمر، استقر، استهدف، استهل، اسس، اعتبر، اقترح، بدا، برم، بسط، تاهب، تطابق، تظاهر، تعرف، تكلف، تلاءم، تماثل، ثبت، جمد، حدث، حدد، حرض، خدع، دبر، دخر، دفن، راهن، ربط، رتب، رسم، رصع، ركب، زرع، صاغ، صنف، ضبط، طرح، طلب، عرض، عين، غرب، فتل، فرض، قرر، كمن، ميز، نظم، وجه، وضع، وقع\n\nplace (n): بقعة، بيت، ساحة، فراغ، مجال، مركز، مساحة، مقعد، مكان، مكانة، منصب، موضع، موقع، ميدان، وضع، وظيفة",
  "direct": "direct (v): ابعد، احتل، اختار، اخذ، اخرج، ادار، ادرك، ادى، ارسال، ارسل، ارشد، استعاد، استلم، استمر، استهدف، استولى، اسر، اشترى، اطلق، اقتضى، امر، بدا، بعث، تبع، تراس، تزعم، تصدر، تصرف، تطلب، تعود، تقدم، تناول، تولى، حجر، حرك، حصد، حقق، حمل، دبر، رافق، ساق، سدد، سير، شارك، صوب، صور، طرد، عنون، فرض، قاد، قبل، مرسل، نال، نزل، هدى، واجه، وجب، وجه، وصل، وفد\n\ndirect (a): مباشر",
  "point": "point (v): ابحر، ادار، ارشد، استهدف، اشار، اشر، برز، بين، تراس، تزعم، تصدر، تقدم، توجه، حرك، حصد، دل، ساق، سير، طين، ظهر، قاد، نقط، نم، هدى، واجه، وجب، وجه، وصل، وما\n\npoint (n): بند، جزء، درجة، راس، رتبة، مادة، مرتبة، مرحلة، مستوى، نقطة",
  "lead": "lead (v): احتل، اختار، اخذ، ادرك، ادى، ارشد، استعاد، استلم، استمر، استولى، اسر، اشترى، اقتضى، امتد، انتشر، بدا، تراس، ترك، تصرف، تطلب، تعود، تفوق، تقدم، تناول، تولى، حدث، حقق، حمل، دبر، رافق، سبق، شارك، صور، عبر، علا، فاق، قاد، قبل، قدم، نال، نشر، هدى، وجب، وجه، وصل\n\nlead (n): Pb، اثر، تقدم، خيط، دليل، ذيل، رصاص، رياسة، قيادة، مفتاح",
  "notice": "notice (v): استبان، اكتشف، دون، سجل، ظهر، علق، لاحظ، وجد\n\nnotice (n): اعلان، مراقبة، ملاحظة، ملصق، ملصقة",
  "hear": "hear (v): ادرك، استانف، اصغى، اصلح، اعتبر، اعتقل، اقتنى، اكتشف، التقط، بحث، بصر، بلغ، تحمل، تخيل، تدبر، تصور، تعلم، تعيش، تلقى، تيقن، حفر، حقق، درس، رافق، راى، رفع، زار، سمح، سمع، شاهد، عرف، علا، علم، عمل، عنى، فحص، فهم، كشف، لاحظ، لمح، نشط، وجد",
  "divided": "divided (a): منقسم",
  "domestic": "domestic (n): وصيف",
  "cause": "cause (v): اثار، احتال، احدث، اخرج، ادى، ارتكب، استمال، استنتج، اسعد، اشتمل، اصاب، اضرم، اضطر، اعتبر، اغرى، اقنع، انتج، انتهى، اندفع، انهى، اهتم، بذل، بنى، تجبر، تصرف، تضمن، تملق، تناول، جعل، جلب، حاز، حث، حرك، حصل، حضر، حفز، حول، حيز، خدع، خلق، دعى، ربح، رتب، زار، زخرف، سبب، شن، صنع، عوض، عين، غلق، فاز، فعل، قاضى، قنع، كسب، ملك، نال، نبه، نجح، نجز، نشط، نظف، نفذ، هيا، وصل، وضع\n\ncause (n): ادعاء، باعث، حركة، حملة، داع، دعوى، سبب، شكوى، عامل، علة، قضية، مسبب، واسطة",
  "exercise": "exercise (v): ابدى، استخدم، استعمل، بذل، تدرب، تريض، تعاطى، تمرن، ثقب، حفر، درب، رياضة، زاول، شغل، طبق، ظهر، علم، مارس، نثر، نغب، نفذ\n\nexercise (n): استخدام، استعمال، تدريب، تمرين، توظيف",
  "answer": "answer (v): اجاب، احتال، ادى، ارتكب، استجاب، انتج، انتهى، انسجم، انهى، اهتم، بذل، خدع، رتب، رد، زخرف، طابق، فعل، كفى، نجز، نظف، نفذ، وضع\n\nanswer (n): اجابة، استجابة، تلبية، جواب، رد",
  "serve": "serve (v): اجاب، احتال، ادى، ارتكب، اعد، انتج، انتهى، انهى، اهتم، بذل، خدع، خدم، خص، رتب، رد، زخرف، زود، ساعد، صفح، عاون، عزز، فعل، قذم، قضى، قعر، قوى، كفى، مد، ناصر، نجز، نظف، نفذ، نفع، نقذ، هزم، وضع",
  "double": "double (v): التف، التوى، تثنى، حنى، صرف، ضاعف، طوى، كسر",
  "down": "down (v): جلا، جمل، جود، حسن، حك، خسر، سقط، شذب، صفى، صقل، كبت، كرر، لمع، مسح، نعم، نقح، نقى، هذب",
  "pull": "pull (v): ارتكب، ازاح، استل، استنتج، استهوى، اضطر، اطلق، اغتصب، اقترف، اقتلع، انتزع، تجبر، تقاضى، تلقى، تناول، توغل، جذب، جر، خسر، ربح، رسم، سحب، سرع، شد، عقد، فرض، كره، مزق\n\npull (n): جذب، جر، سحب، شد",
  "force": "force (v): اجبر، ادخل، ارهق، ازاح، استل، استنتج، استهوى، اضطر، اطلق، اغتصب، اقتلع، اقحم، اكره، انتزع، تجبر، تقاضى، تلقى، تناول، توغل، جذب، جر، حشر، خسر، دسر، دفع، ربح، رسم، روج، سحب، سحق، سرع، شد، صد، ضغط، عصر، عقد، غرز، غصب، فرض، كره، ناضل، واصل\n\nforce (n): بطش، حول، سلطان، شدة، طاقم، عنف، عنوة، غصب، قدرة، قوة، مقدرة، موظفون",
  "run": "run (v): ادار، ادى، اذاب، ارتشح، ارتفع، اشبع، اطعم، افلت، اقتات، اكل، امتد، انبعث، انتشر، انزلق، انسل، انصهر، بدد، تدفق، تدلى، تراس، ترشح، تسرع، تكرر، تلاشى، تهدل، جرى، جري، حدث، حكم، دار، دخل، ذاب، رضى، رق، ركض، سال، سحب، شجع، شغل، صب، صفى، صهر، طارد، طبع، طعم، عبر، عجل، عدا، عمل، غذى، غمر، فاض، فر، قاد، لقم، مال، مرر، ميع، نجا، نحل، نشر، هرب، هرول، وقع\n\nrun (n): تجربة، تنسيل، جري، ركض، فحص، نسل",
  "dress": "dress (n): ثوب، ثياب، رداء، فستان، كسوة، لباس، ملابس\n\ndress (v): ارتدى، اعد، اكسي، البس، انتظم، زين، سمد، ضمد، طرى، عبر، كسا، لبس، مشط، هيا",
  "clothes": "clothes (n): ثوب، ثياب، رداء، كسوة، لباس، ملابس",
  "driving": "driving (n): سياقة، قيادة",
  "drive": "drive (v): تجبر، تدحرج، حرك، دفع، ساق، قاد، كره\n\ndrive (n): جولة، حافز، حركة، حملة، دافع، دفع، غريزة",
  "motor": "motor (v): تجبر، تدحرج، حرك، دفع، ساق، قاد، كره\n\nmotor (n): محرك",
  "dry": "dry (v): جف، جفف، نشف\n\ndry (a): جاف، قاحل، مجدب",
  "each": "each (r): كل",
  "early": "early (a): باكر، مبكر",
  "easy": "easy (a): سهل",
  "economic": "economic (a): اقتصادي",
  "educational": "educational (a): تعليمي",
  "emotional": "emotional (a): انفعالي، عاطفي",
  "empty": "empty (v): اخلى، افرغ، بول، جرد، خلا، خلى، سكب، فرغ\n\nempty (a): خاو، فارغ",
  "entire": "entire (n): حصان",
  "equal": "equal (n): صنو، مثيل، مناظر، ند، نظر، نظير\n\nequal (v): بارى، تطابق، تعادل، تماشى، ساوى، سوى، عادل، قارن، كافا، لاءم، ماثل، ناغم، نسق\n\nequal (a): متكافي، مساو، معادل، مماثل",
  "be": "be (v): احتج، استعرض، اصبح، اضحى، اعلن، الف، بقي، حيي، ذهب، ساوى، شرح، شكل، صرح، عادل، عاش، عين، كان، كلف، كون، مثل، ناب، نصب، وجد، وضح، يوجد",
  "plant": "plant (v): اخرج، استقر، استهل، اسس، اشتهر، اعتبر، اقام، الف، انشا، اوجد، بدا، برهن، تاهب، تسلل، تلاءم، توطيد، ثبت، جمد، حدد، حرض، خبا، دبر، دخر، ربط، رتب، رسخ، رصع، ركب، زرع، سبك، شتل، شكل، ضبط، عرض، عسكر، عين، غرب، غرز، غرس، قرر، نصب، وجب، وضع، وطد، وطن\n\nplant (n): غرسة، فخ، مصنع، مصيدة، منشاة، نبات، نبتة",
  "prove": "prove (v): اثبت، اختبر، استعرض، اسس، اشار، اشتهر، اظهر، اعلن، اقام، اكد، امتحن، بحث، برهن، بين، تظاهر، توطيد، ثبت، جرب، رسخ، شرح، شهد، طهر، ظهر، عرض، علاقة، فحص، قاد، قدم، قرر، مثل، وصف، وضح، وطد، وطن",
  "show": "show (v): ابدى، اثبت، اختبر، ارى، استعرض، اسس، اشار، اشتهر، اظهر، اعلن، اقام، اكد، برهن، بين، تظاهر، توطيد، ثبت، رسخ، رسم، سجل، شرح، شهد، صور، طهر، ظهر، عبر، عرض، علاقة، قاد، قدم، قرر، قيد، كتب، مثل، وصف، وضح، وطد، وطن\n\nshow (n): استعراض، عرض",
  "evening": "evening (n): رواح، عشاء، عشية، مساء",
  "even": "even (n): رواح، عشاء، عشية، مساء\n\neven (v): سطح، سهل، سوى، مهد\n\neven (a): زوجي",
  "level": "level (v): سطح، سهل، سوى، مهد\n\nlevel (n): درجة، رتبة، طابق، طبقة، مرتبة، مرحلة، مستوى، مستوي، منزلة، نقطة",
  "evil": "evil (n): اثم، اساءة، بغي، خبث، خطيية، سوء، شر، فاحشة، فسق",
  "exist": "exist (v): اصبح، اضحى، بقي، حيي، ذهب، عاش، كان، وجد، يوجد",
  "live": "live (v): اقام، اقتات، بقي، ثبت، حيي، خلد، سكن، شغل، طبق، عاش، عمر، قطن، كان، كمن، نجا، نزل، وقع، يوجد",
  "ask": "ask (v): احتاج، احتل، اختار، اخذ، ادرك، استخبر، استخدم، استدعى، استعاد، استعلم، استفسر، استلزم، استلم، استمر، استولى، اسر، اشترط، اشترى، اقتضى، التزم، التمس، بدا، تطلب، تعود، تناول، توقع، حتم، حقق، حمل، رافق، ربط، سال، شارك، شمل، صور، طالب، طلب، فرض، قبل، قضى، لزم، مطلوب، نال، وجب، ورط",
  "require": "require (v): احتاج، احتل، اختار، اخذ، ادرك، استخدم، استدعى، استعاد، استلزم، استلم، استمر، استولى، اسر، اشترط، اشترى، اقتضى، التزم، التمس، بدا، تطلب، تعود، تناول، توقع، حتم، حقق، حمل، رافق، ربط، سال، شارك، شمل، صور، طالب، طلب، عاز، فرض، قبل، قضى، لزم، مطلوب، نال، وجب، ورط",
  "look": "look (v): اتضح، اصدر، انتظر، بان، بحث، بدا، ترقب، تطلع، تظاهر، توقع، حدق، راقب، راى، ظهر، مثل، نظر\n\nlook (n): تعبير، مظهر، منظر، نظر، نظرة",
  "wait": "wait (v): انتظر، ترقب، تروى، تريث، تطلع، توقع\n\nwait (n): انتظار، تاجيل، تاخير، توقف",
  "experience": "experience (v): اجتاز، احس، اختبر، ادرك، اصلح، اعتبر، امن، بحث، بصر، تحمل، تخيل، تدبر، تصور، تلمس، تيقن، جرب، جس، حس، حقق، رافق، راى، زار، سمح، شاهد، شعر، شم، عاش، عانى، عايش، عرف، عمل، عنى، فحص، فهم، قاسى، لاحظ، لاقى، لمح، مس، واجه، وعى\n\nexperience (n): تجربة، خبرة، معرفة",
  "feel": "feel (v): احس، اختبر، ادرك، امن، بدا، تلمس، جرب، جس، حس، شعر، شم، عانى، قاسى، لاقى، لمس، مس، واجه، وعى",
  "state": "state (v): اخبر، استخلص، اعترف، اعتقد، اعلن، اورد، بسط، تكلم، روى، زعم، صاغ، صرح، عبر، عرض، عين، قال، قرر، لفظ، محدد، نطق، وضح\n\nstate (n): ارض، اقليم، بلد، حال، حالة، دولة، قطر، وضع، وضعية، ولاية",
  "face": "face (v): اتجه، تحدى، تصدى، تقنع، جابه، غطى، قابل، قارن، قدم، كسا، كسى، لبس، واجه، وجه\n\nface (n): تعبير، جانب، راس، واجهة، وجه",
  "present": "present (v): احتج، استعرض، اظهر، اعطى، اعلن، اهدى، برهن، تجلى، ترشح، تظاهر، جلب، حضر، حيا، شرح، صرح، طلع، ظهر، عرض، عرف، قابل، قدم، قلد، كافي، مثل، منح، ناب، هدى، واجه، وجه، وضح\n\npresent (n): الان",
  "fellow": "fellow (n): ترب، جليس، ربيع، رفيق، زميل، صاحب، صنو، عشير، قرين",
  "familiar": "familiar (n): ترب، جليس، ربيع، رفيق، زميل، صاحب، صنو، عشير، قرين",
  "far": "far (a): بعيد\n\nfar (r): بعيد",
  "fast": "fast (n): صوم، صيام\n\nfast (v): صام\n\nfast (a): سريع\n\nfast (r): مسرع",
  "fat": "fat (n): دهن، شحم\n\nfat (v): اخصب، سمن\n\nfat (a): بدين، سمين",
  "fell": "fell (v): اسقط",
  "drop": "drop (v): اخطا، اراق، استخدم، استعمل، استهلك، اسقط، اطلق، اغفل، افتقد، القاء، القى، امضى، انحدر، انحط، انخفض، انسحب، انسل، انفق، انهار، اهمل، اوقع، اوقف، بدد، بذر، بذل، تجاهل، تجنب، تدنى، تدهور، ترك، تسطح، تفسخ، تلف، تناثر، توقف، حذف، حظ، خسر، خصم، خفض، خفق، دمر، ذرف، رجم، رمى، ساء، سال، سبك، سجن، سحق، سطح، سفك، سقط، سقوط، سكب، سوى، شكل، صب، صرف، ضنى، طرح، عقد، غزل، فات، فسد، فشل، قتل، قذف، قضى، قطر، مهد، نحل، نزل، نسى، نظرة، نظم، نقص، نهك، هبط، هجر، هزم، هيية، وزع، وقع\n\ndrop (n): اسقاط، رمي، قطرة",
  "fall": "fall (v): اخمد، استدق، اصبح، اضعف، انحدر، اندفع، انهار، انهزم، تدلى، تدنى، ترسب، تساقط، تسرع، تقدم، تقلص، تكثف، تلاشى، تناقص، تهور، جرى، حث، خر، خفض، خفف، سقط، سكن، سلسل، صغر، ضم، عجل، قل، قلص، قلل، نزل، نقص، نقض، هبط، هوى، وقع، ولد\n\nfall (n): استسلام، خريف، سقوط، وقوع",
  "fight": "fight (n): اشتباك، خصام، شجار، صراع، عراك، قتال، مبارزة، معركة، موقعة\n\nfight (v): اعترض، تبارز، تعارك، تقاتل، حارب، حمى، دافع، صارع، صان، ضاد، عادى، عارض، قاتل، قاوم، كافح، لاكم، ناضل",
  "fighting": "fighting (n): شجار، عراك، قتال، معركة",
  "struggle": "struggle (v): تبارز، تعارك، تقاتل، حارب، صارع، قاتل، قاوم، كافح، لاكم، ناضل\n\nstruggle (n): خلاف، صراع، قتال، كفاح، معركة، نزاع، نضال",
  "meet": "meet (v): اتحد، اتخذ، اتصل، اتم، اجتمع، اخذ، ادرك، ادى، ارضى، استجمع، استخدم، استقطب، استلف، اصلح، اعتبر، اعد، التام، التزم، التقى، امتلا، انتفخ، انسد، انهى، بارى، بحث، بصر، تبنى، تجمع، تجمهر، تحدى، تحمل، تخيل، تدبر، تصادم، تصور، تطابق، تعرف، تعلق، تعود، تقابل، تكيف، تلاقى، تماشى، توقف، تيقن، جاور، جس، جمع، جنى، جهز، حاذى، حسب، حشد، حقق، راجع، رافق، راى، ردم، رضى، زار، زود، سال، سد، سر، سمح، شاهد، شغل، صادف، ضلع، طعم، عرف، عمل، عنى، عوض، فحص، فهم، قابل، قارن، كافا، لاءم، لاحظ، لاعب، لاقى، لامس، لايم، لبى، لم، لمح، لمس، ماثل، مارس، مجموعة، مس، ملا، ناسب، ناغم، نجز، نسق، نفذ، نما، هذب، واجه، وافق، وصل",
  "fiscal": "fiscal (a): مالي",
  "financial": "financial (a): مالي",
  "fine": "fine (n): جزاء، غرامة",
  "firm": "firm (n): شركة",
  "house": "house (n): اسرة، بيت، دار، شركة، عايلة، مجلس، مسرح، منزل\n\nhouse (v): احتوى، اوى، سكن",
  "doctor": "doctor (v): احيا، استرجع، اصلح، اعاد، اعاق، تقوى، ثبت، جدد، حدد، حل، رسخ، ركز، رمم، زيف، شفى، عالج، عدل، عوض، قرر، لصق، نظم، هيا، ورط\n\ndoctor (n): طبيب",
  "ready": "ready (v): احدث، اخرج، استعد، استقر، استهل، اسس، اسعد، اصلح، اضرم، اعاق، اعتبر، اعد، انتج، اندفع، بدا، بنى، تاهب، تجبر، تصرف، تلاءم، تلاعب، تملق، تناول، ثبت، جعل، جمد، جهز، حدد، حرض، حضر، حل، حول، خلق، دبر، دخر، ربح، ربط، رتب، رسخ، رصع، ركب، ركز، شفى، شن، صنع، ضبط، طبخ، طها، عالج، عدل، عرض، عوض، عين، غرب، غلق، فعل، قرر، لصق، نجح، نظم، هيا، ورط، وصل، وضع",
  "apartment": "apartment (n): شقة",
  "flat": "flat (n): شقة",
  "following": "following (n): تتبع، مطاردة، ملاحقة",
  "follow": "follow (v): اتبع، اتخذ، اختار، ادرك، اعتنق، اعقب، افلح، اقر، امتثل، بحث، تابع، تبع، تبنى، تتبع، تعاقب، تعقب، تلا، توالى، خلف، رافق، راقب، سعى، سلك، طابق، طارد، فاز، فلح، قلد، لاحظ، لاحق، لحق، مارس، ناضل، نتج، نجح، نفذ، واصل، ولى",
  "pressure": "pressure (v): اجبر، ادخل، ارهق، اضطر، اغتصب، اقحم، اكره، تجبر، توغل، سحق، سرع، ضغط، عصر، غصب، فرض، كره\n\npressure (n): ضغط",
  "foreign": "foreign (a): اجنبي، خارجي",
  "form": "form (v): اثار، احتال، ادار، اسس، اشتغل، الف، انشا، برز، تالف، تشكل، تطور، تعضي، تعفن، تقدم، تكون، تكوين، تنظم، جسد، حدث، حول، رتب، زور، زيف، سكب، شغل، شكل، صاغ، صمم، عين، غير، فعل، كون، كيف، لفق، مثل، نشا، نظم\n\nform (n): بدن، بنية، شكل، صف، صنف، صورة، ضرب، مظهر، نمط، نوع، هيكل، هيية",
  "work": "work (v): اثار، اثر، اجتهد، احتال، ادار، ادى، استغل، اشتغل، اكتشف، الف، انشا، انطلق، برز، تابع، تالف، تخمر، تشكل، تطور، تعفن، تفوق، تقدم، تكوين، توصل، جبل، جسد، حدث، حل، حمض، حول، خمر، دار، درب، دلك، ذاب، رتب، زور، زيف، سخر، سكب، شغل، شكل، صاغ، صمم، صنع، عالج، عجن، عرف، عمل، غير، فسد، فعل، قرر، كون، كيف، لحس، لعق، لفق، مص، نظم، هزم، واصل\n\nwork (n): اعمال، انتاج، شغل، عمل، مولف، نتاج، وظيفة",
  "receive": "receive (v): استقبل، استلم، اكتسب، تسلم، تلقى، رحب، لقي، نال، وجد",
  "free": "free (n): حر\n\nfree (v): ازاح، استثنى، اصدر، اطلق، اعتق، اعفى، تحرر، تخلى، ترك، حرر، حل، خلص، زحزح، سحب، سرح، عزل، فك\n\nfree (a): حر، طليق",
  "loose": "loose (v): اصدر، اطلق، اعتق، تخلى، تراخى، حرر، حل، رخا، رخى، رخي، سرح، فك، نحل، هلهل",
  "front": "front (n): جبهة، حركة، مقدمة، واجهة\n\nfront (v): جابه، صارع، واجه",
  "movement": "movement (n): انتقال، تحرك، تنقل، جبهة، حركة، حملة، رحلة، سفر، مسيرة، نقل، هجرة",
  "future": "future (n): مستقبل\n\nfuture (a): مستقبل",
  "game": "game (n): خطة، صيد، لعبة، مباراة، موامرة",
  "general": "general (n): جنرال، عام\n\ngeneral (a): عام",
  "hand": "hand (v): اتصل، اعد، اعطى، امتد، اهمل، بسط، بلغ، تاول، تبادل، تبرز، تجاوز، تغاضى، تغوط، جهل، حدث، رحل، سلم، سير، عبر، قدم، مات، مر، مرر، نجح، نقل، وصل\n\nhand (n): اوراق، براعة، عون، قدرة، كف، مساعدة، يد",
  "reach": "reach (v): اتصل، اتم، اجتاز، احدث، احرز، ارتطم، ازداد، اسعد، اصاب، اضرم، اعتبر، اعد، اعطى، اكتسب، اكتشف، امتد، انتج، انتصر، انجز، اندفع، اهمل، بسط، بلغ، بنى، تاول، تبادل، تبرز، تجاوز، تجبر، تحصل، تصرف، تغاضى، تغوط، تملق، تناول، جعل، جهل، حدث، حضر، حقق، حول، خلق، ربح، رحل، سدد، سلم، سير، شن، صد، صدم، صنع، ضرب، عبر، عوض، عين، غلق، فاز، فعل، قدم، قضى، كسب، كمل، مات، مر، مرر، نال، نجح، نجز، نقل، هاجم، هيا، وجد، وصل\n\nreach (n): متناول، مجال",
  "given": "given (s): معطى، مهدى",
  "granted": "granted (s): معطى، مهدى",
  "giving": "giving (n): اعطاء، اهداء، تقديم، عطية، منح، هدية، وهب",
  "offer": "offer (n): تجربة، تقدمة، تقديم، عرض، محاولة\n\noffer (v): تطوع، عرض، قدم",
  "travel": "travel (v): اثار، ادى، ارتحل، استقر، استهلك، اصبح، اعتزم، انطلق، باع، تجول، تحرك، تنزه، تنقل، جاب، جال، حدث، خرج، دار، ذهب، رحل، زار، سافر، ضحك، طاف، غادر، قال، قنع، لجا، لعب، مشى، مضى، نزل\n\ntravel (n): تحرك، ترحال، ترحل، تنقل، سفر",
  "sound": "sound (v): ادى، استهلك، اصبح، اعتزم، اعلن، امر، انطلق، بدا، بوق، تردد، حدث، خرج، دار، ذهب، رن، سافر، سبر، سمع، صوت، غادر، فحص، قال، قرع، لجا، مشى، مضى\n\nsound (n): صوت، مضيق",
  "function": "function (v): ادار، ادى، اشتغل، حدث، خدم، دار، شغل، عمل\n\nfunction (n): استعمال، اقتران، دالة، دور، عمل، فايدة، مناسبة، مهمة، نفع، وظيفة",
  "going": "going (n): ذهاب، رحيل، فراق، فقد، فقدان، مغادرة، وفاة",
  "leaving": "leaving (n): ذهاب، رحيل، مغادرة",
  "passing": "passing (n): رحيل، فراق، فقد، فقدان، وفاة",
  "loss": "loss (n): حرمان، خسارة، خسران، رحيل، فراق، فقد، فقدان، نقص، نقصان، وفاة",
  "good": "good (n): بضاعة، خير، سلعة، صلاح",
  "greater": "greater (a): اضخم، اعظم",
  "growth": "growth (n): ارتفاع، ازدياد، تطور، تعاظم، خراج، زيادة، نضج، نضوج، نمو، ورم",
  "growing": "growing (n): تطور، نضج، نضوج، نمو\n\ngrowing (a): نام",
  "turn": "turn (v): ابطل، ابعد، اثار، ارتد، استدار، التفت، التوى، الغى، انحرف، انعطف، انعكس، انقلب، بدل، تبدل، تحول، تخمر، حرك، حمض، حول، خلع، خمر، دار، دعا، رجع، سال، شوه، طرد، عكس، غير، فسد، قلب، لف، لوى، وثا\n\nturn (n): التفاف، دور، دوران، دورة، روتين، فصل، لعب، لفة",
  "farm": "farm (v): انتج، ربى، زرع\n\nfarm (n): مزرعة",
  "half": "half (n): فاصل، منتصف، نصف\n\nhalf (r): نصف",
  "happy": "happy (a): سعيد",
  "hearing": "hearing (n): استماع، انصات، سماع، سمع",
  "audience": "audience (n): استماع، جمهور، سماع، مجلس",
  "heavy": "heavy (a): ثقيل، شديد، ضخم، وافر",
  "maintain": "maintain (v): ابقى، احتفظ، احتوى، اخفى، استمر، اطاق، اعاد، اعال، اعتصم، اكد، امسك، انفق، ايد، بقي، تحمل، تكبد، جزم، حافظ، حجز، حفظ، حمل، دعم، راعى، راقب، ربى، رصد، ساند، سيطر، شغل، صان، صرح، صمد، طعم، ظل، عزز، عقد، غذى، قاسى، قاوم، قبل، قوى، كبت، كبح، لاحظ، لزم، مدد، ملك، واصل، وافق، ودع، وقى",
  "historical": "historical (a): تاريخي",
  "home": "home (n): اسرة، بلد، بيت، سكن، عايلة، مسكن، مقر، مكان، منزل",
  "family": "family (n): اسرة، اهل، بيت، جنس، ذنابة، صنف، عايلة، عشيرة، فصيلة، قرابة، قريب، قوم، منزل، نوع",
  "hot": "hot (a): ساخن",
  "man": "man (n): امرو، انسان، بشر، جندي، حبيب، خليل، ذكر، رجل، زوج، شخص، عاشق، عالم، عسكري، قرين، محبوب، مرء",
  "human": "human (n): انسان، بشر\n\nhuman (a): ادمي، انساني، بشري",
  "in": "in (n): انش، بوصة",
  "include": "include (v): ادخل، اشتمل، اضاف، اعترف، اقر، تضمن، درج، رضي، سلم، سمح، شمل، ضاف، ضم، ضمن، طوق، قبل",
  "increase": "increase (v): ازداد، اشتد، تزايد، تكاثر، رفع، ريع، زاد، كبر، نما، نمى\n\nincrease (n): ارتفاع، ازدياد، اضافة، تعاظم، زيادة، نمو",
  "increased": "increased (a): زايد، متزايد",
  "increasing": "increasing (a): متزايد",
  "person": "person (n): انسان، جسد، روح، شخص، صيغة، فرد، مخلوق، نفس",
  "individual": "individual (n): انسان، روح، شخص، فرد، مخلوق، نفس\n\nindividual (a): فردي",
  "someone": "someone (n): انسان، روح، شخص، فرد، مخلوق، نفس",
  "industrial": "industrial (a): صناعي",
  "inside": "inside (n): باطن، جوف، داخل",
  "intellectual": "intellectual (n): المعي، مثقف، مفكر\n\nintellectual (a): عقلي، فكري",
  "interest": "interest (v): اعتنى، اهتم، حث، رغب\n\ninterest (n): اهتمام، تسلية، تشويق، حصة، ربا، رغبة، سبيل، سلوى، سهم، شغف، غاية، غرض، فايدة، قصد، لهو، متعة، مصلحة",
  "interested": "interested (a): راغب، مهتم",
  "need": "need (v): احتاج، احتل، اختار، اخذ، ادرك، استخدم، استدعى، استعاد، استلزم، استلم، استمر، استولى، اسر، اشترط، اشترى، اعوز، اقتضى، التزم، التمس، بدا، تطلب، تعود، تناول، حتم، حقق، حمل، رافق، ربط، سال، شارك، شمل، صور، طالب، طلب، عاز، فرض، قبل، قضى، لزم، مطلوب، نال، وجب، ورط\n\nneed (n): احتياج، باعث، حاجة، حافز، داع، دافع، ضرورة، عوز",
  "demand": "demand (v): احتاج، احتل، اختار، اخذ، ادرك، استخدم، استدعى، استعاد، استلزم، استلم، استمر، استولى، اسر، اشترط، اشترى، اقتضى، التزم، التمس، بدا، تطلب، تعود، تناول، حتم، حقق، حمل، رافق، ربط، سال، شارك، شمل، صور، طالب، طلب، فرض، قبل، قضى، لزم، مطلوب، نال، وجب، ورط\n\ndemand (n): احتياج، حاجة، ضرورة، طلب، عوز، متطلب، مطلب",
  "involved": "involved (a): متورط، مشترك",
  "join": "join (v): اتحد، اتصل، اقترن، التحق، الحق، انخرط، انضم، تزوج، تلاصق، رافق، ربط، ضم، وحد، وصل\n\njoin (n): اتحاد، اتصال، جمع، ربط، ضم، مجموع، وصل",
  "prevent": "prevent (v): ابعد، احبط، احتفظ، اخفى، ازال، استبعد، استمر، اعاد، اعال، اعتصم، اعجز، تفادى، حجز، حرم، حظر، حفظ، راعى، ربى، سيطر، صمد، طعم، ظل، عاق، قطع، كبت، كبح، منع، واصل، ودع، وقى",
  "kind": "kind (n): شكل، صنف، ضرب، نمط، نوع",
  "sort": "sort (n): شكل، صنف، ضرب، نمط، نوع\n\nsort (v): استخلص، افترق، انسحب، انفصل، بوب، ترتب، تفرق، تفكك، رتب، شرح، صنف، عاشر، عرف، عنون، فرز، فرق، فصل، فك، فهم، قسم، قطع، ميز، نظم، وزع",
  "variety": "variety (n): شكل، صنف، ضرب، نمط، نوع",
  "know": "know (v): اتهم، اجاد، ادرك، ايقن، برهن، ترنح، تلولب، تلوى، جامع، خبط، دار، درى، شاطر، ضاجع، ضغط، طرف، عانى، عرف، عشق، علم، غازل، غرس، فتن، فهم، قرع، لاحظ، لولب، لوى، ميز، نجح، نكح، هزم، هوى، ولع",
  "love": "love (v): اتهم، احب، برهن، ترنح، تلولب، تلوى، جامع، خبط، دار، درى، شاطر، ضاجع، ضغط، طرف، عانى، عرف، عشق، علم، غازل، غرس، فتن، فهم، قرع، لاحظ، لولب، لوى، ميز، نجح، نكح، هزم، هوى، هوي، ولع\n\nlove (n): حب، حبيب، عزيز، عشق، غزيز، محبوب، معشوق، وجد",
  "jazz": "jazz (v): اتهم، برهن، ترنح، تلولب، تلوى، جامع، خبط، دار، درى، شاطر، ضاجع، ضغط، طرف، عانى، عرف، عشق، علم، غازل، غرس، فتن، فهم، قرع، لاحظ، لولب، لوى، ميز، نجح، نكح، هزم، هوى، ولع\n\njazz (n): جاز",
  "bed": "bed (v): اتهم، برهن، ترنح، تلولب، تلوى، جامع، خبط، دار، درى، رقد، شاطر، ضاجع، ضغط، طرف، عانى، عرف، عشق، علم، غازل، غرس، فتن، فهم، قرع، لاحظ، لولب، لوى، ميز، نجح، نكح، هزم، هوى، ولع\n\nbed (n): سرير، طبقة",
  "known": "known (a): محدد، معروف",
  "position": "position (v): اخرج، اخمد، اربك، استثمر، استقر، استهل، اسس، اعتبر، اقترح، بدا، برم، بسط، تاهب، تظاهر، تكلف، تلاءم، ثبت، جمد، حدث، حدد، حرض، خدع، دبر، دخر، دفن، راهن، ربط، رتب، رسم، رصع، ركب، زرع، صاغ، صنف، ضبط، طرح، طلب، عرض، عين، غرب، فتل، فرض، قرر، كمن، نظم، وضع، وقع\n\nposition (n): مركز، مكان، مكانة، منصب، منظور، موضع، موقع، موقف، نظرة، وضع، وضعية، وظيفة، وقفة",
  "lay": "lay (v): اخرج، اخمد، اربك، استثمر، استراح، استقر، استند، استهل، اسس، اضطجع، اعتبر، اعتمد، اقترح، القى، بدا، برم، بسط، تاهب، تظاهر، تكلف، تلاءم، ثبت، جمد، حدث، حدد، حرض، خدع، دبر، دخر، دفن، راهن، ربط، رتب، رسم، رصع، رقد، ركب، زرع، سكن، سند، صاغ، صنف، ضبط، طرح، طلب، عرض، عين، غرب، فتل، فرض، قرر، كمن، مد، نظم، وضع، وقع",
  "death": "death (n): اجل، تلاش، زوال، قتل، ممات، منية، موت، نحب، نهاية، هلاك، وفاة",
  "lie": "lie (v): اثقل، ارهق، استلقى، اضطجع، تمدد، جثم، دجل، رقد، ظل، كذب، كمن\n\nlie (n): موضع",
  "leadership": "leadership (n): رياسة، زعامة، قيادة",
  "leading": "leading (n): قيادة",
  "leave": "leave (v): اتاح، اتمنى، احتاط، اراد، اشترط، اعطى، انحرف، انصرف، اودع، اورث، اوصى، ايتمن، تاهب، تخلى، ترك، تزود، جهز، حيد، خرج، خلف، ذهب، رحل، رغب، زود، سافر، سمح، شاء، صمم، غادر، فوض، قام، مات، مد، مضى، موت، نزح، نسى، نسي، هجر، ودع، ورث، وصى\n\nleave (n): اجازة، اذن، انصراف، توديع، فراق، وداع",
  "result": "result (v): اسفر، ترك\n\nresult (n): تاثير، تبعة، حصيلة، عاقبة، نتيجة",
  "top": "top (v): تفوق، تقدم، سبق\n\ntop (n): اوج، دوامة، ذروة، راس، غطاء، قمة",
  "read": "read (v): احتل، اختار، اخذ، ادرك، استعاد، استلم، استمر، استولى، اسر، اشار، اشترى، اقتضى، اكتشف، بحث، بدا، تامل، ترجم، تصفح، تطلب، تعلم، تعود، تفحص، تناول، حاول، حقق، حمل، درس، دل، رافق، سجل، سمع، شارك، صور، طالع، علم، فسر، فهم، قال، قبل، قرا، قيد، كتب، نال",
  "left": "left (n): الشمال، اليسار",
  "provide": "provide (v): اتاح، اثث، احتاط، اشترط، اعطى، امد، تاهب، ترك، تزود، تمون، جهز، دهن، ذاب، رجع، رد، زود، سكب، سلم، سمح، شكر، صير، طلى، عزف، عين، غذى، غنى، قدم، مد",
  "will": "will (v): اراد، اورث، اوصى، تخلى، ترك، ذهب، رغب، سافر، شاء، صمم، غادر، مضى، نسى، هجر، ورث، وصى\n\nwill (n): وصية",
  "forget": "forget (v): تناسى، دفن، نسي",
  "legal": "legal (a): قانوني",
  "degree": "degree (n): درجة، رتبة، شهادة، مرتبة، مرحلة، مستوى، منزلة، نقطة",
  "stage": "stage (n): درجة، رتبة، شوط، فترة، مرتبة، مرحلة، مستوى، مسرح، نقطة",
  "floor": "floor (n): ارض، ارضية، طابق، طبقة",
  "story": "story (n): تقرير، حكاية، رواية، سرد، طابق، طبقة، قصة",
  "liberal": "liberal (n): تحرري، تقدمي، ليبرالي\n\nliberal (a): تحرري، حر، ليبرالي، متحرر",
  "light": "light (n): اشراق، اضاءة، سطوع، ضوء، قداحة، لمعان، مقداح\n\nlight (v): احرق، اشعل، اضاء، انار، انكب، ترجل، فك، فكك، نزع، نزل، وضح",
  "wish": "wish (v): ابتغى، اراد، اشتهى، اعتنى، بغى، تاق، تشابه، تماثل، تمنى، حب، رام، رغب، شاء، صمم، مال، ود، ورث\n\nwish (n): امنية، رغبة، مبتغى، مراد، مرام",
  "care": "care (v): ابتغى، ادار، اراد، اشتهى، اعتنى، اقتصد، اكل، اهتم، تاجر، تاق، تشابه، تصرف، تعامل، تعهد، تماثل، تمنى، حب، رام، رغب، روض، عالج، عنى، عني، قاد، لمس، مال، مس، ناور، نجح، واجه، وجد، ود، وزع\n\ncare (n): اهتمام، حرص، حماية، خوف، رعاية، صون، صيانة، عناية، مبالاة، مراعاة، وقاية",
  "like": "like (v): ابتغى، احب، اراد، اشتهى، اعتنى، تاق، تشابه، تماثل، تمنى، حب، رام، رغب، مال، وجد، ود\n\nlike (a): مثل، مرادف، مساو، مكافي، مماثل، نفس",
  "same": "same (a): ذاته، عينه، مثل، مرادف، مساو، مكافي، مماثل، نفس، نفسه",
  "likely": "likely (a): متوقع، محتمل\n\nlikely (r): ربما",
  "probably": "probably (r): ربما",
  "literary": "literary (a): ادبي",
  "small": "small (a): دقيق، مجهري",
  "little": "little (a): دقيق، مجهري",
  "life": "life (n): ترجمة، حركة، حياة، حيوية، روح، سيرة، عمر، معيشة، همة",
  "living": "living (n): حي، حياة، معيشة\n\nliving (a): حي",
  "long": "long (v): اشتاق، تاق، حن",
  "looking": "looking (n): نظر، نظرة",
  "appear": "appear (v): اتضح، اصدر، بحث، بدا، تظاهر، جاء، حدق، راقب، ظهر، مثل، نظر",
  "seem": "seem (v): اتضح، اصدر، بحث، بدا، تظاهر، حدق، راقب، ظهر، مثل، نظر",
  "lose": "lose (v): اضاع، خسر، ضيع، فقد",
  "create": "create (v): ابتدع، ابدع، احدث، اخرج، اسعد، اضرم، اعتبر، انتج، اندفع، بنى، تالف، تجبر، تصرف، تملق، تناول، جعل، حضر، حقق، حول، خلق، ربح، شن، صنع، ظهر، عرض، عوض، عين، غلق، فعل، قدم، لفق، نجح، هيا، وصل، ولد",
  "hit": "hit (v): ابتلى، اتصل، احدث، احرز، ارتطم، ازداد، اسعد، اشتعل، اصاب، اضرم، اطلق، اعتبر، اكتشف، امتد، انتج، انتصر، اندفع، بسط، بلغ، بنى، تاول، تجبر، تحصل، تصرف، تملق، تناول، جدول، جعل، حسب، حصد، حضر، حقق، حول، خلق، دون، ذبح، ربح، رطم، رن، سجل، سدد، سمع، شن، صد، صدم، صرع، صنع، ضرب، طعن، عجب، عد، عزف، عوض، عين، غلق، فاز، فعل، قتل، قدم، قذف، كافح، كسب، لدغ، لكم، نال، نجح، نجز، هاجم، هيا، وجد، وصل، وقع\n\nhit (n): ارتطام، اصابة، اصطدام، تصادم، دق، ضرب، ضربة، قرع، نجاح",
  "major": "major (v): تخصص",
  "many": "many (a): عديد، كثير، متعدد",
  "mark": "mark (v): ابدى، اشار، اشر، تميز، حدد، حذف، حقق، دون، رقم، سجل، شطب، ظهر، علم، لاحظ، ميز، نقط، وسم، وصل\n\nmark (n): اثر، تاشير، تعليم، دريية، دلالة، علامة، لطخة، مارك، مرقس، هدف، واصمة، وسم",
  "note": "note (v): اشار، انتبه، دون، ذكر، سجل، ظهر، علق، كتب، لاحظ\n\nnote (n): كمبيالة، ملاحظة، ملحوظة",
  "married": "married (a): متزوج",
  "mass": "mass (n): الكثير، جماهير، جمهور، شعب، كثرة، كثلة",
  "lot": "lot (n): الكثير، اوضاع، باقة، حزمة، حظ، حلقة، ظرف، ظروف، قدر، قسمة، قطف، كثرة، مجموعة، نصيب\n\nlot (v): ادار، اعطى، بصق، بوب، تاجر، تعامل، حكم، حلف، خص، خصص، دبر، صنف، عاقب، عالج، فرق، قسم، منح، نثر، نشر، وزع",
  "plenty": "plenty (n): الكثير، كثرة",
  "sight": "sight (n): الكثير، روية، كثرة، مشهد، مصوب، منظر\n\nsight (v): راى، شاهد، صوب، لمح",
  "people": "people (n): اهل، جماهير، جمهور، شعب، مواطنين، ناس",
  "master": "master (n): اصل، حرفي، محترف، مهني، مولى\n\nmaster (v): اتقن، تمكن، ساد، سيطر، هيمن",
  "original": "original (n): اصل\n\noriginal (a): اصلي، اصيل، جديد، مبتكر",
  "professional": "professional (n): حرفي، محترف، مهني\n\nprofessional (a): احترافي، حرفي، محترف، مسلكي، مهني",
  "material": "material (n): شيء، قماش، مادة، نسيج\n\nmaterial (a): بدني، جسماني، مادي، ماذي",
  "mean": "mean (n): المتوسط\n\nmean (v): اراد، استتبع، استلزم، استوجب، اشار، اعتزم، اعتقد، اعتنى، اوجب، بين، تامل، تخيل، دل، ضمر، ظن، عنى، فكر، قدر، قصد، مثل، نوى",
  "meaning": "meaning (n): جوهر، غرض، قصد، مدلول، معنى، مغزى",
  "significance": "significance (n): اهمية، شان، قصد، مدلول، معنى، مغزى",
  "measure": "measure (v): اجل، ثمن، جزم، حدد، حسب، خمن، ذرع، ضبط، عظم، فرض، قاس، قدر، قوم، قيم، كال، كيل، نظم\n\nmeasure (n): اجراء، اعداد، تدبير، خطوة، قدر، قياس، كم، كمية، مبلغ، معيار، مقدار، مقياس",
  "value": "value (v): اتصل، اجل، احترم، اعز، تعلق، ثمن، جزم، حدد، حسب، حفظ، حقق، خمن، ذرع، ضبط، عجب، عظم، فرض، قاس، قدر، قوم، قيم، كسب، نظم، وقر\n\nvalue (n): قدر، قيمة",
  "measured": "measured (s): مقاس",
  "medical": "medical (a): طبي",
  "contact": "contact (v): اتحد، اتصل، اجتمع، استلف، التقى، تصادم، تعرف، تعلق، تقابل، توقف، جاور، جس، حاذى، راجع، صادف، ضلع، قابل، لامس، لمس، مس، هذب، واجه، وصل\n\ncontact (n): اتصال، ارتباط، ارتطام، اصطدام، تلامس، تماس، ربط، ملامسة",
  "metal": "metal (n): اشابة، خليطة، سبيكة، معدن\n\nmetal (a): معدني",
  "military": "military (n): جيش، عسكر\n\nmilitary (a): حربي، عسكري",
  "minute": "minute (n): برهة، دقيقة، فينة، لحظة، هنيهة",
  "moment": "moment (n): برهة، فينة، لحظة، هنيهة",
  "second": "second (n): برهة، ثانية، فينة، لحظة، هنيهة",
  "model": "model (n): طراز، قالب، قدوة، مثال، محاكاة، مودل، موديل، نموذج\n\nmodel (v): احتذى، اقتدى، تعفن، جسد، جسم، خطط، سبك، سكب، شكل، صاغ، صمم",
  "modern": "modern (a): حديث",
  "moral": "moral (a): اخلاقي",
  "moving": "moving (a): متحرك",
  "musical": "musical (a): موسيقي",
  "narrow": "narrow (v): تخصص، حدد، ضيق",
  "national": "national (n): مواطن\n\nnational (a): قومي، وطني",
  "necessary": "necessary (a): اساسي، ضروري، فرض، لازم، متطلب، مهم، واجب",
  "negative": "negative (n): رفض، نفي",
  "new": "new (a): جديد",
  "next": "next (r): بعدها، ثم",
  "no": "no (n): كلا، لا",
  "normal": "normal (n): اسلوب، تقليد، عادة، قاعدة\n\nnormal (a): طبيعي، عادي، قياسي، نظامي",
  "pattern": "pattern (n): اسلوب، تقليد، رسم، زخرفة، زينة، شكل، صورة، عادة، غرار، قاعدة، نمط، نموذج",
  "rule": "rule (n): اسلوب، اصل، تعليمة، تقليد، عادة، قاعدة، نظام\n\nrule (v): اعلن، حصر، حكم، ساد، سطر، سيطر، شرع، عاق، عم، غلب، غوى، قرر، ملك",
  "formula": "formula (n): اسلوب، تقليد، صغة، عادة، قاعدة",
  "north": "north (n): شمال\n\nnorth (a): شمالي\n\nnorth (r): شمالا",
  "mention": "mention (v): استدعى، استشهد، اشار، انتبه، اورد، ذكر، شيد، علق، لاحظ، نوه",
  "noticed": "noticed (a): جلي، ملاحظ، ملحوظ",
  "novel": "novel (n): رواية",
  "nuclear": "nuclear (a): ذري، نووي",
  "object": "object (n): جسم، شيء، غاية، غرض، قصد، موضع، هدف\n\nobject (v): اعترض، رفض، عارض",
  "objective": "objective (n): غاية، غرض، قصد، هدف",
  "murder": "murder (v): ذبح، قتل\n\nmurder (n): قتل",
  "off": "off (v): ذبح، قتل",
  "remove": "remove (v): احتل، اختار، اخذ، اخرج، ادرك، ارتد، ازاح، ازال، استبعد، استرد، استعاد، استلم، استمر، استولى، اسر، اشترى، اقال، اقتضى، انسحب، بدا، تخلص، تراجع، تطلب، تعود، تقهقر، تناول، حقق، حمل، حول، ذبح، رافق، رحل، سحب، شارك، صرف، صور، طرد، فصل، قبل، قتل، كشف، نال، نزع، نكص",
  "official": "official (n): مسوول، موظف\n\nofficial (a): رسمي",
  "old": "old (n): الماضي، قدم",
  "older": "older (s): اكبر، كبرى",
  "open": "open (v): ابتدا، استفتح، استهل، اسس، اطلق، افتتح، انفتح، تفتح، حرر، شق، فتح، كشف، مد، نشر",
  "spread": "spread (v): اتسع، اشاع، امتد، انتشر، انفرج، بث، بسط، بعثر، تفتح، تفشى، تمدد، توسع، دار، ذر، ذيع، سطح، شاع، فتح، فرق، كسا، كشف، مد، نثر، نشر، وزع\n\nspread (n): امتداد، انتشار",
  "opening": "opening (n): احتمال، افتتاح، امكان، امكانية، بدء، بداية، ثغرة، سم، سمام، شاغر، فتح، فتحة، فجوة، فراغ، فرجة، فرصة، فوهة، كوة، مبادرة، مدخل",
  "possibility": "possibility (n): احتمال، افتراض، امكان، امكانية، ظن، فرض، فرضية، نظرية",
  "opposite": "opposite (n): خصم، ضد، عكس، غريم، متسابق، ند، نظير، نقيض",
  "order": "order (v): اخبر، استثمر، امر، حدث، حكم، رتب، صنف، ضبط، طلب، عين، كون، نصب، نظم، وسم، وضع، وقع\n\norder (n): امر، انتظام، ترتيب، تسلسل، تنظيم، حكم، قرار، مرسوم، ناد، نسق، نظام",
  "tell": "tell (v): اخبر، ادرك، استخلص، اعترف، اعتقد، اعلن، افترق، امر، انسحب، انفصل، اورد، بسط، بوب، تخالف، تخلق، تفرق، تفكك، تفهم، تكلم، تميز، خلق، روى، زعم، صاغ، صرح، صنف، عرض، عين، فرق، فصل، فك، قال، قرر، قسم، قطع، لفظ، ميز، نطق، وضح",
  "say": "say (v): اخبر، اختار، اشار، اعترف، اعتقد، اعلن، افترض، امر، اورد، بسط، بين، تذرع، تكلم، تهجا، ردد، روى، زعم، صاغ، صرح، عبر، عرض، عين، قال، قرر، لفظ، نطق، وضح\n\nsay (n): قول",
  "rate": "rate (v): استثمر، ثمن، حدث، رتب، صنف، طلب، قدر، وضع، وقع\n\nrate (n): تعريفة، سعر، معدل",
  "range": "range (v): استثمر، اضاع، اطلق، القى، امتد، انبسط، انجرف، انحرف، انضم، تاه، تجول، تدحرج، تدفق، تراصف، ترحل، ترصن، تسكع، تسلق، تسول، تعرش، تكور، تلوى، تمايل، تمرق، تنزه، جاب، جرى، جول، حاد، حام، حدث، حظ، خرف، دخل، دفع، دوى، رتب، رغا، رمى، سبك، شرد، شكل، صب، صنف، صوب، ضل، طاف، طفا، طلب، عقد، غبار، قذف، ملس، مهد، نظرة، نظم، هام، هذى، هيية، وزع، وضع، وقع\n\nrange (n): تشكيلة، متناول، مجال، ميدان، نسق، نطاق",
  "out": "out (v): ظهر، نشر",
  "outside": "outside (n): الخارج",
  "own": "own (v): حاز، ملك",
  "paid": "paid (a): مدفوع",
  "pale": "pale (v): اصفر، شحب",
  "particular": "particular (n): تفصيل، جزء، خاص",
  "specific": "specific (n): خاص",
  "detail": "detail (n): تفصيل، جزء",
  "item": "item (n): بند، تفصيل، جزء، رمز، علامة، مادة، مفرد، نقطة",
  "spend": "spend (v): استخدم، استعمل، استهلك، اعد، امضى، انحدر، انخفض، انسحب، انفق، انهار، اهمل، بدد، بذر، بذل، تبادل، تبرز، تجاوز، تدنى، ترك، تغاضى، تغوط، جهل، حدث، رحل، سقط، سقوط، سير، صرف، ضنى، عبر، قضى، قطر، مر، مرر، نجح، نزل، نهك، وقع",
  "past": "past (n): الماضي، سابق، ماض\n\npast (a): ماضي",
  "patient": "patient (n): مريض",
  "perfect": "perfect (v): اتم، جود، حسن، شحذ، صقل، نجز، هذب",
  "station": "station (v): استثمر، حدث، صنف، طلب، عين، وضع، وقع\n\nstation (n): محطة، مركز، مكان، موقع",
  "post": "post (v): ارسل، استثمر، برق، بعث، حدث، صنف، طلب، عين، وضع، وقع\n\npost (n): بريد، مركز، منصب، موقع، وظيفة",
  "plane": "plane (n): طايرة، مستوى، مستوي",
  "plan": "plan (v): اعتزم، اعد، خطط، صمم، نظم، نوى\n\nplan (n): ترتيب، تصميم، خطة، مخطط",
  "plus": "plus (n): اضافة، جمع، زيادة، كسب، نفع",
  "addition": "addition (n): اضافة، جمع، زيادة",
  "indicate": "indicate (v): ابحر، اشار، اشر، اظهر، اقترح، برز، بين، دل، طين، ظهر، نقط، نم، وجب، وجه، وما",
  "signal": "signal (v): ابحر، اشار، اشر، برز، بين، دل، طين، ظهر، نقط، نم، وجب، وجه، وما",
  "political": "political (a): سياسي",
  "possible": "possible (a): جايز، محتمل، ممكن",
  "potential": "potential (a): جايز، محتمل، ممكن\n\npotential (n): احتمالية، ارجحية، امكانية، جواز",
  "powerful": "powerful (a): جبار، عظيم، قوي",
  "private": "private (n): جندي، عسكري، مجند، نفر",
  "proud": "proud (a): فخور، معتز، مفتخر",
  "evidence": "evidence (v): اثبت، اخبر، اختبر، استعرض، اشار، اعلن، اكد، برهن، بين، تظاهر، ثبت، شهد، طهر، ظهر، عرض، علاقة، قاد، قدم، مثل\n\nevidence (n): اثبات، برهان، دليل، سند، شاهد، علامة",
  "test": "test (v): اختبر، امتحن، بحث، جرب، فحص\n\ntest (n): اختبار، استجواب، امتحان، تجربة، فحص",
  "try": "try (v): اجتهد، اختبر، ارهق، امتحن، بحث، تذوق، تعب، جرب، حاكم، حاول، ذاق، سعى، طلب، عاين، فحص، قاس، قاضى، قصد، لبس\n\ntry (n): تجربة، جهد، سعي، محاولة، مسعى",
  "public": "public (n): ناس",
  "world": "world (n): الارض، الخلق، الدنيا، العالم، الكون، الناس، الوجود، بشر، حياة، دنيا، عالم، ناس",
  "issue": "issue (v): اصدر، انبثق، اندفع، انطلق، بزغ، خرج، ظهر، نشر\n\nissue (n): اصدار، تاثير، تبعة، تموين، حصيلة، خلف، ذرية، شان، عاقبة، عدد، قضية، متنفس، مخرج، مسالة، منفذ، موضوع، موونة، نتيجة، نسل",
  "published": "published (a): مطبوع، منشور",
  "quality": "quality (n): خاصية، سمة، ملمح، نغمة، نوعية",
  "character": "character (n): حرف، خاصية، دور، سمة، شخصية، ملمح",
  "tone": "tone (n): صبغة، نغمة",
  "quiet": "quiet (n): هدوء",
  "radio": "radio (n): مذياع\n\nradio (a): اشعاعي",
  "fire": "fire (v): اثار، اجج، احدث، احرق، استثار، استحث، استفز، استيقظ، اشعل، اضرم، اطلق، اقال، انهض، اهاج، ايقظ، برز، تحرش، ثور، جمع، حث، حرض، خبز، خمر، رب، ربى، رفع، رقى، سدد، شال، شوى، شيد، ضحك، طرد، غضب، غيظ، فصل، قتل، نبذ، نهض، هاج، هيج\n\nfire (n): اطلاق، حريق، لهب، نار",
  "real": "real (a): حقيقي، واقعي",
  "recognize": "recognize (v): ادرك، استطلع، اعترف، اقر، تبين، تعرف، حي، حيا، راى، سلم، سمع، شكر، عرف، فطن، قدر، لاحظ، ميز",
  "understand": "understand (v): ادرك، استنتج، ترجم، تفهم، تيقن، حقق، عرف، فهم، لاحظ",
  "spot": "spot (v): تبين، راى، سمع، فطن، لاحظ، لمح، ميز\n\nspot (n): بقعة، تلويث، شايبة، عيب، لطخة، مكان، منصب، وصمة، وظيفة",
  "red": "red (n): خسارة",
  "thin": "thin (v): اضعف، انقص، خفض، خفف، رق، صعف، قلل، نحف، نحل، نقص، هزل",
  "reduced": "reduced (a): مخفض، ناقص",
  "regular": "regular (a): نظامي",
  "rising": "rising (n): انتفاضة، تمرد، ثورة",
  "surface": "surface (v): اتى، ارتفع، تصاعد، دهن، ستر، سطح، طلع، طلى، ظهر، غطى، كسا\n\nsurface (n): سطح، ظاهر، مظهر",
  "rose": "rose (n): وردة، ورديات",
  "round": "round (n): جولة، حلقة، دور، دورة\n\nround (v): تهجم، صقل، هاجم\n\nround (a): دايري، كروي، مبروم، مدور، مستدير، مكور",
  "attack": "attack (v): اعتدى، اغار، تهجم، مهاجمة، هاجم، هجم، هجوم\n\nattack (n): اعتداء، مهاجمة، نوبة، هجوم",
  "running": "running (n): ادارة، تسيير، جري، ركض",
  "escape": "escape (v): ادار، اذاب، ارتشح، افلت، انبعث، انتشر، انزلق، انسل، ترشح، تسرع، تكرر، جرى، جري، حكم، دخل، ركض، سال، سحب، شغل، صفى، طارد، طبع، عبر، عجل، عدا، فر، فلت، قاد، نجا، نشر، هرب، هرول، وقع\n\nescape (n): تسلل، تهرب، فرار، هارب، هروب",
  "flow": "flow (v): ادار، اذاب، ارتفع، اشبع، اطعم، اقتات، اكل، انتشر، انزلق، انسل، انهال، تدفق، تدلى، ترشح، تسرع، تكرر، تهدل، جرى، جري، حدث، حكم، دخل، رضى، ركض، سال، سحب، شجع، شغل، صب، صفى، طارد، طبع، طعم، عبر، عجل، عدا، غذى، غمر، فاض، قاد، لقم، نشر، هرول، وقع\n\nflow (n): تدفق، جريان",
  "feed": "feed (v): ادار، اذاب، ارتفع، اشبع، اطعم، اقتات، اكل، انتشر، انزلق، انسل، تدفق، تدلى، ترشح، تسرع، تغذى، تكرر، تهدل، جرى، جري، حدث، حكم، خصب، دخل، دعم، رضى، ركض، سال، سحب، سمد، شجع، شغل، صب، صفى، طارد، طبع، طعم، عبر، عجل، عدا، علف، غذى، غمر، فاض، قاد، لقم، نشر، هرول، وقع\n\nfeed (n): طعام، علف، عليق",
  "course": "course (v): ادار، اذاب، ارتفع، اشبع، اطعم، اقتات، اكل، انتشر، انزلق، انسل، تدفق، تدلى، ترشح، تسرع، تكرر، تهدل، جرى، جري، حدث، حكم، دخل، رضى، ركض، سال، سحب، شجع، شغل، صب، صفى، طارد، طبع، طعم، عبر، عجل، عدا، غذى، غمر، فاض، قاد، لقم، نشر، هرول، وقع\n\ncourse (n): اسلوب، توجه، درس، دورة، سيرة، صف، طريقة، غرار، مسار، مسعى، مسلك، مسيرة، مقرر، منهج، ميدان، ميل",
  "safe": "safe (a): امن",
  "suppose": "suppose (v): احتسب، اعتقد، افترض، تخيل، تصور، تفكر، توقع، حدس، حرز، حسب، خمن، ظن، قدر، قوم",
  "scientific": "scientific (a): علمي",
  "secret": "secret (n): سر",
  "project": "project (v): ادرك، اسقط، اصلح، اطلق، اعتبر، اقترح، بحث، برز، بصر، تجاوز، تحمل، تخيل، تدبر، تصور، تمثل، توهم، تيقن، جسم، حسب، حقق، خطط، رافق، راى، رسم، رمى، زار، زين، سمح، شاهد، صمم، صور، ظن، عرض، عرف، عزم، عمل، عنى، فحص، فهم، قرر، لاحظ، لمح، نتا، نوى\n\nproject (n): تعهد، شغل، عمل، مشروع، مهمة، واجب",
  "figure": "figure (v): اتكل، احصى، ادرك، اسقط، اصلح، اضاف، اطلق، اعتبر، اعتقد، اعتمد، افترض، بحث، برز، بصر، تجاوز، تحمل، تخيل، تدبر، تصور، تعمد، تمثل، تنبا، توقع، توهم، تيقن، جسم، حسب، حقق، حكم، خطط، خمن، رافق، راى، رسم، رمى، زار، زين، سمح، شاهد، صمم، صور، ظن، عد، عرف، عزم، عمل، عنى، فحص، فهم، قدر، قرر، قوم، لاحظ، لمح، نتا، نوى\n\nfigure (n): اسم، بدن، بنية، رسم، رقم، زخرفة، زينة، شخصية، شكل، عدد، هيكل",
  "picture": "picture (v): ادرك، اسقط، اصلح، اطلق، اظهر، اعتبر، بحث، برز، بصر، تجاوز، تحمل، تخيل، تدبر، تصور، تمثل، توهم، تيقن، جسم، حسب، حقق، خطط، رافق، راى، رسم، رمى، زار، زين، سمح، شاهد، صمم، صور، ظن، عرض، عرف، عزم، عمل، عنى، فحص، فهم، قرر، لاحظ، لمح، مثل، نتا، نوى\n\npicture (n): انطباع، ايقونة، تصوير، تصويرة، تمثيل، رسم، صورة، فيلم، مشهد",
  "image": "image (v): ادرك، اسقط، اصلح، اطلق، اعتبر، بحث، برز، بصر، تجاوز، تحمل، تخيل، تدبر، تصور، تمثل، توهم، تيقن، جسم، حسب، حقق، خطط، رافق، راى، رسم، رمى، زار، زين، سمح، شاهد، صمم، صور، ظن، عرف، عزم، عمل، عنى، فحص، فهم، قرر، لاحظ، لمح، نتا، نوى\n\nimage (n): تصور، شخصية، صورة، وجه",
  "visit": "visit (v): ابتلى، ادرك، ازعج، اصاب، اصلح، اعتبر، الم، انزل، بحث، بصر، تحادث، تحمل، تخيل، تدبر، تسامر، تصطك، تصور، تفقد، تيقن، ثرثر، حقق، دردش، رافق، راى، زار، زقزق، سمح، شاهد، صب، عرف، عمل، عنى، فحص، فرض، فهم، لاحظ، لغا، لغى، لمح، نم، هذر، وجع، وجه\n\nvisit (n): زيارة",
  "date": "date (v): تواعد، راى، شاهد، واعد\n\ndate (n): تاريخ، تمر، توقيت، جد?يد، موعد، ميعاد، يوم",
  "selected": "selected (a): مختار، منتخب، منتقى",
  "ship": "ship (v): ابعد، ارسل، بعث، شحن، نقل\n\nship (n): سفينة، مركب",
  "class": "class (v): استخلص، افترق، انسحب، انفصل، بوب، ترتب، تفرق، تفكك، رتب، شرح، صنف، عاشر، عرف، عنون، فرز، فرق، فصل، فك، فهم، قسم، قطع، ميز، نظم، وزع\n\nclass (n): جنس، درس، دفعة، دورة، صف، صنف، طبقة، مقرر، نوع",
  "circle": "circle (n): حلقة، دايرة، مجموعة",
  "sexual": "sexual (a): جنسي",
  "shot": "shot (n): اطلاق، اقتناص، تجربة، حقن، حقنة، رامي، رصاصة، رمي، رمية، زرق، زرقة، ضربة، طلقة، فرصة، قذفة، قنص، لقطة، محاولة، مشهد",
  "scene": "scene (n): ساحة، صورة، لقطة، مشهد، مكان، منظر، موقع",
  "film": "film (v): احتل، اختار، اخذ، ادرك، استعاد، استلم، استمر، استولى، اسر، اشترى، اصاب، اصطاد، اطلق، اعدم، اقتضى، انزلق، بدا، برز، تبرعم، تحجب، تطلب، تعود، تغشى، تناول، جرح، حقق، حقن، حمل، رافق، سدد، شارك، صوب، صور، قبل، قتل، لقح، نال، نما\n\nfilm (n): سيليلويد، طبقة، فلم، فيلم",
  "side": "side (n): انحدار، جانب، منحدر، ميل، وجه",
  "sign": "sign (n): استقطابية، اشارة، ايماءة، قطبية، لافتة\n\nsign (v): اشار، علم، وقع، وما",
  "sit": "sit (v): ابحر، اجلس، استقر، اقعد، امتطى، انعقد، بدل، بقي، تغلب، جثم، جلس، حط، درك، رقد، ركب، سافر، طفا، قعد، نكح",
  "size": "size (n): حجم",
  "slight": "slight (n): استخفاف، اهانة",
  "slow": "slow (v): تباطا، تمهل، خفف",
  "social": "social (n): اجتماعي",
  "soft": "soft (a): رخو، لين",
  "solid": "solid (n): جمود، صلابة، مجسم\n\nsolid (a): جامد، صلب",
  "search": "search (v): استشار، استكشف، اكتشف، بحث، تقصى، حاول، سبر، طلب، فتش، فحص، قصد\n\nsearch (n): بحث، تفتيش",
  "seek": "seek (v): اجتهد، اختبر، ارهق، استشار، استكشف، اكتشف، بحث، تعب، تقصى، جرب، حاكم، حاول، سبر، سعى، طلب، فتش، فحص، قصد",
  "attempt": "attempt (v): اجتهد، اختبر، ارهق، باشر، بحث، تعب، جرب، حاكم، حاول، سعى، شرع، طلب، فحص، قصد\n\nattempt (n): اعتداء، تجربة، جهد، سعي، محاولة، مسعى، مهاجمة، هجوم",
  "sought": "sought (a): مامول، متوخى، منشود",
  "phone": "phone (n): تلفون، سماعة، صوت، هاتف\n\nphone (v): اتصل، تلفن، كلم، هاتف",
  "south": "south (n): ج، جنوب\n\nsouth (a): جنوبي\n\nsouth (r): جنوبا",
  "special": "special (n): خاص",
  "square": "square (n): تربيع، مربع، ميدان",
  "standard": "standard (n): معيار، مقياس",
  "standing": "standing (n): سمعة، مكانة",
  "stock": "stock (n): اصل، اصول، جرد، حساء، حيوانات، دواجن، ذرية، سلالة، ماشية، مخزون، مرق، مواشي، موونة، نسل\n\nstock (v): اختزن، خزن",
  "store": "store (n): حانوت، دكان، متجر، مخزن، مخزون، مستودع، موونة\n\nstore (v): ادخر، حفظ، خزن، زود، ودع",
  "blood": "blood (n): دم، ذرية، سلالة، نسل",
  "block": "block (v): احبط، اخفى، اربك، اعاق، اعترض، الغى، انسد، انقطع، اوقف، بقي، تردد، تعطل، تكدس، توقف، جمد، جمع، حاصر، حبس، حجز، حشا، حظر، حول، خدر، سحق، سد، شوش، ضغط، عاق، عرقل، عطل، عقد، علق، عوق، غرز، غلق، فاصل، قطع، قفل، كبح، منع، نسي، هرس، هزم، ورط\n\nblock (n): انسداد، انغلاق، تكلس، قاطع، قالب، مجموعة، مربع، مكعب، وحدة",
  "bar": "bar (v): احبط، اربك، اعاق، اعترض، الغى، انسد، انقطع، اوقف، بقي، تردد، توقف، جمع، حاصر، حجز، حظر، حول، خدر، سد، عاق، علق، فاصل، قطع، منع، هزم\n\nbar (n): بار، حانة، خمارة، عارضة، قضيب، منع",
  "straight": "straight (a): مستقيم",
  "strong": "strong (a): قوي",
  "theme": "theme (n): الفكرة، الموضوع، موضوع",
  "field": "field (n): اطار، حقل، ساحة، سهل، فرع، مجال، مسرح، مطار، ملعب، مهبط، موضوع، ميدان، نطاق",
  "matter": "matter (n): امر، شان، شيء، مادة، مسالة، موضوع\n\nmatter (v): اهم، هم",
  "case": "case (n): ادعاء، امثولة، حال، حالة، دعوى، شاهد، شكوى، صندوق، قضية، مثال، مثل، مسالة، نموذج\n\ncase (v): جمع، راقب، صندق، غطى، غلف",
  "such": "such (r): هايل",
  "imagine": "imagine (v): اعتقد، افترض، تخيل، تصور، توقع، حسب، خمن، شبه، ظن، قدر، قوم",
  "guess": "guess (v): استنتج، اعتقد، افترض، تبار، تخيل، تصور، توقع، ثمن، حاكم، حرز، حزر، حسب، خرص، خمن، ظن، فصل، قارب، قاس، قدر، قوم، قيم",
  "surprise": "surprise (v): ادهش، اقتحم، باغت، دهش، ذهل، عصف، فاجا، هاج\n\nsurprise (n): بغتة، فجاة، مباغتة، مفاجاة",
  "surprised": "surprised (a): مندهش",
  "sweet": "sweet (n): حلاوة، حلوى، حلويات",
  "bring": "bring (v): ابلغ، اثار، اجتذب، احتل، احدث، احضر، اختار، اخذ، اخرج، ادرك، ادى، استعاد، استلم، استمر، استولى، اسر، اسهم، اشترى، اصاب، اضاف، اضفى، اعار، اغرى، اقتضى، اقرض، بدا، تبرع، تجبر، تطلب، تعود، تناول، جاء، جضر، جلب، جمع، حصل، حضر، حقق، حمل، حيز، رافق، زار، زود، ساعد، ساهم، سرق، شارك، صور، ضم، فاز، قبل، قنع، كسب، معدل، منح، نال، نقل، هيا، واكب، وصل",
  "claim": "claim (v): اخذ، ادعى، استحق، تطلب، دعا، شكى، طالب، طلب\n\nclaim (n): دعوة، دعوى، شكاية، شكوى، مطلب",
  "tall": "tall (a): عالي",
  "then": "then (r): بعديذ، ثم",
  "so": "so (r): بعديذ، ثم",
  "thinking": "thinking (n): تامل، تفكير، فكر، فكرة",
  "thought": "thought (n): تامل، تفكير، خاطر، خاطرة، راي، فكر، فكرة",
  "remember": "remember (v): ااستدعى، استرجع، استرد، اعاد، تذكر، تفكر، ذكر",
  "together": "together (r): سوية، معا",
  "school": "school (v): ادب، ثقف، درب، درس، ربى، علم، هذب\n\nschool (n): مدرسة",
  "process": "process (v): اعتبر، تاخم، تظاهر، تقدم، خطا، دخل، سار، سير، شكل، صنع، عالج، عمل، فاوض، مشى\n\nprocess (n): اجراء، انبثاق، بزوغ، خروج، زايدة، طريقة، ظهور، عملية، لاحقة، ملحق، ناتي، نتوء، نمو",
  "treated": "treated (a): معالج",
  "sample": "sample (v): اجتهد، اختبر، ارهق، بحث، تذوق، تعب، جرب، حاكم، حاول، ذاق، عاين\n\nsample (n): عينة، مسطرة، نموذج",
  "taste": "taste (v): اجتهد، اختبر، ارهق، بحث، تذوق، تعب، جرب، حاكم، حاول، ذاق، عاين\n\ntaste (n): ادراك، تذوق، تقدير، تمييز، حصافة، ذوق، طعم",
  "true": "true (a): حقيقي، صحيح",
  "understanding": "understanding (n): بصيرة، دراية، رشد، صواب، عقل، فطنة، فهم",
  "reason": "reason (n): رشد، سبب، صواب، عقل، فهم\n\nreason (v): استخرج، استدل، استنبط، استنتج، ايد، برهن، توصل، جادل، حسب، سوغ، عقد، فكر، وصل",
  "union": "union (n): اتحاد، اندماج، توحيد، جمع، دمج، زواج، ضم، مجموع",
  "marriage": "marriage (n): زواج، عرس",
  "used": "used (a): مستخدم، مستعمل، مستغل",
  "walk": "walk (n): تمشى، سير، مشى، مشي، ممر، ممشى\n\nwalk (v): اجتاز، تمشى، تنزه، خطا، رافق، صحب، ظهر، لازم، مشى",
  "walking": "walking (n): سير، مشي",
  "wanted": "wanted (a): مبتغى، مراد، مطلوب",
  "warm": "warm (v): اسعد، تحمس، حمى، حمي، دفا، سخن",
  "weather": "weather (n): جو، طقس",
  "conditions": "conditions (n): جو، طقس",
  "wet": "wet (v): بلل، بول، تندى، خضل\n\nwet (a): رطب، مبتل، مبلل، مبلول",
  "white": "white (a): ابيض، قوقازي",
  "whole": "whole (n): جميع، كل، مجموع، وحدة",
  "unit": "unit (n): جميع، كل، مجموع، وحدة",
  "willing": "willing (a): راغب، مستعد",
  "universe": "universe (n): البشر، الخلق، الدنيا، العالم، الكون، الوجود",
  "existence": "existence (n): الخلق، الدنيا، العالم، الكون، الوجود، ديمومة، كيان، كينونة، وجود",
  "reality": "reality (n): حقيقة، حياة، دنيا، عالم، واقع، واقعية",
  "earth": "earth (n): ارض، الارض، العالم، الكون، اليابسة، بر، تراب، دنيا",
  "worth": "worth (n): استحقاق، جدارة، قيمة",
  "write": "write (v): الف، تهجى، خط، دبج، دون، كاتب، كتب، لحن، نظم",
  "written": "written (a): كتابي، مخطوط، مدون، مكتوب، مولف",
  "wrong": "wrong (v): ضام، ظلم\n\nwrong (a): خاطي، طالح، فاسد، مخالف",
  "young": "young (n): جرو، شباب، شبيبة، صغير، فتيان، نسل\n\nyoung (a): حدث، شاب، ناشي، يافع",
  "youth": "youth (n): شباب، شبيبة، صبا، صبي، غلام، فتى، فتيان",
  "as": "as (n): زرنيخ",
  "a": "a (n): امبير، انجستروم، انغستروم",
  "immediately": "immediately (r): حالا، فورا، مباشرة",
  "directly": "directly (r): حالا، فورا، مباشرة",
  "now": "now (r): حالا، فورا، مباشرة\n\nnow (n): الان",
  "particularly": "particularly (r): خصوصا",
  "especially": "especially (r): خصوصا",
  "forth": "forth (r): متقدما",
  "not": "not (r): لا، ليس",
  "nothing": "nothing (n): صفر",
  "once": "once (r): حالما، حين، عندما",
  "piece": "piece (n): جزء، شريحة، طرف، قسم، قطعة، مقطوعة، منطقة\n\npiece (v): قضم، لقط",
  "region": "region (n): اقليم، جهة، حد، حقل، مجال، منطقة، نحو",
  "office": "office (n): دور، مركز، مكتب، منصب، مهمة، موظفين، وظيفة، وكالة",
  "role": "role (n): استعمال، دور، شخصية، عمل، فايدة، مهمة، نفع، وظيفة",
  "share": "share (n): جزء، حصة، سهم، قسط، قسم، نصيب\n\nshare (v): اشترك، شارك، شاطر، قاسم",
  "section": "section (n): تقسيم، جزء، فصل، فقرة، قسم، قطاع، مقطع",
  "division": "division (n): تجزية، تقسيم، تقطيع، جزء، شعبة، فرقة، فصل، فية، قسم، قسمة، كتيبة",
  "quickly": "quickly (r): مسرع",
  "rapidly": "rapidly (r): مسرع",
  "truly": "truly (r): باخلاص، بصدق، حقا، صدقا",
  "really": "really (r): باخلاص، بصدق، حقا، صدقا",
  "today": "today (n): اليوم",
  "tomorrow": "tomorrow (n): الغد، غد\n\ntomorrow (r): غدا",
  "twice": "twice (r): مرتان، مرتين",
  "usually": "usually (r): عادة، غالبا",
  "manner": "manner (n): اسلوب، طريقة، نمط",
  "style": "style (n): اسلوب، تصميم، صيحة، طراز، طريقة، موضة، نمط",
  "way": "way (n): اتجاه، اسلوب، جهة، حيز، سبب، سبيل، طريق، طريقة، متسع، مجال، مسلك، ممر، منوال، نمط، وجهة، وساطة، وسيلة",
  "fashion": "fashion (n): اسلوب، طريقة، نمط",
  "means": "means (n): سبب، سبيل، طريقة، واسطة، وساطة، وسيلة",
  "direction": "direction (n): اتجاه، ادارة، ارشاد، امر، تدبير، تركيز، تسيير، تعليمات، توجه، توجيه، جهة، سبيل، سياسة، طريق، وجهة",
  "room": "room (n): الحضور، المكان، حجرة، حيز، غرفة، متسع، مجال",
  "ability": "ability (n): قدرة",
  "power": "power (n): اس، جبروت، حول، سلطان، عظمة، قدرة، قوة، مركز، منصب",
  "absence": "absence (n): غياب",
  "history": "history (n): تاريخ، تقرير، حكاية، قصة",
  "achievement": "achievement (n): اتمام، اكمال، انجاز",
  "bit": "bit (n): بت، روتين، شكيمة، فصل",
  "action": "action (n): اجراء، اداء، ادعاء، تحرك، تشريع، حركة، دعوى، عمل، عملية، فعالية، فعل، قانون، معركة، نشاط\n\naction (v): اتم، ادى، اكمل، انجز، انهى، حقق، قضى، مارس، نجز، نفذ",
  "activity": "activity (n): تحرك، حركة، عمل، عمليةجسمية، فعالية، نشاط",
  "add": "add (v): اجتذب، احدث، احضر، ادى، اسهم، اضاف، اضفى، اعار، اغرى، اقرض، الحق، تبرع، تجبر، تزود، تمون، جاء، جضر، جلب، جمع، حضر، ذيل، رافق، زود، ساعد، ساهم، شارك، ضم، عين، غذى، قنع، معدل، منح، واكب",
  "supply": "supply (v): اثث، احتاط، اشترط، اضاف، الحق، امد، تاهب، تزود، تمون، جهز، دهن، ذاب، ذيل، رجع، رد، زود، سكب، سلم، شكر، صير، طلى، عزف، عين، غذى، غنى، قدم، مد\n\nsupply (n): امدادات، تجهيز، تزويد، توفير، عرض، مخزون، موونة",
  "speech": "speech (n): اسلوب، حديث، خطاب، كلام، كلمة، لغة، لهجة، محادثة، مخاطبة",
  "speak": "speak (v): اطلق، تحدث، تفوه، تكلم، تلفظ، ثرثر، حدث، خاطب، خطب، دل، سال، عبر، فوه، قال، كلم، لحس، لفظ، ناقش، نطق، نفث، همس، وضع",
  "administration": "administration (n): ادارة، تسيير، تصرف، حكم، حكومة، رياسة",
  "government": "government (n): الحكومة، السلطة، النظام، حكم، حكومة، سلطة، سياسة",
  "advantage": "advantage (n): افضلية، ميزة",
  "advice": "advice (n): اقتراح، راي، نصح، نصيحة",
  "thing": "thing (n): امر، شان، شي، شيء، مسالة",
  "occasion": "occasion (n): فرصة، مناسبة",
  "afternoon": "afternoon (n): اصيل، عصر",
  "age": "age (n): زمن، سن، شيخوخة، عمر، كبر، مدة، هرم\n\nage (v): انضج، شيخ، قدم، كبر، هرم",
  "years": "years (n): زمن، سن، شيخوخة، كبر، مدة، هرم",
  "agreement": "agreement (n): اتفاق، ايتلاف، توافق، وفاق",
  "aid": "aid (n): اهتمام، رعاية، عناية، عون، مساعدة، معاونة، معونة\n\naid (v): اعان، ساعد، عاون",
  "assistance": "assistance (n): عون، مساعدة، معاونة، معونة",
  "help": "help (n): عون، مساعد، مساعدة، معاون، معاونة، معونة\n\nhelp (v): اعان، ساعد، سهل، عاون، عزز، قذم، قوى، مد، ناصر، نقذ",
  "attention": "attention (n): انتباه، اهتمام، رعاية، عناية",
  "air": "air (n): ترنيمة، جملة، لحن، نغم، هواء\n\nair (v): ابدى، اذاع، اشهر، اعلن، بث، علن، كشف، نشر، هوى",
  "aircraft": "aircraft (n): طايرة",
  "cost": "cost (v): قدر، كلف\n\ncost (n): تكلفة، ثمن، سعر، كلفة",
  "analysis": "analysis (n): تحليل",
  "angle": "angle (n): زاوية\n\nangle (v): اتكا، استند، اعتمد، انحدر، انحرف، انحنى، تكهن، حرف، حصل، حنى، رشق، رمى، شذب، شوه، ضغط، قلب، مال، مس",
  "response": "response (n): اجابة، استجابة، تلبية، جواب، رد، نتيجة",
  "appeal": "appeal (n): استعطاف، استغاثة، استيناف، توسل، مناشدة\n\nappeal (v): استانف، استغاث، استمال، استنجد، التمس، توسل، راع، طلب، ناشد",
  "appearance": "appearance (n): ضهور، ظهور، مظهر، هيية",
  "application": "application (n): تطبيق، طلب",
  "approval": "approval (n): استحسان، قبول، مباركة، موافقة",
  "area": "area (n): اطار، بلاد، جهة، حقل، رقعة، مجال، مساحة، منطقة، نطاق",
  "country": "country (n): ارض، امة، بلاد، بلد، دولة، رقعة، ريف، قرية، قطر، منطقة",
  "argument": "argument (n): افادة، برهان، جدال، جدل، حجة، حوار، خصام، خلاف",
  "statement": "statement (n): افادة، برهان، بيان، تصريح، حجة، قول",
  "arm": "arm (n): ذراع، ساعد، سلاح، عضد، فرع\n\narm (v): استعد، تسلح، تقوى، تهيا، حصن، سلح، صان، عزز، قوى، هيا",
  "arms": "arms (n): اسلحة، سلاح",
  "army": "army (n): جيش، حشد، قوة",
  "art": "art (n): رسومات، فن",
  "artist": "artist (n): فنان، مبدع",
  "asking": "asking (n): سوال، طلب",
  "assignment": "assignment (n): تخصيص، تسمية، تعيين، تنصيب، توظيف، تولية، فراغة، مهمة",
  "atmosphere": "atmosphere (n): اطار، جو",
  "effort": "effort (n): انجاز، بذل، تجربة، تعب، جد، جهد، حركة، حملة، سعي، صنيع، عرق، عمل، كدح، ماثرة، محاولة، مسعى، منقبة، همة",
  "attitude": "attitude (n): موقف، وضع، وضعية، وقفة",
  "authority": "authority (n): ترخيص، تفويض، ثقة، حجة، حكومة، سلطات، سلطة، مرجع، مستند، مكتب، وكالة، ولاية",
  "confidence": "confidence (n): ثقة",
  "baby": "baby (n): رضيع، صغير، طفل، مولود\n\nbaby (v): بدد، تعطل، تلف، خدع، خرب، دلع، دلل، سلق، شوه، ضل، ضلل، فسد، كدر، كذب، نهب",
  "child": "child (n): ابن، حدث، رضيع، صبي، صغير، طفل، غلام، نجل",
  "background": "background (n): اطار، خلفية، مجال، نطاق\n\nbackground (v): قلل",
  "setting": "setting (n): اطار، خلفية، سياق، مجال، مقام، نطاق",
  "balance": "balance (n): الباقي، باق، بقية، تماثل، تناسق، توازن، متبقي، مخلف\n\nbalance (v): اهتز، تذبذب، ترجح، تردد، تعادل، رصد، زخرف، زين، كال، وازن",
  "rest": "rest (n): استراحة، الباقي، باق، بقية، متبقي، مخلف، مسند\n\nrest (v): اراح، ارتاح، ازال، استجم، استراح، استقر، استند، اضطجع، بقى، بقي، توقف، ثبت، رسخ، طمان، ظل، علق، مكث، هدا",
  "ball": "ball (n): كتلة، كرة",
  "bank": "bank (n): ضفة\n\nbank (v): اتكل، اتمن، استحلف، اشتم، اعتمد، اقسم، اكد، اودع، تراكم، توكل، حلف، رجا، ركم، سب، ضغط، قسم، كوم، وثق",
  "battle": "battle (n): اشتباك، خلاف، صراع، قتال، كفاح، معركة، موقعة، نزاع، نضال\n\nbattle (v): تعارف، حارب، عارك، عرك، قاتل، قاوم، كافح، ناضل، وغى",
  "conflict": "conflict (n): اشتباك، جدال، خصام، خلاف، صراع، قتال، معركة، موقعة، نزاع",
  "beauty": "beauty (n): جمال، حسن، رونق، صباحة، وسامة",
  "behavior": "behavior (n): تصرف، سلوك، سيرة",
  "being": "being (n): المتعضي، ديمومة، كاين، كيان، كينونة، متعض، وجود",
  "belief": "belief (n): اعتقاد",
  "benefit": "benefit (n): استفادة، فايدة، مصلحة، منفعة\n\nbenefit (v): ابريه، استفاد، افاد، انتفع، ربح، كسب",
  "board": "board (n): لوح، مجلس",
  "boat": "boat (n): مركب، معدية",
  "body": "body (n): اتساق، بدن، ترابط، تماسك، تناسق، جثة، جثمان، جذع، جرم، جسد، جسم، جهاز، مجلس، هيية",
  "book": "book (n): دفتر، سجل، كتاب، مجلد، مدونة",
  "volume": "volume (n): حجم، كتاب، مجلد",
  "record": "record (n): تسجيل، دفتر، سجل، قرص، قيد، مدونة\n\nrecord (v): استعرض، اشار، انضم، باشر، دخل، دون، سجل، شارك، طرق، قيد، كتب، وضع",
  "bottle": "bottle (n): زجاجة، قارورة، قنينة",
  "box": "box (n): صندوق، مقصورة",
  "boy": "boy (n): ابن، شاب، صبي، فتى، ولد",
  "son": "son (n): ابن، ولد",
  "breath": "breath (n): تنفس، نفس",
  "bridge": "bridge (n): جسر، قنطرة",
  "brother": "brother (n): اخ، رفيق، شقيق، صاحب، قرين",
  "budget": "budget (n): مزانية",
  "frame": "frame (n): بدن، بنية، هيكل",
  "flesh": "flesh (n): بدن، بنية، هيكل",
  "building": "building (n): انشاء، بناء، بناية، مبنى",
  "construction": "construction (n): انشاء، بناء، بنية، تركيب، تركيبة، عبارة",
  "business": "business (n): اعمال، تجارة، حرفة، دور، زبون، شغل، عمل، مهنة، وظيفة",
  "job": "job (n): حرفة، شغل، عمل، مهمة، مهنة، واجب، وظيفة",
  "buy": "buy (v): اشترى، رشا",
  "call": "call (n): طلب\n\ncall (v): اتصل، احتج، اختار، اذاع، استدعى، استرجع، استرد، استنجد، اقتضى، التمس، بكى، تباكى، تطلب، تلفن، حدد، دعا، زار، زعق، سال، سمى، شكا، صاح، صرخ، طالب، طلب، عج، عرج، عوى، عين، قهقه، كلم، لقب، مكالمة، نادى، نبح، نعب، هاتف، هتف، هدر",
  "telephone": "telephone (v): اتصل، تلفن، كلم، هاتف\n\ntelephone (n): تلفون، هاتف",
  "campaign": "campaign (n): حركة، حملة\n\ncampaign (v): حمل، عارض",
  "car": "car (n): سيارة، عربة، مركبة",
  "machine": "machine (n): الة، سيارة، مركبة",
  "fear": "fear (n): حرص، خوف، دعر، رعب، فزع، مبالاة، مراعاة\n\nfear (v): خاف، خشي",
  "maintenance": "maintenance (n): صون، صيانة",
  "instance": "instance (n): امثولة، حالة، شاهد، مثال، مثل، نموذج",
  "example": "example (n): امثولة، حالة، شاهد، مثال، مثل، نموذج",
  "event": "event (n): تاثير، تبعة، حادثة، حال، حالة، حدث، حصيلة، عاقبة، نتيجة، واقعة",
  "cattle": "cattle (n): ابقار، بقر",
  "cell": "cell (n): خلية",
  "cent": "cent (n): سنت",
  "century": "century (n): قرن",
  "chair": "chair (n): رييس، كرسي",
  "president": "president (n): رييس، عميد، مدير",
  "mission": "mission (n): بعثة، مبعوث، مفوض، مندوب، مهمة، وفد",
  "chest": "chest (n): خزانة، صدر",
  "kid": "kid (n): ابن، حدث، رضيع، صبي، صغير، طفل، غلام، نجل",
  "church": "church (n): كنيسة",
  "circumstances": "circumstances (n): اوضاع، حظ، ظرف، ظروف، قدر، قسمة، نصيب",
  "condition": "condition (n): اعتبار، حالة، شرط، مراعاة، وضع\n\ncondition (v): اشترط، حدد، كيف، نص",
  "city": "city (n): مدينة",
  "year": "year (n): حول، دفعة، دورة، سنة، عام",
  "clay": "clay (n): جثة، جثمان، رفاة، طفل، طين، وحل",
  "remains": "remains (n): بقايا، جثة، جثمان، رفاة",
  "club": "club (n): ناد، نادي، هراوة",
  "society": "society (n): رفقة، زمالة، صحبة، عشرة، مجتمع، ناد",
  "coffee": "coffee (n): قهوة",
  "collection": "collection (n): تجمع، تجميع، تخزين، تراكم، تشكيلة، تكديس، جمع، شمل، مجموعة",
  "college": "college (n): كلية",
  "column": "column (n): طابور، عمود",
  "combination": "combination (n): اتحاد، تركيب، تركيبة، خلط، دمج، مجموعة، مزج",
  "command": "command (n): اجادة، املاء، تمكن، سيطرة، قيادة، هيمنة\n\ncommand (v): تحكم، راقب، سيطر، ضام، فحص، قاد، كافح، كبح، نظم، هيمن، وجه",
  "committee": "committee (n): لجنة",
  "communication": "communication (n): ابلاغ، اتصال، اشعار، اعلام، تخابر، خطاب، رسالة، مخابرة",
  "community": "community (n): جماعة",
  "company": "company (n): جماعة، جمع، حزب، رفقة، زاير، زمالة، شركة، صحبة، ضيف، عشرة، عصبة، فرقة، فريق، فوج، لمة، معشر، مندوب\n\ncompany (v): رافق، صاحب",
  "party": "party (n): جماعة، جمع، حزب، حفل، حفلة، صحبة، طرف، عصبة، فرقة، فريق، لمة",
  "competition": "competition (n): تنافس، سباق، غريم، مزاحم، مسابقة، منافس، منافسة، ند، نظير",
  "concept": "concept (n): تصور، مفهوم",
  "worry": "worry (n): انزعاج، قلق، مشكلة، هم\n\nworry (v): خاف",
  "decision": "decision (n): حكم، قرار",
  "status": "status (n): حالة، مركز، مكانة، موقع، وضع",
  "term": "term (n): شرط، فترة، مدة، مصطلح\n\nterm (v): اصطلح، دعا، سمى، وصف",
  "conference": "conference (n): موتمر",
  "difference": "difference (n): انحراف، تباين، تشعب، جدال، خصام، خلاف، نزاع",
  "connection": "connection (n): اتصال، اتصالات، ارتباط، توصيل، توصيلة، رابط، رابطة، ربط، صلة، علاقات، قرينة، مصدر، وصل، وصلة",
  "expression": "expression (n): انعكاس، تركيب، تعبير، عبارة، قول، مظهر",
  "structure": "structure (n): بنية، تركيب، تركيبة، حبكة، هيكل",
  "press": "press (v): اثار، ادخل، ارهق، ازدحم، استحث، استعجل، اقحم، التقط، الح، اندفع، انقبض، انكمش، تابع، تجمع، تراكم، تقلص، جادل، جذب، حاصر، حث، حدد، حذر، حشد، حض، خص، خطب، خطبة، دفع، سحق، سطح، صر، ضغط، ضيق، عانق، عدى، عصر، عقد، قبض، قصر، قلص، قولب، كبح، كبس، كوى، نبه، نصح، هاجم، واصل، وصى، وعظ\n\npress (n): خزانة، دولاب، صحافة، صحف، ضغط، مطبعة",
  "conversation": "conversation (n): حديث، محادثة",
  "conviction": "conviction (n): اقتناع",
  "corner": "corner (n): احتكار، ركن، زاوية",
  "price": "price (n): تكلفة، ثمن، سعر، قيمة\n\nprice (v): سعر",
  "nation": "nation (n): ارض، امة، بلد، دولة، شعب، قطر",
  "land": "land (n): ارض، ارضية، الارض، اليابسة، امة، املاك، بر، بلد، تراب، تربة، دولة، عقار، قطر، ملك، ملكية\n\nland (v): اجتذب، احدث، احضر، اخذ، ادى، اغرى، تجبر، جاء، جضر، جلب، حضر، رافق، قنع، واكب، وصل",
  "county": "county (n): مقاطعة",
  "pair": "pair (v): ازدوج، اقتران، تسافد، تعشق، تقارن، جامع، زاوج، زوج، زوجان، ضاجع، عاشر، قرن\n\npair (n): زوج",
  "couple": "couple (v): ازدوج، اقتران، تسافد، تعشق، تقارن، جامع، زاوج، زوج، زوجان، ضاجع، عاشر، قرن",
  "court": "court (n): بلاط، قصر، محكمة، ملعب",
  "credit": "credit (n): رصيد",
  "crisis": "crisis (n): ازمة، تازم",
  "crowd": "crowd (n): جماعة، جمع، حشد، فريق\n\ncrowd (v): احتشد، اكتظ، تجمع، تدافع، حشد، دفع، ضغط، كظ",
  "culture": "culture (n): ثقافة، حضارة، زرع",
  "dance": "dance (n): رقص، رقصة\n\ndance (v): تراقص، رقص، وثب",
  "danger": "danger (n): خطر، خطورة، محذور، مخافة",
  "data": "data (n): بيانات، حقايق، معطيات، معلومات",
  "information": "information (n): بيانات، حقايق، معطيات، معلومات، معلومة",
  "day": "day (n): ايام، عصر، عيد، لحظة، نهار، وقت، يوم",
  "trade": "trade (n): تجارة، زبانة، صفقة، صناعة، صنعة، معاملة، مهارة، مهنة\n\ntrade (v): بادل، باع، تاجر، تداول، تسوق، تعامل، خدع، ساوم، سوق، عالج، غش، قايض، قنع، وزع",
  "defense": "defense (n): حماية، دفاع",
  "department": "department (n): قسم",
  "depth": "depth (n): اعماق، عمق، غور",
  "description": "description (n): وصف",
  "purpose": "purpose (n): ارادة، استعمال، تصميم، دور، عزم، عمل، غاية، غرض، فايدة، قصد، مرمى، مغزى، مهمة، نفع، نية، وظيفة\n\npurpose (v): اعتزم، عزم، قرر",
  "desk": "desk (n): مكتب",
  "device": "device (n): جهاز، شعار، صورة",
  "difficulty": "difficulty (n): حرج، شظف، صعوبة، عايق، عسر، عناء، كبد، مشقة، مشكلة",
  "management": "management (n): ادارة، تدبير، سياسة",
  "director": "director (n): مدير",
  "manager": "manager (n): مدرب، مدير",
  "discussion": "discussion (n): معالجة، مناقشة، نقاش",
  "treatment": "treatment (n): تدبير، دواء، علاج، معالجة، معاملة، مناقشة، نقاش",
  "word": "word (n): اخبار، خبر، كلمة، لفظة، نبا، نقاش",
  "disease": "disease (n): داء، مرض",
  "distance": "distance (n): انطواء، بعد، تباعد، طول، فترة، مدة، مسافة\n\ndistance (v): ابتعد، تجنب",
  "length": "length (n): امد، بعد، طول، مدة، مسافة",
  "space": "space (n): حيز، فترة، فراغ، فضاء، مجال، مدة، مساحة، مكان",
  "distribution": "distribution (n): تبعثر، تشتت، تفرق، توزع، توزيع",
  "district": "district (n): اقليم، محافظة، مقاطعة، منطقة، ناحية",
  "dr.": "dr. (n): طبيب",
  "dog": "dog (n): كلب\n\ndog (v): اختار، الحق، انمحى، تتبع، تجرجر، تعقب، تقفى، تلاشى، جامع، جر، جرجر، حيلة، زحف، سحب، سرع، ضايق، ضيق، طارد، عبر، عدا، قطر، قناة، لاحق، وسم",
  "doubt": "doubt (n): ارتياب، ريب، ريبة، شك\n\ndoubt (v): ارتاب، تشكك، شك",
  "dream": "dream (n): حلم، طموح، مطمح\n\ndream (v): احتلم، حلم",
  "drink": "drink (n): ابتلاع، بلع، تشرب، شراب، شرب، مشروب\n\ndrink (v): احتسى، استوعب، امتص، تشرب، سكر، شرب",
  "dust": "dust (n): غبار، غبرة\n\ndust (v): انتثر، انجاب، بث، بدد، بعثر، تبعثر، تشتت، تغبر، ذر، رذ، رش، شتت، شكل، ضريبة، غبر، فرق، قزح، نثر، نشر، نضح، نقط، هدا",
  "duty": "duty (n): التزام، مسيولية، مهمة، واجب",
  "responsibility": "responsibility (n): التزام، مسيولية، واجب",
  "economy": "economy (n): ادخار، اقتصاد، توفير",
  "edge": "edge (n): حاشية، حافة، حد، زاوية، هامش",
  "editor": "editor (n): محرر",
  "education": "education (n): تدريس، تعليم",
  "teaching": "teaching (n): تدريس، تعليم",
  "effect": "effect (n): انطباع، تاثير، تبعة، حصيلة، عاقبة، نتيجة\n\neffect (v): احدث، ادى، اعد، انتج، انشا، حقق، سبب، طبق، نفذ، واقع",
  "election": "election (n): اختيار، انتخاب، تصويت",
  "element": "element (n): جزء، عامل، عنصر، مكون",
  "factor": "factor (n): جزء، جين، دلال، سمسار، سيسترون، عامل، عنصر، مكون، مورثة، وسيط، وكيل",
  "emphasis": "emphasis (n): تاكيد، تشديد، توكيد، نبرة",
  "stress": "stress (n): اجهاد، تاكيد، تشديد، توتر، توكيد، ضغط، نبرة\n\nstress (v): اكد، برز، رقم، شدد، شكل، علم، نبر، نقط، وضح، وضع",
  "goal": "goal (n): غاية، مرمى، هدف",
  "enemy": "enemy (n): خصم، عدو، معاد",
  "energy": "energy (n): طاقة",
  "entrance": "entrance (n): دخول، مدخل\n\nentrance (v): استهوى، اسر، اغرم، اغوى، تيم، جذب، خدع، سبى، سحر، فتن",
  "equipment": "equipment (n): تجهيزات، معدات",
  "establishment": "establishment (n): تاسيس، تاليف، تشكيل، تكوين، تنظيم، توطيد، منشاة، موسسة",
  "organization": "organization (n): تاسيس، تاليف، ترتيب، تشكيل، تكوين، تنظيم، توطيد، منظمة",
  "grounds": "grounds (n): دليل، ساحة، سند، شاهد، علامة",
  "expense": "expense (n): مصاريف، نفقات، نفقة",
  "experiment": "experiment (n): اختبار، تجربة، تجريب",
  "saying": "saying (n): تعبير، عبارة، قول",
  "extent": "extent (n): امتداد، حجم، حد، مد، مدى، مساحة",
  "fact": "fact (n): حقيقة",
  "faculty": "faculty (n): قدرة، ملكة",
  "failure": "failure (n): اخفاق، افلاس، خيبة، رسوب، فشل",
  "religion": "religion (n): ديانة، دين",
  "faith": "faith (n): ثقة، ديانة، دين",
  "father": "father (n): اب، جد، منجب، موسس، والد",
  "eat": "eat (v): ارهق، استنزف، استنفد، استهلك، اشبع، اصدا، اطعم، اقتات، اكل، التهم، انفق، تغدى، تغذى، تلف، حت، خفض، ذبل، ذوى، رضى، شجع، صدا، ضنى، طعم، علف، غذى، فني، كد، لقم، نهك",
  "sense": "sense (v): احس، ادرك، امن، تلمس، جس، حس، شعر، شم، مس، وعى\n\nsense (n): احساس، حاسة، حس، دلالة، شعور، معنى",
  "feeling": "feeling (n): احساس، حس، شعور، عاطفة",
  "file": "file (n): رتل، صف، طابور، مبرد، ملف\n\nfile (v): برد",
  "stream": "stream (n): تيار، جريان، مجرى\n\nstream (v): اندفع، انسكب، انهمر، تدفق، تقاطر، تموج، دفق، رشق، سال، سرع، سكب، صب، طار، فاض، فرغ، قذف",
  "food": "food (n): طعام، غذاء، قوت",
  "strength": "strength (n): بقاء، تحملية، ثبات، حول، دوام، شدة، فعالية، قوة، متانة، مقدرة",
  "personnel": "personnel (n): طاقم، قوة، موظفون",
  "freedom": "freedom (n): حرية",
  "friend": "friend (n): رفيق، صاحب، صديق، ظهير، مشجع، معجب، معرفة، مويد، نصير",
  "funds": "funds (n): اموال، تمويل",
  "gas": "gas (n): بنزين، غاز، غازولين",
  "generation": "generation (n): اكثار، انتاج، توليد، عصر",
  "getting": "getting (n): احراز، اخذ، اكتساب، حصول، نيل",
  "girl": "girl (n): انسة، بنت، شابة، صبية، صغيرة، طفلة، فتاة",
  "glass": "glass (n): زجاج، طاسة، قدح، كاس، كوب\n\nglass (v): زجج",
  "politics": "politics (n): سياسة",
  "grass": "grass (n): عشب\n\ngrass (v): ابلغ، خان، وشى",
  "shop": "shop (v): ابلغ، خان، ساند، عاضد، وشى\n\nshop (n): حانوت، دكان، متجر، مشغل، معمل، ورشة",
  "soil": "soil (n): ارض، ارضية، تراب، تربة\n\nsoil (v): اتسخ، انجس، تلوث، دنس، لطخ، لوث، وسخ",
  "labor": "labor (v): اشتغل، عمل، كدح\n\nlabor (n): تعهد، جهد، شغل، عمل، كدح، مشروع، مهمة، واجب",
  "group": "group (n): تجميع، جماعة، زمرة، شق، مجموع، مجموعة",
  "gun": "gun (n): مدفع",
  "hair": "hair (n): شعر",
  "hall": "hall (n): بهو، ردهة، صالة، قاعة",
  "hands": "hands (n): ايدي، رعاية، وصاية",
  "men": "men (n): ايدي",
  "hat": "hat (n): =، قبعة",
  "he": "he (n): ه، هليوم، هيليوم",
  "mind": "mind (n): انتباه، حكم، دراية، دماغ، ذاكرة، راس، راي، عقل، فكر، معرفة\n\nmind (v): استمع، اصغى، اطاع، اعتنى، انتبه، انزعج، انصت، اهتم، تذكر، تعهد، حذر، راقب، رعى، عارض، عني",
  "question": "question (n): استجواب، استعلام، تحقيق، تساول، سوال، قضية، مسالة، مشكلة\n\nquestion (v): استعلم، استفسر، استفهم، اعترض، تساءل، سال، شكك",
  "headquarters": "headquarters (n): مقر",
  "spirit": "spirit (n): حركة، حيوية، رغبة، روح، مزاج، ميل، همة",
  "heat": "heat (n): تدفية، حرارة\n\nheat (v): اثار، احمى، ثور، حمى، سخن، غضب",
  "score": "score (v): احرز، ارتطم، اصاب، اكتشف، جدول، حسب، حصد، حقق، دون، سجل، سدد، صد، صدم، ضرب، عد، هاجم، وجد\n\nscore (n): نتيجة، هدف",
  "keeping": "keeping (n): احتفاظ، حراسة، حفظ، حماية، رعاية، عناية",
  "holding": "holding (n): احتفاظ، ارصدة، حفظ، متاع، ملكية، ممتلكات",
  "property": "property (n): ارصدة، بعد، خاصة، خاصية، صفة، متاع، مكان، ملكية، ممتلكات، مميزة، ميزة، نعت، وصف",
  "hole": "hole (n): ثقب، حفرة",
  "honor": "honor (n): تكريم، حسب، شرف، عز، مجد، مكافاة",
  "hope": "hope (n): امل، رجاء\n\nhope (v): ارتجى، امل، ترجى، رجا",
  "horse": "horse (n): جواد، حصان، فرس",
  "hotel": "hotel (n): فندق، نزل",
  "hour": "hour (n): توقيت، ساعة، وقت",
  "housing": "housing (n): سكن، مسكن، منزل، وقاء",
  "idea": "idea (n): خاطر، خاطرة، راي، فكرة",
  "identity": "identity (n): تطابق، مطابقة، هوية",
  "imagination": "imagination (n): تخيل، تصور، خيال، روية، مخيلة",
  "vision": "vision (n): ابصار، بصر، تخيل، خيال، رويا، روية",
  "impact": "impact (n): تاثير، وقع\n\nimpact (v): اثر، استلف، اصطدم، الف، تظاهر، تعلق، تكلف، توقف، جس، ضرب، غرز، فعم، قلد، لمس، مس، هذب، وصل",
  "importance": "importance (n): اهمية",
  "income": "income (n): ايراد، دخل، عايد، مدخول",
  "index": "index (n): اس، قوة",
  "industry": "industry (n): صناعة، مجال",
  "intensity": "intensity (n): شدة، قوة، كثافة",
  "task": "task (n): تعهد، شغل، عمل، مشروع، مهمة، واجب",
  "judgment": "judgment (n): حكم، راي، قرار",
  "opinion": "opinion (n): حكم، راي",
  "justice": "justice (n): عدل، قاضي",
  "kill": "kill (n): قتل\n\nkill (v): اسقط، امات، اوقف، حظر، ذبح، سكن، فتك، قتل",
  "kitchen": "kitchen (n): مطبخ",
  "knife": "knife (n): سكين، سكينة\n\nknife (v): اقحم، جرح، طعن، غرز",
  "knowledge": "knowledge (n): ادراك، معرفة",
  "lack": "lack (n): افتقار، انعدام، عجز، نقص\n\nlack (v): احتاج، فقد، معوز، نقص",
  "language": "language (n): كلام، لغة، محادثة، مخاطبة",
  "law": "law (n): الامن، بوليس، شرطة، قانون",
  "police": "police (n): الامن، بوليس، شرطة",
  "leader": "leader (n): رييس، زعيم، قايد، مرشد",
  "leaders": "leaders (n): رياسة، زعامة، قيادة",
  "learning": "learning (n): تعلم",
  "leg": "leg (n): رجل، ساق، شوط، مرحلة",
  "let": "let (v): اجاز، اجر، ادخل، اذن، اعترف، ايد، ترك، جعل، خصص، رخص، سلم، سمح، شجع، صرح، عد، فرد، فرق، قبل، منح، وافق، ودع",
  "permit": "permit (v): اجاز، اجر، ادخل، اذن، اعترف، ايد، خصص، رخص، سلم، سمح، شجع، صرح، عد، فرد، فرق، قبل، منح، وافق، ودع\n\npermit (n): اجازة، اذن، ترخيص، رخصة",
  "letter": "letter (n): حرف، خطاب، رسالة، كتاب",
  "list": "list (n): جدول، فهرس، قايمة\n\nlist (v): سجل، وضع",
  "literature": "literature (n): ادب",
  "location": "location (n): مكان، موقع، وضع",
  "lower": "lower (v): اوطا، خفض، نزل",
  "machinery": "machinery (n): اليات، الية",
  "majority": "majority (n): اغلب، اغلبية، اكثرية، غالبية",
  "making": "making (n): ابتداع، ابتكار، تصميم، شرط، موهل",
  "market": "market (n): بازار، بقالة، سوق\n\nmarket (v): استغل، باع، تاجر، تجر، تسوق، سوق",
  "may": "may (n): ايار، مايو",
  "step": "step (n): اجراء، اعداد، تدبير، تدرج، خطوة، درجة\n\nstep (v): بادر، تبع، تقدم، خطا، داس، درج، دعس، سحق، عفص، مشى، وطا",
  "meeting": "meeting (n): اجتماع، تلاقي، جمع، جميعة، دمج، لقاء، لقية، مصادفة، مقابلة، مواجهة، ندوة، وحدة",
  "member": "member (n): طرف، عضو",
  "membership": "membership (n): عضوية",
  "memory": "memory (n): تذكر، ذاكرة",
  "method": "method (n): طريقة",
  "might": "might (n): جبروت، عظمة، قدرة، قوة",
  "mine": "mine (n): لغم، منجم\n\nmine (v): لغم، منجم",
  "money": "money (n): عملة، مال، نقد، نقود",
  "month": "month (n): شهر",
  "morning": "morning (n): صباح، صبح، صبيحة، فجر",
  "mother": "mother (n): ام، والدة\n\nmother (v): دلل",
  "motion": "motion (n): انتقال، تحرك، تنقل، حركة، رحلة، سفر، مسيرة، هجرة\n\nmotion (v): اشار، اوما، تغوط، لوح، وما",
  "mouth": "mouth (n): فم، فو\n\nmouth (v): اطلق، تحدث، تفوه، تكلم، تلفظ، ثرثر، خطب، دل، سال، عبر، فوه، قال، لحس، لفظ، ناقش، نطق، نفث، همس، وضع",
  "talk": "talk (v): اطلق، تحدث، تفوه، تكلم، تلفظ، ثرثر، حاضر، حدث، خطب، دل، سال، عبر، فوه، قال، كلم، لحس، لفظ، ناقش، نطق، نفث، همس، وضع\n\ntalk (n): محاضرة",
  "music": "music (n): موسيق?ى، موسيقى",
  "nature": "nature (n): طبع، طبيعة",
  "neck": "neck (n): برزخ، جيد، خليج، رقبة، عنق",
  "neighborhood": "neighborhood (n): جنب، جوار، جيرة، حارة، حد، حي، قرب، موضع، ناحية",
  "news": "news (n): اخبار، خبر، نبا",
  "newspaper": "newspaper (n): جريدة، صحيفة",
  "paper": "paper (n): جريدة، صحيفة، ورق، ورقة",
  "nose": "nose (v): شم",
  "wind": "wind (v): ادار، التف، التوى، انعطف، تجول، تذبذب، ترنح، تسكع، تلوى، تمايل، تمهل، جول، حاد، حاك، حبك، دار، رسم، شم، طاف، فرع، لف، لولب، لوى، مرر، ملا، نسج، هام، ورط\n\nwind (n): تدوير، تعبية، رياح، ريح، هواء",
  "situation": "situation (n): حالة، منصب، وضع، وظيفة",
  "officer": "officer (n): بوليس، دركي، شرطي، ضابط، موظف\n\nofficer (v): امر، وجه",
  "oil": "oil (n): زيت",
  "operation": "operation (n): اداء، جراحة، سريان، عمل، عملية",
  "performance": "performance (n): اداء، انجاز، تادية، تقديم، تنفيذ، عمل",
  "system": "system (n): برنامج، ترتيب، تنظيم، جهاز، خطة، منظومة، نظام",
  "page": "page (n): صفحة",
  "pain": "pain (n): الم، عذاب، عناء، وجع\n\npain (v): اذى، ازعج، اضعف، الم، امض، اوجع، جرح، ساء، ضر، عاق، عانى، عض، كابد، كبد، وجع",
  "painting": "painting (n): تدهين، رسم، صورة، طلاء، طلي",
  "wage": "wage (n): اجر، دخل، راتب، مرتب، مكافاة\n\nwage (v): استاجر، شن، نشب",
  "payment": "payment (n): تسديد، دفع، دفعة، سداد",
  "peace": "peace (n): سلام",
  "period": "period (n): زمن، فترة، مدة",
  "phase": "phase (n): فترة، مرحلة",
  "philosophy": "philosophy (n): فلسفة، معتقد",
  "program": "program (n): برنامج، خطة\n\nprogram (v): برمج، خطط",
  "planning": "planning (n): تخطيط، تدبير",
  "works": "works (n): مصنع، منشاة",
  "platform": "platform (n): برنامج، منصة",
  "pleasure": "pleasure (n): بهجة، سرور، متعة",
  "poet": "poet (n): شاعر",
  "policy": "policy (n): سياسة",
  "pool": "pool (n): اتحاد، ايتلاف، بركة، حلف، حوض، نقابة",
  "population": "population (n): البشر، الكون، سكان",
  "theory": "theory (n): افتراض، امكانية، ظن، فرض، فرضية، نظرية",
  "presence": "presence (n): حضرة، حضور، وجود",
  "terms": "terms (n): ثمن، سعر",
  "problem": "problem (n): مسالة، مشكل، مشكلة، معضلة",
  "trouble": "trouble (n): مشكل، مشكلة، معضلة\n\ntrouble (v): ابطل، اثار، اربك، ازعج، اقلق، انقلب، بعثر، شوش، ضايق، عاق، عكر، غلظ، قاطع، قلب، كدر",
  "procedure": "procedure (n): اجراء، طريقة، عملية",
  "product": "product (n): انتاج، بضاعة، تقاطع، سلعة، منتج، منتوج، ناتج، نتاج",
  "production": "production (n): انتاج، منتج، منتوج",
  "protection": "protection (n): حماية، رعاية، ضمان، عناية، ملجا، وقاية",
  "security": "security (n): امن، رهن، سند، ضمان، ضمانة",
  "shelter": "shelter (n): حماية، ماوى، ملجا\n\nshelter (v): الجا، اوى",
  "wonder": "wonder (v): تساءل\n\nwonder (n): اعجوبة، عجب، فضول",
  "race": "race (n): جنس، سباق، عرق\n\nrace (v): استعجل، اسرع، اطلق، اندفع، ركض، سابق، سرع، عاجل، عجل، هاجم، هرول",
  "speed": "speed (v): استعجل، اسرع، اطلق، اندفع، تسارع، تعجل، حث، ركض، سابق، سرع، عاجل، عجل، هاجم، هرول\n\nspeed (n): سرعة",
  "radiation": "radiation (n): اشعاع",
  "rain": "rain (n): سيل، غيث، مطر، وابل\n\nrain (v): امطر، انهمر، تمطر، صب، غدق، مطر",
  "achieve": "achieve (v): اتصل، اتم، اجتاز، احرز، اكتسب، امتد، انجز، بسط، بلغ، تاول، حقق، فاز، قدم، قضى، كسب، كمل، نال، نجح، نجز، وصل",
  "reaction": "reaction (n): استجابة، تفاعل",
  "reading": "reading (n): قراءة، مطالعة",
  "enter": "enter (v): ادخل، ادرج، استعرض، اشار، اشترك، اضاف، انضم، اولج، باشر، جند، دخل، درج، دون، رصع، سجل، شارك، طرق، قيد، كتب، وضع",
  "reference": "reference (n): استشارة، اشارة، علامة، مرجع، مصدر",
  "respect": "respect (n): احترام، تقدير، خصوص، ناحية، نقطة\n\nrespect (v): اتصل، اجل، احترم، اعز، تعلق، ثمن، حقق، عظم، قدر، قوم، كسب، وقر",
  "relation": "relation (n): جماع، رابطة، صلة، علاقة، قريب، مباشرة، معاشرة، نسيب، نكاح",
  "relationship": "relationship (n): صلة، علاقة، قرابة",
  "relief": "relief (n): استراحة، اعتدال، اغاثة، تاييد، تخفيف، تسكين، تلطيف، دعم، راحة، سلوة، عون، غوث، مدد، مساعدة، معونة، نصر",
  "research": "research (n): بحث، دراسة",
  "resolution": "resolution (n): اصرار، بيان، تصريح، تصميم، عزم، قرار",
  "sleep": "sleep (n): استراحة، غفوة، نوم\n\nsleep (v): ضاجع، غفو، نام، هجع",
  "return": "return (n): ارجاع، استرداد، استعادة، اعادة، ترجيع، تكرار، رجوع، عودة، مقابل\n\nreturn (v): اب، اجاب، ارتد، ارجع، استرد، اعاد، انكفا، تراجع، جزع، رجع، رد، شكر، صد، عاد، عاود، قدم، نكص، وضع",
  "rifle": "rifle (n): بندقية",
  "river": "river (n): نهر",
  "road": "road (n): سبيل، طريق",
  "rock": "rock (n): جلمود، حجر، حجرة، صخر، صخرة\n\nrock (v): اهتز، تارجح، ترنح، تمايل، زعزع، هز",
  "roof": "roof (n): سطح، سقف",
  "trial": "trial (n): امتحان، تجربة، دور، فحص، محاكمة",
  "saturday": "saturday (n): السبت",
  "save": "save (v): احتفظ، اراح، ازال، اسعف، اقتصد، انجد، انجى، انقد، برز، تجنب، جسم، حافظ، حفظ، خزن، خفف، خلص، خلل، دخر، ساعد، سكن، صان، علب، لطف، نجد، نقذ، هدا، وفر، وقى",
  "saw": "saw (v): نشر",
  "scale": "scale (n): حرشف، درع، سلم، قدر، قشرة، مدرج، مقدار، مقياس، ميزان",
  "science": "science (n): علم، مهارة",
  "sea": "sea (n): بحر، محيط",
  "season": "season (n): فترة، فصل، موسم\n\nseason (v): انضج، تبل، جف، جفف، حسن",
  "series": "series (n): سلسلة",
  "service": "service (v): خدم، خص، زود، نفع\n\nservice (n): خدمة، عمل، مديرية، مصلحة",
  "session": "session (n): جلسة",
  "sex": "sex (n): الجنس، جنس\n\nsex (v): اثار، استحث، استفز، استيقظ، ايقظ، حمس، نبه، هاج، هيج",
  "shoulder": "shoulder (n): كتف، منكب",
  "showing": "showing (n): عرض",
  "sin": "sin (n): اثم، جا، خطيية، معصية",
  "site": "site (n): بقعة، مكان، موقع",
  "sky": "sky (n): سماء",
  "smile": "smile (n): بسمة\n\nsmile (v): ابتسم، سخر",
  "snow": "snow (n): ثلج، سقط\n\nsnow (v): سقط",
  "solution": "solution (n): جذر، حل، محلول",
  "song": "song (n): اغنية",
  "spite": "spite (v): اذى، ازعج، استاء، اشتم، اضعف، الم، انتهك، انجرح، اهان، بهر، جرح، ذنب، رض، ساء، سحن، صدم، ضر، عاق، غضب، غيظ، كدر، كدم، لسع",
  "spring": "spring (n): ربيع، عين، ينبوع\n\nspring (v): احاط، ارتفع، استعجل، استولى، اشتم، انبثق، انحرف، انطلق، برز، تجاوز، زاد، شق، طفر، ظهر، عبر، غادر، قفز، نبت، نزع، نطط، هاجم، وافق، وثب",
  "staff": "staff (n): طاقم",
  "street": "street (n): شارع",
  "tension": "tension (n): اجهاد، توتر، شد",
  "student": "student (n): باحث، تلميذ، دارس، طالب",
  "success": "success (n): فوز، نجاح",
  "summer": "summer (n): صيف",
  "sun": "sun (n): شمس",
  "sunday": "sunday (n): الاحد",
  "symbol": "symbol (n): رمز، شعار",
  "table": "table (n): جدول، طاولة، مايدة، منضدة\n\ntable (v): اجل، اخر، ارجا",
  "tax": "tax (n): رسم، ضريبة",
  "teacher": "teacher (n): معلم",
  "team": "team (n): فرقة، فريق",
  "technique": "technique (n): اهلية، براعة، جدارة، كفاءة، مهارة",
  "text": "text (n): نص",
  "things": "things (n): اشياء، حوايج",
  "time": "time (n): اوان، توقيت، زمن، ساعة، مرة، موعد، وقت\n\ntime (v): اثقل، اعاق، انسد، رقص، سد، ضبط، وقت",
  "times": "times (n): ضرب، مضاعفة",
  "title": "title (n): باب، عنوان، لقب، مادة",
  "town": "town (n): البلدة، بلدة، دايرة، ناحية",
  "tradition": "tradition (n): تقليد، عادة، عرف",
  "traffic": "traffic (n): اتجار، تجارة، تعامل، حركة، معاملة",
  "training": "training (n): اعداد، تاهيل، تدريب، تهيية",
  "trip": "trip (v): تجول، تنزه، زار، سافر، طاف، مشى\n\ntrip (n): رحلة، روحة، سفرة، سفرية، غدوة",
  "tree": "tree (n): شجرة",
  "troops": "troops (n): جنود، عساكر، عسكر",
  "truck": "truck (n): شاحنة",
  "truth": "truth (n): حقيقة، صحة، صدق",
  "turning": "turning (n): التفاف، دوران",
  "type": "type (n): نوع",
  "university": "university (n): جامعة",
  "using": "using (n): استخدام، استعمال، استغلال، تسخير",
  "values": "values (n): قيم",
  "victory": "victory (n): انتصار، تغلب، ظفر، غلبة، فوز، نصر",
  "voice": "voice (n): صوت، متحدث، ممثل، ناطق",
  "vote": "vote (n): اقتراع، انتخاب، تصويت، صوت\n\nvote (v): اعلن، اقترح، اقترع، انتخب، رشح، صوت",
  "wall": "wall (n): جدار، حايط، ساتر، متراس",
  "war": "war (n): حرب، صراع، قتال\n\nwar (v): حارب، صارع، قاتل",
  "watching": "watching (n): رصد، مراقبة، مشاهدة، ملاحظة",
  "water": "water (n): بول، ماء",
  "week": "week (n): اسبوع",
  "weight": "weight (n): وزن\n\nweight (v): اثقل، حمل",
  "wheel": "wheel (n): دراجة، دولاب، عجلة\n\nwheel (v): انبسط، انعطف، تدحرج، تدفق، تكور، تلوى، تمايل، تمرق، جرى، جول، دار، دخل، دفع، دوى، طاف، ملس، مهد",
  "wife": "wife (n): زوج، زوجة",
  "window": "window (n): شباك، نافذة",
  "wine": "wine (n): خمر، خمرة، نبيذ",
  "winter": "winter (n): شتاء",
  "woman": "woman (n): امراة",
  "wood": "wood (n): ادغال، خشب، غاب، غابة",
  "writer": "writer (n): كاتب، مولف",
  "writing": "writing (n): تاليف، تحرير، كتابة",
  "attend": "attend (v): حضر",
  "avoid": "avoid (v): ابطل، اجتنب، الغى، تجنب، تفادى",
  "explain": "explain (v): اوضح، شرح، فسر، وضح",
  "suggest": "suggest (v): اثار، استحضر، استدعى، اشار، اقترح، المح، اوحى، طرح، لمح"
}