{
  "one": "انسان، واحد، احد، مرء، فرد",
  "1": "فرد، واحد",
  "I": "فرد، واحد",
  "single": "فردي، فرد، واحد",
  "two": "اثنان",
  "2": "اثنان",
  "three": "ثلاثة، ثلاث",
  "3": "ثلاثة، ثلاث",
  "able": "قادر",
  "above": "فوق، اعلى",
  "use": "تعود، نفع، قدم طلبا، استفاد من استعمال، وضع، استنزف، طبع، دور، انتفع، وظف، استخدم، استغلال، خصص لغرض، شغل، طبق، جرب، توظيف، استعمل، استفاد، انتفاع، وظيفة، تطبق، استهلك، عمل، مهمة، استعمال، دمن الخمر، نشر، فايدة، عادة، عامل، استخدام، استنفد، استهلاك",
  "applied": "مستخدم، مطبق",
  "average": "معدل",
  "by": "جانبا، على حدة",
  "away": "جانبا، على حدة",
  "back": "قوى، دعم، ساعد، شجع، دبر، تحمل، ايد، احتمل، اعال، ساند، عجيزة، ظهر، موخرة، ناصر، سند، قام بنفقة كذا، خلف، قفا",
  "support": "اصطف، ساعد، سند، طول، خضع لعملية ما، اتخذ موقف، مساندة، تراسل، واقف، انسجم، قدم الدليل، واصل، علم موكدا، ايد، تصور، تالم، اساس، كان في موقف، ابحر في اتجاه معين، اثبت، احتمل، وقف، عانى، شجع، صبر، ترشح، ترك، كابد، وثق، تعزيز، تسامح ب، ساند، امسك، توافق، هضم، واكب، ركيزة، ظل قايما، جزم، تراجع، اطاق، مدد، استوعب، غضب، اعطى، غذى، تطابق، قرر، قام بنفقة كذا، عزز، ناصر، اكد، قاسى، بقي، تساهل، اعال، قاوم، ولد، عاقب، نشر، تحمل، سامح، قوى، حاكم، قدم برهان، صدق، التفت، تدهور، تكبد، تاييد، وازى، انتج، ابتعد، تقوية، ثبت، امداد، مسك، دعامة، منحه التثبيت الديني، دعم، اوقف، برر، مثل ببراعة، قام بنفقة، دفع الثمن، سمح، لاقى",
  "bad": "الرديء، السوء، الطالح، السيء",
  "ground": "تربة، اسس، بنى، ارضية، انشا، تراب، الارض، اليابسة، اقام، بر، ارض",
  "found": "خلق وظيفة، سن تشريعات، انشا، قرر، برهن، انشا موسسة، وجب، اوجد، شكل، بدا، الف، عين، توطيد، رسخ، احدث، ثبت، اشتهر، وطن، وطد، سبك، اسس، بنى، نصب، اقام",
  "based": "مبني على، مرتكز على",
  "beautiful": "جميل",
  "beginning": "استهلال، نقطة الانطلاق، ابتداء، بداية، غرة، فاتحة، مستهل، انطلاق انطلاق، استفتاح، اصل، انطلاق، وقت البدء، جذر، منشا، انطلاق  انطلاق، اساس، مبدا، ينبوع، استشهلال، مصدر، مطلع، بدء",
  "first": "اول، اولى، غرة، فاتحة، نقطة الانطلاق، مستهل، استشهلال، وقت البدء، رقم واحد، استفتاح، مطلع، الاول، ابتداء، بداية، بدء، انطلاق",
  "start": "استهلال، باشر عملا، نقطة الانطلاق، فارق، ابتدا، ابتداء، بداية، غادر، انخلع من مكانه، غرة، فاتحة، استهل عملا، مستهل، استهل، ذهب، انشا، استفتاح، شغل، بادر، شرع، انطلاق، انصرف، بدا، وقت البدء، رحل، ادار المحرك، استشهلال، افتتح، باشر، مطلع، انطلق، بدء، شرع ب",
  "get": "خرج العمل الاذاعي، اصاب ب، اندفع، صير فى حالة، فاز ب، انتج عمل سينمايي، صنع، اندفع نحو، جذب، خضع لعملية ما، حول، نجح، اغرى، اتى ب، كسب، ساوى، اضطر، حرك، دخل مرحلة كذا، اكرهه على، حصل، شن، وفق، ولد الكهرباء، اصبح محكما، وصل، سرق، واصل، نقل ملكية، سبب، ايد، عوض، تالم، استولى، كان من ابناء بلد واحد، اخرج، حيز، شرك، ملك، ادى، اسر شي، بنى، عجل الولادة، لمح، اثار، استقرى يتتبع الجزييات، تلقى، جعل، عانى، زاد، ادرك، اقتنى، اصاب، حدث، ضم جهده، قدم، ترك، فاجا، كابد، احرز، اشتمل، احضر، زار، خدع، اصطاد سمك، فاز، ظهر، خلق، تملق، كبر، نشا، ايد فكرة ما، اشتكى من، قبض على، بدا، اعتبر، وضح بتفصيل، ساند، اسر، وجد، امسك، اكتسب، بدا عملا، واكب، صياح، صار، اطاق، هيا، وقع في شرك، قنع، نبه، مدد، كشف عن، نقل، لفت، غذى، حصل على، خطر، استهل، رافق، غلق، اقنع، وسع، استمال، نشط، عزز، ازداد، سمح، شرع، دعى، حث، قاسى، بقي، اتخذ قرارا، احدث، انتقم من، اتى، نظرة، ااشترى، خفق، ولد، اصبح، راع، تصرف، جضر، عاقب، تضمن، اشتد، تحمل، فعل، نال، قوى، فهم، قدم برهان، لقي، نبت، بلغ، جلب، استنتج، نمى، وقع ضمن، استثمر، زرع، تفشى، سبى، اضرم، حضر، وقع، بات، طور، قاضى، حفز، تدهور، تجبر، سحر، تكبد، عبر، انتج، اسعد، تحدر من، ربح، عين، ابلغ، سير نحو النضج، عرض، احرز هدفا، حمض فيلم، لحق، ثبت، امسك به، ادى الى، مثل ببراعة، حبس نفسه، عانى من، نما، اجتذب، حقق، دفع الثمن، حاز، جاء، تناول، لاقى",
  "can": "علبة معدنية، قدر، طرف، طرد، اقال، عجز، كنيف، صفيحة، فصل، كفل، ردف، صرف  من الخدمة، حمام، بيض بالقصدير، اطلق سراح، طلى بالقصدير، بيت الخلاء، قفا، نبذ، سجن، مرحاض، انهى خدمة، مقعد، دورة المياه، اعفى من الخدمة، بيت الادب، اوقف، علبة، علب، قصدر، وضع في علبة، موخرة، مكن، استطاع",
  "behind": "طرف، عجز، مقعد، موخرة، كفل، قفا، ردف",
  "better": "حسن استغلال، اغتنم، اصلح، تحسن، جمل، دخل تحسينات، طور، عدل، جود، استفاد، حسن",
  "large": "كبير",
  "big": "كبير",
  "Negro": "جوزيف بلاك، بلاك",
  "black": "اسود",
  "have": "اندفع، حرر، اندفع نحو، صير فى حالة، فاز ب، صنع، طول، خضع لعملية ما، حول، نجح، صور، اغرى، كسب، القى خطابا، استخدم، اضطر، حرك، اكرهه على، حصل، شن، وصل، واصل، سبب، كبت، ايد، تصور، عوض، تالم، استولى، اخرج، حيز، تميز، صمد، امسك ب، ملك، التهم، وزع، بنى، عجل الولادة، نقذ، اعد، اثار، استقرى يتتبع الجزييات، تلقى، جعل، عانى، ادرك، اقر، اصاب، ضم جهده، ترك، وافق، كابد، اشتمل، خطب، زار، قدم اعترافات، اختار، فاز، استعاد، شارك، خلق، تملق، اخذ، ايد فكرة ما، اشتكى من، قبض على، بدا، اعتبر، استحوذ على، ساند، اسر، تسلم، القى، امسك، اظهر، بدا عملا، واكب، كبح، رضى، استمر، ابقى، اطاق، قبل التحدى للمبارزة، تبقى، هيا، لزم، قنع، نبه، قبل، مدد، غضب، اعطى، نقل، سلم، غذى، تطلب، رافق، مد يده، اقنع، غلق، استمال، احتفظ، شغل، نشط، سمح، عزز، دعى، قاسى، حث، استلم، بقي، اتخذ قرارا، استعمل، احدث، انتقم من، قاوم، استهلك، عمل، ولد، تصرف، عاقب، تضمن، اقتضى، نشر، تحمل، فعل، نال، قوى، حاكم، فهم، قدم برهان، جلب، وافق على، تعود، حمل، استنتج، ارسل، اضرم، صدق، عقد، حضر، حبس النفس، التفت، قاضى، تدهور، حفز، تجبر، تكبد، وفى بوعده، انتج، وجه ضربة، اشترى، اسعد، احتل، عين، ربح، لبي، احرز هدفا، دعم، مثل ببراعة، عانى من، احتوى، حقق، دفع الثمن، حاز، تناول، لاقى",
  "stand": "تراجع، اطاق، اصطف، ترك، كابد، لاقى، استوعب، ساعد، اعطى، سند، غضب، طول، قوى، خضع لعملية ما، وقف منتصبا، اتخذ موقف، مقاومة، التفت، قام، تدهور، اقام، قام بنفقة كذا، ناصر، انتصب، صمود، تكبد، واقف، قاسى، وجهة نظر، انتج، بقي، نهض، توقف، قاعدة، ظل قايما، تساهل، ايد، تسامح ب، اعال، تالم، ابتعد، تصور، نظرة، قاوم، قاوم البلى، كان في موقف، هضم، ولد، واجه، ابحر في اتجاه معين، اوقف، دعم، عاقب، واكب، نشر، صبر، تحمل، تزوج، احتمل، دفع الثمن، وقف، عانى، سامح، نصب، شجع، سمح، ترشح، حاكم",
  "hold": "احتجز، اعتنى ب، سند، طول، تعاون، وجه، ضبط، صان، حافظ، ساوى، رسم مربعات، اضطر، حصر، ربى، انذر، وصل، واصل، حجز، امساك، كبت، ايد، تصور، استولى، احتجاز، صمد، وبخ، ملك، اعد، قيد، هدا، وقف، عانى، اخفى، اتسع، اقر، اعلن، راى رايا، تمالك نفسة، سحب مالا، انطبق على، طعم، وافق، مشى، تزامن، ودع، اشتمل، تفاهم، ظل، مقبض، اعتقل، اعاد، سلم جدلا، ظهر، اخذ، اعلن بشكل عام، قبض، حوى، امتنع عن، قبض على، التقى، اعتبر، وفر ماوى، اسر، كفى، امسك، توافق، استضاف، كتم، اعتكف في، واكب، بلغ مسافة ما، كبح، حفظ، حسب، تاجيل، استمر، استحوذ، ابقى، انسجم مع، اطاق، اعتصم، حافظ على، حقق النصر، لزم، وقى، قبل، استوعب، غضب، اعطى، نقل، سلم، تاخير، اعتقال، تعقب، اهدا، رافق، مد يده، قرر، كافح، وسع، تطابق، احتفظ، شغل، عزز، اكد، لطف، صرح، انتظار، قاسى، بقي، مسكة، قاد، دفع، احبط، اعال، تنشر، عتل، قاوم، راقب، عمل، ولد، تصرف، سوق، تضمن، نشر، تحمل، نظم، راس، فحص، قوى، استبقى، حاكم، كمش، حبس، حمل، اتفق، نجح في حمل، لين، عقد، اضمر، حبس النفس، التفت، حاز، عرض الخصم للخطر، ضام، قمع، عبر، سجن، راعى، انتج، شكم الفرس، افترض، كتمان، اعتقد، رحل، مسك، انفق، دعم، اوقف، اوى، حرم، احتوى، سيطر، راى، حقق، عنف، توصل الى تسوية، بقي على، توقف، دافع عن، تحكم في",
  "pay": "تنازل، ادى ما عليه، سدد دينه، اطاق، دخل، غل، اجر، مرتب، اثمر، ودع، غضب، اعطى، سد دينه، طول، كان دون غيره جودة، تخلى، مكافاة، التفت، قضى، رد، صرف، حصل، راتب، وهب، قاسى، سدد، انتج، سدد حسابه، ربح، دفع، خضع، سلم الروح، تصور، عوض، وفى، رخي حبلا، ادخل، ولد، ادى، خلى مكانه ل، دفع ما عليه، واكب، نشر، تحمل، قام ب، عانى، حاكم",
  "expect": "اطاق، حقق النصر، طلب، حمل، حملت، مشى، توقع، نجح في حمل، غضب، اعطى، طول، نقل، تطلب، امل، تعقب، رافق، التفت، اعتمد، تطلع الى، عزز، عبر، قاسى، انتج، قاد، دفع، تصور، استولى، تنشر، عتل، كفى، تنتظر مولودا، رحل، انتظر، ولد، تطلع، تصرف، سوق، دعم، واكب، نشر، تحمل، بلغ مسافة ما، ترقب، وقف، عانى، استحوذ، حاكم",
  "born": "مولود",
  "make": "خرج العمل الاذاعي، ورط، اندفع، جمل بمستحضرات تجميل، ابتدع، اندفع نحو، صير فى حالة، فاز ب، صنع، انتج عمل سينمايي، انشا تدريجيا، حول، نجح، زخرف، اغرى، كسب، انهى، اضطر، برهن، حرك، اعتمد، اكرهه على، صرف، عمل في صناعة البناء، حصل، شن، ولد الكهرباء، سدد، القى المسولية، وصل، شكل، سبب، رسخ، عوض، صدم، اخرج، ركب، حيز، اعاق، ادى، ملك، وفق الى، بنى، عجل الولادة، اطمح، اعد، اثار، لفق، استقرى يتتبع الجزييات، جعل، اصاب، انتصر، جنى، ضم جهده، ابدع، قدم، اتخذ، اعد للطبخ، حدد، احرز، عدل، وضع، استحق، اشتمل، استعد، زار، خدع، فاز، ظهر، خلق، مد يده للوصول ل، نظف، اهتم، تملق، اجبر على، امتد، قبض، ايد فكرة ما، الف، اعتبر، وجد، ارتطم، اشتهر، اكره على، صد، اكتسب، بدا عملا، اسس، لصق، هاجم، حل، قام ب، خلق وظيفة، شيد، طبخ، هيا، اعد حضر، اتصل، قنع، نبه، اعطى، اصاب الهدف، انشا، غلق، قرر، اقنع، بسط، استمال، نشط، عزز، ازداد، دعى، حث، استلم، اتخذ قرارا، تسبب في، توطيد، تاول، احدث، انتقم من، عمل، ولد، تصرف، عمل دعاية، استاهل، وطد، كان في متناول اليد، تضمن، ضرب، لاقى نجاحا، ربح راتب، نظم، فعل، نال، ركز، نفذ، جلب، بلغ، اصلح، تلاعب، استنتج، شفى، اكتشف، قدم خدمة، احتال، اضرم، انتهى، رتب، عقد، حضر، حقق انتصار، قاضى، حفز، تحصل، تجبر، طها، انتج، عالج، اسعد، بذل، انجز، كون، عين، ربح، اعطى الشىء شكلا، نجز، توافق مع، احرز هدفا، عرض، ثبت، ارتكب، تسبب ب، وطن، اتكل، ادى الى، تالف، وقع في ورطة، اسفر عن، حقق، حاز، تناول، اقام",
  "center": "مركز، برشم، حدد، جذب، تجمع، وسط، خلاصة، بير، تامل طويلا، جوهر، لفت الانتباه، كثف، ثبت باحكام، لب، صميم، ثبت ببرشام، حشد، تبار، استغرق في القراءة، قلب، تمركز، ركز، تركز، درس عن قرب، فحوى، اصبح اشد قوة، منتصف",
  "heart": "مركز، لب، صميم، ميل، مزاج، حب، رغبة، فحوى، جوهر، خلاصة، قلب",
  "eye": "عين، مركز",
  "central": "مقسم هواتف، بدالة، سنترال",
  "opportunity": "فرصة",
  "chance": "خاطر، لقي، ضارب، تاخذ فرصة، راهن، صادف، قابل، فرصة، غامر، امكانية، جازف، حظ، قامر، وجد، مصادفة، عرض للخطر، صدفة، احتمال، امكان، لاقى",
  "find": "لقي، توصل، بلغ، استبان، صفى، تحرى، استرجع، حدد، وجد نفسه، استعاد الصحة، لاحظ، صادف، اكتشف، فصل، قابل، كشف عن، عثور، حول تيار متردد الى طردى، كشف، حصل على، تاكد، انتهى، قرر، فصل فى، حتم، ادان، انهى، استرد، استعاد، حسم، شعر، اكتشاف، قوم تيارا، اتخذ قرارا، اقتنى ثانية، تحقق، حكم، لحق، وجد، اصدر حكما، عقد العزم، استعاد قوات، رسم الحدود، اكتسب، احس، حقق، تلقى، نال، فضى ب، لاقى، عاد",
  "choice": "انتقاء، اختيار، بديل، خيار",
  "clear": "جنى، صفى، باع، مر الكرة للاعب اخر، القى الضوء على، شرح، حرر، ازال، اهمل، تخلى عن دوره في اللعب، اجتاز بنجاح، ابري، مشرق، تبادل، استحق، صحا، سير، تنحنح، انتقل الى، نجح، اوضح، كسب، طالب، تبرز، نظف، فسر، صرف، تجاوز، الغى اعلان، واثق، وثب، عبر، حصل ربحا صافيا، استلم، قبض، مرر، برا، ربح، وضح، خلص، تغوط، ربح ربحا صافيا، نجز، اجاز، اخضع السفينة لشروط الجمارك، انقشع، رحل، جهل، اقر ب، رخص، تبادل الشيكات، اعفا، استاهل، اكتسب، نور، اعد، ربح راتب، حل، شق طريقه، تغاضى، اخلى، سمح، مر، حدث، خول",
  "last": "ختام، نحب، مرحلة نهايية، انتهاء، نهاية، نقطة النهاية، اجل، ممات، نجا، موت، اخير، بقي، اخر، ثبت، وفاة، اختتام، خاتمة، منية، استمر، دام",
  "close": "ختام، غلق ابوابه، قفل، توقف عن الصدور، حبس، طوى، اتفق، غمض، انسد، تخلص منه بسعر مخفض، كسر، فض، نقطة النهاية، عقد، غلق، انهى، قريب، ختم، ثنى، طبق، حجز، سد، انثنى، اغلق، ضاعف، اختتم، راقب، اشتبك، اقفل، ضيق، عانق، اختتام، غلق الباب على اصبعه، انغلق، خاتمة، انتهاء",
  "end": "ختام، وضع حد، هلاك، تردد، طرف، بقية، وضع حدا ل، فصل من العمل، مرحلة نهايية، انقطع، اقام موقتا، انسد، قام بزيارة، منع، حول، نهاية، علق، هزم، غاية، انتهى، توقف القطار، انهاء، انهى، قطع، اعترض، موت، وضع نهاية ل، بقي، الغى، اخر، هدف، حجز، باقية، سد، توقف الطايرة، فرغ، قتل، زايدة، انقضى، اختتم، تم، اوقف الدفع، حد، اوقف، اقتطع مبلغا مستحقا، اربك، وضع حدا، خاتمة، توقف، انتهاء، قصد",
  "near": "دنا، قريب، اقترب، قرب",
  "cold": "بارد، برد، برودة، فاتر",
  "color": "صباغ، لمعان، مظهر خارجي، غير اللون، مظهر، خضب، ملون، شكل، لون، بريق، ملونون، صبغ، صبغة، شوه، يمجد، دهن، طلى، مادة ملونة، مظهر خادع، لون براق",
  "approach": "لفت انتباه، اتصل، اقترب، ضاهى، دنا، تردد على، اقترح، فاتح، سبيل، شرع، طريق، بدا، بدا بالتعامل مع، توجه نحو، تقرب الى، ناقش، هاجم، مدخل، قرب",
  "coming": "مجيء، قرب، قدوم",
  "come": "بلغ، قدم، جلب، هيا، صير فى حالة، فاز ب، تلف، وقع ضمن، ارتفع ل، خطر، زار، عادل، حضر، كسب، ساوى، وقع، فاز، دخل مرحلة كذا، جمع، حصل، عبر، وفق، وصل، رقم، تحدر من، اعتبر، عد حضر، انتقم من، اتى، سير نحو النضج، كان من ابناء بلد واحد، اخرج، حيز، هدم، خفق، احصى، بلغ في مجموعه، عد، اثار، حسب، نال، جاء، اصاب، حدث",
  "total": "بلغ، قدم، تلف، وقع ضمن، ارتفع ل، خطر، عادل، حضر، ساوى، وقع، دخل مرحلة كذا، جمع، حاصل الجمع، عبر، وفق، وصل، رقم، اجمالي، تحدر من، اعتبر، مجموع، عد حضر، اتى، سير نحو النضج، كان من ابناء بلد واحد، هدم، مبلغ، خفق، احصى، بلغ في مجموعه، عد، حسب، مبلغ كلي، جاء، اصاب، حدث",
  "number": "بلغ، قدم، قدر، اصدار، تلف، وقع ضمن، فصل، رقم الهاتف، دخل في الحساب، ارتفع ل، اخذ بعين الاعتبار، عدد، خطر، عادل، روتين، حضر، ساوى، وقع، دخل مرحلة كذا، جمع، صرف، نمرة مسرحية، عبر، وفق، رقم تعيين الهوية، وصل، عد عدد، اثر، رقم، تحدر من، اعتبر، رقم التلفون، عد حضر، سرد، اتى، سير نحو النضج، كان من ابناء بلد واحد، هدم، كلام معاد، خفق، احصى، بلغ في مجموعه، اتكل، عد، حسب، جاء، اعلن، اصاب، حدث",
  "amount": "بلغ، قدم، قدر، تلف، وقع ضمن، ارتفع ل، مبلغ مالي، خطر، عادل، حضر، ساوى، وقع، دخل مرحلة كذا، جمع، حاصل الجمع، مقدار، مبلغ من المال، عبر، وفق، وصل، رقم، تحدر من، اعتبر، مجموع، عد حضر، اتى، سير نحو النضج، كان من ابناء بلد واحد، هدم، مقياس، مبلغ، خفق، احصى، كمية، بلغ في مجموعه، عد، كم، حسب، مبلغ كلي، جاء، اصاب، حدث",
  "common": "متنزه، منتزه، حديقة عامة، مشترك، متداول، عام، شايع",
  "complete": "ملا، هزم، اكمل، اتم، اضفى اللمسات، انتهى، فرغ، نجز، قتل، انهى، عبا، فرغ من، كمل",
  "concerned": "قلق",
  "see": "عكس صورة، نظر بعين الاعتبار، تعرف، عرض فلما، نتا، زين، خرج مع، تصادم، علم، نظر، بجل، خضع ل، صور، التقط، عنى، اعتمد، تعيش، تصور، جعل له نتوء، استنطق، التقى ب، دفع القيمة، رسم لوحة، درس المسالة، توهم، احترم، تامل، لمح، تلقى، عانى، ادرك، اقتنى، فضى ب، تدبر، درس، عايش، بحث، اجتمع، كشف، واعد، رمى، زار، اعتقل، برز، وقر، اصغى، ولع ب، تعلم، قام بدور المترجم، تصور و يعتبر، اتحد، شاهد، جرب، اول الاحلام، التقى، امتحن، اعتبر، وجد، صمم، عزم، ترجم، حسب، عاش، اولى الامر عناية، علم من طريق السماع، قدر، اضاف، ابدى للعيان، كشف عن، قابل، حفر، سمع، قام بسلسلة حركات، استعاد صحته، خطط، عرف، رافق، قرر، اختبر، ظن، صفى حسابا، حفظ عن ظهر قلب، نشط، استجوب، تجاوز، قاسى، علا، تقابل، فتش، تمثل، حمل الركاب، ابصر، نوى، عمل، اسقط، عرض على الشاشة، تحمل، بصر، فحص، فهم، بلغ، اصلح، رفع، رسم، لاحظ، اكتشف، صادف، اخذ بعين الاعتبار، تاكد، اجل، عمل بحمية، جسم، تيقن، تدارس، ذهب للسينما، فسر، مر ب، جسد تمثال، وفى بالمرام، راعى، تواعد، استانف، فكر، اطلق، سمع الدعوى، افترض، حلل، حكم، اعتقد، قوم، واجه، تعرف لاصدقاء، اتكل، تخيل، حقق، راى، ظهر ناتيا، سمح، اجتاز، لاقى",
  "consider": "اصلح، تدبر، درس، قدر، نظر بعين الاعتبار، اضاف، لاحظ، بحث، اخذ بعين الاعتبار، بجل، نظر، وثق، زار، صدق، اجل، عرف، وقر، رافق، تيقن، عنى، تدارس، ظن، اعتمد، صفى حسابا، تبصر، راعى، شاهد، نظر في، اعتبر، فكر، تصور، افترض، حكم، اعتقد، فكر مليا، قوم، عمل، اتكل، درس المسالة، احترم، تخيل، تامل، لمح، تحمل، حسب، حقق، راى، بصر، ادرك، فحص، سمح، اولى الامر عناية، فهم",
  "view": "اصلح، تدبر، درس، قدر، نظر بعين الاعتبار، منظور، اضاف، لاحظ، بحث، اخذ بعين الاعتبار، بجل، نظر، زار، اجل، عرف، وقر، رافق، تيقن، عنى، تدارس، ظن، اعتمد، صفى حسابا، راعى، شاهد، وجهة نظر، هدف، نظر في، اعتبر، فكر، تصور، افترض، نظرة، حكم، اعتقد، قوم، عمل، اتكل، درس المسالة، احترم، تخيل، تامل، لمح، تحمل، حسب، حقق، راى، بصر، ادرك، فحص، سمح، قصد، اولى الامر عناية، فهم، راي",
  "study": "عاين، طاف لتصيد اصوات الناخبين، قبل التحدى للمبارزة، قرا الطالع، درس، تعود، حمل، قبل، موضوع، اكتشف، طالع، التمس، اختصر، بحث، علم، قرا بين السطور، تطلب، موضوع البحث، صور، عمل بحمية، اختار، رافق، تقرير كتابي، اختبر، استعاد، تعلم، شارك، طلع على، تدارس، حفظ عن ظهر قلب، استجوب، دراسة، اخذ، راعى، استلم، اشترى، عزف لحنا، فرع، فحص بدقة، امتحن، احتل، بدا، راجع دروسه، دل، فتش، استنطق، استحوذ على، حلل، استولى، اسر، تقرير، امسك ب، قرا، فحص، اقتضى، حاول، تامل، فهم، جرى دراسات، ناقش، حقق، نال، ادرك، حلل نفسيا، استمر، تناول، اشار",
  "think": "قدر، تدبر، استرجع، اعد لغرض، تفكر، توقع، اخذ بعين الاعتبار، بجل، نظر، وثق، صدق، وقر، اعاد، عنى، استرد، تدارس، ااستدعى، ظن، راعى، اراد، اعتنى، اعتبر، فكر، تصور، افترض، تذكر، اعتقد، اعد لغرض ما، فكر مليا، نوى، قوم، خمن، درس المسالة، احترم، تخيل، تامل، اعتزم، حسب، راى، ذكر، ضمر، قصد",
  "believe": "قدر، اخذ بعين الاعتبار، بجل، نظر، وثق، صدق، وقر، تدارس، ظن، راعى، اعتبر، فكر، تصور، امن، اعتقد، فكر مليا، درس المسالة، احترم، تخيل، تامل، راى",
  "continue": "استغرق، ستر، سافر، صان، حافظ، وجه دعوة، صمد للحفظ، هيمن، واصل، عمل بكل طاقته، علب، خلل، زاد، جرى حصانابكل سرعته، قدم، حمى، ذهب الى، زود، كمل، ظل، امتد، اطال، سير العمل، اخذ سبيله للا نجاز، بدا، دوام، تصرف بحماقة، عمل كبديل لغيره، كسا، ترقب، استمر، دام، صوب المسدس الى، ابقى، اصدر من، ثر، حافظ على، وقى، جامع، مدد، مد، بسط، وسع، عزز، غطى، شرع، حسن، انفع، بقي، احدث، تصرف، لف، احتفظ بشي للا ستعمال، نشر، مكث، مط، نفذ، تحضن، حمل، استكمل، انتشر، تحرك، ادار، اجل، سير في موكب، قاضى، اشترى، عالج، بذل، استانف، ضخم، تقدم، كان على علاقة مع، تابع، شمل، انبثق عن، رفع دعوى قضايية، مضى، رحب، اجتاز",
  "keep": "استغرق، اخفى شهادة، منع، صان، حافظ، صمد للحفظ، ربى، واصل، حجز، كبت، ايد، اخمد، صمد، ملك، وضع حدا، قيد، علب، خلل، اخفى، طعم، ودع، ظل، اعتقل، اعاد، اوفى، امتنع عن، قبض على، ساند، امسك، كتم، اعتكف في، احيا، كبح، حفظ، استمر، ابقى، اعتصم، اطاق، حافظ على، لزم، وقى، مدد، زود بالة مزيلة للتشويش، غذى، مد يده، احتفظ، شغل، عزز، قاسى، بقي، اعال، قاوم، راقب، حظر، احتفظ بشي للا ستعمال، تحمل، قوى، قدم برهان، حمل، ازال، رصد، لاحظ، عاق، عقد، حبس النفس، قمع، تكبد، راعى، سحق، حال دون، كتمان، انفق، تابع، دعم، مثل ببراعة، حرم، احتوى، سيطر، بقي على، احتفل",
  "stay": "نزل في فندق، التزم، نزل، مكوث، ثبت بحبل، ظل، اهدا، اقام، انهى السباق، عطل، بقي، واصل، بقاء، لبث، ثبت، انتظر، صد، اوقف، حلول، هدا، تحمل، بقى، مكث، اقام في، سكن، اقامة",
  "continued": "متتابع، مستمر، متواصل",
  "deal": "باع، مس، عمليه تجارية، روج لبضاعة، صفقة، معاملة، نجح، بحث العلاقات التجارية، تقسيم، اعطى دواء، دبر، عنى، باع بسعر محدد، حظي بالقبول، دفع مالا، اقتلع، اراد، وصل، واصل، بوب، غش، اكل، ادى، وزع، منح الاسرار، ناور، نثر، صفى املاك متوفي، تسوق، دبر امره ب، منح، خدع، تاجر، بصق، جرف، ادار املاك قاصر، اهتم، تعامل، اعتنى، سير العمل، وجد، تصرف بحماقة، خطط الارض، خصص لغرض معي، ترقب، الكثير، قام ب، كثرة، جرف الثلج، قنع، ساوم، اعطى، توزيع، حفر، رغب، اقتصد، تولى، عالج موضوعا، قايض، انفع، صفقة تجارية، قاد، قسم، قصف ب، تعامل مع، عمل، خصص، تصرف، عاقب، نشر، فرق، رسب في الامتحان، لمس، تاجر ب، نفذ، خص، حمل، اقام العدل، استثمر، صنف، باع بصورة جيدة، حرث، ادار، بحث في، حلف، روض، عالج، حكم، كان على علاقة مع، واجه، عامل بطريقة خاصة، اوراق، سقط في الانتخابات",
  "covered": "مغطى، مكسو، مستور، محجب",
  "current": "تيار، تيار كهربايي",
  "cut": "تقلص، طعن، اهمل، عدى، زين، وازن السفينة، قطعة، خفض عدد العاملين، خفض، صامد، زخرف، شذب الشعر، التقط، انهى، ضرب بالكرة، خضع، نزل الرتبة، وبخ، اقتطاع، ضيق، عالج الصورة السلبية، قلل، خطبة، اطفا، فصل، طرى الشعر، قلم، اختصر، خطب، اضعف، قطع، انقبض، دق، حال الى، صد، شق، لحمة، قلل النفقات، حلق، حصة، رصع، تقاصر، جرح، تجاهل، شذب، زجر، بتر، عامل بازدراء، اعاده الي مكانه، رفض، ازدرى، سجل، اوجز، قص، اختزل، هزل، انقص، قلم الاظافر، هذب، سكت، رتب، عقد، لاءم الشراع، سلك طريقا، قلص، قناة، تهيي، قصر، تجبر، انكمش، سحق، حسن الترتيب، اقتطع، نقص، اوقف، حرم، لخص، طبع على، جعله هشا",
  "dark": "معتم، ليل، شر، خسة، عتمة، ظلمة، نذالة، سيية، ظلام، ظلماء، قاتم، غلس، لوم، مظلم، دهمة، قتمة، داكن",
  "night": "ليل، ليلة، ظلام",
  "dead": "ميت",
  "deep": "عميق",
  "report": "بلغ، وصف، قص، تواجد، تقرير اخباري، نقل، اعد تقريرا، تقرير كتابي، روى، حضر، رفع تقرير ضد جهة ما، خبر، قدم تقريرا، دراسة، وصف اخباري، ابلغ، عمل مراسلا صحفيا، تقرير، تقرير شفوي، قصة اخبارية، جرى تحقيقا، اعلن، رواية، اورد",
  "account": "فاتورة، وصف، تفسير، تقرير اخباري، نقل، قايمة الحساب، روى، كشف حساب، تار يخ، قصة، وصف اخباري، حساب، تعليل، تقرير، تقرير شفوي، قصة اخبارية، توضيح، ايضاح، حكاية، حسب، رواية",
  "line": "ذرية، نسل، اسلوب، جدل، رسم، شركة نقل، حبل، استشف، تجعيد، جملة، سلالة، خطط، تجعد، رتل، سيرة، خط، حجة منطقية، قناة، شغل، صف، سطر، مسعى، نغم، لحن، مهنة، قناة اتصال، وظيفة، مسار، عمل، ثنية، ترنيمة، تغضن، خط نقل، حرفة",
  "name": "دعا، شيد، احال الى، سمى، وصف، استرجع، ميز، حدد، استدعى، اكتشف، اشار الى، لفت النظر الى، استشهد ب، استنجد، نوه الى، تطلب، شخص مشهور، نادى، اختار، سال، استرد، نوه ب، استشهد، نوه، صيت، دعا للمثول امام القضاء، عين، عرج، شخصية بارزة، شخصية، سمعة، اسم، صاح، حدد الثمن، اقتضى، صرخ، اجتذب الطريدة، لقب، ذكر، مكالمة، تلفن، اشار، اورد",
  "design": "مغزى، ابتكار، رسم، تصميم، وضع، فرد، نموذج، سمم، غاية، خطط، احداث، غرض، سم، اختراع، تصور، ترتيب، قتل بالسم، عزم، صمم، زينة، فسد، نية، مرمى، مخطط، زخرفة، قصد، بدعة",
  "influence": "صاغ، حدد، احتال، حول، ضبط، ادار، نفوذ، جسد، احرز مكانة، اشتغل، اعطى شكلا ل، سدد من طريق العمل، شغل، شكل، اثر، عين، اثر في، اعد من طريق التحويل، تاثير، حل مسالة، اثار، فعل، سلطة، حدث",
  "set": "غرب، ورط، فتل، تصليب، صاغ، فرض، ضبط، دبر، روج الاشاعات، مجموعة، عسكر، القى المسولية، رسخ، انجبر للعظم، اخرج، ركب، اخمد، اعاق، قذف الكرة، سوى، استقر، اعد، غرس، عين شخصا في وظيفة، القى اللوم على فلان، حدث، برم، طلب، حدد، تلاءم، راهن، عدل، وضع، طرح، استعد، تصلب، كان في موقع، كيف، خدع، وقف امام الفنان ليرسمه، تظاهر، بدا، اعتبر، كمن، اربك، اسس، لصق، وضعه فى موضع معين، دخر، حل، حلقة، جهز، تحضن البيض، يوجد عملا ل، غرز، رصع، تسلل، هيا، اعد حضر، رقص وجها لوجه، دفن، سجل رقما قياسيا، شتل، حرض، استهل، اقترح، قرر، بسط، جمد، انشا، صحح، تكلف، انتقم من، حدد موعدا، عاقب، نظم، ركز، ربط، فاز بمرتبة مرموقة، سجل، تاقلم، اصلح، هيا المايدة، رسم، سدد ضربة، ميز شخصا، شفى، استثمر، صنف، زرع، طرح سوالا، تكيف، رتب، وقع، لاءم، تاهب، عالج، وازن بين، خبا، اعطى الشىء شكلا، عين، عرض، ثبت، قوم، متفق، خلق مشاكل، عير، حقق، تصنع للطبيب، اجبر العظم",
  "difficult": "صعب",
  "hard": "قاس، صلب، صعب",
  "place": "غرب، فتل، مركز، صاغ، تعرف، استهدف، اعطى درجة، فرض، وجه، ضبط، دبر، موضع، روج الاشاعات، انجبر للعظم، اخرج، ركب، اخمد، قذف الكرة، تماثل، استقر، عين شخصا في وظيفة، القى اللوم على فلان، حدث، برم، ساحة، طلب، حدد، ميز، تلاءم، بيت، راهن، وضع، طرح، كان في موقع، خدع، اعتبر الشييين شي واحد، وقف امام الفنان ليرسمه، تظاهر، بدا، بدلا من، اعتبر، كمن، وظيفة، مكانة، اربك، اسس، وضعه فى موضع معين، دخر، تحضن البيض، يوجد عملا ل، عين الهوية، رصع، مكان فارغ، منصب، رقص وجها لوجه، دفن، سجل رقما قياسيا، حرض، استهل، اقترح، بسط، قرر، جمد، اعطى رتبة، تطابق، بقعة، تكلف، حدد موعدا، اعطى علامة، مكان، ركز جنود، نظم، ميدان، ربط، فاز بمرتبة مرموقة، نقطة طوبوغرافية، موقع، هيا المايدة، مجال، رسم، ميز شخصا، استثمر، صنف، زرع، طرح سوالا، رتب، وقع، مساحة، تاهب، عين النوع، وازن بين، عين، مقعد، عرض، ثبت، وظف اموالا، خلق مشاكل، تصنع للطبيب، اجبر العظم، فراغ",
  "direct": "تزعم، حجر، صوب، قبل التحدى للمبارزة، مرسل، تعود، طرد، استهدف، قاد سفينة او سيارة، حمل، قبل، تصدر، نزل، ارشد، ابعد، ارسل، فرض، وجه، سير، تطلب، ادار دفة، صور، ادار، دبر، لعب الورقة الاولي، اختار، رافق، استعاد، شارك، حرك، تولى، اتخذ سبيلا ما، تبع، اخذ، استلم، اشترى، وجب، وصل، سدد، قاد، احتل، بدا، توج براسية، اطلق، حصد، استحوذ على، استولى، تراس، اسر، تقدم، اخرج، مباشر، امسك ب، امسك بالدفة، واجه، تصرف، ادى، ادى الى، هدى، اطلق صيحة، اقتضى، ادار دفة السفينة، اطلق النار، بعث، امر، حقق، نال، ارسال، ادرك، عنون، ساق، استمر، تناول، ركل كرة، وفد",
  "point": "تزعم، عبر باختصار، استدل على، وما، نم، انذر ب، صوب مسدسا، استهدف، مستوى، قاد سفينة او سيارة، مرحلة، طرف مستدق، اوحى بضرورة، تصدر، برى قلما، طين، اشار الى، ارشد، نقطة البوصلة، سير، وجه، درجة، ادار دفة، مادة، ادار، برز، مرتبة، بند، نقطة زمنية، رتبة، وضح الاتجاه، حرك، ظهر، اتخذ سبيلا ما، لفت الانتباه، وجب، وصل، استقرن يصبح ذا راس، قاد، توج براسية، جزء، دل، كحل في البناء، حصد، ابحر، تراس، توجه، تقدم، اشر، فترة  زمنية، امسك بالدفة، واجه، تدرب لمباراة، نقطة، هدى، ادار دفة السفينة، راس، ساق، بين، نقط، ركل كرة، اشار",
  "lead": "رصاص، رياسة، قدم، قبل التحدى للمبارزة، تعود، ترك، خرج ب، حمل، قبل، ارشد، انتشر، وجه، فاق، تطلب، رقيقة فاصلة، صور، خيط، قيادة، دبر، لعب الورقة الاولي، اختار، رافق، الرقم الذري 82، استعاد، شارك، تولى، فاق اهمية، امتد، اخذ، دليل، عبر، استلم، اشترى، وجب، وصل، Pb، اثر، قاد، احتل، بدا، دور رييس، تفوق، سبق، علا، استحوذ على، استولى، اسر، تراس، تقدم، فاق غيره، امسك ب، تصرف، ادى، ذيل، ادى الى، هدى، مفتاح، اقتضى، دور قايد، نشر، اطلق النار، اسفر عن، حقق، نال، علا من حيث المرتبة، ادرك، استمر، تناول، حدث",
  "take": "صوب، ورط، استاجر، انسحب، دفع اشتراكه، فرض، وجه، لقح، علم، حول، صور، اصطفى، دبر، لعب الورقة الاولي، اغرى، استخدم، طلع على، اضطر، احتاج، ختم، تبع، صرف، سدد، حقن، وصل، سرق، اطلق النار في الهواء، نقل ملكية، اراد، ايد، قتل، رضي ب، استولى، اخرج، اطلق نحو الهدف، امسك ب، فضل، تبنى، صور فوتغرافيا، ادى، ملك، هدى، التهم، تامل، اطلق النار، امر، اعدم، اتخذ شكلا او مظهرا، ادرك، اقر، اصاب، اثر في، تحجب، اتخذ، طرد، درس، تقبل، صنع فيلما، طلب، تبرعم، وافق، اقال، التزم، تغشى، اشترط، فصل، ارشد، اشتمل، سمح ل، التمس، احضر، بحث، قرا بين السطور، كشف، اتسع ل، برز، اختار، اشترك، حتم، استعاد، سال، شارك، تعلم، اخذ، عزف لحنا، بدا، استحوذ على، اسر، امسك، قبل التحدى، قرا، سحب، قبله في، خرج للصيد، واكب، استلزم، رضى، مطلوب، استمر، اشار، تراجع، قبل التحدى للمبارزة، قرا الطالع، جر اللسان، لزم، اكتتب، جرح، قبل، قنع، طالع، نقل، اخذ صورة، سلم، تطلب، رغب، رافق، قرر، سمح بالدخول، استرد، قضى، تولى، طالب، حفظ عن ظهر قلب، مطره بالاسيلة، سمح ب، استلم، وجب، نزع، اشترك في صحيفة، استعمل، قاد، راجع دروسه، احدث، تحدى، استهلك، جضر، تصرف، اقتضى، تضمن، تبرع، نال، ربط، انزلق، فهم، ارتد، انتهز، جلب، وافق على، تعود، غير سكنه، حمل، ازال، استدعى، اكتشف، انتخب، تقهقر، صدق، عمل بحمية، حضر، وقع، تجبر، فسر، الهى عن، وقع بامضاية، انطوى على، اشترى، وجه ضربة، منحه حق الدخول، احتل، دل، اطلق، اصطاد، ابلغ، لبي، اعترف، رحل، ساهم، مسك، كان ضروريا، ادى الى، شمل، حاول، نما، جرى دراسات، اجتذب، حقق، راى من المناسب، نكص، عنون، حاز، جاء، تناول، انتقى",
  "head": "تزعم، دماغ، عريف، قاد سفينة او سيارة، تصدر، قضية، ارشد، مسالة، سافر، سير، وجه، باب، ادار دفة، رييس، ادار، مشكلة، عنوان رييسي، ذهب، مقدمة، راس موضوع، حرك، اتخذ سبيلا ما، وصل، قاد، توج براسية، عنوان، حصد، تراس، توجه، تقدم، رحل، امسك بالدفة، واجه، زعيم، هدى، شيخ، ادار دفة السفينة، عقل، مضى، راس، ساق، ركل كرة",
  "do": "جمل بمستحضرات تجميل، اندفع، اندفع نحو، صنع، حول، برولة، جرى ما هو ضرورى، نجح، زخرف، ادى دور، رقص، انهى، سلك، اكرهه على، تمرن، شن، وصل، سبب، عوض، ادى، عزف، بنى، اعدم، جعل، ضم جهده، اعد للطبخ، مارس، وضع، خدع، غنى، خلق، رد، نظف، اهتم، مثل، تملق، نفد، ايد فكرة ما، اعتبر، كفى، خدم، بدا عملا، قام ب، وفى بالغرض، استمر، صلح للتمثيل، هيا، غلق، قضى، حفلة صاخبة، اتخذ قرارا، تسبب في، احدث، اجاب، عمل، تصرف، فعل، نفذ، احدث اثرا، صادر، قدم خدمة، احتال، اضرم، انتهى، رتب، جرى، حضر، قاضى، تجبر، انتج، انجز، بذل، مثل دور في مسرحية، اسعد، عين، ربح، نجز، تدرب، احرز هدفا، ارتكب، تسبب ب، ادى الى، اسفر عن، تناول",
  "cause": "اندفع، جمل بمستحضرات تجميل، اندفع نحو، صير فى حالة، فاز ب، صنع، دعوى، حول، نجح، زخرف، علة، اغرى، حركة، كسب، انهى، اضطر، حرك، اكرهه على، حصل، شن، وصل، سبب، عوض، اخرج، حيز، ادى، ملك، بنى، عجل الولادة، اثار، استقرى يتتبع الجزييات، جعل، اصاب، ضم جهده، اعد للطبخ، قضية، وضع، اشتمل، زار، خدع، فاز، خلق، نظف، اهتم، تملق، ايد فكرة ما، واسطة، اعتبر، بدا عملا، قام ب، حملة، ادعاء، مسبب، هيا، قنع، نبه، غلق، اقنع، استمال، نشط، دعى، حث، اتخذ قرارا، تسبب في، احدث، انتقم من، دعوى قضايية، تصرف، شكوى، تضمن، باعث، فعل، نال، عامل، نفذ، جلب، استنتج، قدم خدمة، احتال، اضرم، انتهى، رتب، داع، حضر، قاضى، حفز، تجبر، انتج، اسعد، بذل، عين، ربح، نجز، احرز هدفا، ارتكب، تسبب ب، ادى الى، اسفر عن، حاز، تناول",
  "answer": "جمل بمستحضرات تجميل، اعد للطبخ، قدم خدمة، وضع، رد على نار العدو، احتال، نشد بعض الترانيم، استجابة، انتهى، زخرف، خدع، رتب، انهى، رد، نظف، اهتم، انسجم، انتج، بذل، نجز، جواب، اجاب، كفى، استجاب، ارتكب، ادى، اجابة، طابق، فعل، قام ب، تلبية، وفى بالغرض، نفذ",
  "serve": "جمل بمستحضرات تجميل، اعد للطبخ، خدم الجيش، خص، نفع، زود، صفح، ساعد شخص على النزول، قدم خدمة، وضع، ساعد، احتال، مد، قعر، هزم، استهل في التنس، ضرب الكرة، انتهى، زخرف، خدع، رتب، خدم الزباين، اشتغل خادما، انهى، سكب الطعام، قضى، خدم في الكنيسة، ساعد الكاهن، رد، عاون، نظف، اهتم، عزز، ناصر، انتج، جامع البقر، بذل، خدم على المايدة، نجز، اجاب، اتم مدة خدمة معينة، كفى، ارتكب، خدم، ادى، قذم، نقذ، اعد، قدم الطعام، فعل، قام ب، قذم الطعام، وفى بالغرض، قوى، نفذ",
  "act": "اخفى المشاعر، نشاط بشري، جمل بمستحضرات تجميل، اعد للطبخ، باع، تلاعب، تشريع، مثل دور، تجرا، دعا على، قنع، صادر، مارس، نزل، فصل، قدم خدمة، وضع، احتال، دفع الى الامام، تحرك، حرك حجر الشطرنج، انتهى، زخرف، لعب مع، خدع، ادى دور، رتب، روتين، انهى، تجول، تسلى، سلك، تنافس، اشترك في لعبة، مثل، اهتم، نظف، لعب دور، ضحك، فعل انساني، نشاط انساني، نمرة مسرحية، زعم، انتج، لعب، عمل بشري، بذل، تظاهر، قدم اقتراحا، نجز، رحل، فعل بشري، ارتكب، تلاعب بالالفاظ، عمل، خدم، كلام معاد، نافق، تصرف، ادى، عزف، استقر، اثار، تنقل، تصنع، فعل، قانون، قام ب، راءى، بارى، صلح للتمثيل، نفذ، احدث اثرا",
  "down": "خسر، صفى، لمع، انهاه بسرعة، صقل، نظف بشدة، نقى، شذب، هذب، حك، حسن، نقح، دخل تحسينات على، جمل، كبت، كرر، مسح، سقط، جلا، لمع الجلد، جود، نعم",
  "each": "لكل واحد، كل، كل واحد، من كل واحد",
  "early": "باكر، مبكر",
  "easy": "سهل",
  "economic": "اقتصادي",
  "entire": "حصان، جواد  غير مخصي، فحل الخيل، حصان  غير مخصي",
  "plant": "غرب، تسلل، خلق وظيفة، حياة نباتية، هيا المايدة، رقص وجها لوجه، حدد، سدد ضربة، تلاءم، سجل رقما قياسيا، شتل، وضع، نبات، زرع، حرض، ممثل وسط الجمهور، ضبط، سن تشريعات، استهل، دبر، رتب، مصنع، انشا، قرر، جمد، برهن، انشا موسسة، روج الاشاعات، عسكر، تاهب، نبتة، وجب، وازن بين، مصيدة، اوجد، شكل، خبا، الف، عين، اعتبر، بدا، توطيد، رسخ، انجبر للعظم، عرض، اخرج، حدد موعدا، ثبت، ركب، اشتهر، فخ، وطن، وطد، سبك، اسس، منشاة، استقر، غرس، دخر، ربط، غرسة، نصب، غرز، اجبر العظم، تحضن البيض، اقام، رصع",
  "show": "شهد ضد، خلق وظيفة، قدم، علاقة، وصف، شرح، رسم، اعلن، ادى دورا، ظهر عواطفه، اشار الى، اقام الدليل، ابدى، سجل، صور، شهد لصالح، قرر، اختبر، برهن، ظهر، ارى، مثل، اكد، استعرض، عبر، عبر عن عواطفه، تظاهر، قاد، وضح، توطيد، رسخ، عرض، اظهر، طهر، دلى بشهادته، ثبت، اشتهر، قام بمظاهرة، كتب، ظهر بوضوح، استعراض، وطن، وطد، ابدى ملاحظة، اثبت، اسس، شهد، قيد، بين، اقام، دل على، اشار",
  "evening": "رواح، عشاء، عشية، مساء",
  "even": "سطح، سوى، سهل، عشية، زوجي، مساء، مهد، رواح، عشاء",
  "level": "درجة، منزلة، سطح، سوى، نقطة، سهل، مرتبة، مستوى، مرحلة، سطح افقي، رتبة، مهد، طابق، مستوي، طبقة",
  "ask": "ورط، قبل التحدى للمبارزة، استخبر، تعود، لزم، طلب، حمل، التزم، قبل، استدعى، اشترط، توقع، التمس، استعلم، فرض، تطلب، صور، اختار، رافق، حتم، استعاد، استخدم، سال، شارك، قضى، احتاج، طالب، اخذ، انطوى على، استلم، اشترى، وجب، احتل، بدا، استحوذ على، استولى، اسر، استفسر، كان ضروريا، امسك ب، شمل، اقتضى، استلزم، حقق، مطلوب، نال، ادرك، ربط، استمر، تناول، اثر في",
  "look": "توقع، بحث، نظر بتركيز، نظر، تراءى ل، حدق، ظهر، مثل، مظهر، تظاهر، بدا، راى النور، نظرة، راقب، اتضح، انتظر، تطلع، بان، منظر، تعبير الوجه، ترقب، راى، اصدر، تعبير",
  "far": "بعيد",
  "fine": "غرامة، جزاء",
  "firm": "موسسة تجارية، شركة تجارية، شركة",
  "house": "اسرة، اوى، دار، قدم مسكنا، عايلة، احتوى، منزل، اعد منزلا، بيت، شركة، دار  سينما، مسرح، موسسة تجارية، سكن، قدم منزلا، شركة تجارية، مجلس",
  "fiscal": "مالي",
  "following": "ملاحقة، مطاردة، تتبع",
  "foreign": "خارجي، اجنبي",
  "feel": "مس، جس، بدا عند اللمس، اختبر، شعر، تلمس، قاسى، جرب، بدا، وعى، حس، شم، امن، واجه، احس، لمس، عانى، ادرك، لاقى",
  "free": "ترك، حرر، عزل، عرض للبيع، تخلى، حل من عهد، استثنى، اعتق، تخلى عن، حر، تنازل عن، زحزح، سرح، فك، اعفى، انسحب من المعركة، اطلق، خلص، سحب، اصدر، حل، طليق، تحرر، تخلص من، ازاح",
  "front": "واجه، واجهة، الخط الامامي، جبهة، حركة اجتماعية، صارع، جابه، حركة، مقدمة، جبهة القتال",
  "movement": "تحرك، رحلة، مسيرة، حركة اجتماعية، جبهة، حركة، تنقل، نقل، هجرة، سفر، انتقال، حملة",
  "further": "دعم، رفع، روج، شجع، عزز",
  "future": "مستقبل",
  "game": "صيد، مباراة، لعبة، خطة، موامرة",
  "general": "عام، جنرال",
  "give": "باع بخسارة، ورط، اهمل، فرض، سير، حول، كشف نفسه، نجح، تجلى، صرف، وصل، ملك، هدى، اعد، قدر على شراء شىء، قدس، وقف، تغاضى، حدث، ترشح، قدم، مر الكرة للاعب اخر، تخلى عن دوره في اللعب، ودع، اقترف، انقطع، كرس وقته، منح، رد، مد يده للوصول ل، امتد، سدد حسابه، رسم كاهنا، هدى كتاب، اقر ب، فدى، اعلن مقدسا، وقف لغرض ما، قدر، ضحى، اتصل، اجتاز بنجاح، تبادل، اعطى، سد دينه، نقل، سلم، انتقل الى، بسط، قضى، تبرز، قدم نفسه، تجاوز، تفانى، الغى اعلان، سلم باليد، مرر، دفع، تغوط، تاول، حلف بالزور، وفى، رخي حبلا، عمل، خصص، كان في متناول اليد، تبرع، تحمل، شق طريقه، نفذ، مات، بلغ، احاطه بهالة، عقد، حضر، قلد، عبر، انتج، ربح، كرس، عرض، رحل، جهل، ارتكب، ساهم، اهدى، قرب باضحية، مر، وهب",
  "present": "قدم، جلب، احتج، شرح، اعطى، قابل، ناب، وجه، منح، عرف، حضر، تجلى، برهن، ظهر، قلد، مثل، قدم نفسه، صرح، استعرض، طلع، تظاهر، وضح، عرض، اظهر، كافي، ادى التحية العسكرية، حيا، واجه، هدى، الوقت الحاضر، اهدى، الان، نظم مسيرة احتجاج، اعلن، ترشح",
  "hand": "مات، بلغ، قدم، اتصل، مر الكرة للاعب اخر، قدرة، اهمل، يد، تخلى عن دوره في اللعب، اجتاز بنجاح، تبادل، اعطى، نقل، سلم، سير، انتقل الى، براعة، نجح، بسط، تبرز، مد يده للوصول ل، مساعدة، امتد، تجاوز، الغى اعلان، عبر، وصل، سلم باليد، مرر، تغوط، تاول، رحل، جهل، كف، اقر ب، كان في متناول اليد، اعد، اوراق، شق طريقه، عون، تغاضى، مر، حدث",
  "reach": "اندفع، اهمل، اندفع نحو، صنع، سير، حول، نجح، كسب، اكرهه على، شن، سدد، وصل، صدم، عوض، وفق الى، بنى، اعد، جعل، تغاضى، اصاب، حدث، انتصر، قدم، مر الكرة للاعب اخر، احرز، تخلى عن دوره في اللعب، كمل، اتم، فاز، خلق، مد يده للوصول ل، تملق، امتد، اعتبر، وجد، ارتطم، اقر ب، صد، اكتسب، بدا عملا، هاجم، هيا، اتصل، اجتاز بنجاح، تبادل، توصل الى، اعطى، اصاب الهدف، نقل، سلم، متناول، انتقل الى، حصل على، بسط، غلق، قضى، تبرز، ازداد، تجاوز، الغى اعلان، اتخذ قرارا، سلم باليد، مرر، تغوط، تاول، احدث، وصل الى، تصرف، كان في متناول اليد، لاقى نجاحا، ضرب، فعل، نال، شق طريقه، مات، بلغ، مجال، اكتشف، اضرم، حضر، حقق انتصار، تحصل، تجبر، عبر، انتج، بلغ هدفا، اسعد، انجز، عين، ربح، نجز، توافق مع، احرز هدفا، رحل، جهل، حقق، تناول، مر، اجتاز",
  "given": "مهدى، معطى",
  "go": "باع، تجربة، تخمد، كف عن اداء وظيفته، اهمل، خذل، انتمى، سافر، سير، نجح، قال، استطلع الاراء، ضحك، عرف ب، واصل، قدم اقتراحا، اخمد، فلس، ادى، اعتزم، استقر، اثار، امر، اعد، فني، تغاضى، انطلق، اعلن، ناسب، حدث، صوت، مر الكرة للاعب اخر، ذهب الى، مشى، عبر عن ارايه بحرية، تخلى عن دوره في اللعب، نزل، بهت، كمل، دفع الى الامام، قاس الاعماق، منح، خرج، زار، اضعف، فقد، سبر غور، نجا، امتد، انهار، اخذ سبيله للا نجاز، بدا، سقط، طاف، اقر ب، تعطل، هلك، تنقل، سبر، تعفن، استمر، صار، عاد، اصدر من، تحرق شوقا، تردد، قنع، اجتاز بنجاح، تبادل، خرج من الدنيا، محاولة، فحص الصدر بالسمع، سمع، انتقل الى، ذهب، اصدر صوت، تبرز، شغل، شرع، تجاوز، الغى اعلان، تنقضي، غادر المسرح، بقي، قاد، مرر، لجا، تغوط، سقط في امتحان، احدث، استهلك، عمل، اخسر، اصبح، تصرف، قصر عن، نشر، راح، زفر، شق طريقه، انقرض، فحص، لفظ النفس الاخير، نفذ، بوق، مات، ساعد على، انتقل الى الرفيق الاعلى، فشل، انتشر، تخلى، غادر، تحرك، انتهى، ادار، سير في موكب، مات من الجوع، تجول، بات، قاضى، اصبح لا مباليا، موت، عبر، لعب، رن، دار، سلم الروح، تقدم، رحل، ثبت، جهل، قرع، نادى على، اعطي، انبثق عن، رفع دعوى قضايية، مضى، اصبح اقل تعرضا، مر، توقف",
  "move": "باع، طعن، قدح النار، سافر، استهل فجاة، حول، جذب الصنارة لا قحام الشص، ادى دور، حركة، حرك، ختم، قال، ضحك، اقتلع، عرف ب، واصل، حرك المشاعر، قدم اقتراحا، صدم، صادر للمصلحة العامة، رحلة، ادى، عزف، اعتزم، استقر، اثار، انطلق، لكم، اصاب، اثر في، حدث، بدا في السباحة، مشى، نزل، فصل، شن غارة، دفع الى الامام، خرج، زار، ولع ب، مثل، تظاهر، الف، خطوة، طاف، خدم، تنقل، هاجم، سفر، استمر، صلح للتمثيل، طبع في الذهن، قنع، دمغ، سمع، ذهب، شرد، اصاب بذعر، كافح، نشط، تكلف، اثر، لجا، هجرة، انتقال، استهلك، عزل من منصب، اصبح، تصرف، ضرب، اشتعل، وصل لاتفاق، نفذ، احدث اثرا، ازاح، ساعد على، مبادرة، اكتشف، غادر، تحرك، وقع، تجول، انتقل، عجب، قلد، تجبر، لعب، رن، دار، رحل، حل محل، مسيرة، نزع الى، صرع، لدغ، مضى، استبدل، صك العملة",
  "become": "اصبح، بات، صار",
  "run": "دخل، تسرع، تجربة، تهدل، بدد، ارتفع، تلاشى، طارد، طبع، انصهر، غاب عن الذاكرة، سوق بسرعة، اطعم، ظل نافذ المفعول، انبعث، لقم، عجل، تكرر، خاض معركة، اكل، ادى، اذاب، بدا العدو، ارتشح، قاد السيارة، شجع، حدث، ترشح، افلت، جري، مال، نما بسرعة، طعم، نسل، اشبع، سباق العدو، سال، نجا، صهر، ميع، امتد، ولى هاربا، هرب، هرول، سحب، عدا، قطع جريا، رضى، فاض، ايد ترشيح، فر، غذى، تدفق، ولى الادبار، شغل، قاد، مرر، تراس، عمل، رق، نشر، غمر، ركض، نحل، فحص، انزلق، قطع ركضا، صفى، ذاب، سجل نقطة في البيسبول، انتشر، صنف الاوراق، تصفح بسرعة، اجتاز بسرعة، ادار، جرى، وقع، اقتات، عبر، صب، دار، تنسيل، انسل، حكم، نزع الى، تدلى، تخلص من، رسم خطا",
  "sound": "ساعد على، تردد، صوت، مشى، مضيق، عبر عن ارايه بحرية، سافر، فحص الصدر بالسمع، غادر، سمع، قاس الاعماق، خرج، ذهب، اصدر صوت، سبر غور، استطلع الاراء، قال، رن، عرف ب، دار، بدا، لجا، استهلك، اصبح، قرع، ادى، فحص، نادى على، صوت كلامي، اعتزم، امر، سبر، مضى، انطلق، اعلن، حدث، حس سمعي، بوق",
  "function": "نفع، دالة، دور، ادار، روتين فرعي، اشتغل، ادى وظيفة، شغل، دار، وظيفة، مهمة، خدم، عمل، ادى، استعمال، مناسبة، ادى مهمة، اقتران، فايدة، مناسبة اجتماعية، حدث",
  "work": "صاغ، صنع، دلك، حول، حمض، زور، احرز مكانة، اشتغل، لحس، كون فكرة، واصل، شكل، انطلق بسرعة، ادى، انطلق باقصي سرعة، اثار، لفق، انطلق، حدث، توصل، درب، جرى بقوة، كيف، برز، اتخذ شكلا، مولف، الف، صمم، وظيفة، سخر، سكب، حل، مص، تعفن، زيف، لعق، اعمال، هزم، استغل، تكوين، عرف، انشا، قرر، شغل، سدد من طريق العمل، اثر، اجتهد، اعد من طريق التحويل، تفوق، تطور، مكان عمل، عمل، وجد حلا، حل مسالة، نظم، فعل، تشكل، عمل في دكان حداد، سدد دين، ذاب، جبل، انتاج، اكتشف، احتال، ادار، رتب، جسد، نتاج، عالج، غير، دار، كون، تقدم، فسد، تابع، خمر، صاغ اللغة، طرق الحديد، تالف، عجن، تخمر",
  "live": "عمر، كمن في كذا، معن النظر في، نزل، حيي، وقع، اقتات، نجا، شغل، طبق، بقي، كان في مستوى، بث على الهواء، سكن اقام، اسهب في التفكير، كمن، يوجد، قضى حياته، ثبت، كان ب، كان، قطن، عاش، اقام ب، اقام، سكن، خلد",
  "going": "انتقال الى رحمة الله، فقدان، رحيل، فقد، انقضاء اجل، ذهاب، انتهاء اجل، فراق، مغادرة، وفاة",
  "good": "صلاح، خير، بضاعة، سلعة",
  "greater": "اعظم، اضخم",
  "growth": "نضج، نمو، نضوج، زيادة، خراج، ورم، ازدياد، ارتفاع، تطور، تعاظم",
  "growing": "نضج، نمو، نضوج، نام، تطور",
  "development": "نضج، نمو، تنمية، تظهير، نضوج، استثمار، تطوير عمراني، تسخير، تحميض، استغلال، تطور، استخدام، تطوير",
  "turn": "دعا، دوران، طرد، تبدل، انعكس، ابطل، قدم خدمة، فصل، انحرف، ابعد، دور، عكس الاتجاه، خلع، حول، التوى، حمض، طلب من، روتين، سال، التفت، انقلب، حرك، تحرك في الاتجاه المعاكس، التوى في الكاحل، بدل، رجع، التفاف، وثا، نمرة مسرحية، لعب، حام حول، الغى، غير، دار، تحول، كلام معاد، قلب، عكس، تخمر، فسد، خمر، قاد الى الوراء، لف، انعطف، اثار، لفة، شوه، دورة، استدار، تخلص من، لوى، ارتد",
  "farm": "زرع، انتج، ربى، مزرعة",
  "half": "نصف، فاصل، منتصف",
  "hear": "علم من طريق السماع، بلغ، اصلح، تدبر، درس، رفع، لاحظ، اكتشف، كشف عن، حفر، بحث، سمع، علم، كشف، استعاد صحته، زار، اعتقل، عرف، اصغى، رافق، التقط، تيقن، عمل بحمية، تعلم، عنى، حفظ عن ظهر قلب، نشط، شاهد، علا، استانف، اعتبر، تعيش، سمع الدعوى، تصور، وجد، حمل الركاب، عمل، تعرف لاصدقاء، تخيل، لمح، تحمل، حقق، تلقى، راى، بصر، ادرك، اقتنى، فحص، سمح، فضى ب، اولى الامر عناية، فهم",
  "heavy": "زايد الوزن، ضخم، ثقيل، شديد، وافر",
  "control": "ابقى، هيمنة، تمكن، تمالك نفسة، سحب مالا، لزم، حمل، سيادة، ودع، اشتمل، وجه، اجادة، ضبط، سيطرة، تحكم، اهدا، لين، عقد، قيادة، حبس النفس، ساوى، رسم مربعات، كافح، عرض الخصم للخطر، ضام، مد يده، وسع، احتفظ، شغل، قمع، لطف، هيمن، وصل، قاد، قبض على، كبت، شكم الفرس، احبط، حكم، قاوم، امسك، سلطة، راقب، صمد، كتم، وبخ، ملك، اوقف، دعم، فحص، تضمن، هدا، قيد، احتوى، سيطر، حفظ، حقق، عنف، كبح، نظم، اتسع، راس، استمر، تحكم في",
  "home": "اسرة، مكان، عايلة، منزل، بيت، بلد، مسكن، سكن، مقر",
  "family": "اسرة، وحدة عايلية، نوع، قوم، اهل، فصيلة، قرابة، عشيرة، ذنابة، جنس، قريب، منزل، بيت، صنف، عايلة",
  "hot": "ساخن",
  "man": "بشر، انسان، عاشق، حبيب، زوج، رجل، شخص، محبوب، ذكر، خليل، عالم، مرء، جندي، قرين، امرو، عامل في الجيش، عسكري",
  "human": "بشر، انسان، ادمي، بشري، انساني",
  "in": "بوصة، انش",
  "increase": "نمو، ريع، اضافة، رفع، اشتد، زيادة، نما، نمى، زاد، ازدياد، ارتفاع، تعاظم، تكاثر، ازداد، تزايد، كبر",
  "increased": "زايد، متزايد",
  "person": "مخلوق، انسان، صيغة، نفس، احد ما، شخص، جسد، روح، فرد، شخص ما",
  "individual": "مخلوق، انسان، نفس، احد ما، شخص، روح، فردي، فرد، شخص ما",
  "industrial": "صناعي",
  "inside": "جوف، باطن، داخل",
  "interest": "من اجل، متعة، سلوى، رغبة، اهتمام، غاية، تسلية، رغب، اثار اهتمام، غرض، مصلحة، سبيل، لهو، اهتم، حث، تشويق، اعتنى، سهم، اصحاب المصالح، شغف، فايدة، اثار انتباه، حصة، ربا، قصد",
  "interested": "مهتم، راغب",
  "need": "ورط، قبل التحدى للمبارزة، تعود، ضرورة، لزم، طلب، حمل، التزم، قبل، عاز، استدعى، اشترط، عوز، التمس، فرض، تطلب، صور، حافز، داع، اختار، رافق، حتم، استعاد، استخدم، سال، شارك، قضى، احتاج، طالب، دافع، اخذ، افتقر الى، انطوى على، استلم، اشترى، وجب، حاجة، احتل، بدا، اعوز، احتياج، استحوذ على، استولى، اسر، كان ضروريا، امسك ب، شمل، اقتضى، استلزم، باعث، حقق، مطلوب، نال، ادرك، ربط، استمر، تناول، اثر في",
  "demand": "مطلب، ورط، قبل التحدى للمبارزة، تعود، ضرورة، لزم، طلب، حمل، التزم، قبل، استدعى، اشترط، عوز، التمس، فرض، تطلب، صور، اختار، رافق، حتم، استعاد، استخدم، سال، شارك، قضى، احتاج، طالب، اخذ، متطلب، انطوى على، استلم، اشترى، وجب، حاجة، احتل، بدا، احتياج، استحوذ على، استولى، اسر، كان ضروريا، امسك ب، شمل، اقتضى، استلزم، حقق، مطلوب، نال، ادرك، ربط، استمر، تناول، اثر في",
  "involved": "مشترك، متورط",
  "kind": "نمط، نوع، شكل، ضرب، صنف",
  "sort": "انفصل، ميز، شرح، ترتب، انسحب، افترق، فصل، صنف، تفكك، رتب، عرف، قطع، احتل مكان في طيقة، انتظم في طبقة، شكل، بوب، قسم، تفرق، فرز، نمط، نوع، وزع، عزل عن بقية، ضرب، فرق، استخلص، نظم، عاشر، عنون، فك، فهم",
  "form": "جعله ذا بنية عضوية، صاغ، عمل في دكان حداد، زيف، صف مدرسي، جرى بقوة، هيكل، احتال، صنف، بدن، تكون، حول، كيف، تكوين، ادار، برز، زور، اتخذ شكلا، رتب، احرز مكانة، انشا، اشتغل، جسد، هيية، تعضي، سدد من طريق العمل، شغل، مثل، مظهر، كون فكرة، بنية، صف، جسم انسان، نشا، غير، شكل، كون، جسم فيزيايي، الف، عين، اعد من طريق التحويل، تنظم، صمم، تقدم، تطور، تنظم في نقابة، نمط، شكل كلمة، نوع، حل مسالة، اسس، ضرب، اثار، لفق، صاغ اللغة، سكب، طرق الحديد، فعل، نظم، جسد انسان، تعفن، صورة، انضم الي نقابة، تالف، حدث، تشكل",
  "know": "شغف ب، طرف، عرف شخص، لوى، ميز، تلوى، خبط، عشق، اجاد، جامع، ضرب بعنف، لاحظ، غلق بقوة، قص شعر الناصية، علم، اصلح بالمفك، هزم، نجح، تلفظ بحماقات، عرف، نكح، ولع ب، عرف جيدا، اضاع الوقت، برهن، شاطر، ولع، ضغط، قذف بقوة، غازل، دار، تلولب، ترنح، حدث ضجة عالية، ضاجع، اتصل جنسيا، قرع، اتهم، لولب، هوى، ايقن، فتن، غرس، نام مع، عانى، درى، ادرك، فهم",
  "love": "شغف ب، طرف، عرف شخص، لوى، تلوى، ميز، خبط، عشق، هوي، جامع، ضرب بعنف، لاحظ، غلق بقوة، قص شعر الناصية، احب، اصلح بالمفك، علم، هزم، نجح، تلفظ بحماقات، معشوق، عرف، نكح، ولع ب، برهن، اضاع الوقت، شاطر، عرف جيدا، ولع، ضغط، قذف بقوة، غازل، عزيز، دار، تلولب، ترنح، محبوب، حدث ضجة عالية، ضاجع، وجد، اتصل جنسيا، قرع، اتهم، لولب، هوى، حب، حبيب، فتن، غرس، غزيز، نام مع، درى، عانى، فهم",
  "bed": "شغف ب، طرف، عرف شخص، لوى، تلوى، ميز، خبط، عشق، جامع، ضرب بعنف، لاحظ، غلق بقوة، قص شعر الناصية، اصلح بالمفك، علم، هزم، نجح، تلفظ بحماقات، عرف، نكح، ولع ب، طبقة، برهن، اضاع الوقت، شاطر، عرف جيدا، ولع، سرير، ضغط، قذف بقوة، غازل، دار، رقد، تلولب، ترنح، حدث ضجة عالية، ضاجع، اتصل جنسيا، قرع، اتهم، لولب، هوى، فتن، غرس، نام مع، درى، عانى، فهم",
  "known": "محدد، معروف",
  "death": "نهاية، هلاك، نحب، اجل، ممات، قتل، منية، زوال، تلاش، موت، وفاة",
  "put": "غرب، فتل، صاغ، فرض، ضبط، دبر، روج الاشاعات، انجبر للعظم، اخرج، ركب، اخمد، قذف الكرة، استقر، عين شخصا في وظيفة، القى اللوم على فلان، حدث، برم، طلب، حدد، تلاءم، راهن، وضع، طرح، كان في موقع، خدع، رجع، وقف امام الفنان ليرسمه، نسب، تظاهر، بدا، اعتبر، كمن، مجد، اربك، اسس، وضعه فى موضع معين، دخر، تحضن البيض، يوجد عملا ل، رصع، عزا، رقص وجها لوجه، دفن، سجل رقما قياسيا، حرض، استهل، اقترح، بسط، قرر، جمد، حول ملكية، تكلف، حدد موعدا، خصص، نظم، ربط، فاز بمرتبة مرموقة، هيا المايدة، رسم، ميز شخصا، استثمر، صنف، زرع، تخلى، طرح سوالا، رتب، وقع، تاهب، وازن بين، كون، عين، عرض، ثبت، وظف اموالا، خلق مشاكل، تصنع للطبيب، اجبر العظم",
  "position": "غرب، فتل، مركز، صاغ، فرض، ضبط، دبر، موضع، روج الاشاعات، انجبر للعظم، اخرج، ركب، اخمد، قذف الكرة، استقر، عين شخصا في وظيفة، القى اللوم على فلان، حدث، برم، وقفة، طلب، حدد، منظور، تلاءم، راهن، وضع، طرح، كان في موقع، خدع، وضعية، موقف، وجهة نظر، وقف امام الفنان ليرسمه، تظاهر، بدا، بدلا من، اعتبر، كمن، وظيفة، مكانة، اربك، اسس، وضعه فى موضع معين، دخر، تحضن البيض، يوجد عملا ل، رصع، علاقة مكانية، منصب، رقص وجها لوجه، دفن، سجل رقما قياسيا، حرض، استهل، اقترح، بسط، قرر، جمد، تكلف، نظرة، حدد موعدا، مكان، نظم، ربط، فاز بمرتبة مرموقة، موقع، هيا المايدة، رسم، ميز شخصا، استثمر، صنف، زرع، طرح سوالا، رتب، وقع، تاهب، وازن بين، عين، عرض، ثبت، خلق مشاكل، موقع عسكري، تصنع للطبيب، اجبر العظم",
  "lay": "غرب، فتل، صاغ، استند، سند، فرض، ضبط، دبر، روج الاشاعات، اعتمد، انجبر للعظم، اخرج، ركب، اخمد، قذف الكرة، استقر، اضطجع، عين شخصا في وظيفة، القى اللوم على فلان، حدث، برم، طلب، حدد، تلاءم، راهن، وضع، طرح، كان في موقع، خدع، وقف امام الفنان ليرسمه، تظاهر، بدا، اعتبر، كمن، القى، اربك، اسس، وضعه فى موضع معين، دخر، تحضن البيض، يوجد عملا ل، رصع، استراح، رقص وجها لوجه، دفن، سجل رقما قياسيا، مد، حرض، استهل، اقترح، بسط، قرر، جمد، تكلف، حدد موعدا، نظم، ربط، فاز بمرتبة مرموقة، هيا المايدة، رسم، ميز شخصا، استثمر، صنف، زرع، طرح سوالا، رتب، وقع، تاهب، وازن بين، رقد، عين، عرض، ثبت، خلق مشاكل، تصنع للطبيب، اجبر العظم، سكن",
  "read": "قبل التحدى للمبارزة، قرا على عجل، قرا الطالع، تعود، درس، حمل، قبل، تفحص، اكتشف، اشار الى، طالع، بحث، سمع، علم، قرا بين السطور، تطلب، صور، عمل بحمية، اختار، رافق، استعاد، تعلم، شارك، طلع على، قال، حفظ عن ظهر قلب، فسر، انطبق على موازيين العروض، اخذ، استلم، اشترى، عزف لحنا، احتل، بدا، راجع دروسه، دل، استحوذ على، استولى، اسر، كتب، امسك ب، قرا، اقتضى، حاول، تامل، قرا بتمعن، ترجم، فهم، جرى دراسات، بحث عن هدف بالرادار، حقق، نال، قيد، ادرك، تصفح، استمر، تناول، سجل، دل على، اشار، قطع الشعر",
  "left": "اليسار، الشمال",
  "leave": "مات، عهد به الى، ترك، خرج ب، نسى، زود، اورث، اوصى، اتمنى، وصى بوصية، وصى، اشترط، اذن بالغياب، اودع، ودع، اذن، مد، اعطى، حيد، انصراف، سلم تراثا، انحرف، سافر، تخلى، غادر، فراق، اتاح، وضع شروط، خرج، ذهب، رغب، توديع، قام، موت، وداع، غادر المسرح، تاهب، هجر، اراد، نزح، انصرف، شاء، عهد الى، تزود، فوض، صمم، رحل، خلف، ورث، احتاط، ادى الى، اجازة، اسفر عن، نسي، مضى، جهز، نص على، سمح، ايتمن",
  "provide": "قدم، ترك، زود، ذاب، اشترط، قدم خدمة، مد، اعطى، صير، سلم، غذى، اتاح، وضع شروط، قدم مساعدة، ملط الطين، غنى، رد، رجع، اثث، سمح، تاهب، تمون، سلم رسالة، سد حاجة، عين، تزود، امد، قدم الحساب، اشبع رغبة، احتاط، عزف، قدم الطعام، سكب، جهز، نص على، زود الطعام، دهن، طلى، شكر",
  "result": "تاثير، تبعة، ادى الى، اسفر، ترك، خرج ب، نتيجة، اسفر عن، حصيلة، نشا بوصفه نتيجة، عاقبة، نتيجة نهايية",
  "will": "ترك، اوصى، اورث، نسى، وصى بوصية، وصى، وصية، سلم تراثا، سافر، تخلى، غادر، ذهب، رغب، اراد، هجر، شاء، صمم، ورث، مضى",
  "degree": "درجة، شهادة، منزلة، نقطة، درجة علمية، مرتبة، مستوى، مرحلة، رتبة، شهادة علمية، درجة اكاديمية",
  "stage": "درجة، نقطة، مرتبة، مستوى، مرحلة، رتبة، مسرح، خشبة المسرح، شوط، فترة",
  "floor": "طابق، ارض، ارضية، طبقة",
  "story": "وصف اخباري، رواية، طابق، حكاية، طبقة، سرد، تار يخ، تقرير، قصة اخبارية، تقرير اخباري، قصة",
  "light": "احرق، فكك، نزل، لمعان، سطوع، اشراق، قداحة، اضاء، انار، نزع، وضح، اضاءة، اشعل، سقط عن ظهر جواد، ضوء، مقداح، ترجل، فك، انكب، ركز التفكير",
  "wish": "اشتهى، مال الي، تشابه، مال، رغب في، وصى بوصية، ود، رغبة، ابتغى، رغب، مراد، امنية، عزم على، بغى، اراد، اعتنى، شاء، فرض عليه، تاق الى، صمم، ورث، مبتغى، حب، تماثل، مرام، تاق، رام، تمنى",
  "care": "اشتهى، ناور، مال الي، تشابه، مال، حماية، صون، مس، رعاية، ود، مبالاة، مراعاة، ابتغى، اهتمام، نجح، ادار، صيانة، رغب، حرص، تاجر، بحث في، عنى، اقتصد، عالج موضوعا، اهتم، روض، اراد، تعامل، اعتنى، عالج، تعهد، قاد، فرض عليه، وقاية، وجد، تعامل مع، اكل، واجه، عناية، تصرف، عامل بطريقة خاصة، حب، تماثل، وزع، تاق، عني، رام، اهتم ب، تاجر ب، خوف، قام ب، لمس، تمنى",
  "like": "اشتهى، مال الي، تشابه، مال، ود، ابتغى، احب، نفس، رغب، مثل، اراد، اعتنى، فرض عليه، وجد، مماثل، مرادف، حب، تماثل، مساو، تاق، رام، تمنى، مكافي",
  "same": "ذاته، نفس، مساو، عينه، نفسه، مرادف، مماثل، مثل، مكافي",
  "likely": "على الارجح، ربما، من المرجح، محتمل، من المحتمل، متوقع، من المتوقع، على اغلب الظن",
  "probably": "على الارجح، ربما، من المرجح، من المحتمل، من المتوقع، على اغلب الظن",
  "small": "مجهري، دقيق",
  "little": "مجهري، دقيق",
  "be": "احتفظ ببقايه، احتج، شرح، كلف، ناب، حيي، ذهب، عادل، سن تشريعات، ساوى، انشا موسسة، اضحى، مثل، صرح، استعرض، بقي، كون، شكل، الف، عين، وضح، يوجد، وجد، كان، اصبح، عاش، نصب، اعلن، نظم مسيرة احتجاج",
  "life": "معيشة، عمر، سجن موبد، ترجمة، قصة حياة، حركة، سيرة، روح، حياة شخص، فترة حياة، همة، تاريخ حياة، سجن مدى الحياة، مدة حياة، حياة، حيوية",
  "living": "معيشة، مفعم بالحياة، حياة، حي",
  "long": "تحرق شوقا، حن، رثى ل، سفق على، تاق، اشتاق",
  "looking": "نظرة، نظر",
  "appear": "نظر بتركيز، نظر، تظاهر، بدا، تراءى ل، اصدر، حدق، راى النور، ظهر، جاء، راقب، مثل، اتضح، بحث",
  "seem": "نظر بتركيز، نظر، تظاهر، بدا، تراءى ل، اصدر، حدق، راى النور، ظهر، راقب، مثل، اتضح، بحث",
  "hit": "دون، اندفع، طعن، اندفع نحو، صنع، قدح النار، ذبح، تصادم، استهل فجاة، حول، نجح، جذب الصنارة لا قحام الشص، رطم، كسب، اكرهه على، شن، سدد، وصل، صدم، عوض، قتل، اصابة، حسب النقاط، عزف، وفق الى، بنى، جعل، لكم، جدول، اصاب، انتصر، بدا في السباحة، قدم، قذف، نجاح باهر، اصطدم ب، احرز، شن غارة، فاز، خلق، مد يده للوصول ل، تملق، امتد، اعتبر، دق، وجد، ارتطم، صد، بدا عملا، سجل اصابة، هاجم، حسب، هيا، اتصل، اصاب الهدف، جعله مطابقا، سمع، بسط، غلق، اصاب بذعر، كافح، اصطدام، ازداد، اتخذ قرارا، تاول، احدث، وصل الى، تصرف، كان في متناول اليد، لاقى نجاحا، ضرب، اشتعل، فعل، نال، وصل لاتفاق، سجل، بلغ، اكتشف، نجاح، اضرم، طابق الارقام، حضر، وقع، حقق انتصار، عجب، تحصل، تجبر، سجل نقطة، ارتطام، انتج، رن، اسعد، عين، ربح، اطلق، نجز، حصد، توافق مع، احرز هدفا، قرع، صرع، ابتلى، عد، لدغ، حقق، ضربة، صك العملة، تناول",
  "ready": "غرب، ورط، اندفع، اندفع نحو، صنع، حول، نجح، ضبط، دبر، روج الاشاعات، اكرهه على، شن، القى المسولية، وصل، رسخ، عوض، انجبر للعظم، اخرج، اعاق، ركب، بنى، اعد، استقر، جعل، حدد، تلاءم، عدل، وضع، استعد، خلق، تملق، بدا، اعتبر، بدا عملا، اسس، لصق، دخر، حل، جهز، تحضن البيض، رصع، طبخ، هيا، اعد حضر، رقص وجها لوجه، سجل رقما قياسيا، حرض، استهل، قرر، غلق، جمد، اتخذ قرارا، احدث، انتقم من، حدد موعدا، تصرف، نظم، فعل، ركز، ربط، اصلح، هيا المايدة، تلاعب، شفى، اضرم، رتب، حضر، تجبر، طها، تاهب، انتج، عالج، وازن بين، اسعد، اعطى الشىء شكلا، عين، ربح، احرز هدفا، عرض، ثبت، تناول، اجبر العظم، وقع في ورطة",
  "main": "عرض البحر",
  "major": "تخصص",
  "many": "كثير، عديد، متعدد",
  "married": "متزوج",
  "material": "مادي، بدني، نسيج، جسماني، مادة، قماش، ماذي، شيء",
  "mean": "قدر، اعد لغرض، عنى، ظن، مثل، اراد، اعتنى، دل، فكر، استتبع، اعتقد، اعد لغرض ما، استوجب، نوى، فكر مليا، المتوسط، اوجب، تخيل، اعتزم، تامل، استلزم، ضمر، بين، قصد، اشار",
  "meaning": "معنى، مغزى، غرض، قصد، جوهر، مدلول",
  "medical": "طبي",
  "meet": "استلف، تعرف، مس، تصادم، اثار الشفقة، عنى، انهى، استخدم، ماثل، جمع، مجموعة، وصل، حرك المشاعر، تصور، عوض، وفى بمطالب، لم، التقى ب، دفع القيمة، تبنى، ادى، زود بمعلومات، لمح، اعد، اتخذ شكلا او مظهرا، ادرك، ناسب، كافا، اثر في، جنى، اتخذ، تدبر، طعم، وافق، زود، التزم، مارس، بحث، ضرب ضربا خفيفا، اجتمع، اتم، زار، سال، جاور، اتحد، اخذ، ضلع، شاهد، نسق، التقى، اعتبر، ردم، قارن، قبل التحدى، تجمهر، وضع المسات الاخيرة، تعرض للموضوع، حسب، رضى، حاذى، جهز، لبى، اولى الامر عناية، لايم، اتصل، ناغم، قابل، اصاب الهدف، ركب دواء، تجمع، دخل في علاقة، حشا السن، سر، استجمع، عرف، رافق، تطابق، راجع، شغل، امتلا، تقابل، حشد، تحدى، عمل، لامس، ملا، تحمل، لمس، بصر، فحص، بارى، فهم، نفذ، اصلح، تعود، انتفخ، لاحظ، صادف، جس، انسد، استقطب، هذب، تكيف، وفى بمطالب او شروط، لاعب، تلاقى، تيقن، وفى ب، تعلق، لاءم، وفى بالمرام، تماشى، ارتبط بعلاقة مع، سد، نجز، ارضى، التام، مس مسا خفيفا، واجه، انطبق على شكل، تخيل، نما، حقق، راى، سمح، توقف، لاقى",
  "play": "خاطر، حالة لعب، تحرر، اتخذ، تعرف، تعود، تلاعب، مثل دور، التزم، مزايدة، مسرحية، راهن، صادف، قابل، اطلاق العنان، قمار، تصادم، دور، اجتمع، حرك حجر الشطرنج، لاعب، لعب مع، مقامرة، مبارزة، خدع، ادى دور، فترة اللعب، مرح، لها، استخدم، تسلى، تنافس، اشترك في لعبة، مثل، اتحد، لعب دور، وفى بالمرام، لعب، عبث، تلهى، التقى، قامر، تقابل، عرض، تحدى، خطة لعب، تبارز، التقى ب، دفع القيمة، تلاعب بالالفاظ، خدم، قبل التحدى، واجه، تبنى، تصرف، مناورة، شوط، عزف، مزاح، اتخذ شكلا او مظهرا، بارى، صلح للتمثيل، ميسر، لاقى، نفذ، احدث اثرا",
  "military": "الة الحرب، قوات مسلحة، حربي، جيش، عسكري، خدمة عسكرية، عسكر",
  "modern": "حديث",
  "moral": "اخلاقي",
  "moving": "متحرك",
  "national": "مواطن، قومي، وطني",
  "subject": "موضوع البحث، قدم، فرع، حالة، مواطن، موضوع، مسالة، خنزير غيني، سلم",
  "necessary": "لازم، اساسي، واجب، ضروري، مهم، فرض، متطلب",
  "want": "اشتهى، طلب، عجز، عاز، اصبح فريسة الفاقة، رغبة، طارد، تطلب، افتقار، رغب، انعدام، مراد، احتاج، اراد، نقص، مبتغى، مرام، استلزم، مطلوب، تاق، تعين",
  "new": "جديد",
  "next": "في المرة التالية، بعد ذلك مباشرة، ثم، بعدها، ثم بعد ذلك، بعد ذلك، بعد هذا",
  "no": "كلا، لا",
  "normal": "تقليد، قاعدة، اسلوب، نظامي، طبيعي، عادي، قياسي، عادة",
  "pattern": "غرار، تقليد، نمط، شكل، قاعدة، اسلوب، رسم، صورة، زخرفة، عادة، نموذج، زينة",
  "nuclear": "ذري، نووي",
  "off": "قتل، ذبح",
  "old": "قديم الزمان، الماضي، قدم",
  "open": "مد، كشف، شق، اسس، انفتح قليلا، استهل، افتتح، نشر، اطلق، انفتح، انفتح على، تفتح، حرر، ابتدا، افضى الي، فتح، استفتح",
  "original": "اصلي، نسخة اصلية، اصيل، مبتكر، جديد، اصل",
  "out": "نشر، ظهر",
  "outside": "الخارج",
  "own": "ملك، قدم اعترافات، حاز",
  "paid": "مدفوع",
  "particular": "خاص، تفصيل، جزء",
  "specific": "خاص",
  "past": "ماضي، الماضي، الايام الخالية، سابق، ماض",
  "rate": "ثمن، قدر، طلب، ميز شخصا، اعطى درجة، وضع، صنف، استثمر، رتب، اعطى رتبة، وقع، سرعة السير، سعر، معدل، اعطى علامة، سعر الوحدة، سرعة التقدم، عين شخصا في وظيفة، يوجد عملا ل، تعريفة، فاز بمرتبة مرموقة، حدث",
  "range": "دخل، صوب، ترحل، تلوى، اعطى درجة، تسكع، تمايل، هيية، تدحرج، تعرش، خرج في نزهة، جاب، شكل، تشكيلة، طفا، ضرب الارض، وزع، تحدث على نحو مفكك، عين شخصا في وظيفة، حدث، انضم، قذف، طلب، تسول، سافر كثيرا، ترصن، وضع، رمى، قرع الطبل، اختار دورا للممثل، جول، خرف، رعى الماشية، دوى، امتد، واصل سيره على القدمين، حظ، نسق، اضاع، القى، طاف، ضل، تراصف، جرى مع التيار، حام، يوجد عملا ل، متناول، تتكسر الامواج، اندفع للامام، سلسلة جبال، سوق بقوة الرياح، شرد، اعطى رتبة، تدفق، انبسط، تكور، اتخذ مكانا، تسلق، خضع بلد للقانون، دفع، نظرة، طرح ارضا، تاه، نطاق، اعطى علامة، سبك، غبار، نظم، ميدان، فاز بمرتبة مرموقة، ميدان رمي، تدفعه الرياح، مجال، ميز شخصا، هام، خطا بتثاقل، صنف، استثمر، انحرف، مجال رمي، سافر بدون هدف، رتب، عقد، جرى، مهد، وقع، تجول، سكب الحديد، تنزه، حاد، ملس، صب، غطى بركام، هذى، اطلق، نطاق رمي، رغا، طرق الحديد، اجتاز سيرا على الاقدام، تمرق، انجرف، جول في، جاب البحار",
  "order": "تسلسل، حالة نظامية، تنظيم، طلب، ميز شخصا، اعطى درجة، وضع، صنف، استثمر، وسم، ناد، اخبر، انتظام، ضبط، رتب، اعطى رتبة، وقع، كون، نسق، عين، ترتيب، حكم، مرسوم، اعطى علامة، نظام، قرار، وصف دواء، امر، نظم، عين شخصا في وظيفة، نصب، يوجد عملا ل، فاز بمرتبة مرموقة، حدث",
  "plane": "مركبة جوية، مستوي، طايرة، مستوى",
  "political": "سياسي",
  "possible": "ممكن، جايز، محتمل",
  "face": "تعبير، قدم، واجهة، ادار وجهه، جانب، قابل، وجه، كسى، لبس، طلب الى، غطى، جابه، قارن، تحدى، واجه، اتجه، كسا، تعبير الوجه، راس، تقنع، تصدى",
  "private": "مجند، نفر، جندي، عسكري",
  "professional": "مسلكي، احترافي، حرفي، معلم حرفة، مهني، محترف",
  "public": "ناس",
  "world": "بشر، الوجود، العالم، حياة، الكرة الارضية، الخلق، دنيا، الحياة الدنيا، الناس، الارض، عالم، الدنيا، ناس، الكون",
  "quality": "نغمة، ملمح، نوعية، سمة، خاصية",
  "character": "شخص غريب الاطوار، ملمح، دور مسرحي، سمة، شخص غير طبيعي، حرف، خاصية، شخصية، رمز كتابي، دور",
  "radio": "اشعاعي، مذياع",
  "fire": "احرق، شيد، نار، طرد، رفع، سعل مخرجا البلغم، اقال، ايقظ، اثار قضية، شال، حريق، فصل، غضب، هاج، غيظ، صرف  من الخدمة، حرض، تحرش، شوى، اضرم، برز، اطلق سراح، استيقظ، استثار، رفع الكاس لاحد، رب، جمع، ربى الماشية، رقى، اضرم النار، ربى، زاد المبلغ المراهن عليه، انهض، استفز، اجج، حث، ثور، سخن قليلا، ضحك، نهض، زاد النار اشتعالا، هيج، اطلاق النار، نبذ، تلفظ بقوة، زور شيكا، انهى خدمة، اطلق، سدد، قتل، احدث، رفع لاعلى، رد بالنار، اعفى من الخدمة، لهب، اشعل، اطلاق، خمر، رفع الستارة، رفع معنوياته، جمع تبرعات، اثار، اهاج، استحث، خبز",
  "real": "حقيقي، واقعي، عدد حقيقي",
  "red": "خسارة",
  "right": "صوب، اصلح، عدل، جناح اليمين، حق، انصف، قويم، صحح، صايب، عالج، نقح، عين طول قوس المنحنى، صحيح، كرر، عرف كل التفاصيل، تدارك، قطر الكحول، صادق، قوم، متفق، عاقب، الملعب الايمن، نظم، سليم، يمين",
  "running": "جري، ركض، ادارة، تسيير",
  "feed": "ايد ترشيح، جري، دخل، تسرع، صفى، طعم، نما بسرعة، تهدل، سجل نقطة في البيسبول، ارتفع، طعام، اشبع، طارد، طبع، انتشر، صنف الاوراق، تصفح بسرعة، اجتاز بسرعة، غذى، ادار، جرى، سوق بسرعة، سال، اقتات، اطعم، تدفق، وقع، ظل نافذ المفعول، شغل، تغذى، عليق، لقم، عبر، صب، عجل، قاد، انسل، تكرر، حكم، خاض معركة، اكل، حدث، هرول، سحب، دعم، اذاب، بدا العدو، عدا، سمد، نشر، خصب، علف، رضى، تدلى، غمر، ركض، قاد السيارة، شجع، انزلق، فاض، ترشح، رسم خطا",
  "course": "ايد ترشيح، جري، دخل، تسرع، صفى، وجهة سير، درس، طعم، نما بسرعة، اسلوب، تهدل، سجل نقطة في البيسبول، طريقة، ارتفع، صف مدرسي، اشبع، طارد، طبع، انتشر، صنف الاوراق، تصفح بسرعة، اجتاز بسرعة، غذى، ادار، سيرة، جرى، سوق بسرعة، سال، اقتات، اطعم، تدفق، وقع، ظل نافذ المفعول، مقرر تعليمي، شغل، غرار، لقم، عبر، صف، صب، عجل، مقرر تدريسي، مسعى، قاد، انسل، تكرر، حكم، توجه، خاض معركة، اكل، مسار، حدث، مسلك، هرول، سحب، مسيرة، دورة دراسية، اذاب، بدا العدو، عدا، مقرر، ميل، نشر، رضى، تدلى، غمر، ركض، قاد السيارة، منهج، ميدان، شجع، دورة، انزلق، فاض، ترشح، رسم خطا",
  "state": "صاغ، حالة، محدد، وضع، نطق، اخبر، لفظ، دولة، روى، بسط، قرر، القى خطابا، وضعية، حالة المادة، قال، ولاية، صرح، ارض، عبر، زعم، تكلم، عين، وضح، حال، بلد، اعترف، عرض، اعتقد، قطر، ارسل سريعا، استخلص، اقليم، اعلن، عبر بالرسم، اورد",
  "say": "صاغ، نطق، ردد، تكلم بوضوح، اخبر، لفظ، روى، بسط، قرر، اختار، القى خطابا، قال، صرح، عبر، زعم، قول، تكلم، عين، وضح، افترض، اعترف، عرض، القى خطبة، اعتقد، تهجا، تذرع، اصدر العقوبة، اعلن موقفا، بين، امر، ابدى رايا، اعلن، اشار، اورد",
  "tell": "صاغ، انفصل، ميز، تخلق، انسحب، افترق، فصل، نطق، صنف، لحظ الفرق، اخبر، لفظ، تفكك، تفهم، روى، بسط، قرر، القى خطابا، قطع، خلق، قال، صرح، اكتسب شهرة، زعم، تكلم، ابلى بلاء حسن، بوب، عين، قسم، وضح، اعترف، عرض، تفرق، اعتقد، تميز، عزل عن بقية، تخالف، امر، فرق، استخلص، ادرك، ميز بين، اعلن، فك، اورد",
  "second": "برهة، هنيهة، ثانية، فينة، لحظة",
  "moment": "الوقت الحاضر، برهة، هنيهة، فينة، لحظة",
  "charge": "فاتورة، اثقل، حجر، ورط، مرسل، ثمن، حماية، طرد، منصب، تكلفة، حدد، حمل، وصى، رعاية، انقض على، حشا، نزل، اودع، اقترف، اشبع، ودع، وضع، فرد، ارسل، ابعد، سلم، فرض، اهتمام، حول، قيد على حساب، حشوة، هجوم مفاجي، اتهام، عبا، شحنة، لقم، استودع، هجم، تذمر، عين، حلف بالزور، لقم او يحشو، ارسل بضاعة، وقاية، امن، ارتكب، دين، مهمة، ادخل، اتخذه رمزا، خصص، اتهم، شحن، شكوى، اطلق صيحة، تهمة، بعثة، بعث، هاجم، كلفه بامر، قايمة حساب، حاسب، ارسال، واجب، وضع حملا، شكاية، جهز، اعلن، وظف، وفد، نفذ",
  "lot": "نثر، صفى املاك متوفي، خص، قدر، باقة، اقام العدل، مجموعة كاملة، اعطى، صنف، منح، ظرف، ادار، اعطى دواء، دبر، تاجر، بصق، بحث في، ادار املاك قاصر، اوضاع، حلف، دفع مالا، مجموعة، تعامل، عالج، حظ، بوب، قسم، نصيب، حكم، قصف ب، قطف، ظروف، حزمة، خصص، عاقب، وزع، خصص لغرض معي، نشر، فرق، منح الاسرار، الكثير، حلقة، كثرة، قسمة",
  "shot": "تجربة، رصاصة، محاولة، فرصة، حقنة، لقطة، رامي، اطلاق، حقن، اطلاق النار، قنص، قذفة، اقتناص، طلقة، رمي، مشهد، زرق، رمية، ضربة، زرقة",
  "scene": "موقع، مكان، لقطة، منظر، ساحة، مشهد، صورة",
  "side": "وجه، انحدار، ميل، جانب، منحدر",
  "size": "حجم",
  "social": "اجتماعي",
  "special": "خاص",
  "square": "تربيع، ميدان عام، ميدان، مربع، تربيع العدد",
  "still": "ما زال، لا زال",
  "stock": "موونة، خزن، اصول، جرد، مرق، ماشية، ذرية، سلالة، مخزون، نسل، مواشي، دواجن، حيوانات، اختزن، مقبض البندقية، حساء، اصل",
  "blood": "ذرية، دم، نسل، سلالة",
  "stop": "وضع حد، تردد، وقفة، ترك، انسداد، تحتجب، فصل من العمل، فاصل، انقطع، اقام موقتا، انسد، انغلاق، قام بزيارة، تخلى، استقال، غادر، حول، علق، منع، هزم، عاق، قطع اشتراكه، انتهى، ايقاف، توقف القطار، قطع، انهى، اقام حاجزا، اعترض، جمع، هجر، بقي، الغى، حجز، خدر، سد، توقف الطايرة، فرغ، احبط، قتل، محطة، انقضى، اخرج، اعاق، كف، تم، اوقف الدفع، حاصر، حظر، اوقف، اقتطع مبلغا مستحقا، اربك، وضع حدا، توقف",
  "straight": "مستقيم",
  "strong": "قوي",
  "field": "مهبط جوي، مجال، ساحة، موضوع، مسرح العمليات، مسرح، ميدان المعركة، ميدان العمليات، موضوع البحث، حقل، ملعب، اطار، ارض المعركة، مسالة العمليات، فرع، مطار، نطاق، سهل، مهبط، ميدان",
  "issue": "اندفع، ذرية، موونة عسكرية، نسل، نتيجة، تموين، اصدار، موضوع، قضية، حصيلة، مسالة، مخرج، انبثق، عدد، متنفس، خرج، منفذ، ظهر، عاقبة، تبعة، خلف، شان، تاثير، موونة، تموين حكومي، نشر، اصدر، انطلق، بزغ",
  "matter": "اخذ اهمية، مادة، اهم، امر، هم، شيء، موضوع، مسالة، شان",
  "case": "ادعاء، حالة، صندق، قضية، مسالة، نموذج، دعوى، موضوع البحث، جمع، مثل، مثال، غطى، خنزير غيني، شخص غريب الاطوار، شاهد، وضع في صندوق، امثولة، حال، شخص غير طبيعي، دعوى قضايية، راقب، غلف، شكوى، صندوق، عبا في صندوق",
  "such": "هايل",
  "surface": "ظاهر، تصاعد، سطح، طلع، طلى، سطح الارض، كسا، ارتفع، ستر، اتى، ظهر، جعل له سطحا، دهن، طلع الى السطح، غطى، مظهر",
  "rise": "نقل من، تعاظم، رفع، بخصوص، ارتفع، انتفض قايما، تعالى، وقف منتصبا، اطل، نبع، كشف، اعلن العصيان، رفع الاسعار، انتقل، خلى، قام، استيقظ، ظهر، جعل له سطحا، ارتفاع، انبعث، طلع الى السطح، انتصب واقفا، انتصب، ازداد، زيادة راتب، تجاوز، اعتلى، طلع، تصاعد، سطح، اقتلع، ثور، الغى، سرق، نشا، سبب، نتج عن، نهض، تسلق، صعد، قفز، صعود، بدي، حكم، ارتفع الى مستوى المسوولية، انقشع، زيادة معاش، ازدياد، زيادة اجرة، اشتهر، حدث، رفع الروح المعنوية، طار، تنفض الجلسة او الاجتماع، زيادة، رفع المعنويات، بعث، وقف، اشرق، حلق، على، بزغ، اجتاز",
  "bring": "جلب، قبل التحدى للمبارزة، تعود، هيا، ضم، زود، حمل، قبل، قنع، صير فى حالة، فاز ب، اضاف، اضفى، اعار، ساعد، احضر، نقل، تطلب، منح، صور، زار، اغرى، اسهم، اتى ب، اختار، حضر، رافق، فاز، استعاد، كسب، شارك، جمع، تجبر، حصل، اخذ، استلم، اشترى، سرق، وصل، جاء، نقل ملكية، احتل، بدا، ابلغ، استحوذ على، احدث، استولى، اسر، انتقم من، معدل، اخرج، حيز، ساهم، امسك ب، جضر، ادى، اضفى على، اقرض، اقتضى، تبرع، واكب، اثار، اجتذب، حقق، نال، ادرك، استمر، تناول، اصاب",
  "then": "و من ثم، ثم، بعد ذلك، بعديذ",
  "so": "و من ثم، ثم، بعد ذلك، بعديذ",
  "thinking": "تفكير، تامل، فكرة، فكر",
  "thought": "خاطر، تامل، فكرة، فكر، تفكير، خاطرة، راي",
  "remember": "استرجع، اعاد، ذكر، استرد، ااستدعى، تذكر، تفكر، فكر في، ملك ذاكرة فذة",
  "together": "معا، مع بعض، سوية",
  "top": "غطاء، قمة، غطاء طبيعي، تفوق، دوامة، سبق، اوج، راس، ذروة، تقدم",
  "try": "عاين، اخذ عينة الدم، سعى لعمل شي، تجربة، طلب، جهد، اخذ عينة، ذاق، محاولة، بحث، سعي، طمح في، قام بمحاولة، اختبر، لبس، قاضى، اختار عينة، نظر في قضية، مهد للجنس، جرب، مسعى، اجتهد، امتحن، نظر في، قاس، اخذ عينة من الدم، اصدر حكما، سعى، قضى ب، تذوق، ارهق، جرب حظه، حاول، حاول الاعتداء، تعب، فحص، قصد، حاكم",
  "test": "جرب، اختبار، امتحن، تجربة، استجواب، اختبر، فحص، امتحان، بحث",
  "true": "صحيح، حقيقي",
  "understanding": "صواب، رشد، فطنة، عقل، بصيرة، دراية، فهم",
  "reason": "توصل، استنتج، استدل، توصل الى، صواب، عقد، استخرج، سوغ، برهن، استمع لصوت العقل، وصل، سبب، رشد، فكر، ايد، عقل، حسب، استنبط، جادل، فهم",
  "understand": "تفهم، عطف على، عرف، ترجم، استنتج، تيقن، حقق، ادرك، لاحظ، فهم",
  "used": "مستخدم، مستعمل، مستغل",
  "wanted": "مطلوب، مبتغى، مراد",
  "white": "قوقازي، ابيض",
  "whole": "وحدة كاملة، كل، مجموع، جميع، كل تام، وحدة",
  "process": "نمو، دخل، كرم بالشراب، اجراء، فاوض، سار، انبثاق، مشى، طريقة، صنع، خطا، سير، بزوغ، لاحقة، اعطى دواء، بحث في، دفع نفقات وليمة، عملية، ظهور، سار في موكب، تاخم، عالج، شكل، تظاهر، اعتبر، زايدة، شارك في موكب، نتوء، تقدم، تعامل مع، خروج، عمل، ناتي، خرج في مسيرة، جرى محادثات، ملحق",
  "existence": "الوجود، العالم، الخلق، ديمومة، كيان، كينونة، الدنيا، وجود، الكون",
  "earth": "العالم، الكرة الارضية، دنيا، الحياة الدنيا، تراب، الارض، اليابسة، بر، الكون، ارض",
  "write": "كاتب، دون، الف، دبج، لحن، خط، نظم، تهجى، وضع الالحان، كتب",
  "written": "مولف، مكتوب، كتابي، مدون، مخطوط",
  "wrong": "ظلم، غير صالح، طالح، خاطي، غير مناسب، عامل بازدراء، ضام، مخالف، فاسد",
  "young": "يافع، فتيان، جرو، صغار السن، نسل، شبيبة، صغير، ناشي، شباب، حدث، شاب",
  "As": "زرنيخ",
  "A": "انغستروم، امبير، انجستروم",
  "class": "درس، انفصل، ميز، شرح، ترتب، صف مدرسي، انسحب، افترق، فصل، صنف، تفكك، رتب، عرف، طبقة، قطع، مقرر تعليمي، احتل مكان في طيقة، انتظم في طبقة، صف، مقرر تدريسي، بوب، قسم، جنس، تفرق، فرز، دورة دراسية، نوع، وزع، مقرر، عزل عن بقية، دفعة، فرق، استخلص، نظم، عاشر، عنون، دورة، فك، فهم",
  "immediately": "على الفور، في الحال، فورا، مباشرة، حالا",
  "directly": "على الفور، في الحال، فورا، مباشرة، حالا",
  "now": "على الفور، في الحال، الان، فورا، مباشرة، حالا",
  "particularly": "بشكل خاص، بشكل مميز، خصوصا",
  "especially": "بشكل خاص، بطريقة خاصة، بشكل مميز، خصوصا",
  "not": "ليس، لا",
  "nothing": "صفر، لا شيء",
  "once": "حالما، عندما، ما ان، حين، في حين",
  "part": "نزل رتبته، فارق، انسحب، افترق، تفارق، قطعة، فلس، وزع، وضع حدا، تكسر، انطلق، وشى ب، صدع، وضع حد، فلق، دور مسرحي، ميز، ترك، تقطع، خفض السعر، فصل، وقع في الافلاس، دور، توقف عن شىء، اضعف، قطع، شارك، استبدل قطع النقد، انقسم، حطم، انفك، جزء، شخصية، نصح، منطقة، وظيفة، نفض، ارهق، حصص، شق، تساقط، فر من، استخلص، حصة، انفجر، طرف، جرح، كسر اضرابا، تشعب، كسر، شق سطح كذا، جزا، فض، ذهب، غير اتجاه شىء ما، فضى بمكنون صدره، نحو، نقض، شطر، شق الماء، وقع الشقاق، انصرف، قسم، تفوق، سهم، تطور، اختتم، عزل عن بقية، انطلق بسرعة خاطفة، فتت، فرق، فرق الشمل، اقليم، اذاع، شق طريقه، فكك، انفصل، فاصل، جانب، خان، تخلى، غادر، دحض، تفكك، انشق، تدهور، فرق الشعر، كسر الثلج، تجزا، اقتحم، عود، قطع الصمت، روض، انشعب، خرق، تمزق، سحق، نصيب، تفرق، رحل، مهمة، افشى، اوقف، انتهك، تقاسم، فك",
  "piece": "اكل بتان، طرف، قسم، جزء، سلاح ناري، لقط، شريحة، سلاح شخصي، مقطوعة، مقطوعة موسيقية، منطقة، قضم، قطعة، قطعة موسيقية",
  "office": "موظفين، مركز، منصب، وكالة، وظيفة، هيية حكومية، مكتب، مهمة، دور",
  "role": "استعمال، نفع، دور مسرحي، عمل، فايدة، شخصية، وظيفة، مهمة، دور",
  "section": "مقطع، تقسيم، قسم، جزء، قطاع، فصل، فقرة",
  "really": "حقا، باخلاص، بصدق، صدقا، في الواقع، في الحقيقة",
  "today": "العصر الحاضر، اليوم، هذه الايام",
  "usually": "عادة، غالبا، بشكل اعتيادي، بشكل عادي",
  "manner": "طريقة، اسلوب، نمط",
  "way": "اتجاه، نمط، وسيلة، وساطة، سبب، طريق، اسلوب، منوال، مجال، طريقة، ممر، سبيل، متسع، حيز، وجهة، جهة، مسلك",
  "means": "واسطة، وسيلة، وساطة، سبب، طريقة، سبيل",
  "direction": "اتجاه، سياسة، تسيير، ادارة، طريق، امر، ارشاد، توجيه، تركيز، تعليمات، توجه، سبيل، تدبير، وجهة، جهة",
  "room": "الحضور، مجال، حجرة، المكان، متسع، حيز، غرفة",
  "history": "حكاية، تار يخ، تقرير، تاريخ، قصة",
  "bit": "بت، شكيمة، روتين، فصل، كلام معاد، نمرة مسرحية",
  "action": "اكمل، ادعاء، اجراء، تشريع، مارس، عملية عسكرية، فعل طبيعي، دعوى، تحرك، اداء، اتم، حركة، انهى، دعوى امام القضاء، قضى، وفى ب، عملية، نشاط طبيعي، نشاط، انجز، فعالية، نجز، دعوى قضايية، عمل، معركة، عملية طبيعية، ادى، فعل، قانون، حقق، عمل عسكري، نفذ",
  "activity": "تحرك، عملية طبيعية، وظيفة جسدية، عملية جسدية، فعل طبيعي، عمليةجسمية، نشاط جسدي، فعالية، حركة، نشاط طبيعي، عمل، نشاط",
  "addition": "جمع، زيادة، اضافة",
  "administration": "رياسة، تسيير، تصرف، ادارة، فترة رياسية، حكم، حكومة",
  "government": "السلطة، الحكومة، النظام، سياسة، نظام الحكم، حكم، علم السياسة، سلطة، حكومة، علوم سياسية، نظام سياسي",
  "afternoon": "اصيل، بعد الظهر، بعد الزوال، عصر",
  "age": "سن، عمر، امد بعيد، شيخ، هرم، قدم، تقدم العمر، زمن، مدة، انضج، شيخوخة، كبر",
  "years": "سن، امد بعيد، هرم، تقدم العمر، زمن، مدة، شيخوخة، كبر",
  "aid": "عناية، عون مالي، معاونة، معونة، معونة اقتصادية، مساعدة مالية، رعاية، اعان، عاون، عون، ساعد، مساعدة، اهتمام",
  "help": "معونة، اعان، معاون، ساعد شخص على النزول، ساعد، مد، معاونة، عاون، مساعدة، عزز، ناصر، مساعد، خدم على المايدة، سهل، قذم، نقذ، عون، قذم الطعام، قوى",
  "attention": "عناية، اهتمام، انتباه، رعاية",
  "air": "اعلن عن، جملة، اشهر، كشف عن، ابدى، قام بالدعاية، كشف، علن، هواء، فضى بسريرة نفسه، لحن، ترنيمة، هوى، عرض على الملا، بث، نشر، اذاع، اعلن، نغم",
  "cost": "ثمن، قدر، تكلفة، سعر، كلفة، كلف، قيمة مالية",
  "analysis": "تحليل",
  "area": "رقعة، حقل، مجال، اطار، بلاد، نطاق، منطقة، مساحة، جهة",
  "country": "ريف، رقعة، امة، دولة، قطر، قرية، بلاد، منطقة، بلد، ارض",
  "arms": "اسلحة، سلاح",
  "art": "عمل فني، ابداع فني، خلق فني، رسومات، انتاج فني، فنون جميلة، فن",
  "attack": "حمل على، محاولة اعتداء، شن هجوما، مهاجمة، هجم، اغار على، تهجم، اعتدى، هاجم، هجوم، هاجم بعنف، نوبة، اعتداء، اغار",
  "attitude": "موقف  ذهني، وقفة، وضعية، وضع، موقف",
  "audience": "فرصة استماع، جلسة استماع، سماع، استماع، جمهور، مجلس",
  "ball": "كرة، كتلة",
  "basis": "حجر الزاوية، قاعدة، جذر، ركن اساسي، مبنى، اساس، مبدا، اصل",
  "being": "كاين، ديمومة، كيان، المتعضي، كينونة، كاين حي، متعض، وجود",
  "board": "لوح، لوحة العاب، طاولة لعب، مجلس",
  "body": "جهاز، جثمان، ترابط، جسم، جسد، اتساق، هيية، جثة، تناسق، جرم، بدن، جذع، تماسك، مجلس",
  "book": "دفتر الحسابات، سجل، مجلد، كتاب، مدونة، دفتر الاستاذ، دفتر",
  "volume": "جهارة الصوت، مجلد، حجم، كتاب",
  "record": "دخل، دون، رقم قياسي، طرق، تسجيل، اشار الى، وضع، مدونة، اسطوانة فونوغرافية، شارك، حطم الرقم القياسي، استعرض، دل على، سجل رقم قياسي، تسجيل فونوغرافي، كتب، قدم بيانا، قيد، التحق ب، قرص، باشر، شلرك في المفاوضات، سجل، انضم، اشار، دفتر",
  "boy": "ولد، فتى، ابن، صبي، شاب",
  "son": "ولد، ابن",
  "building": "مبنى، بناية، بناء، انشاء",
  "business": "زبون، قطاع التجارة، شغل شاغل، تجارة، نشاط تجاري، مشروع تجاري، مهنة، قطاع الاعمال، اعمال، وظيفة، عمل تجاري، شغل، حرفة، عمل، دور",
  "job": "مهنة، مهمة، واجب، وظيفة، شغل، حرفة، عمل",
  "call": "دعا، احتج، استرجع، سمى، اعلن عن، اتصل، طلب، حدد، صرخ من الالم، نبح، هاتف، استدعى، بعث رسالة بالتليفون، كلم، عوى، التمس، استنجد، تطلب، زار، نادى، شكا، اختار، سال، اطلق بنبرة صارخة، استرد، طالب، نادى بسخرية، هدر، خاطب بالتليفون، عين، عرج، خاطب تلفونيا، طلب للحضور، عبر عن شيء بالصراخ، نعب، اثار ضجة، صاح، قال بصوت عال، حدد الثمن، ضحك حتى البكاء، نادى على، اقتضى، صرخ، اجتذب الطريدة، لقب، اطلق لقب كذا على، اذاع، زعق، عج، قهقه، مكالمة، تلفن، بكى، هتف، وصف ب، حدث اثرا مذهلا، دعا ب، تباكى",
  "visit": "اصلح، تدبر، انهمك فى القيل و القال، نم، ثرثر، تحادث في غير كلفة، سدد ضربة، زقزق، عاد مريضا، لفظ بغير وضوح، تتذبذب بسرعة، لاحظ، فرض، بحث، وجه، تفقد، زار، حادث سطحيا، عرف، رافق، تيقن، عنى، سافر الى، زيارة، صب، شاهد، انزل، الم، اعتبر، اصاب ببلاء، هذر، تصور، نشر الاشاعات، لغى، عمل، لغا، تصطك، ازعج، ابتلى، وجع، تخيل، دردش، لمح، تحمل، تحادث، حقق، راى، تسامر، بصر، ادرك، فحص، سمح، اصاب، اولى الامر عناية، فهم",
  "car": "عربة سكة حديد، عربة قطار، سيارة، عربة، مركبة",
  "fear": "دعر، حرص، خشي، فزع، خاف، مبالاة، مراعاة، خوف، رعب",
  "example": "شاهد، حالة، امثولة، نموذج، مثل، مثال",
  "type": "حرف طباعي، شخص غير طبيعي، شخص غريب الاطوار، نوع",
  "effort": "صنيع، تجربة، جهد، انجاز، همة، محاولة، سعي، ماثرة، عرق، عمل بطولي، حركة، كدح، مسعى، بذل، عمل، عمل فذ، تعب، منقبة، جد، حملة",
  "cent": "سنت",
  "century": "قرن",
  "change": "حصل على الشهادة العليا، تحفظ، قرع الاجراس، تنوع، حدد، تبدل، تبادل، عدل، قيد المعنى، تقلب، اختلف، صرف ورقة نقدية، نقل، تبديل، وجه، تحرك، حول، جلد، اكتسب القوة او الصلاحية، اهل، كيف، غير موقفه، حصل على الدبلوم، قطع الكهرباء، ابدل، خفف، انتقل، قطع، انتقل من، تدبر امره بنفسه، بدل، لطف، حسن، قايض، غلظ، خصى، غير، تحول، غير او زور، تغير، القى، تعديل، خفف العقوبة، رحل، قلب، بادل، ضرب بالسوط، نوع، قطع التيار، تغيير، قيد، تنقل، فصل التيار، تفاوت، حور، استبدل، سكن، خول",
  "child": "نجل، رضيع، ابن، صبي، غلام، صغير، حدث، طفل",
  "church": "كنيسة مسيحية، صلاة عامة، كنيسة",
  "city": "سكان المدينة، مدينة",
  "year": "سنة، حول، دفعة، عام، دورة",
  "college": "كلية، مبنى الكلية",
  "community": "جماعة، منطقة سكنية",
  "company": "فرقة، ضيف، مندوب، شركة، لمة، عصبة، حزب، صاحب، رافق، عشرة، معشر، جمع، فريق، زمالة، رفقة، جماعة، صحبة، فوج، زاير",
  "society": "زمالة، رفقة، مجتمع، عشرة، صحبة، ناد",
  "party": "حزب سياسي، فرقة، طرف، حزب، فريق، حفل، حفلة، جماعة، صحبة، جمع، لمة، عصبة",
  "conditions": "حالة الطقس، جو، حالة الجو، طقس",
  "corner": "احتكار، احتكار سلعة، زاوية، ركن، احتكار تجارة",
  "price": "حدد الثمن، ثمن، تكلفة، سعر، سال عن السعر، قيمة مالية، قيمة",
  "nation": "امة، دولة، شعب، قطر، بلد، ارض",
  "land": "تربة، جلب، عقار، ارضية، قنع، تراب، احضر، بر، دولة، اغرى، حضر، رافق، الارض، تجبر، املاك، اخذ، ارض، وصل، امة، احدث، قطر، اليابسة، جضر، قطعة ارض، ملك، ادى، واكب، اجتذب، ملكية، جاء، بلد",
  "couple": "تقارن، رتب زوجا زوجا، زوج، التقان ازواجا، قرن، اقتران، امات الشاه، ازدوج، جامع، اجتمع ازواجا، زوجان، زاوج، رتب زواج زوجين، ضاجع، تعشق، عاشر، تسافد",
  "court": "بلاط ملكي، بلاط، السلطة القضايية، ملعب، قصر، محكمة، مجلس القضاء",
  "data": "معلومات، بيانات، معطيات، حقايق",
  "information": "بيانات، معلومات، حقايق، معطيات، معلومة",
  "date": "موعد، تمر، شاهد، واعد، جد?يد، تواعد، يوم، راى، ميعاد، تاريخ، خرج مع، توقيت",
  "day": "وضح النهار، يوم فلكي، وقت، عيد، عصر، يوم، نهار، يوم نجمي، ايام، لحظة، اربع و عشرون ساعة، يوم شمسي",
  "trade": "باع، مهارة، قنع، صناعة، ساوم، روج لبضاعة، عمليه تجارية، تسوق، عمل في التجارة، صفقة، معاملة، باع بصورة جيدة، قام بعمل تجاري، بحث العلاقات التجارية، تجر ب، صنعة، خدع، تجارة، تاجر، بحث في، باع بسعر محدد، حظي بالقبول، قايض، تعامل، عالج، صفقة تجارية، غش، مهنة، تداول، بادل، سوق، وزع، زبانة",
  "decision": "قرار، حكم",
  "defense": "دفاع، تركيب دفاعي، قوة دفاع، حماية",
  "plan": "رسم خطة، خطط، اعتزم، تصميم عمراني، اعد، تصميم، نظم، مخطط، ترتيب، خريطة مبنى، صمم، نوى، وضع خطة، خطة",
  "figure": "عكس صورة، عرض فلما، نتا، توقع، زين، بدن، صور، عنى، اعتمد، فكر في النتايج، بنية، شكل، رقم، تصور، جعل له نتوء، زينة، خمن، رسم لوحة، توهم، لمح، ادرك، تدبر، تنبا، بحث، رمى، برز، زار، ولع ب، تصور و يعتبر، شاهد، اعتبر، شخصية، صمم، عزم، اسم، تعمد، حسب، جسد انسان، اولى الامر عناية، جرد حسابا، قدر، اضاف، ابدى للعيان، قام بسلسلة حركات، عدد، شخص مشهور، جسم انسان، خطط، عرف، رافق، قرر، ظن، صفى حسابا، تجاوز، تمثل، نوى، اسقط، عمل، عرض على الشاشة، تحمل، بصر، شكل جسماني، فحص، فهم، اصلح، رسم، لاحظ، هيكل، شكل بشري، جسم، تيقن، ذهب للسينما، جسد تمثال، جسم فيزيايي، شخصية بارزة، اطلق، افترض، حكم، اعتقد، قوم، احصى، اتكل، تخيل، عد، حقق، راى، ظهر ناتيا، زخرفة، سمح",
  "purpose": "نية، مرمى، غاية، مغزى، استعمال، نفع، اعتزم، تصميم، فايدة، مهمة، غرض، قرر، عزم، ارادة، وظيفة، قصد، عمل، دور",
  "difference": "جدال، نزاع، خصام، تشعب، انحراف، خلاف، تباين",
  "distance": "تباعد، تجنب، مسافة، انطواء، بعد، مدة، ابتعد، عدم اكتراث، طول، فترة",
  "length": "مسافة، بعد، مدة، امد، طول",
  "space": "مكان فارغ، مكان، مجال، مدة، فضاء، حيز، مساحة، فراغ، فترة",
  "doubt": "شك، ارتاب، ريبة، ريب، ارتياب، تشكك",
  "education": "تدريس، تعليم",
  "effect": "تاثير، تبعة، ادى، انتج، طبق، سبب، اعد، نتيجة، انشا، حقق، احدث، نفذ، حصيلة، دخل حيز التنفيذ، عمل بالفعل، واقع، عاقبة، انطباع",
  "equipment": "معدات، تجهيزات",
  "evidence": "شهد ضد، قدم، علاقة، برهان، اعلن، ادى دورا، اقام الدليل، سند، علامة، اخبر، شهد لصالح، اختبر، اثبات، برهن، ظهر، مثل، اكد، دليل، استعرض، شاهد، تظاهر، قاد، دلى بشهادته، طهر، عرض، ثبت، اثبت، شهد، بين، اشار",
  "experience": "اصلح، تدبر، عايش، تجربة، مس، لاقى، لاحظ، خبرة، جس، بحث، بدا عند اللمس، خضع ل، زار، عرف، رافق، تيقن، اختبر، عنى، شعر، تلمس، مر ب، قاسى، شاهد، جرب، وعى، اعتبر، حس، تصور، شم، امن، معرفة، عمل، واجه، تخيل، احس، لمح، تحمل، عاش، حقق، راى، بصر، عانى، ادرك، فحص، سمح، اجتاز، اولى الامر عناية، فهم",
  "extent": "امتداد، حجم، مد، مساحة، مدى، حد",
  "fact": "حقيقة",
  "religion": "دين، ديانة",
  "faith": "دين، ديانة، ثقة",
  "fall": "خريف، قلل من شان كذا، انهزم، تسرع، اندفع، ضم، انتقل بالارث، تقلص، هبط، وقوع، شرع بهمة و نشاط، انحط الى مستوى، قذف به بعنف، تلاشى، نزل، استدق، اخذ في النقص، خفض، اضعف، خفف، ترسب، جرى، قلص، وقع، تهور، نقض، انحدر، انهار، اصبح مستدق الطرف، حث، صغر، عجل، تحدر من، سلسل، تقدم، سقوط، سقط، اخمد، ال الى، تدنى، حط من القيمة، قل، فصل الخريف، ولد، اصبح، خر، هوى، تكثف، تناقص، استسلام، نقص، تساقط، سقط من حالق، تدلى، القى بنفسه، قلل، سكن",
  "father": "والد، منجب، موسس، اب، جد",
  "sense": "معنى، دلالة، احساس، شعور، احس، جس، وعى، مس، حس، شعر، امن، شم، ادرك، تلمس، حاسة، بدا عند اللمس",
  "feeling": "شعور، عاطفة، احساس، حس",
  "picture": "عكس صورة، اصلح، تدبر، صورة ذهنية، رسم، عرض فلما، لوحة فنية، نتا، ابدى للعيان، زين، لاحظ، بحث، قام بسلسلة حركات، صور، خطط، برز، رمى، زار، عرف، جسم، رافق، تيقن، قرر، عنى، ولع ب، تصوير، ذهب للسينما، ظن، تصور و يعتبر، مثل، تجاوز، جسد تمثال، شاهد، اعتبر، اطلق، تصور، جعل له نتوء، فيلم، تمثل، صمم، عزم، تصويرة، وصف حي، اظهر، نوى، عرض، اسقط، عمل، رسم لوحة، توهم، عرض على الشاشة، شريط سينمايي، تخيل، مشهد، لمح، ايقونة، تحمل، حسب، حقق، راى، بصر، ظهر ناتيا، ادرك، صورة، عرض سينمايي، فحص، سمح، تمثيل، صورة فوتوغرافية، اولى الامر عناية، فهم، انطباع",
  "image": "عكس صورة، اصلح، تدبر، صورة ذهنية، رسم، عرض فلما، نتا، ابدى للعيان، زين، لاحظ، بحث، وجه، قام بسلسلة حركات، صور، خطط، برز، رمى، زار، عرف، جسم، رافق، تيقن، قرر، عنى، ولع ب، ذهب للسينما، ظن، تصور و يعتبر، شخصية مظهرية، تجاوز، جسد تمثال، شاهد، اعتبر، اطلق، تصور، جعل له نتوء، تمثل، صمم، عزم، شخصية، نوى، اسقط، عمل، رسم لوحة، توهم، عرض على الشاشة، تخيل، لمح، تحمل، حسب، حقق، راى، بصر، ظهر ناتيا، ادرك، صورة، فحص، سمح، اولى الامر عناية، فهم",
  "food": "مادة مغذية، قوت، طعام، غذاء",
  "force": "خسر، شدة، جر، قدرة، اخذ جرعة من شراب، استهوى، رسم، سرع، اغتصب، شق طريقة بصعوبة، استنتج، بطش، روج، حرر وصية، شهر مسدسا، جذب، غصب، لوى القوس، اجتذب المشاهدين، فرض، ناضل، حول، عنوة، ارهق بالملاحقة، اكره، قوة عسكرية، دسر، مجموع الموظفين، انتزع عنوة، عقد، اضطر، شق طريقه بالقوة، تجبر، تقاضى، لفت الانتباه، ضغط، اقتلع، اقحم، ابتز المال، واصل، عصر، كبس على، دخل بصعوبة، دفع، اطلق، ربح، سحق، شد، كره، اجبر على الطاعة، طاقم، جرى سحب يانصيب، انتزع، ادخل، اجبر، سحب، ارهق، حشر، صد، موظفون، توغل، قوة، دفع بالقوة، مقدرة، تقدم تدريجيا، اطلق النار، تناول، عنف، تلقى، شق طريقه، سلطان، غرز، استل، طول معدنا، ازاح",
  "strength": "حول، شدة، ثبات، قوة، تحملية، مقدرة، قوة عسكرية، قدرة عسكرية، فعالية، دوام، بقاء، متانة",
  "power": "حول، مركز، منصب، قوة، قدرة، سلطان، عظمة، جبروت، اس",
  "pressure": "سرع، اغتصب، شق طريقة بصعوبة، غصب، مستوى الضغط، فرض، اكره، انتزع عنوة، اضطر، شق طريقه بالقوة، الضغط على وحدة المساحة، تجبر، ضغط، اقحم، ابتز المال، عصر، كبس على، دخل بصعوبة، سحق، كره، اجبر على الطاعة، ادخل، اجبر، ارهق، توغل، دفع بالقوة",
  "freedom": "حرية",
  "friend": "ظهير، صاحب، مشجع، معجب، مويد، نصير، معرفة، صديق، رفيق",
  "getting": "نيل، اكتساب، احراز، حصول، اخذ",
  "girl": "انسة، فتاة، طفلة، صغيرة، بنت، شابة، صبية",
  "labor": "كدح، مشروع، تعهد، جهد، اشتغل، مهمة، واجب، شغل، عمل",
  "group": "تجميع، زمرة، شق، مجموع، مجموعة كيميايية، جماعة، مجموعة",
  "hair": "شعر",
  "hall": "بهو، قاعة، ردهة، قاعة الاستقبال، حجرة الانتظار، غرفة الانتظار، صالة",
  "hands": "قوة عاملة، وصاية، ايدي، القوة البشرية، رعاية، الايدي العاملة",
  "men": "القوة البشرية، قوة عاملة، الايدي العاملة، ايدي",
  "He": "العنصر الثاني، هيليوم، هليوم، ه",
  "mind": "انصت، دماغ، انتبه، انزعج، رعى، حذر، عارض، اصغى، ذاكرة، اهتم، اعتنى، تعهد، فكر، رعى طفلا، حكم، تذكر، معرفة، راقب، دراية، استمع، انتباه، انتبه الى، اطاع، عقل، عني، راس، راي",
  "question": "سوال، استعلم، استعلام، تحقيق، مشكلة، وضع علامة استفهام، استجواب، استفهم، تساول، سال، شكك، قضية، اعترض، استفسر، مسالة، تساءل",
  "spirit": "مزاج، ميل، حالة عاطفية، حركة، روح، رغبة، همة، حيوية",
  "hope": "ترجى، ارتجى، رجا، رجاء، امل",
  "horse": "حصان، جواد، فرس",
  "hour": "وقت، ساعة، توقيت",
  "idea": "خاطر، خاطرة، فكرة، راي",
  "importance": "اهمية",
  "industry": "صناعة، مجال",
  "knowledge": "ادراك، معرفة",
  "lack": "نقص، افتقار، فقد، عجز، انعدام، معوز، احتاج",
  "language": "لغة، كلام، مخاطبة، محادثة، عملية لغوية",
  "law": "رجال الشرطة، سلطان القانون، شرطة، بوليس، قوات الشرطة، قانون الطبيعة، قانون، الامن",
  "police": "رجال الشرطة، شرطة، بوليس، قوات الشرطة، الامن",
  "leaders": "رياسة، قيادة، زعامة",
  "let": "ترك، وافق، قبل، اجر، اذن، ودع، فرد، سمح ل، سلم، منح، سمح له بالذهاب، اتاح الفرصة، صرح، ايد، اجاز، اعترف، رخص، ادخل، خصص، عد، فرق، جعل، شجع، سمح",
  "letter": "كتاب، حرف ابجدي، رسالة، حرف، رسالة خطية، خطاب",
  "list": "وضع، فهرس، وضع في قايمة، قايمة، جدول، سجل في قايمة، سجل",
  "literature": "ادب",
  "lower": "خفض، نزل، اوطا",
  "making": "ابتكار، تصميم، شرط، موهل، ابتداع",
  "market": "سوق مواد غدايية، سوق، تجر، بازار، بقالة، باع، استغل، تاجر، دكان البقال، تسوق",
  "thing": "شي، امر، شيء، مسالة، شان",
  "May": "مايو، ايار",
  "meeting": "لقاء، تلاقي، مواجهة، مقابلة، اجتماع، دمج، لقية، وحدة، جميعة، جمع، مصادفة، ندوة",
  "member": "عضو، طرف",
  "method": "طريقة",
  "might": "قوة، قدرة، عظمة، جبروت",
  "money": "مال، نقد، نقود، عملة",
  "month": "شهر، شهر شمسي، شهر ميلادي",
  "morning": "صباح، صبح، فجر، صبيحة",
  "mother": "دلل، اهتم كثيرا ب، والدة، رعى بافراط، ام",
  "mouth": "نفث، تناقش بخصوص، ثرثر، نطق بلسان، وضع، نطق، لفظ، خطب، سال، تكلم بطريقة لفظية، همس، قال، تفوه، لفظ العبر، لحس، عبر، فو، تكلم، تجويف فموي، تلفظ، حول الى فعل، ناقش مع، اطلق، دل، تحدث، نشر الاشاعات، نبس ب، فوه، قلب شفتيه ازدراء ا، ناقش، تناول طعاما، فم، عبر بالالفاظ",
  "talk": "نفث، تناقش بخصوص، ثرثر، نطق بلسان، كلم، وضع، نطق، لفظ، خطب، سال، تكلم بطريقة لفظية، همس، قال، تفوه، لفظ العبر، لحس، عبر، تكلم، تلفظ، حول الى فعل، ناقش مع، اطلق، دل، تحدث، نشر الاشاعات، نبس ب، فوه، قلب شفتيه ازدراء ا، ناقش، تناول طعاما، محاضرة، عبر بالالفاظ، حاضر، حدث",
  "speak": "نفث، تناقش بخصوص، ثرثر، تحدث الى، خاطب، نطق بلسان، كلم، وضع، نطق، لفظ، خطب، سال، القى خطابا، تكلم بطريقة لفظية، همس، قال، تفوه، لفظ العبر، لحس، عبر، تكلم، تلفظ، حول الى فعل، ناقش مع، اطلق، دل، تحدث، نشر الاشاعات، نبس ب، خطب في، فوه، قلب شفتيه ازدراء ا، ناقش، تناول طعاما، عبر بالالفاظ، حدث",
  "music": "موسيق?ى، موسيقى",
  "nature": "طبيعة، طبع",
  "note": "دون، انتبه، قدم ملاحظة، لاحظ، ورقة قبض، علق، نوه ب، ظهر، سند اذني، سند تعهدي، ملاحظة، كتب، ملحوظة، كمبيالة، ابدى ملاحظة، ذكر، ابدى رايا، سجل، اشار",
  "situation": "وظيفة، وضع، حالة، منصب",
  "operation": "اداء، سريان، مسالة حسابية، عملية جراحية، عملية عسكرية، جراحة، عملية، عملية حسابية، عمل",
  "performance": "اداء، انجاز، تادية، تنفيذ، تقديم، عمل",
  "organization": "تشكيل، تنظيم، منظمة، تكوين، توطيد، تاليف، ترتيب، تاسيس",
  "system": "نظام، تنظيم، منظومة، ترتيب، برنامج، خطة، جهاز",
  "paper": "ورقة، صحيفة، ورق، جريدة",
  "peace": "سلام",
  "people": "اهل، شعب، مواطنين، جمهور، ناس، جماهير",
  "period": "مدة زمنية، زمن، مدة، فترة، فترة  زمنية",
  "property": "ممتلكات، مكان، ارصدة، وصف، صفة، سندات مالية، صفة مميزة، بعد، نعت، خاصية، ملكية، مميزة، ميزة، خاصة، متاع",
  "program": "برنامج سياسي، وضع برنامج، اعد برنامجا، خطط، لقم الحاسبة، برنامج، برمج، برنامج حاسوب، خطة، برنامج اذاعي",
  "planning": "تدبير، تخطيط",
  "works": "منشاة، مصنع",
  "playing": "تمثيل، عزف",
  "policy": "سياسة، بوليصة تامين، وثيقة تامين",
  "pool": "بركة، اتحاد، نقابة، حلف، حوض، ايتلاف",
  "population": "الكون، البشر، سكان، كثافة سكانية",
  "president": "رييس، رييس جلسة، عميد، مدير",
  "President": "رييس الولايات المتحدة",
  "press": "صحف، كوى، خزانة الملابس، اندفع، خص، دولاب، تقلص، خطبة، حدد، نبه، صحافة عامة، وصى، شق طريقة بصعوبة، ازدحم، عدى، صحافة، جذب، تجمع، اكره على اداء الخدمة العسكرية، خطب، صحافة مطبوعة، حذر، عقد، التقط، قصر، قلص، خزانة الثياب، الح، صادر للمصلحة، استعجل، مطبعة، قبض، ضغط، حث، سطح، ضغط بقوة مطردة، واصل، عصر، اقحم، ابتز المال، انكمش، كبس على، دخل بصعوبة، دفع، دولاب الملابس، حشد، دفع بقوة، انقبض، سحق، نصح، تراكم، ادخل، حاصر، تابع، قولب، صر، ارهق، عانق، ضيق، حض، وعظ، خزانة، كبح، هاجم، ضغط على، اثار، شق طريقه، كبس، استحث، استخرج اسطوانة مسجلة، جادل",
  "terms": "سعر، ثمن",
  "problem": "مشكلة، معضلة، مسالة، مشكل",
  "trouble": "غلظ، عاق، اربك، ازعج، عكر، معضلة، مشكلة، كدر، اثار، بعثر، اقلق، ضايق، مشكل، انقلب، ابطل، شوش، قاطع، قلب",
  "production": "منتج، انتاج، منتوج",
  "progress": "مات، مقدما، قدم، ارتفع، نقل، سير، نضج، تتحسن حالته، ظهر، ارتقى، واصل، صعد، احرز تقدم، احدث، تقدم، احرز تقدما، تحسن، ترقى، دفع سلفا، استمر، مر",
  "race": "اندفع، نقل بسرعة، سرع، مشى بسرعة، نقض على، عمل بسرعة، سباق، ارسل بسرعة، عرق، سابق، تسابق مع، استعجل، عجل، اسرع، جنس، اطلق، انطلق بسرعة، هرول، شارك في سباق، هاجم، ركض، قاد بسرعة مفرطة، عاجل",
  "reaction": "رد فعل، تفاعل كيماوي، تفاعل، تفاعل كيميايي، استجابة",
  "reading": "قراءة، قراءة عداد، مطالعة",
  "research": "دراسة، بحث",
  "respect": "ثمن، قدر، اتصل، اعز، رفع بقوة، اجل، وقر، احترام، كسب، تعلق، قوم، ناحية، نقطة، احترم، منح جايزة، حقق، تقدير، عظم، خصوص",
  "value": "ارتفع ثمنه، ثمن، ادرك ادراكا كاملا، قدر، اتصل، حدد، قدر قيمة، اعز، فرض، ضبط، رفع بقوة، اجل، وقر، كسب، رفع الثمن، عجب، تعلق، قيمة اقتصادية، قاس، قوم، قيم، قيمة، خمن، زاد في قيمة شي، احترم، ذرع، منح جايزة، حسب، حقق، حفظ، نظم، جزم، عظم، حدد الضريبة",
  "responsibility": "التزام، مسيولية، واجب",
  "rest": "استراح، ارتاح، بقية، استند، ازال، استراحة، استجم، باق، الباقي، علق، علق اماله على، ظل، متبقي، مخلف، مسند، بقي، رسخ، طمان، علق الجلسات، ثبت، اراح، استقر، هدا، اضطجع، بقى، مكث، راحة سرمدية، توقف، راحة ابدية",
  "return": "حنث بوعده، اعادة، قدم، تراجع، اعاد دفع، عاد ليعلن الحكم، سدد دين، رد الجميل، قابل شييا بمثله، اعاد مالا، وضع، تكرار، رد بحسم، عودة للوطن، رجع في كلامه، ترجيع، ارجاع، عاد الملك الى المالك، اعاد، جزع، استرد، ارتد، رد، رجع، اب، استعادة، رجع الي صاحبه، القى وثيقة تامين، انكفا، اعاد كتابا، مقابل، اجاب، رجوع، عودة، اعاد المال، صد، استوفى حقه، عاود، نكص، استرداد، ارجع، شكر، عاد",
  "road": "طريق، سبيل",
  "trial": "تجربة، فحص، امتحان، محاكمة، دور",
  "saw": "نشر، نشر بمنشار",
  "saying": "قول، عبارة، تعبير",
  "school": "هذب، علم، درس، ثقف، مدرسة، درب، ادب، ربى",
  "science": "فرع علمي، علم، مهارة",
  "season": "تبل، موسم، جفف، جف، تبل الطعام، فصل، انضج، فترة، حسن",
  "series": "سلسلة",
  "service": "خدم الجيش، خص، نفع، زود، قدم خدمة، استهل في التنس، خدمة، ضرب الكرة، خدم الزباين، اشتغل خادما، مصلحة، ساعد الكاهن، خدم في الكنيسة، جامع البقر، خدم على المايدة، اتم مدة خدمة معينة، عمل، خدم، مديرية، صلاة عامة، قدم الطعام",
  "spring": "ترك فجاة، نبت، وافق، ارتفع، وجه نقدا لاذعا، انحرف، غادر، انبثق، حمله على الوثب، انفجر ضاحكا، اطلق سراح، برز، اشتم، انتقل بسرعة، طفر، استعجل، ظهر، رفع منزلته، تجاوز، جعله يثب، عبر، ربيع، نزع، وثب، فصل الربيع، نهض فجاة، عين، قفز، استولى، نطط، فجر لغما، ينبوع، شق، فر من، طار فرحا، هاجم، زاد، انطلق، احاط",
  "staff": "طاقم",
  "State": "وزارة الخارجية الامريكية",
  "statement": "قول، حجة، برهان، كشف مالي، بيان، تصريح، افادة",
  "step": "اجراء، مشى، خطا، درجة، تبع، دعس، بادر، خطوة راقصة، داس، سحق، خطوة، تقدم بحزر، تقدم، تدبير، عفص، وطا، تدرج، درج، اعداد، وقع اقدام",
  "street": "شارع",
  "stress": "ضغط، علم، نبرة، توكيد، شكل، رقم، تشديد، برز، وضح، تاكيد، شدد، اجهاد، قاطع بين فترة و اخرى، نبر، وضع، توتر، اكد، نقط",
  "student": "طالب، باحث، دارس، تلميذ",
  "summer": "صيف",
  "sun": "شمس، اشعة الشمس، ضوء الشمس",
  "Sunday": "الاحد، يوم الاحد",
  "table": "اخر، جعله في المقام الثاني، اجل، طاولة، منضدة، مايدة، ارجا، جدول",
  "tax": "فرض ضريبة، رسم، ضريبة",
  "temperature": "درجة الحرارة، احساس بالحرارة او البرودة",
  "theory": "نظرية، افتراض، امكانية، فرضية، ظن، فرض",
  "things": "حوايج، اشياء",
  "time": "اثقل، بعد رابع، زمن، مرة، مدة الحبس، انسد، موعد، فترة الحكم، ضبط، وقت، فرصة مناسبة، ساعة، رقص، مدة السجن، مدة الحكم، فترة الحبس، توقيت، سد، قاس الوقت، اوان، اعاق، فترة السجن، وقت مناسب",
  "times": "ضرب، مضاعفة",
  "town": "اهل المدينة، بلدة، دايرة، البلدة، سكان المدينة، سكان البلدة، ناحية",
  "training": "تاهيل، اعداد، تدريب، تهيية",
  "treatment": "تدبير، معاملة، نقاش، علاج، معالجة، مناقشة، دواء",
  "truth": "حقيقة، صدق، صحة",
  "America": "الولايات المتحدة",
  "U.S.": "الولايات المتحدة",
  "using": "تسخير، استخدام، استغلال، استعمال",
  "values": "قيم",
  "voice": "ناطق، متحدث، ممثل، صوت",
  "wall": "حايط، جدار، ساتر، متراس",
  "war": "حارب، شن حربا، صارع، قاتل، حالة حرب، صراع، قتال، حرب",
  "water": "نظام مايي، ماء، بول، امداد مايي",
  "week": "اسبوع، اسبوع عمل",
  "wife": "زوجة، زوج",
  "window": "نافذة، شباك",
  "woman": "امراة",
  "word": "كلمة، اخبار، نقاش، لفظة، اخد وعطاء، نبا، خبر",
  "writing": "مادة مكتوبة، كتابة، تاليف، تحرير، عمل كتابي",
  "include": "ضم، وضع في، قبل، اضاف، اشتمل، سمح ل، سلم، اتسع ل، منحه حق، سمح بالدخول، درج، ضم الى، ضاف، منحه حق الدخول، رضي ب، اعترف، رضي، ادخل، طوق، قبله في، شمل، تضمن، اقر، سمح، ضمن"
}