{
  "chapter": "الفاتحة",
  "text": "بسم الله الرحمن الرحيم",
  "translations": [
    {
      "translation": "In the name of Allah, most benevolent, ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Merciful, the Compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Beneficent, the Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - beginning with the name of - the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of God, the Merciful, the Compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "﻿In the name of God, the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the All-beneficent, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, Most Gracious, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Most Beneficent, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Name of Allah, the Merciful, the Most Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of God, the Gracious, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the name of Allah, the Entirely Merciful, the Especially Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:1] In the Name of God, the Compassionate, the Merciful:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "In the name of Allah, the Beneficent, the Merciful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحَدَّثنا أبو جعفر\n قال: حَدَّثنا علي بن أحمد\n قال: حدَّثَنا عَطاءُ بنِ السَّائب\n قال: حدَّثَنا أبو خالد عمرو بن خالد الواسطي عن زيد بن علي عليهما السلام\n أنه سُئل عن فاتحةِ الكتابِ فقال: { بِسمِ ٱلله } هو تعظيمٌ لله { الرَّحْمٰنِ } بما خَلَقَ من الأرضِ في الأرضِ، والسَّماءِ في السَّماءِ",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nاسم الشيء ما يعرف به، فأسماء الله تعالى هي الصور النوعية التي تدلّ بخصائصها وهوياتها على صفات الله وذاته، وبوجودها على وجهه، وبتعينها على وحدته، إذ هي ظواهره التي بها يعرف\n و { الله } اسم للذات الإلهية من حيث هي هي على الإطلاق، لا باعتبار اتصافها بالصفات، ولا باعتبار لا اتصافها\n و { الرحمن } هو المفيض للوجود والكمال على الكل بحسب ما تقتضي الحكمة وتحتمل القوابل على وجه البداية\n و { الرحيم } هو المفيض للكمال المعنويّ المخصوص بالنوع الإنساني بحسب النهاية، ولهذا قيل: \" يا رحمن الدنيا والآخرة \" ، ورحيم الآخرة\n فمعناه بالصورة الإنسانية الكاملة الجامعة الرحمة العامّة والخاصة، التي هي مظهر الذات الإلهي والحق الأعظمي مع جميع الصفات ابدأ واقرأ، وهي الاسم الأعظم وإلى هذا المعنى أشار النبي صلى الله عليه وسلم بقوله:\n\n \" أوتيت جوامع الكلم، وبعثت لأتمم مكارم الأخلاق \" \n\n، إذ الكلمات حقائق الموجودات وأعيانها\n كما سمي عيسى عليه السلام كلمة من الله، ومكارم الأخلاق حالاتها وخواصها التي هي مصادر أفعالها جميعها محصورة في الكون الجامع الإنساني\n وههنا لطيفة وهي أن الأنبياء عليهم السلام وضعوا حروف التهجي بإزاء مراتب الموجودات\n وقد وجدت في كلام عيسى عليه الصلاة والسلام وأمير المؤمنين علي عليه السلام وبعض الصحابة ما يشير إلى ذلك\n ولهذا قيل: ظهرت الموجودات من باء بسم الله إذ هي الحرف الذي يلي الألف الموضوعة بإزاء ذات الله\n فهي إشارة إلى العقل الأول الذي هو أول ما خلق الله المخاطب بقوله تعالى:\n\n \" ما خلقت خلقاً أحب إليّ ولا أكرم عليّ منك، بك أعطي، وبك آخذ، وبك أثيب، وبك أعاقب\n\n\n \" \n\nالحديث\n والحروف الملفوظة لهذه الكلمة ثمانية عشر، والمكتوبة تسعة عشر\n وإذا انفصلت الكلمات انفصلت الحروف إلى اثنين وعشرين، فالثمانية عشر إشارة إلى العوالم المعبر عنها بثمانية عشر ألف عالم، إذ الألف هو العدد التام المشتمل على باقي مراتب الأعداد فهو أمّ المراتب الذي لا عدد فوقه، فعبر بها عن أمّهات العوالم التي هي عالم الجبروت، وعالم الملكوت، والعرش، والكرسي، والسموات السبع، والعناصر الأربعة، والمواليد الثلاثة التي ينفصل كل واحد منها إلى جزئياته\n والتسعة عشر إشارة إليها مع العالم الإنساني، فإنه وإن كان داخلاً في عالم الحيوان إلا أنه باعتبار شرفه وجامعيته للكل وحصره للوجود عالم آخر له شأن وجنس برأسه له برهان، كجبريل من بين الملائكة في قوله تعالى:\n\n[البقرة، الآية: 98]\n والألفات الثلاثة المحتجبة التي هي تتمة الاثنين والعشرين عند الانفصال إشارة إلى العالم الإلهيّ الحقّ، باعتبار الذات، والصفات، والأفعال\n فهي ثلاثة عوالم عند التفصيل، وعالم واحد عند التحقيق، والثلاثة المكتوبة إشارة إلى ظهور تلك العوالم على المظهر الأعظميّ الإنسانيّ ولاحتجاب العالم الإلهي\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بِسمِ ٱلله } المعبر بها عن الذات الأحدية، باعتبار تنزيلها عن تلك المرتبة؛ إذ لا يمكن التعبير عنها باعتبار تلك المرتبة أصلاً، وباعتبار شمولها وإحاطتها جميع الأسماء والصفات الإلهية المستندة إليها المظاهر كلها المعبر عنها عند أرباب المكاشفة بالأعيان الثابتة، وفي لسان الشرع باللوح المحفوظ والكتاب المبين { الرَّحْمٰنِ } المعبر بها عن الذات الأحدية باعتبار تجلياتها على صفحات الأكوان وتطوراتها في ملابس الوجودب والإمكان، وتنزيلها عن المرتبة الأحدية إلى مراتب العددية، وتعيناتها بالتشخيصات العلمية والعينية وانصباغها بالصبغ الكيانية { الرَّحِيـمِ } [الفاتحة: 1] المعبر بها عن الذات الأحدية باعتبار توحيدها بعد تكثيرها، وجمعها بعد تفريقها، وطيِّها بعد نشرها، ورفعها بعد خفضها، وتجريدها بعد تقييدها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الحمد } مبتدأ، و { الله } خبر، وأصله النصب، وقرئ به، والأصل: أحمد الله حمداً، وإنما عدل عنه إلى الرفع ليدل على عموم الحمد وثباته، دون تجدده وحدوثه، وفيه تعليم اللفظ مع تعريض الاستغناء\n أي: الحمد لله وإن لم تحمدوه\n ولو قال أحمد الله لما أفاد هذا المعنى، وهو من المصادر التي تُنْصَب بأفعال مضمرة لا تكاد تذكر معها\n والتعريف للجنس أي: للحقيقة من حيث هي، من غير قيد شيوعها، ومعناه: الإشارة إلى ما يَعْرِفه كل أحد أن الحمد ما هو\n أو للاستغراق إذ الحمد في الحقيقة كُلُّه لله إذ ما من خير إلا وهو مُولِيهِ بواسطة وبغير واسطة\n كما قال:\n\n[النّحل: 53]، وقيل: للعهد، والمعهودُ حمدُه تعالى نَفْسَه في أزله\n وقُرِئ { الحمد لله } بإتباع الدال للام، وبالعكس، تنزيلاً لهما من حيث إنهما يستعملان معاً منزلة كلمة واحدة\n ومعناه في اللغة: الثناءُ بالجميل على قصد التعظيم والتبجيل، وفي العُرف: فعل يُنبئ عن تعظيم المُنعم بسبب كونه منعماً\n والشكر في اللغة: فعل يُشعر بتعظيم المنعم، فهو مرادف للحمد العرفي، وفي العرف: صرفُ العبد جميعَ ما أنعم الله عليه من السمع والبصر إلى ما خُلِقَ لأجله وأعطاه إياه\n وانظر شرحنا الكبير للفاتحة في النَّسَبِ التي بيناها نظماً ونثراً\n و { الله } اسم مُرْتَجَلٌ جامد، والألف واللام فيه لازمة لا للتعريف، قال الواحدي: اسم تفرِّد به الباري - سبحانه - يجري في وصفه مجرى الأسماء الأعلام، لا يُعرف له اشتقاق، وقال الأقْلِيشي: إن هذا الاسم مهما لم يكن مشتقّاً كان دليلاً على عين الذات، دون أن يُنظر فيها إلى صفة من الصفات، وليس باسمٍ مشتق من صفة، كالعالِم والحق والخالق والرازق، فالألف واللام على هذا في الله من نفس الكلمة، كالزاي من زيد، وذهب إلى هذا جماعة، واختاره الغزالي، وقال: كل ما قيل في اشتقاقه فهو تعسُّف\n وقيل: مشتق من التَّأَلُّهِ وهو التعبد، وقيل: من الوَلَهَان، وهو الحيرة؟ لتحيُّر العقول في شأنه\n وقيل: أصله: الإلهُ، ثم حذفت الهمزة ونقلت حركتها إلى اللام، ثم وقع الإدغام وفُخمت للتعظيم، إلا إذا كان قبلها كسر\n و { رب } نعت { لله } ، وهو في الأصل: مصدر بمعنى التربية، وهو تبليغ الشيء إلى كماله شيئاً فشيئاً، ثم وُصف به للمبالغة كالصوم والعدل\n وقيل: هو وصفٌ من رَبِّه يَرُبُّهُ، وأصله: رَبَبَ ثم أُدغم، سُمي به المالكُ لأنه يحفظ ما يملكه ويربيه، ولا يطلق على غيره تعالى إلا بقيد كقوله تعالى:\n\n[يُوسُف: 50]\n قال ابن جُزَيّ: ومعانيه أربعة: الإله والسيد والمالك والمصلح، وكلها تصلح في رب العالمين، إلا أن الأرجح في معناه، الإله لاختصاصه بالله تعالى\n\n",
      "translations": []
    }
  ]
}