{
  "chapter": "الفاتحة",
  "text": "الحمد لله رب العلمين",
  "translations": [
    {
      "translation": "ALL PRAISE BE to Allah, Lord of all the worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, the Lord of the entire universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to God, Lord of the Universe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah, the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Al-Hamd be to Allah, the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God, the Lord of all Being,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Lord of the Worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to God, the Lord of the Universe;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise unto Allah, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah, Lord of all the worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, the Cherisher and Sustainer of the worlds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Lord of the Worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, Lord of the worlds -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:2] Praise be to God, is a predicate of a nominal clause, the content of which is intended to extol God [by stating that]: He possesses the praise of all creatures, or that He [alone] deserves their praise. God is a proper noun for the One truly worthy of worship; Lord of all Worlds, that is, [He is] the One Who owns all of creation: humans, jinn, angels, animals and others as well, each of which may be referred to as a ‘world’; one says ‘the world of men’, or ‘world of the jinn’ etc. This plural form with the yā’ and the nūn [sc. ‘ālamīn] is used to denote, predominantly, cognizant beings (ūlū ‘ilm). The expression [‘ālamīn] relates to [the term] ‘sign’ (‘alāma), since it is an indication of the One that created it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And on his authority it is related that Ibn 'Abbas said, regarding the saying of Allah, Exalted is He, (Praise be to Allah): 'He says: laudation is Allah's in that He is kind towards His created beings and, hence, they praise Him. It is also said that laudation is Allah's because of His excessive blessings upon His servants whom He has guided to believe in Him. It is also said: laudation, absolute unity and godhood all belong to Allah Who has neither progeny, partner, helper nor an assistant. (Lord of the worlds): Lord of any that has a spirit and walks about on the face of the earth and also of the dwellers of heaven. It is also said that this means: the Master of the jinn and human beings. It is also said that (Lord of the worlds) means the Creator of all created beings, their Provider and the One Who changes them from one state into another.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n { ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَالَمِينَ } فقال: الجنُ عالَمٌ والإِنسُ عالَمٌ، وسِوى ذلِكَ ثمانيةَ عشرَ ألفَ عَالَمٍ\n من الملائكةِ على الأَرضِ في كلِ زاويةٍ منها أربعةُ آلافٍ وخمسمائة عالَم خلقَهُمْ لِعِبادَتِهِ تَباركَ وتَعالى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحمد لله ربّ العالمين } إلى آخر السورة، الحمد بالفعل ولسان الحال هو ظهور الكمالات وحصول الغايات من الأشياء إذ هي أثنية فاتحة ومدح رائعة لموليها بما يستحقه\n فالموجودات كلها بخصوصياتها وخواصها، وتوجهها إلى غاياتها، وإخراج كمالاتها من حيز القوّة إلى الفعل، مسبحة، حامدة، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ } والثناء الشامل لجميع المحامد والأُثنِيّة الصادرة عن ألسنة ذرائر الكائنات المتوجهة نحو مبدعها طوعاً، المعترفة بشكر منعمها حالاً ومقالاً، أزلاً وأبداً، ثابتةً مختصة { للَّهِ } أي: للذات المستجمع لجميع الأسماء والصفات المظهرة المريبة للعوالم، وما فيها بأسرها لكونه { رَبِّ ٱلْعَالَمِينَ } [الفاتحة: 2] ولولا تربيته إياها وإمداده لها طرفة لفني العالم دفعة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الحمد } مبتدأ، و { الله } خبر، وأصله النصب، وقرئ به، والأصل: أحمد الله حمداً، وإنما عدل عنه إلى الرفع ليدل على عموم الحمد وثباته، دون تجدده وحدوثه، وفيه تعليم اللفظ مع تعريض الاستغناء\n أي: الحمد لله وإن لم تحمدوه\n ولو قال أحمد الله لما أفاد هذا المعنى، وهو من المصادر التي تُنْصَب بأفعال مضمرة لا تكاد تذكر معها\n والتعريف للجنس أي: للحقيقة من حيث هي، من غير قيد شيوعها، ومعناه: الإشارة إلى ما يَعْرِفه كل أحد أن الحمد ما هو\n أو للاستغراق إذ الحمد في الحقيقة كُلُّه لله إذ ما من خير إلا وهو مُولِيهِ بواسطة وبغير واسطة\n كما قال:\n\n[النّحل: 53]، وقيل: للعهد، والمعهودُ حمدُه تعالى نَفْسَه في أزله\n وقُرِئ { الحمد لله } بإتباع الدال للام، وبالعكس، تنزيلاً لهما من حيث إنهما يستعملان معاً منزلة كلمة واحدة\n ومعناه في اللغة: الثناءُ بالجميل على قصد التعظيم والتبجيل، وفي العُرف: فعل يُنبئ عن تعظيم المُنعم بسبب كونه منعماً\n والشكر في اللغة: فعل يُشعر بتعظيم المنعم، فهو مرادف للحمد العرفي، وفي العرف: صرفُ العبد جميعَ ما أنعم الله عليه من السمع والبصر إلى ما خُلِقَ لأجله وأعطاه إياه\n وانظر شرحنا الكبير للفاتحة في النَّسَبِ التي بيناها نظماً ونثراً\n و { الله } اسم مُرْتَجَلٌ جامد، والألف واللام فيه لازمة لا للتعريف، قال الواحدي: اسم تفرِّد به الباري - سبحانه - يجري في وصفه مجرى الأسماء الأعلام، لا يُعرف له اشتقاق، وقال الأقْلِيشي: إن هذا الاسم مهما لم يكن مشتقّاً كان دليلاً على عين الذات، دون أن يُنظر فيها إلى صفة من الصفات، وليس باسمٍ مشتق من صفة، كالعالِم والحق والخالق والرازق، فالألف واللام على هذا في الله من نفس الكلمة، كالزاي من زيد، وذهب إلى هذا جماعة، واختاره الغزالي، وقال: كل ما قيل في اشتقاقه فهو تعسُّف\n وقيل: مشتق من التَّأَلُّهِ وهو التعبد، وقيل: من الوَلَهَان، وهو الحيرة؟ لتحيُّر العقول في شأنه\n وقيل: أصله: الإلهُ، ثم حذفت الهمزة ونقلت حركتها إلى اللام، ثم وقع الإدغام وفُخمت للتعظيم، إلا إذا كان قبلها كسر\n و { رب } نعت { لله } ، وهو في الأصل: مصدر بمعنى التربية، وهو تبليغ الشيء إلى كماله شيئاً فشيئاً، ثم وُصف به للمبالغة كالصوم والعدل\n وقيل: هو وصفٌ من رَبِّه يَرُبُّهُ، وأصله: رَبَبَ ثم أُدغم، سُمي به المالكُ لأنه يحفظ ما يملكه ويربيه، ولا يطلق على غيره تعالى إلا بقيد كقوله تعالى:\n\n[يُوسُف: 50]\n قال ابن جُزَيّ: ومعانيه أربعة: الإله والسيد والمالك والمصلح، وكلها تصلح في رب العالمين، إلا أن الأرجح في معناه، الإله لاختصاصه بالله تعالى\n\n\nو { العالمين } جمع عالَم، والعالَمُ: اسم لما يُعْلَمُ به، كالخاتم لما يُختم به، والطابع لما يطبع به\n غلب فيما يُعلم به الصانع\n وهو كل ما سواه من الجواهر والأعراض، فإنها لإمكانها وافتقارها إلى مُؤثِرٍ واجبٍ لذاته، تدل على وجوده، وإنما جُمع ليشمل ما تحته من الأجناس المختلفة، وغلب العقلاء منهم فجُمِعَ بالياء والنون كسائر أوصافهم، فهو جمع، لا اسم جمع، خلافاً لابن مالك\n وقيل: اسم وضع لذوي العلم من الملائكة والثقلين، وتناولُه لغيرهم على سبيل الاستتباع، وقيل: عني به هنا الناس، فإن كل واحد منهم عالَمٌ، حيث إنه يشتمل على نظائر ما في العالم الكبير، ولذا سوّى بين النظر فيهما فقال:\n\n[الذّاريَات: 21]\n { قلت }: وإليه يشير قول الشاعر:\n",
      "translations": []
    }
  ]
}