{
  "chapter": "الفاتحة",
  "text": "ملك يوم الدين",
  "translations": [
    {
      "translation": "King of the Day of Judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Master of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Master of the Day of Judgment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Owner of the Day of Recompense\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Owner of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Master of the Day of Doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the Day of Judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sovereign of the Day of Requital.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Only Owner (and the Only Ruling Judge) of the Day of Recompense (i.e. the Day of Resurrection)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Owner of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Master of the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sovereign of the Day of Recompense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:4] Master of the Day of Judgement: that is, [the day of] requite, the Day of Resurrection. The reason for the specific mention [of the Day of Judgement] is that the mastery of none shall appear on that Day except that of God, may He be exalted, as is indicated by [God’s words] ‘Whose is the Kingdom today?’ ‘God’s’ [Q. 40:16] (if one reads it mālik [as opposed to malik], then this signifies that He has possession of the entire affair on the Day of Resurrection, or else that He is ever described by this [expression], in the same way as [He is described as] ‘Forgiver of sin’ (ghāfir al-dhanb). Thus, one can validly take it as an adjective of a definite noun).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Owner of the Day of Judgement) the Arbitrator on the Day of Judgement which is the Day of Reckoning and settlement of disputes between created beings, i.e. the Day when people are judged according to their deeds; there is no judge save Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَـٰلِكِ يَوْمِ ٱلدِّينِ } يومُ الحسابِ والجزاءِ\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَـٰلِكِ يَوْمِ ٱلدِّينِ } [الفاتحة: 4] والجزاء المسمى في الشرع بيوم القيامة، والطامة الكبرى المندكة فيها الأرض والسماء المطويات فيها سجلات الأولى والأخرى في الأرض؛ إذ فيها ارتجت الآراء والأفكار وارتفعت الحجب والأستار، واضمحلت أعيان السوى والأغيار، ولم يبق إلا الله الواحد القهار، ثم لما تحقق العبد في هذا المقام، ووصل إلى هذا المرام، وفوض الأمور كلها إلى الملك العلام القدوس السلام حق له أن يلازم ربه ويخاطب معه بلا ستر ولا حجاب، تتميماً لمرتبة العبودية إلى أن يرتفع كاف الخطاب عن البين، وينكشف الغين عن العين، وعند ذلك قال لسان مقالة مطابقاً بلسان حاله:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { مَلِكَ } نِعت لما قبله، قراءةُ الجماعة بغير ألف من المُلك بالضم، وقرأ عاصم والكسائي بالألف، من المِلك بالكسر، والتقدير على هذا: مالك مجيء يوم الدين، أو مالك الأمر يوم الدين\n وقراءةُ الجماعة أرجح، لثلاثة أوجه: الأول: أن الملك أعظم من مالك، إذ قد يوصف كل أحد بالمالك لماله، وأما المَلِكُ فهو سيد الناس، والثاني: قوله:\n\n[الأنعَام: 73]، والثالث: أنها لا تقتضي حذفاً، والحدف خلاف الأصل\n و { يوم الدين } ظرف مضاف إلى ما قبله على طريق الاتساع، وأُجري الظرف مجرى المفعول به، والمعنى على الظرفية، أي: الملك في يوم الدين، أو ملك الأمر يوم الدين، فيكون فيه حذف\n وقد رُويت القراءتان - أي: القصر والمد - عن النبيّ صلى الله عليه وسلم\n وقد قرئ { ملك } بوجوه كثيرة تركنا ذكرها لشذوذها\n\n\nفإن قيل: ملك ومالك نكرة لأن إضافة اسم الفاعل لا تُخصص، وكيف يُنعت به { الرحمان الرحيم } وهما معرفتان؟ قلت: إنما تكون إضافةُ اسم الفاعل لا تخصص إذا كان بمعنى الحال أو الاستقبال لأنها حينئذٍ غيرُ مَحْضَةٍ، وأما هذا فهو مستمر دائماً، فإضافته محضة\n قاله ابن جُزَيّ\n يقول الحقّ جلّ جلاله مُعلَّماً لعباده كيف يُثْنُونَ عليه ويعظمونه ثم يسألونه: يا عبادي قولوا { الحمد لله رب العالمين } أي: الثناء الجميل إنما يستحقه العظيم الجليل، فلا يستحق الحمدَ سواه، إذ لا منعم علىالحقيقة إلا الله،\n\n[النّحل: 53]\n أو جميعُ المحامدِ كلُّها لله، أو الحمدُ المعهودُ في الأذهان هو حمدُ الله تعالى نفسَه في أزله، قبل أن يُوجِدَ خلقّه، فلما أوجد خلقه قال لهم: الحمد لله، أي: احْمَدُوني بذلك المعهود في الأزل\n وإنما استحق الحمد وحده لأنه { ربّ العالمين } ، وكأن سائلاً سأله: لم اختصصت بالحمد؟ فقال: لأني ربُّ العالمين، أنا أوجدتُهم برحمتي، وأمددتهم بنعمتي، فلا منعم غيري، فاستحققت الحمد وحدي، مِنِّي كان الإيجاد وعليَّ توالي الإِمْدَاد، فأنا ربُّ العباد، فالعوالم كلها - على تعدد أجناسها واختلاف أنواعها - في قبضتي وتحت تربيتي ورعايتي\n قال بعضهم: خلق الله ثمانيةَ عَشرَ ألف عالَم، نصفها في البر ونصفها في البحر\n وقال الفخرُ الرازي: رُوِيَ أن بني آدم عُشْرُ الجن، وبنو آدم والجنُ عُشْرُ حيوانات البر، وهؤلاء كلُّهم عشر الطيور، وهؤلاء كلهم عشر حيوانات البحار، وهؤلاء كلهم عشر ملائكة الأرض الموكلين ببني آدم، وهؤلاء كلهم عشر ملائكة سماء الدنيا، وهؤلاء كلهم عشر ملائكة السماء الثانية، ثم على هذا الترتيب إلى ملائكة السماء السابعة، ثم الكلُّ في مقابلة الكرسي نَزْرٌ قليل، ثم هؤلاء عشر ملائكة السُّرَادِق الواحد من سُرادقات العرش، التي عددُها: مائةُ ألف، طول كل سرادق وعرضُه - إذا قُوبلتْ به السماوات والأرض وما فيهما وما بينهما - يكون شيئاً يسيراً ونَزْراً قليلاً\n وما من موضع شِبْرٍ، إلا وفيه مَلَكٌ ساجد أو راكع أو قائم، وله زَجَل بالتسبيح والتهليل\n ثم هؤلاء كلهم في مقابلة الذين يَجُولُون حول العرش كالقطرة في البحر، ولا يَعلم عددّهم إلا الله تعالى:\n\n[المدَّثِّر: 31]\n هـ\n وقال وَهْبُ بن مُنّبِّه: قائمُ العرش ثلاثُمائةٍ وست وستون قائمة، وبين كل قائمة وقائمة ستون ألف صحراء، وفي كل صحراء ستون ألف عالم، وكل عالم قَدْرُ الثقلين\n فهذه العوالم كلها في قبضة الحق وتحت تربيته وحفظه، يوصل المدد إلى كل واحد وهو في مستقرِّه ومستودعه، إما إلى روحانيته من قوة العلوم والمعارف، وإما إلى بشريته من قوة الأشباح، من العرش إلى الفرش، كلها مقدَّرة أرزاقها محصورة آجالُها، محفوظة أشباحُها، معلومات أماكنها، لا يخفى عليه شيء في الأرض ولا في السماء وهو السميع العليم\n\n\nثم هذه التربية التي ربى سبحانه بها خلقه إنما هي رحمة منه وإحسان، لا لزوم عليه وإيجاب، ولذلك وصلَه بقوله: { الرحمن الرحيم } ، أي: الرحمن بنعمة الإيجاد، الرحيم بنعمة الإمداد\n \" نعمتان ما خلا موجود عنهما، ولا بد لكل مُكَوَّنَ منهما: نعمة الإيجاد ونعمة الإمداد، أنعم أولاً بالإيجاد، وثنى بتوالي الإمداد \"\n كما في الحِكَم\n فاسمُه { الرحمن } يقتضي إيجادَ الأشياء وإبرازها، واسمه { الرحيم } يقتضي تربيتَها وإمدادها\n ولذلك لا يجوز إطلاق اسم { الرحمان } على أحد، ولم يَتَسَمَّ أحد به إذ الإيجاد لا يصح من غيره تعالى، بخلاف اسمه { الرحيم } فيجوز إطلاقه على غيره تعالى لمشاركة صدور الإمداد في الظاهر من بعض المخلوقات مجازاً وعاريةً\n أو: الرحمن في الدنيا والآخرة، والرحيم في الآخرة: لأن رحمة الآخرة خاصة بالمؤمنين\n أو الرحمن بجلائل النعم والرحيم بدقائقها، فجلائل النعم مثل: نعمة الإسلام والإيمان والإحسان، والمعرفة والهداية، وكشف الحجاب وفتح الباب والدخول مع الأحباب، ودقائقُ النعم مثل: الصحة والعافية والمال الحلال، وغير ذلك مما يأتي ذكره في المُنْعَم عليهم\n ثم من تحقق منه الإيجادُ والإمداد استحق أن يكون ملكاً لجميع العباد، ولذلك ذكرَهِ بِأَثَره فقال: { ملك يوم الدين } أي: المتصرف في عباده كيف شاء، لا رادّ لما قضى ولا مانع لما أعطى، فهو ملكُ الملوك رب الأرباب في هذه الدار وفي تلك الدار\n\n وإنما خصّ يوم الدين - وهو يوم الجزاء - بالملكية لأن ذلك اليوم يظهرُ فيه المُلْكُ لله عيَاناً لجميع الخلق، فإن الله تعالى يتجلّى لفصل عباده، حتى يراه المؤمنون عياناً، بخلاف الدنيا فإن تصرفه تعالى لا يفهمه إلا الكَمَلَةُ من المؤمنين، ولذلك ادَّعى كثير من الجهلة الملكَ ونسبوه لأنفسهم\n ويوم القيامة ينفرد الملك لله عند الخاص والعام، قال تعالى:\n\n[غَافر: 16]\n الإشارة: لما تلجَّى الحق سبحانه من عالَم الجبروت إلى عالم الملكوت، أو تقول: من عالم الغيب إلى عالم الشهادة، حمد نفسه بنفسه، ومجَّد نفسه بنفسه، ووحَّد نفسه بنفسه، ولله دَرُّ الهَرَوِيّ، حيث قال:\n\nفقال في توحيد نفسه بنفسه مترجماً عن نفسه بنفسه: { الحمد لله رب العالمين } ، فكأنه يقول في عنوان كتابه وسر خطابه: أنا الحامد والمحمود، وأنا القائم بكل موجود، أنا رب الأرباب، وأنا مسبب الأسباب لمن فهم الخطاب، أنا رب العالمين، أنا قيوم السموات والأرَضين، بل أنا المتوحِّدُ في وجودي، والمتجلِّي لعبادي بكرمي وجودي، فالعوالم كلها ثابتة بإثباتي، مَمْحُوَّةٌ بأحدية ذاتي\n قال رجل بين يدي الجنيد: { الحمد لله } ولم يقل: { رب العالمين } ، فقال له الجنيد: كَمِّلْهَا يا أخي، فقال الرجل: وأيّ قَدْر للعالمين حتى تُذكر معه؟! فقال الجنيد: قُلها يا أخي فإن الحادث إذا قُرن بالقديم تلاشى الحادُ وبقي القديم\n\n\nيقول سبحانه:\n\n \" يا مَن هو مني قريب، تَدبر سِرِّي فإنه غريب أنا المحبُ، وأنا الحبيب، وأنا القريب، وأنا المجيب، أنا الرحيم الرحمن، وأنا الملك الديّان، أنا الرحمن بنعمة الإيجاد، والرحيمُ بتوالي الإمداد\n منِّي كان الإيجاد، وعليَّ دوام الإمداد، وأنا رب العباد، أنا الملك الديَّان، وأنا المجازي بالإحسان على الإحسان، أنا الملك على الإطلاق، لولا جهالة أهل العناد والشقاق، الأمر لنا على الدوام، لمن فهم عنا من الأنام \"\n \n\nقال في الرسائل الكبرى: لا عبرة بظواهر الأشياء، وإنما العبرة بالسر المكنون، وليس ذلك إلا بظهور أمر الحق وارتفاع غَطَائه وزوال أستاره وخفائه، فإذا تحقق ذلك التجلّي والظهور، واستولى على الأشياء الفناءُ والدُّثُور، وانقشعت الظلمات بإشراق النور، فهناك يبدو عينُ ويَحِقُّ الحق المبين، وعند ذلك تبطل دعوى المدعين، كما يفهم العامة بطلان ذلك في يوم الدين، حين يكون الملك لله رب العالمين، وليت شعري أيُّ وقت كان الملكُ لسواه حتى يقع التقييد بقوله:\n\n[الحَجّ: 56]، وقوله:\n\n[الانفِطار: 19]؟! لولا الدعاوَى العريضة من القلوب المريضة\n هـ\n\n",
      "translations": []
    }
  ]
}