{
  "chapter": "الفاتحة",
  "text": "اياك نعبد واياك نستعين",
  "translations": [
    {
      "translation": "You alone we worship, and to You alone turn for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You alone do we worship, and You alone do we turn for help\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Lord), You alone We do worship and from You alone we do seek assistance\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You alone we worship and from You alone we seek help (and may we always).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You we worship, and You we ask for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thee do we serve and Thee do we beseech for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thee only we serve; to Thee alone we pray for succour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thee (alone) we worship; Thee (alone) we ask for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You alone we worship, and to You alone we turn for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thee alone do we worship and of Thee alone do we seek help,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You [alone] do we worship, and to You [alone] do we turn for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thee do we worship, and Thine aid we seek.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (Alone) we worship, and you (Alone) we ask for help (for each and everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (alone) we worship; and You (alone) we rely for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is You we worship, and upon You we call for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is You we worship and You we ask for help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:5] You [alone] we worship, and You [alone] we ask for help: that is to say, we reserve worship for You [alone] by way of acknowledging Your Oneness (tawhīd) and so on, and we ask for [Your] assistance in worship and in other things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thee (alone) we worship), we turn to you as the only One God and we obey you; ((Thee alone) we ask for help), we ask for your help in worshipping You and from You we obtain confidence in obeying You.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِيَّاكَ } لا إلى غيرك؛ إذ لا غير في الوجود معك { نَعْبُدُ } نتوجه ونسلك على وجه التذلل والخضوع؛ إذ لا معبود لنا سواك ولا مقصد إلا إياك { وَإِيَّاكَ نَسْتَعِينُ } [الفاتحة: 5] أي ما نطلب الإعانة والإقدار على العبادة لك إلا منك؛ إذ لا مرجع لنا غيرك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إياك } مفعول { نعبد } ، وقُدِّم للتعظيم والاهتمام به، والدلالِ على الحصر، ولذلك قال ابن عباس: نعبُدك ولا نعبد معك غيرَك، ولتقديم ما هو مقدَّمٌ في الوجود وهو الملك المعبود، وللتنبيه على أن العابدَ ينبغي أن يكون نظرُه إلى المعبود أولاً وبالذات، ومنه إلى العبادة، لا من حيث إنها عبادةٌ صدَرتْ عنه، بل من حيث إنها نِسْبَةٌ شريفة إليه، وَوُصْلَةٌ بينه وبين الحق، فإن العارف إنما يَحِقُّ وصوله إذا استغفر في ملاحظة جناب القدس، وغاب عما عداه، حتى إنه لا يلاحظ نفسَه ولا حالاً من أحوالها إلا من حيث إنها تَجَلٍّ من تجلياته ومظهرٌ لربوبيته، ولذلك فُضِّلَ ما حكى اللَّهُ عن حبيبه حين قال:\n\n[التّوبَة: 40]، على ما حكاه عن كليمه حيث قال:\n\n[الشُّعَرَاء: 62]، أي: حيث صرّح بمطلوبه، و { إياك } مفعول { نستعين } وقدّم أيضاً للاختصاص والاهتمام، كما تقدم في { إياك نعبد }\n وكرّر الضمير ولم يقل: إياك نعبد ونستعين لأن إظهارَه أبلغ في إظهار الاعتماد على الله، وأقطعُ في إحضار التعلق بالله والإقبال على الله وأمدحُ، ألا ترى أن قولك: بك أنتصر وبك أحتمي وبك أنال مطالبي - أبلغ وأمدح من قولك: بك أنتصر وأحتمي\n\n\n الخ؟ وَقَدَّمَ العبادة على الاستعانة ليتوافقَ رؤوسُ الآي، وليُعلمَ منه أن تقديم الوسيلة على طلب الحاجة أَدْعَى إلى الإجابة، فإن مَنْ تَلبَّس بخدمة الملك وشرع فيها بحسب وُسْعَه، ثم طلب منه الإعانة عليها أجيب إلى مطلبه، بخلاف من كلّفه الملكُ بخدمته، فقال: أعطني ما يعينُني عليها، فهو سوء أدب، وأيضاً: من استحضر الأوصافَ العِظام ما أمكنه إلا المسارعةُ إلى الخضوع والعبادة، وأيضاً: لمّا نسبَ المتكلمُ العبادةَ إلى نفسه أوْهَمَ ذلك تبجحاً واعتداداً منه بما يصدُر عنه فعقَّبه بقوله: { وإياك نستعين } ، دفعاً لذلك التوهم\n والعبادة: أقصى غاية الخضوع والتذلل، ومنه طريق مُعَبَّدٌ، أي: مُذَلل، والاستعانة، طلب المعونة، والمراد طلب المعونة في المُهمات كُلِّها، أو في أداء العبادات\n والضمير المستتر في الفعلين للقارئ ومن معه من الحفظة وحاضري صلاة الجماعة، أو له ولسائر الموجودين\n أدْرَجَ عبادته في تضاعيف عبادتهم وخلط حاجته بحاجتهم لعلها تُقبل ببركتها ويُجاب إليها، ولهذا شرعت الجماعة\n قاله البيضاوي\n يقول الحقّ جلّ جلاله، تتميماً لتعليم عباده: فإذا أثنيتمُ عليَّ ومجدتموني وعظمتموني فأقِرُّوا لي بالربوبية، وأظهروا من أنفسكم العبودية، واطلبوا مني العون في كل وقت وقولوا: { إياك نعبد وإياك نستعين } ، وكأنه - جلّ جلاله - لَمّا ذكر أنه مستحق للمحامد كلها قديمها وحديثها لأنه رب العوالِم وقيومها، أصل الأصول وفروعها، أنعم عليها أولاً بالإيجاد، وثانياً بتوالي الإمداد، فهو مالكها على الإطلاق، ذكر أنه لا يستحق أن يُعبد سواه إذ لا مُنعمَ على الحقيقة إلا الله، فهو أحقُّ أن يُعبد، وأولى أن يفرد بالوجهة والقصد، لأنه مُسْتَبِدٌ وغير مُسْتَمدّ، والمادة من عَيْنِ الجود، فإذا انقطعت المادة انعدم الوجود\n\n\nقال البيضاوي: ثم إنه لما ذكر الحقيق بالحمد، ووصف بصفات عظام تميَّز بها عن سائر الذوات، تعلَّق العلمُ بمعلوم معين، خوطب بذلك، أي: يا من هذا شأنه نخصُّك بالعبادة والاستعانة، لكون أدلّ على الاختصاص، وللترقي من الغَيْبة إلى الشهود، وكأن المعلومَ صار عياناً، والمعقولَ مُشاهَداً، والغيبة حضوراً، بَنَى أول الكلام على ما هو مبادئ حالِ العارفِ من الذكر والفكر والتأمل في أسمائه، والنظر في آلائه، والاستدلال بصنائعه على عظيم شأنه وباهر سلطانه، ثم قفَّى بما هو منتهى أمرِه، وهو أن يخوض لُجَّةَ الوصول،ويصير من أهل المشاهدة، فيراه عياناً ويناجيه شِفاها، اللهم اجعلنا من الواصلين إلى العين دون التابعين للأثر\n ومن عادة العرب التفنن في الكلام والعدول عن أسلوبٍ إلى آخر، تَطْريَةً وتنشيطاً للسامع، فَتَعْدِل من الخطاب إلى الغيبة، ومن الغيبة إلى التكلم، كقوله:\n\n[يُونس: 22]، ولم يقل بكم وقوله:\n\n[فَاطِر: 9]، أي: ولم يقل: فساقه\n\n\n انظر تمام كلامه\n والالتفات هذا في قوله: { إياك نعبد } ولم يقل: إياه نعبد لأن الظاهر من قبل الغيبة، وحسنه أن الموصوف تعيَّن وصار حاضراً\n قال الأقليشي: فهذه الآية هي التي قال فيها النبيّ صلى الله عليه وسلم:\n\n \" فإذا قال العبد: إياك نعبد وإياك نستعين، يقول الله تعالى: هذه بيني وبين عَبْدِي ولعَبْدِيَ مَا سَأَلَ \" \n\nمعناه: أيُّ عبد توجَّه إليَّ بالعبادة وسألني العون عليها فعبادته متقبلة، والعون مني له عليها حاصل حتى يُوقعها على وجهها، فالعبادة وصف العبد، والعون من الله تعالى للعبد، فلهذا قال: \" فهذه بيني وبين عبدي \"\n قال ابن جُزَي: أي نطلب العون منك على العبادة وعلى جميع أمورنا، وفي هذا دليل على بطلان قول القدَرية والجبرية، وأنَّ الحق بين ذلك\n { الإشارة }: لمّا تجلّى الحقّ جلّ جلاله من عالم الجبروت إلى عالم الملكوت، وحَمِدَ نفسه بنفسه، تجلّى أيضاً وتنزَّل من عالم الملكوت إلى عالم المُلك بقدرته وحكمته لإظهار آثار أسمائه وصفاته، فأظهر العبودية وأخفى الربوبية، أظهر الحكمة وأبطن القدرة، فجعلَ عالَم الحكمة يخاطبُ عالمَ القدرة، ويخضع له، ويتعبّد ويستمد، منه الإعانة والهداية، ويتحرز من طريق الضلالة والغواية\n فعالَمً الحكمة محلُّ التكليف، وعالم القدرة محل التصريف، عالم الحكمة عالم الأشباح، وعالم القدرة عالم الأرواح، فإياك نعبد لأهل عالم الحكمة، وإياك نستعين لأهل عالم القدرة، ولذلك قال الشيخ أبو العباس المرسي رضي الله عنه: { إياك نعبد } شريعة، و { إياك نستعين } حقيقة، و { إياك نعبد } إسلاماً، و { إياك نستعين } إحساناً، { إياك نعبد } عبادة، و { إياك نستعين } عبودية، { إياك نعبد } فَرْقٌ، { إياك نسعتين } جَمْعٌ\n\n\nهـ\n وإن شئت قلت: { إياك نعبد } لأهل العمل لله وهم المخلصون، و { إياك نستعين } لأهل العمل بالله وهم الموحِّدون، العمل لله يوجب المثوبة، والعمل بالله يوجب القُرْبَة، العمل لله يوجب تحقيق العبادة، والعمل بالله يوجب تصحيح الإرادة، العمل لله نعتُ كُلِّ عابد، والعمل بالله نعت كل قاصد، العمل لله قيامٌ بأحكام الظواهر، والعمل بالله قيام بإصلاح الصمائر، قاله القشيري\n ثم إنَّ الناسَ في شهود القدرة والحكمة على ثلاثة أقسام: قسم حُجبوا بالحكمة عن شهود القدرة، وهم أهل الحجاب من أهل الغفلة، وقفوا مع قوله: { إياك نعبد } ،وقسم حُجبوا بشهود القدرة عن الحكمة، وهم أهل الفناء، وقفوا مع قوله: { إياك نستعين } ، وقسم لم يحجبوا بالحكمة عن القدرة ولا بالقدرة عن الحكمة، أَعْطَوا كُلَّ ذي حق حقَّه وَوَفَّوْا كل ذي قسط قسطه، وهم أهل الكمال من أهل البقاء، جمعوا بين قوله: { إياك نعبد وإياك نستعين } ، وبالله التوفيق\n\n",
      "translations": []
    }
  ]
}