{
  "chapter": "الفاتحة",
  "text": "صرط الذين انعمت عليهم غير المغضوب عليهم ولا الضالين",
  "translations": [
    {
      "translation": "The path of those You have blessed, Not of those who have earned Your anger, nor those who have gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way of those whom You have favoured, who did not incur Your wrath, who are not astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of those to whom You have granted blessings, those who are neither subject to Your anger nor have gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those whom You have favoured – Not the path of those who earned Your anger – nor of those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way of those upon whom You have bestowed Your grace, not (that) of those who earned Your anger, nor of those who went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those upon whom Thou hast bestowed favors. Not (the path) of those upon whom Thy wrath is brought down, nor of those who go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of those whom Thou hast blessed, not of those against whom Thou art wrathful, nor of those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those whom Thou hast favoured; Not the (path) of those who earn Thine anger nor of those who go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of those You have blessed; not of those who have incurred Your wrath, nor of those who have gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those whom Thou hast favoured. Not of those on whom is indignation brought down, nor of the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the path of those whom You have blessed — such as have not incurred Your wrath, nor are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The way of those on whom Thou hast bestowed Thy Grace, those whose (portion) is not wrath, and who go not astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Way of those on whom You have bestowed Your Grace, not (the way) of those who earned Your Anger, nor of those who went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Path of those upon whom You have favored, not those upon whom is the anger, nor the astray. (Amen please answer)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those You have blessed, not of those against whom there is anger, nor of those who are misguided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[1:7] the path of those whom You have favoured, with guidance (from alladhīna together with its relative clause is substituted by [ghayri l-maghdūbi ‘alayhim]) not [the path] of those against whom there is wrath, namely, the Jews, and nor of those who are astray, namely, the Christians. The subtle meaning implied by this substitution is that the guided ones are neither the Jews nor the Christians. But God knows best what is right, and to Him is the Return and the [final] Resort. May God bless our master   Muhammad (s), his Family and Companions and grant them everlasting peace. Sufficient is God for us; an excellent Guardian is He. There is no power and no strength save in God, the High, the Tremendous.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The path of those whom Thou hast favoured), the Religion of those whom You have blessed with the Religion and who are the followers of Moses, before the blessings of Allah deserted them, in that He shaded them with a white cloud and sent down on them honey and quails when they were in the wilderness. It is also said that (the path of those whom Thou hast favoured) refers to the prophets. (Not of those who earn Thine anger), not the religion of the Jews who earned Your anger, whom You forsook and whose hearts You did not protect until they became complaisant. (Nor of those who go astray), nor the religion of the Christians who erred from Islam. Amen: thus shall be its custodians; it is also said that Amen means let it be so. It is also said that it means: our Lord! Do with us as we have requested You. And Allah knows best'. And of the surah in which the Cow (al-Baqarah) is mentioned, which is Medinan in its entirety- although it is also said to be Meccan -and consists of 280 verses, 3,100 words and 25,500 letters. Surah 2: The Cow (al-Baqarah) And of the surah in which the Cow (al-Baqarah) is mentioned, which is Medinan in its entirety — although it is also said to be Meccan — and consists of 280 verses, 3,100 words and 25,500 letters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولٌه تعالى: { ٱلْمَغْضُوبِ عَلَيْهِم وَلاَ ٱلضَّآلِّينَ } هم اليهودُ والنصارى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { غير المغضوب عليهم } الذين وقفوا مع الظواهر، واحتجبوا بالنعمة الرحمانية، والنعيم الجسمانيّ، والذوق الحسيّ عن الحقائق الروحانية، والنعيم القلبي، والذوق العقليّ كاليهود إذ كانت دعوتهم إلى الظواهر والجنان والحور والقصور، فغضب عليهم لأن الغضب يستلزم الطرد والبعد والوقوف مع الظواهر التي هي الحجب الظلمانية غاية البعد\n { ولا الضالين } الذين وقفوا مع البواطن التي هي الحجب النورانية واحتجبوا بالنعمة الرحيمية عن الرحمانية، وغفلوا عن ظاهرية الحقّ، وضلّوا عن سواء السبيل، فحرموا شهود جمال المحبوب في الكلّ كالنصارى إذ كانت دعوتهم إلى البواطن وأنوار عالم القدّوس ودعوة المحمديين الموحدين إلى الكلّ، والجمع بين محبة جمال الذات، وحسن الصفات، كما ورد في القرآن الكريم:\n\n[آل عمران، الآية: 133]،\n\n[الحديد، الآية: 28]،\n\n[النساء، الآية: 36]، فأجابوا الدعوات الثلاث\n كما جاء في حقهم:\n\n[الإسراء، الآية: 57]،\n\n[التحريم، الآية: 8]،\n\n[فصلت، الآية: 30]\n فأثيبوا بالجميع على ما أخبر الله تعالى:\n\n[البينة، الآية: 8]،\n\n[الحديد، الآية: 19]،\n\n[البقرة: 115]،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ } من النبيين والصديقين والشهداء والصالحين، وحسن أولئك رفيقاً { غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم } من المرتدين الشاكين، المنصرفين بمتابعة العقل المشوب بالوهم عن الطريق المستبين\n\n\n\n\n{ وَلاَ ٱلضَّآلِّينَ } [الفاتحة: 7] بتغريرات الدنيا وتسويلات الشياطين عن منهج الحق ومحجة اليقين\n\n\nآمين: إجابة منك يا أرحم الراحمين\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المتوجه نحو توحيد الذات - يسَّر الله أمرك - أن تتأمل في الأبجر السبعة المشتمل بهذا السبع المثاني في القرآن العظيم، المتفرعة على الصفات السبع الذاتية الإلهية، الموافقة للسماوات السبع والكواكب السبعة الكونية، وتدبر فيها حق التدبر، وتتصف بما رمز فيها تتخلص من الأودية السبعة الجهنمية، المانعة من الوصول إلى جنة الذات المستهلكة عندها جميع الإضافات والكثرات ولا يتيسر لك هذا التأمل والتدبر إلا بعد تصفية ظاهرك بالشرائع النبوية والنواميس المصطفوية المستنبطة من الكلم القرآنية، وباطنك بعزائمه وأخلاقه صلى الله عليه وسلم المقتبسة من حكمها المودعة فيها، فيكن القرآن الجامع له خلق النبي صلى الله عليه وسلم ظاهراً وباطناً، المورث له من ربه المستخلف له\n\n\n\n\nفالقرآن خلق الله المنزل على نبيه، من تخلق به فاز بما فاز، لذلك قال صلى الله عليه وسلم:\n\n \" تخلقوا بأخلاق الله \" \n\nوهي التي ذكرت في القرآن، والفاتحة منتخبة من جميع القرآن على أبلغ وجه وأوضح بيان، من تأمل فيها نال ما نال من جميع القرآن، لذلك فرض قراءتها عند الميل والتوجه إلى الذات الأحدية المعبر عنه بلسان الشرع، بالصلاة التي هي معراج أهل الاتجاه، كما قال صلى الله عليه وسلم:\n\n \" الصلاة معراج المؤمن \" \n\n، وقال أيضاً:\n\nلا صلاة إلا بفاتحة الكتاب\n\n\n\nفعليك أيها المصلي المتوجه إلى الكعبة الحقيقة والقبلة الأصلية أن تواظب على الصلوات المفروضة المقربة إليها، وتلازم الحكم والأسرار المودعة في تشريعها، بحيث إذا أردت الميل إلى جنابه والتوجه نحو بابه لا بد لك أولاً من التوضؤ والتطهر عن الخبائث الظاهر والباطنة كلها، والتخلي عن اللذات والشهوات برمتها إلى حيث تيسر لك التحريمة بلا وسوسة شياطين الأهواء المظلة\n\n\n\n\nفإذا قلت مكبراً محرماً على نفسك جميع حظوظك من دنياك: الله أكبر، لا بد لك أن تلاحظ معناه بأنه: الذات الأعظم الأكبر في ذاته لا بالنسبة إلى الغير؛ إذ لا غير، وافعل هذا للصفة لا للتفضيل وتجعلها نصيب عينيك وعين مطلبك ومقصدك\n\n\n\n\nوإذا قلت قلت متيمناً متبركاً: بسم الله، انبعثت رغبتك إليه ومحبتك له\n\n\n\n\nوإذا قلت: الرحمن، استنشقته من النفس الرحماني ما يعينك على الترقي نحو جنابه\n\n\n\n\nوإذا قلت: الرحيم، استروحت بنفحات لطفه ونسمات رحمته، وجئت بمقام الاستئناس معه سبحانه بتعديد نعمه على نفسك\n\n\n\n\nوإذا قلت شاكراً لنعمه: الحمد لله، توسلت بشكر نعمه إليه\n\n\n\n\nوإذا قلت: رب العالمين، تحققت بإحاطته وشموله وتربيته على جميع الأكوان\n\n\n\n\nوإذا: قلت الرحمن، رجوت من سعة رحمته وعموم إشفاقه ومرحمته\n\n\n\n\nوإذا قلت: الرحيم: نجوت من العذاب الأليم الذي هو الالتفات إلى غير الحق، ووصلت إليه بعدما فصلت عنه بل اتصلت\n\n\nوإذا قلت: مالك يوم الدين، قطعت سلسلة الأسباب مطلقاً، وتحققت بمقام الكشف الشهود وحين ظهر لك ما ظهر، فلك أن تقول في تلك المقام والحالة بلسان الجمع: إياك نعبد، بك مخاطبين لك وإياك نستعين بإعانتك مستعينين منك\n\n\n\n\nوإذا قلت: اهدنا الصراط المستقيم، تحققت بمقام العبودية\n\n\n\n\nوإذا قلت: صراط الذين أنعمت عليهم، تحققت بمقام الجمع\n\n\n\n\nوإذا قلت: غير المغضوب عليهم، استوحشت من سطوة سلطنة صفاته الجلالية\n\n\n\n\nوإذا قلت: ولا الضالين، خفت من الرجوع بعد الوصول\n\n\n\n\nوإذا قلت: آمين، أمنت من الشيطان الرجيم\n\n\n\n\nفلك أن تصلي على الوجه الذي تلي، حتى تكون لك صلاتك معراجاً إلى ذروة الذات الأحدية ومرقاة إلى السماء السرمدية، ومفتاحاً للخزائن الأزلية الأبدية، وذلك لا يتيسر إلا بعد الموت الإرادي من مقتضيات الأوصاف البشرية، والتخلق بالأخلاق المرضية والخصال السنية، ولا يحصل لك هذا الميل إلا بعد العزلة والفرار عن الناس المنهمكين في الغفلة، والانقطاع عنهم وعن وسوستهم وعاداتهم المرة، وإلا فالطبيعة سارقة والأمراض سارية والنفوس آمرة بالهوى، مائلة عن المولى، عصمنا الله من شرورها وخلصنا من غرورها بمنه وجوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { صراط } بدل من الأول - بدل الكل من الكل - وهو في حكم تكرير العامل من حيث إنه المقصود بالنسبة، وفائدته: التوكيد والتنصيص على أن طريق المسلمين هو المشهود عليه بالاستقامة، على آكد وجه وأبلغه لأنه جعله كالتفسير والبيان له، فكأنه من البيِّن الذي لا خفاء فيه، وأن الصراط المستقيم ما يكون طريق المؤمنين، و { غير المغضوب عليهم } بدل من { الذين } على معنى أن المُنْعَمَ عليهم هم الذي سَلِمُوا من الغضب والضلال\n أو صفة له مُبيَّنة أو مقيدة على معنى أنهم جمعوا بين النعمة المطلقة، وهي نعمة الإيمان، وبين السلامة من الغضب والضلال، وذلك إنما يصح بأحد تأويلين: إجراء الموصول مجرى النكرة، إذ لم يُقصد به معهود كالمعرَّف في قوله:\n\nأو يُجعل { غير } مَعْرِفةً لأنه أُضيف إلى مآلَهُ ضدٍّ واحد، وهو المنعمُ عليه، فيتعينُ تَعيُّن الحركة غير السكون، وإلا لزِم عليه نعت المعرفة بالنكرة\n فتأملْهُ\n والغضبُ: ثَوَرانُ النفس إرادةَ الانتقام، فإذا أسند إلى الله تعالى أريد غايته وهو العقوبة، و { عليهم } نائب فاعل: و { لا } مَزيدة لتأكيد ما في { غير } من معنى النفي، فكأنه قال: ولا المغضوب عليهم ولا الضالين، وقرأ عمرُ رضي الله عنه: { وغير الضالين } ، والضلال: والعدول عن الطريق السوي عمداً أو خطأً، وله عرض عَريضٌ والتفاوت بين أدناه وأقصاه كبير\n قاله البيضاوي\n وإنما أَسند النعمة إلى الله والغضبَ إلى المجهول تعليماً للأدب،\n\n[النِّساء: 79] الآية\n يقول الحقّ جلّ جلاله في تفسير الطريق المستقيم: هو طريق الذين أنعمتُ عليهم بالهداية والاستقامة، والمعرفة العامة والخاصة، من النبيين والصديقين والشهداء والصالحين، والمُنعَم عليهم في الآية مطلق، يصدق كل منعَم عليه بالمعرفة والاستقامة في دينه، كالصحابة وأضرابِهِمْ، وقيل: المراد بهم أصحاب سيّيدنا موسى عليه السلام قبل التحريف\n وقيل: أصحاب سيدنا عيسى قبل التغيير\n والتحقيق أنه عام\n قال البيضاوي: ونِعَمُ الله وإن كانت لا تُحصى كما قال الله:\n\n[إبراهيم: 34] تنحصر في جنسين: دنيوي وأخروي\n فالأول: وهو الدنيوي - قسمان: موهبي وكَسْبِي، والموهبي قسمان: رُوحاني، كنفخ الروح فيه وإشراقه بالعقل وما يتبعه من القوي، كالفهم والفكر والنطق، وجسماني: كتخليق البدن بالقوة الحالة فيه والهيئات العارضة له من الصحة وكمال الأعضاء\n والكسبي: كتزكية النفس عن الرذائل، وتحليتها بالأخلاق الحسنة والملكات الفاضلة، وتزيين البدن بالهيئات المطبوعة والحُلي المستحسنة، وحصول الجاه والمال\n والثاني: وهو الأُخروي: أن يغفر له ما فَرَطَ منه ويرضى عنه ويُبوأهُ في أعلى علِّيين، مع الملائكة المقربين أبد الآبدين، والمراد القسمُ الأخير، وما يكون وُصْلة إلى نيله من القسم الأول، وأما ما عدا ذلك فيشترك فيه المؤمن والكافر\n\n\nهـ\n قال ابن جُزَيّ: النعم التي يقع عليها الشكر ثلاثة أقسام، دنيوية: كالصحة والعافية والمال الحلال\n ودينية: كالعلم والتقوى والمعرفة\n وأخرويةٌ: كالثواب على العمل القليل بالعطاء الجزيل: وقال أيضاً: والناس في الشكر على مقامين: منهم مَن يشكر على النعم الواصلة إليه، الخاصة به، ومنهم مَن يشكر الله عن جميع خلقه على النعم الواصلة إلى جميعهم\n والشكر على ثلاث درجات: فدرجة العوام، الشكر على النعم، ودرجة الخواص: الشكر على النعم والنقم وعلى كل حال، ودرجة خواص الخواص: أن يغيب عن رؤية النعمة بمشاهدة المُنعم\n قال رجل لإبراهيم بن أدهَمَ رضي الله عنه: الفقراء إذا أُعْطُوا شَكَرُوا وإذا مُنعوا صَبَبروا، فقال إبراهيم: هذه أخلاقُ الكلاب، ولكن القومَ إذا مُنِعوا شكروا وإذا أُعْطُوا آثروا\n هـ\n ثم احترس من الطريق غير المستقيمة، فقال: { غير المغضوب عليهم } أي: غير طريق الذين غضبت عليهم، فلا تهدنا إليها ولا تسلك بنا سبيلها، بل سلَّمنَا من مواردها\n والمراد بهم: اليهود، كذا فسرها النبيّ صلى الله عليه وسلم، ويَصْدُقُ بحسب العموم على كل من غضب الله عليهم، { ولا الضالين } أي: ولا طريق الضالين، أي: التالفين عن الحق، وهم النصارى كما قال صلى الله عليه وسلم\n والتفسيران مأخوذان من كتاب الله تعالى\n قال تعالى في شأن اليهود:\n\n[البَقَرَة: 90]، وقال في حق النصارى:\n\n[المَائدة: 77 }\n واعلم أن الحق - سبحانه - قسم خلقه على ثلاثة أقسام: قسم أعدَّهم للكرم والإحسان، ليُظْهِرَ فيهم اسم الكريم أو الرحيم، وهو المنعم عليه بالإيمان والاستقامة\n وقسم أعدَّهم للانتقام والغضب، ليُظهر فيهم اسمه المنتقم أو القهار، وهم المغضوب وعليهم والضالون عن طريق الحق عقلاً أو عملاً، وهم الكفار، وقسم أعدَّهم الله للحِلْم والعفو، ليُظهر فيهم اسمه تعالى الحليم والعفو، وهم أهل العصيان من المؤمنين\n فمن رَامَ أن يكونَ الوجودُ خالياً من هذه الأقسام الثلاثة، وأن يكون الناس كلهم سواء في الهداية أو ضدها، فهو جاهل بالله وبأسمائه إذ لا بد من ظهور آثار أسمائه في هذا الآدمي، من كرم وقهرية وحِلْم وغير ذلك\n والله تعالى أعلم\n الإشارة: الطريق المستقيم التي أمرنا الحق بطلبها هي: طريق الوصول إلى الحضرة، التي هي العلم بالله على نعت الشهود والعيان، وهو مقام التوحيد الخاص، الذي هو أعلى درجات أهل التوحيد، وليس فوقه إلا مقامُ توحيد الأنبياء والرسل، ولا بد فيه من تربية على يد شيخ كامل عارف بطريق السير، قد سلك المقامات ذوقاً وكشفاً، وحاز مقام الفناء والبقاء، وجمع بين الجذب والسلوك لأن الطريق عويص، قليلٌ خُطَّارُهُ، كثيرٌ قُطَّاعُه، وشيطانُ هذا الطريق فَقِيهٌ بمقاماته ونوازِله، فلا بد فيه من دليل، وإلا ضلّ سالكها عن سواء السبيل، وإلا هذا المعنى أشار ابن البنا، حيث قال:\n\n\n\nوقال في لطائف المنن: من لم يكن له أستاذ يصله بسلسلة الأتباع، ويكشف له عن قلبه القناع، فهو في هذا الشأن لَقيطٌ لا أب له، دَعِيٍّ لا نَسَبَ له، فإن يكن له نور فالغالب غلبة الحال عليه، والغالب عليه وقوفه مع ما يرد من الله إليه، لم تَرْضْهُ سياسةُ التأديب والتهذيب، ولم يَقُدْهُ زمَانمُ التربية والتدريب، فهذا الطريق الذي ذكرنا هو الذي يستشعره القارئ للفاتحة عند قوله: { اهدنا الصراط المستقيم } مع الترقي الذي ذكره الشيخ أو العباس المرسي رضي الله عنه المتقدم، وإذا قرأ { صراط الذين أنعمت عليهم } استشعر، أَيْ: أنعمتَ عليهم بالوصول والتمكين في معرفتك\n وقال الورتجبي: اهدنا مُرَادَك مِنَّا لأن الصراط المستقيم ما أراد الحق من الخلق، من الصدق والإخلاص في عبوديته وخدمته\n ثم قال: وقيل: اهدنا هُدَى العِيَانِ بعد البيان، لتستقيم لك حسب إرادتِك\n وقيل: اهدنا هُدَى مَنْ يكون منك مبدؤه ليكون إليك منتهاه\n ثم قال: وقال بعضهم: اهدنا، أي: ثبِّتْنا على الطريق الذي لا اعوجاج فيه، منازل الذين أنعمت عليهم بالمعرفة والمحبة وحسن الأدب في الخدمة\n ثم قال: وقال بعضهم: اهدنا، أي: ثبِّتْنا على الطريق الذي لا اعوجاج فيه، وهو الإسلام، وهو الطريق المستقيم والمنهاج القويم { صراط الذين أنعمت عليهم } أي: منازل الذين أنعمت عليهم بالمعرفة والمحبة وحسن الأدب في الخدمة\n ثم قال: { غير المغضوب عليهم } يعني: المطرودين عن باب العبودية، { ولا الضالين } يعني المُفْلِسين عن نفائس المعرفة\n هـ\n قلت: والأحسن أن يقال: { غير المغضوب عليهم } هم الذين أَوْقَفَهُمْ عن السير اتباعُ الحظوظ والشهوات، فأوقعهم في مَهَاوِي العصيان والمخالفات، { ولا الضالين } هم الذين حبسهم الجهل والتقليد، فلم تنفُذْ بصائرهم إلى خالص التوحيد، فنكصوا عن توحيد العيان إلى توحيد والبرهان، وهو ضلال عند أهل الشهود والعِيان، ولو بلغ في الصلاح غايةَ الإمكان\n وقال في الإحياء: إذا قلت: { بسم الله الرحمن الرحيم } فافْهَمْ أن الأمور كلها بالله، وأن المراد ها هنا المُسمَّى، وإذا كانت الأمورُ كلها بالله فلا جرَم أنَّ الحمد كله لله، ثم قال: وإذا قلت: { الرحمن الرحيم } فأحضرْ في قلبك أنواعَ لطفه لتتفتحَ لك رحمتُه فينبعث به رجاؤُك، ثم استشعر من قلبك التعظيم والخوف من قولك: { يوم الدين }\n ثم قال: ثم جَدَّد الإخلاص بقولك: { إياك نعبد }\n وجدَّد العجز والاحتياج والتبرِّيَ من الحوْل والقوة بقولك: { وإياك نستعين } ، ثم اطلب اسم حاجتك، وقل: { اهدنا الصراط المستقيم } الذي يسوقنا إلى جوارك ويُفضي بنا إلى مرضاتك، وزِدْهُ شرحاً وتفصيلاً وتأكيداً، واستشهد بالذين أفاض عليهم نعم الهداية من النبيين والصديقين والشهداء والصالحين، دون الذين غضب عليهم من الكفار والزائغين واليهود والنصارى والصابئين\n هـ\n ملخصاً\n وقال القشيري: قوله تعالى: { اهدنا الصراط المستقيم } الأمر في هذه الآية مضمر، أي: قولوا: اهدنا\n والصراط المستقيم: طريق الحق، وهو ما عليه أهل التوحيد، أي: أرشدْنا إلى الحق لئلا نتكل على وسائط المعاملات، فيقعَ على وجه التوحيد غُبَارُ الظنون والحسابات لتكون دليلنا عليك، ثم قال: { صراط الذين أنعمت عليهم } أي: الواصلين بك إليك، ثم قال: { غير المغضوب عليهم } بنسيان التوفيق والتَّعامِي عن رؤية التأييد، { ولا الضالين } عن شهودِ سابقِ الاختيار، وجريان تصاريف الأقدار\n هـ\n\n",
      "translations": []
    }
  ]
}