{
  "chapter": "البقرة",
  "text": "ود كثير من اهل الكتب لو يردونكم منۢ بعد ايمنكم كفارا حسدا من عند انفسهم منۢ بعد ما تبين لهم الحق فاعفوا۟ واصفحوا۟ حتى ياتى الله بامره ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "How many of the followers of the Books having once known the truth desire in their hearts, out of envy, to turn you into infidels again even after the truth has become clear to them! But you forbear and overlook till God fulfil His plan; and God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the people of the Book desire to turn you anyhow back to unbelief. They wish this out of the envy of their hearts though the Truth has become quite clear to them. Yet, you should show forbearance and forgiveness to them' till Allah Himself enforces His judgement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once you have accepted the faith, many of the People of the Book would love, out of envy, to turn you back to disbelief, even after the Truth has become evident to them. Have forgiveness and bear with them until God issues His order. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many among People given the Book(s) wished to turn you to disbelief after you had accepted faith; out of hearts’ envy, after the truth has become very clear to them; so leave them and be tolerant, until Allah brings His command; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Scripture (Jews and Christians) wish that they could turn you away as disbelievers after you have believed, out of envy from their own selves, even after the truth (that Muhammad is Allah's Messenger) has become manifest unto them. But forgive and overlook, till Allah brings His command. Verily, Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the followers of the Book wish that they could turn you back into unbelievers after your faith, out of envy from themselves, (even) after the truth has become manifest to them; but pardon and forgive, so that Allah should bring about His command; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Book wish they might restore you as unbelievers, after you have believed, in the jealousy of their souls, after the truth has become clear to them; yet do you pardon and be forgiving, till God brings His command; truly God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the people of the Scripture long to make you disbelievers after your belief, through envy on their own account, after the truth hath become manifest unto them. Forgive and be indulgent (toward them) until Allah give command. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many among the People of the Book wish, through envy, to lead you back to unbelief, now that you have embraced the faith and the truth has been made plain to them. But you should pardon them and bear with them until God gives His command. Truly, God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would Many of the People of the Book turn you back infidels after ye have believed, out of envy from their, after the truth hath become manifest unto them so Pardon them, and pass over, until Allah sendeth His command. Verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Book are eager to turn you into unbelievers after your faith, out of their inner envy, [and] after the truth had become manifest to them. Yet excuse [them] and forbear until Allah issues His edict. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Quite a number of the People of the Book wish they could Turn you (people) back to infidelity after ye have believed, from selfish envy, after the Truth hath become Manifest unto them: But forgive and overlook, Till Allah accomplish His purpose; for Allah Hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the people of the Scripture (Jews and Christians) wish that if they could turn you away as disbelievers after you have believed, out of envy from their ownselves, even, after the truth (that Muhammad Peace be upon him is Allah's Messenger) has become manifest unto them. But forgive and overlook, till Allah brings His Command. Verily, Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Book wish they might turn you back as unbelievers after you have believed, in envy of their souls, after the truth has been clarified to them. So pardon and forgive until Allah brings His command. Allah is Powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Book wish to turn you back into unbelievers after you have believed, out of envy on their part, after the Truth has become clear to them. But pardon and overlook, until God brings His command. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the People of the Scripture wish they could turn you back to disbelief after you have believed, out of envy from themselves [even] after the truth has become clear to them. So pardon and overlook until Allah delivers His command. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:109] Many of the People of the Scripture long that (law, ‘[if only] that’, represents [the import of] the verbal noun) they might make you disbelievers, after you have believed, from the envy (hasadan is the object denoting reason), being, of their own souls, that is to say, their wicked souls have prompted them to this [attitude]; after the truth, with regard to the Prophet (s), has become clear to them, in the Torah; yet pardon, leave them be, and be forgiving, stay away, and make no encroachments against them, till God brings His command, concerning fighting them; truly God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Many of the people of the Scripture) Ka'b Ibn al-Ashraf and his companions and Finhas Ibn 'Azurah and his companions (long to make you disbelievers) make you abandon your Religion and become unbelievers, O 'Ammar [Ibn Yasir], Hudhayfah [Ibn al-Yaman] and Mu'adh Ibn Jabal! (after your belief) in Muhammad and the Qur'an, (through envy of their own account) through resentful envy, (after the Truth hath become manifest unto them) in their Book that Muhammad and his Book, his description and traits, are true, (So forgive) leave them (and be indulgent) shun them (until Allah giveth command) brings His chastisement 18 upon Banu Qurayzah and Banu'l-Nadir, through killing, captivity and expulsion. (Lo! Allah is Able to do all things) to cause their death and expulsion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم اعلموا أيها المؤمنون أنه { وَدَّ كَثِيرٌ مِّنْ أَهْلِ ٱلْكِتَابِ } خصوصاً اليهود والنصارى { لَوْ يَرُدُّونَكُم } بأنواع الحيل والنفاق { مِنْ بَعْدِ إِيمَانِكُمْ } بالله وكتبه ورسله { كُفَّاراً } مردين واجب القتل والمقت عند الله، وليس ودادتهم كفركم لغايى تصلبهم في دينهم ونهاية غيرتهم عليه بل { حَسَداً } لكم ناشئاً { مِّنْ عِنْدِ أَنْفُسِهِمْ } من غاية عداوتهم معكم { مِّن بَعْدِ مَا تَبَيَّنَ } ظهر { لَهُمُ } أن دينكم { ٱلْحَقُّ } المطابق للواقع بشهادة كتابهم ونبيهم، وإذا فهمتم أمرهم وعرفتم عداوتهم { فَٱعْفُواْ } عن الانتقام والعقوبة { وَٱصْفَحُواْ } أعرضوا عن التعبير في التقريع واصبروا { حَتَّىٰ يَأْتِيَ ٱللَّهُ } باسمه المنتقم { بِأَمْرِهِ } المبرم من ضرب الذلة والمسكنة والغضب عليهم دائما { إِنَّ ٱللَّهَ } المتجلي باسم المنتقم { عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ } [البقرة: 109] من أنواع الانتقامات قدير على الوجه الأصعب الأشد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}