{
  "chapter": "البقرة",
  "text": "الم تعلم ان الله له ملك السموت والارض وما لكم من دون الله من ولى ولا نصير",
  "translations": [
    {
      "translation": "Do you not know that God's is the kingdom of the heavens and the earth, and that there is none to save and protect you apart from God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that Allah has full power over everything? Do you not know that the sovereignty of the heavens and the earth belongs to Allah alone and that you have neither any protector nor helper beside Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that the kingdom of the heavens and the earth belongs to God and that no one is your guardian or helper besides Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that for Allah only is the kingship of the heavens and the earth? And except Allah, you have neither a protector nor any supporter?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know you not that it is Allah to Whom belongs the dominion of the heavens and the earth And besides Allah you have neither any Wali (protector or guardian) nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that Allah's is the kingdom of the heavens and the earth, and that besides Allah you have no guardian or helper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that to God belongs the kingdom of the heavens and the earth, and that you have none, apart from God, neither protector nor helper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that it is Allah unto Whom belongeth the Sovereignty of the heavens and the earth; and ye have not, beside Allah, any guardian or helper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that the kingdom of the heavens and the earth belongs to God alone? And that there is no protector or helper for you besides God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that verily Allah! His is the dominion of the heavens and the earth? and for you beside Allah is no protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the kingdom of the heavens and the earth? And besides Allah, you do not have any guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that to Allah belongeth the dominion of the heavens and the earth? And besides Him ye have neither patron nor helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know you not that it is Allah to Whom belongs the dominion of the heavens and the earth? And besides Allah you have neither any Wali (protector or guardian) nor any helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that it is to Allah that the Kingdom of the heavens and the earth belong, and that there is none, other than Him, to protect or help you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to God belongs the sovereignty of the heavens and the earth, and that apart from God you have no guardian or helper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the dominion of the heavens and the earth and [that] you have not besides Allah any protector or any helper?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:107]   Do you not know that to God belongs the kingdom of the heavens and the earth, doing what He pleases, and that you have none, besides God, other than God, neither protector, to safeguard you, nor helper?, to keep away His chastisement when it comes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Knowest thou not) O Muhammad (that it is Allah unto Whom belongeth the sovereignty of the heavens and the earth) the stores of the heavens and earth; He commands His servants with whatever He wills because He knows better what is good for them; (and ye have not) O Jews, (apart from Allah) from Allah's torment, (any friend) anyone close to benefit or protect you (or helper?) anyone that can prevent your punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } يتصرف فيهما كيف يشاء، كما يشاء، متى يشاء بلا فتورٍ ولا فطور، هذا في الآفاق { وَ } ارجعوا إلى أنفسكم، واعلموا أنه { مَا لَكُمْ } في ذواتكم وهوياتكم { مِّن دُونِ ٱللَّهِ } المحيط بكم وبجميع أوصافكم { مِن وَلِيٍّ } يولي أموركم { وَلاَ نَصِيرٍ } [البقرة: 107] يعين عليكم من دونه بل هو محيط هوياتكم وماهياتكم كما أخبر به سبحانه في قوله:\n\n \" كنت سمعه\n\n\n وبصره\n\n\n ويده\n\n\n ورجله\n\n\n \"\n \n\n \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهو جائز عقلاً وشرعاً، فكما نسخت شريعتهم ما قبلها نسخها ما بعدها، فمن تحكم على الله، أو رد على أصفياء الله ممن اطصفاهم لرسالته، فليس له { مِّن دُونِ اللّه مِن وَلِيٍّ } يمنع من عذاب الله، { وَلا نَصِيرٍ } ينصره من غضب الله\n والنسخ إنما يكون في الأوامر والنواهي دون الأخبار، لأنه يكون كذباً، ومعنى النسخ: انتهاء العمل بذلك الحكم، ونقل العباد من حكم إلى حكم لمصلحة، فلا يلزم عليه البَدَاءُ كما قالت اليهود، والنسخ عندنا على ثلاثة أقسام: نسخ اللفظ والمعنى: كما كان يُقْرَأُ: \" لا ترغبوا عن آبائكم فإنه كفر \" ، ثم نُسخ، ونسخ اللفظ دون المعنى: \" كالشيخ والشيخة إذا زينا فرجموهما البتة \" ثم نسخ لفظه، وبقي حكمه وهو الرجم، ونسخ المعنى دون اللفظ: كآية السيف بعد الأمر بالمهادنة مع الكفار\n الله تعالى أعلم\n الإشارة: قال الشيخ أبو العباس المرسي رضي الله عنه في تفسيرها: ما نذهب من بدل إلا ونأت بخير منه أو مثله\n هـ\n ومعناه: ما نذهب بولي إلا ونأت بخير منه أو مثله إلى يوم القيامة، وبهذا يُرَدّ على مَن زعم أن شيخ التربية انقطع فإن قدرة الله عامة، وملك الله قائم، والأرض لا تخلو ممن يقوم بالحجة حتى يأتي أمر الله\n قال في لطائف المنن: وقد سئل بعض العارفين عن أولياء المدد: أينقُضون في زمن؟ فقال: لو نقص منهم واحد ما أرسلت السماء قطرها، ولا أبرزت الأرض نباتها، وفساد الوقت لا يكون بذهاب أعدادهم، ولا بنقص إمدادهم، ولكن إذا فسد الوقت كان مراد الله وقوع اختفائهم مع وجود بقائهم، ثم قال: وقد قال عليّ - كرّم الله وجهه - في مخاطبته لكميل: اللهم لا تخلو الأرض من قائم لك بحجتك، أولئك الأقلون عدداً، الأعظمون عند الله قدراً، قلوبهم معلقة بالمحل الأعلى\n\n\nأولئك خلفاء الله في بلاده وعباده، واشوقاه إلى رؤيتهم\n  وروى الترمذي الحكيم عن ابن عمر رضي الله عنه يرفعه إلى رسول الله صلى الله عليه وسلم قال:\n\n \" أمتي كالمَطَرِ لا يُدْرَى أَولهُ خيرٌ أم آخِرُه \" \n\nوبالله التوفيق\n\n",
      "translations": []
    }
  ]
}