{
  "chapter": "البقرة",
  "text": "ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين اوتوا۟ الكتب كتب الله وراء ظهورهم كانهم لا يعلمون",
  "translations": [
    {
      "translation": "When a messenger was sent to them by God affirming the Books they had already received, some of them put (His message) behind their backs as if they had no knowledge of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever a Messenger came to them from Allah, confirming that Scripture which they already possessed, some from among the people of the Book threw the Book of Allah behind their backs as though they knew nothing about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a Messenger of God came to them confirming the (original) revelation that they already had received, a group of those who had the Scripture with them, threw the Book of God behind their backs as if they did not know anything about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a Noble Messenger from Allah came to them, confirming the Book(s) which they possessed, a group of those who have received the Book(s) flung the Book of Allah behind their backs as if they were totally unaware!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them a Messenger from Allah (i.e. Muhammad) confirming what was with them, a party of those who were given the Scripture threw away the Book of Allah behind their backs as if they did not know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them an Apostle from Allah verifying that which they have, a party of those who were given the Book threw the Book of Allah behind their backs as if they knew nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there has come to them a Messenger from God confirming what was with them, a party of them that were given the Book reject the Book of God behind their backs, as though they knew not,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there cometh unto them a messenger from Allah, confirming that which they possess, a party of those who have received the Scripture fling the Scripture of Allah behind their backs as if they knew not,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever a messenger from God has come to them, fulfilling that [predictions] which they already had, some of those to whom the Book was given have cast off the Book of God behind their backs as if they had no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever there came unto them an apostle from Allah confessing to that which was with them, a Party among those who were vouchsafed the Book, cast Allah's Book behind their backs as though they knew not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them an apostle from Allah, confirming that which is with them, a part of those who were given the Book cast the Book of Allah behind their back, as if they did not know [that it is Allah’s Book].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them a messenger from Allah, confirming what was with them, a party of the people of the Book threw away the Book of Allah behind their backs, as if (it had been something) they did not know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them a Messenger from Allah (i.e. Muhammad Peace be upon him) confirming what was with them, a party of those who were given the Scripture threw away the Book of Allah behind their backs as if they did not know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now that a Messenger has come to them from Allah confirming what was with them, some of those to whom the Book was given reject the Book of Allah behind their backs, as though they knew nothing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there came to them a messenger from God, confirming what they had, a faction of those who were given the Book threw the Book of God behind their backs, as if they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a messenger from Allah came to them confirming that which was with them, a party of those who had been given the Scripture threw the Scripture of Allah behind their backs as if they did not know [what it contained].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:101] When there came to them a messenger from God, namely, Muhammad (s), confirming what was with them, a party of them who were given the Scripture have cast away the Scripture of God, that is, the Torah, behind their backs, that is to say, they have not acted according to what it said about belief in the Messenger and otherwise; as though they did not know, what is contained in it, to the effect that he is a true Prophet, or that it is the Book of God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when there cometh unto them a messenger from Allah, confirming) conforming in traits and description (that which they possess) of the Book, (a party of those who have received the Scripture fling the Scripture of Allah) i.e. the Torah (behind their backs) disbelieving in what it contains of the traits and description of Muhammad (pbuh) nor did they exposit this (as if they knew not) as if they were ignorant people who knew nothing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة عتوهم أنهم { لَمَّآ جَآءَهُمْ رَسُولٌ } مرسل { مِّنْ عِندِ ٱللَّهِ } المرسل للرسل لهداية الناس إلى التوحيد مع أنه { مُصَدِّقٌ لِّمَا مَعَهُمْ } من الكتب المنزلة على الرسل، الهادي لارتفاع التعدد والاختلاف عن أهل التوحيد مع أن مجيء هذا الرسول منزل مثبت في كتابهم الذي يدعون الإيمان به { نَبَذَ } طرح { فَرِيقٌ مِّنَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَٰبَ } وهو اليهود { كِتَٰبَ ٱللَّهِ } هو التوراة التي أدعوا الإيمان بها { وَرَآءَ ظُهُورِهِمْ } ولم يلتفتوا إليه ولم يتوجهوا نحوه بل صاروا من غاية عداوتهم وعنادهم مع الرسول المبعوث { كَأَنَّهُمْ لاَ يَعْلَمُونَ } [البقرة: 101] ولا يقرأون كتابهم أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وَلَمَّا جَاءَهُمْ } يعني اليهود { رَسُولٌ مّشنْ عِندِ اللّهِ } محمد صلى الله عليه وسلم { مُصَدِّقٌ لِّمَا مَعَهُمْ } من التوراة بموافقته له في بعض الأخبار { نَبَذَ فَرِيقٌ مِّنَ الَّذِينَ أثوتُوا الْكِتابَ } ، وهم من كفر من أحبار يهود، { كِتَابَ اللّهِ }: التوراة، { وَرَاءَ ظُهُورِهِمْ } ، حيث لم يعملوا بما فيه من الأمر بالإيمان بالنبيّ صلى الله عليه وسلم، وغيروا صفته التي فيه، وكتموها، فكأنهم طرحوه وراء ظهورهم، وكأنهم لا علم لهم بشيء من ذلك\n قال البيضاوي: اعلم أن الحق تعالى دل على أن حال اليهود أربع فرق: فرقة آمنوا بالتوراة وقاموا بحقوقها كمؤمني أهل الكتاب، وهم الأقلون المدلول عليهم بقوله:\n\n[البَقَرة: 100]، وفرقة جاهروا بنبذ عهودها، وتخطي حدودها، تمرداً وفسوقاً، وهم المعنيون بقوله تعالى:\n",
      "translations": []
    }
  ]
}