{
  "chapter": "البقرة",
  "text": "ام تريدون ان تسـلوا۟ رسولكم كما سئل موسى من قبل ومن يتبدل الكفر بالايمن فقد ضل سواء السبيل",
  "translations": [
    {
      "translation": "Do you too, O believers, wish to question your Apostle as Moses was in the past? But he who takes unbelief in exchange for belief only strays from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you then ask your Prophet such questions as were asked of Moses in former times? In fact, anyone, who changes the way of belief for that of disbelief, has surely swerved from the Right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you want to address the Prophet in the same manner in which Moses was addressed? Anyone who exchanges belief for disbelief has certainly gone down the wrong path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you wish to ask your Noble Messenger a question similar to what Moosa was asked before? And whoever chooses disbelief instead of faith has gone astray from the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you want to ask your Messenger (Muhammad) as Musa (Moses) was asked before (i.e. show us openly our Lord) And he who changes faith for disbelief, verily, he has gone astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather you wish to put questions to your Apostle, as Musa was questioned before; and whoever adopts unbelief instead of faith, he indeed has lost the right direction of the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you desire to question your Messenger as Moses was questioned in former time? Whoso exchanges belief for unbelief has surely strayed from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or would ye question your messenger as Moses was questioned aforetime? He who chooseth disbelief instead of faith, verily he hath gone astray from a plain road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you [all] want to question your messenger just as Moses was questioned previously? Anyone who exchanges faith for unbelief has strayed from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek ye to question your apostle, even as Musa was questioned afore. And whosoever changeth belief for infidelity, he hath of a surety strayed from the even way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you question your Apostle as Moses was questioned formerly? Whoever changes faith for unfaith certainly strays from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would ye question your Messenger as Moses was questioned of old? but whoever changeth from Faith to Unbelief, Hath strayed without doubt from the even way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you want to ask your Messenger (Muhammad Peace be upon him) as Musa (Moses) was asked before (i.e. show us openly our Lord?) And he who changes Faith for disbelief, verily, he has gone astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you rather demand of your Messenger that which was once demanded of Moses! He who exchanges belief for disbelief has surely strayed from the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you want to question your Messenger as Moses was questioned before? Whoever exchanges faith for disbelief has strayed from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you intend to ask your Messenger as Moses was asked before? And whoever exchanges faith for disbelief has certainly strayed from the soundness of the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:108] When the Meccans asked [the Prophet] to enlarge the size of Mecca and make Safā full of gold, the following was revealed: Or do you desire to question your Messenger as Moses was questioned, by his people, aforetime?, when they asked him to show them God openly among other things; whoever exchanges belief for unbelief, taking the latter in place of the former by refraining from contemplating the clear proofs and by requesting others instead, has surely strayed from the even way, meaning, he has mistaken the proper path (al-sawā‘ essentially means al-wasat, ‘middle way’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or would ye question your messenger) ask him to see your Lord, hear His speech and other similar things (as Moses was questioned) as the Children of Israel asked Moses (before) before the advent of Muhammad (pbuh)? (He who chooseth disbelief instead of faith, verily he hath gone astray from a plain road) he has relinquished the path of guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { سَوَآءَ ٱلسَّبِيلِ } معناهُ وسَطَ السَّبيلِ\n والسَّبيلُ: يُذكرُ ويؤنثُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأتسلمون وتفوضون أموركم إلى الله ورسوله أيها المؤمنون المسلمون، وتقبلون دين الإسلام تعبداً { أَمْ تُرِيدُونَ } وتقصدون { أَن تَسْأَلُواْ } وتقترحوا عن سرائر الآيات النازلة عليكم لإصلاحكم حالكم عناداً ومكابرة { رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ } عن الآيات النازلة لإصلاح بني إسرائيل مما نزل من آيةٍ إلا ويسألوه على وجه الإلحاح والاقتراح، فيجازيهم الله على مقتضى اقتراحهم، وإن اقترحتم كما اقترحوا يجازيكم الله كما جازاهم { وَ } اعلموا أن { مَن يَتَبَدَّلِ ٱلْكُفْرَ } الموهوم المذموم { بِٱلإِيمَانِ } المحقق المجزوم { فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ } [البقرة: 108] طريق الحق المستقيم الموصل إلى التوحيد كما ضل بنو إسرائيل بمخالفة كتاب الله وتكذيب رسله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أم } للإضراب بمعنى بل وهو على قسمين: إما إضراب عن المعنى السابق، أو لفظه فقط كما هنا، انظر تفسير ابن عطية، وإضافة الرسول إليهم باعتبار ما في نفس الأمر\n وهو نص في إرساله إليهم كما أرسل إلى غيرهم\n والضلال: التلف\n و { سواء السبيل }: وسط الطريق\n يقول الحقّ جلّ جلاله: أتريدون يا معشر اليهود أن قترحوا على نبيكم الذي أرسلت إليكم، وإلى كافة الخلق من غيركم الآيات، وتسألوه أن يريكم المعجزات، كما سألتم موسى من قبل فقلتم:\n\n[النِّساء: 153] تشغيباً وتعنتاً، وأبيتم عن الإيمان، واستبدلتموه بالكفر والعصيان، { ومن يتبدل الكفر بالإيمان } فقد تلف عن طريق الحق والسداد، ومأواه جهنم وبئس المهاد\n الإشارة: لا يُشترط في الولي ظهور الكرامة، وإنما يشترط فيه كمال الاستقامة، ولا يشترط فيه أيضً هداية الخلق على يديه إذ لم يكن ذلك للنبيّ فكيف يكون للولي؟ قال تعالى:\n\n[يُونس: 99] وقد سَرَى في طبع العوام ما سَرَى في طبع الكفار، قالوا:\n",
      "translations": []
    }
  ]
}