{
  "chapter": "البقرة",
  "text": "اوكلما عهدوا۟ عهدا نبذه فريق منهم بل اكثرهم لا يؤمنون",
  "translations": [
    {
      "translation": "And every time they made a pledge some of them pushed it aside, and many of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has it not always been so that every time they made a covenant, some of them set it aside? Nay, most of them never believe in it sincerely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why is it that every time they (the Jews) make a covenant, some of them abandon it. Most of them do not even believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And is it that whenever they make a covenant, only a group of them throws it aside? In fact, most of them do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not (the case) that every time they make a covenant, some party among them throw it aside Nay! (the truth is:) most of them believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! whenever they make a covenant, a party of them cast it aside? Nay, most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, whensoever they have made a covenant, does a party of them reject it? Nay, but the most of them are unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it ever so that when they make a covenant a party of them set it aside? The truth is, most of them believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why is it that, whenever they make a covenant, some of them cast it aside? Most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that whenever they enter into a covenant some party among them cast it aside? Aye! most of them even believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not that whenever they made a covenant, a part of them would cast it away? Rather, the majority of them do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not (the case) that every time they make a covenant, some party among them throw it aside?- Nay, Most of them are faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not (the case) that every time they make a covenant, some party among them throw it aside? Nay! the truth is most of them believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, whenever they make a promise do some of them cast it aside! Most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not that whenever they make a covenant, some of them toss it aside? In fact, most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not [true] that every time they took a covenant a party of them threw it away? But, [in fact], most of them do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:100] Why, whenever they make a covenant, with God that they will believe in the Prophet (s) when he appears, or that they will not give assistance to the idolaters against the Prophet (s), does a party of them reject it?, cast it away repudiating it (this is the response to the clause beginning with kullamā, the interrogative of rebuke). Nay (bal indicates a transition), but most of them are disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is it ever so that when they make a covenant) i.e. the Jewish leaders with Muhammad (a party of them set it aside?) reject and break it. (The truth is, most of them) all of them in fact (believe not).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَوَكُلَّمَا عَاهَدُواْ عَهْداً نَّبَذَهُ فَرِيقٌ مِّنْهُم } معناهُ تَرَكَهُ فَرِيقٌ مِنْهُمْ\n وجَمعُهُ أَفْرِقاءُ، وأَفْرِقَةٌ، وفِرقٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَكُلَّمَا عَاهَدُواْ عَهْداً } وثيقاً مؤكداً { نَّبَذَهُ } نقضه { فَرِيقٌ مِّنْهُم } لفسقه ثم سرى نقضه إلى الكل فنقضوا جميعاً { بَلْ أَكْثَرُهُمْ لاَ يُؤْمِنُونَ } [البقرة: 100] ينقادون بالعهد والكتاب والنبي أو أمره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الهمزة للإنكار، والواو للعطف على محذوف تقديره: أَكفروا بالآيات وكلما عاهدوا عهداً، و { كُلَّمَا } منصوب على الظرفية، وهي متضمنة معنى الشرط فتفتقر للجواب، وهو العامل فيها\n والنبذ: الطرح، لكنه يغلب فيما ينسى، قاله البيضاوي\n يقول الحقّ جلّ جلاله: في شأن اليهود والإنكار عليهم: { أَوَ كُلَّمَا } أعطوا عهداً وعقدوه على أنفسهم طرحه { فَرِيقٌ مِّنْهُمْ }؟ فقد أعطوا العهد أنهم إن أدركوا محمداً صلى الله عليه وسلم ليؤمنن به ولينصرنه، فلما أدركوه نبذوا ذلك العهد ونسوه\n وكذلك أعطوا العهد للنبيَ صلى الله عليه وسلم ألا يعاونوا المشركين عليه، فنبذه بنو قريظة والنضير، ولم ينقضه جميعهم بل فريق منهم، وهم الأكثر، ولذلك قال: { بَلْ أَكْثَرُهُمْ لا يُؤْمِنُونَ } ، فالأكثر هم الناقضون للعهود، المجاوزون للحدود\n والله تعالى أعلم\n الإشارة: نقض العهد مع الله أو مع عباده من علامة النفاق، ومن شيم أهل البعاد والشقاق، والوفاء بالعهد من علامة الإيمان، ومن شيم أهل المحبة والعرفان\n قال تعالى في صفة المفلحين:\n\n[المؤمنون: 8]، ولا سيما عهود الشيوخ أهل التمكين والرسوخ، فمن أخذ عقد الصحبة مع الشيخ الذي هو أهل للتربية فيحذر مِنْ حَلّ العقدة بينه وبينه، فإنَّ ذلك يقطع الإمداد، ويوجب الطرد والبعاد، والالتفات إلى غيره تسويس لبذرة الإرادة، وموجب لقطع الزيادة والإفادة، ثم إن الانجماع على الشيخ، وقطع النظر والالتفات إلى غيره هو سبب للكون – كذلك – مع الله، فبقدر الانقطاع إلى الشيخ يحصل الانقطاع إلى الله، وبقدر ترك الاختيار وسلب الإرادة مع الشيخ يحصل كذلك مع الله، وبقدر الوفاء بعهود شيوخ التربية يحصل الوفاء بعهود حقوق الربوبية\n فمن كانت غيبته في الشيخ أقوى، وانحياشه أليه أكثر، وجمعه عليه أدوم، كان كذلك مع ربه، وكذلك التعظيم والأدب، والله يعامل العبد على حسب ذلك\n قال الشيخ زَرُّوق رضي الله عنه: ولا تنتقلْ عنه، ولو رأيت من هو أعلى منه، فتحرمَ بركة الأول والثاني، ولذلك كان المشايخ يمنعون أصحابهم من صحبة غيرهم، بل من زيارتهم، وأنشدوا:\n\nوحاصل أمر الزيارة لغير شيخه أن فيه تفصيلاً: فمن كَمُل صدقه، وتوفر عقله، بحيث إذا زار لا يستنقص شيخه، ولا الذي زاره، جاز له أن يزور من شاء، ومن لم يكمل صِدقُهُ وعقله، بحيث إذا زار: إما يستنقص شيخه، أو الشيخ الذي زاره، فليكف عن زيارة غير شيخه\n وقال محيي الدين بن العربي: ويجب على المريد أن يعتقد في شيخه أنه عالم بالله، ناصح لخلق الله، ولا ينبغي له أن يعتقد في شيخه العصمة\n وقد قيل للجنيد: أيزني العارف؟ فقال:\n\n\n\n[الأحزَاب: 38]\n وصحب تلميذ شيخاً، فرآه يوماً قد زنا بامرأة، فلم يتغير من خدمته، ولا أخلّ في شيء من مرسومات شيخه، ولا ظهر منه نقص في احترامه\n وقد عرف الشيخ أنه رآه، فقال له يوماً: يا بني قد عَرَفْتُ أنك رأيتني حين فسقتُ بتلك المرأة، وكنت أنتظر فراقك عني من أجل ذلك: فقال له التلميذ: يا سيدي الإنسان معرض لمجاري أقدار الله عليه، وإني من الوقت الذي دخلت فيه إلى خدمتك ما خدمتك على أنك معصوم، وإنما خدمتك على أنك عارف بطريق الله تعالى، عارف بكيفية السلوك عليه الذي هو طلبي، وكونك تعصي أو لا تعصي شيء بينك وبين الله عزّ وجلّ، لا يرجع من ذلك شيء عَلَيَّ، فما وقع منك يا سيدي شيء لا يوجب نفاري وزوالي عنك، وهذا هو عَقْدي، فقال له الشيخ: وفقت وسعدت هكذا وإلا فلا\n\n\n فربح ذلك التلميذ، وجاء منه ما تَقَرُّ بِهِ العين من حسن الحال وعُلوِّ المقام\n هـ\n\n",
      "translations": []
    }
  ]
}