{
  "chapter": "البقرة",
  "text": "واتبعوا۟ ما تتلوا۟ الشيطين على ملك سليمن وما كفر سليمن ولكن الشيطين كفروا۟ يعلمون الناس السحر وما انزل على الملكين ببابل هروت ومروت وما يعلمان من احد حتى يقولا انما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من احد الا باذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا۟ لمن اشترىه ما له فى الءاخرة من خلق ولبئس ما شروا۟ به انفسهم لو كانوا۟ يعلمون",
  "translations": [
    {
      "translation": "And they follow what devilish beings used to chant against the authority of Solomon, though Solomon never disbelieved and only the devils denied, who taught sorcery to men, which, they said, had been revealed to the angels of Babylon, Harut and Marut, who, however, never taught it without saying: \"We have been sent to deceive you, so do not renounce (your faith).\" They learnt what led to discord between husband and wife. Yet they could not harm any one or without the dispensation of God. And they learnt what harmed them and brought no gain. They knew indeed whoever bought this had no place in the world to come, and that surely they had sold themselves for something that was vile. If only they had sense!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Instead of this,) they began to follow that (magic) to which the devils falsely attributed (the greatness of) the kingdom of Solomon. In fact Solomon was never involved in any practice of disbelief, but the satans, who taught magic to the people were themselves guilty of disbelief. They were after that thing which was sent to Harut and Marut, the two angels at Babylon. Whenever these two angels taught black art to anyone, they would always give a clear warning beforehand, saying, \"We are merely a trial for you; so you should not commit blasphemy. But in spite of this warning, those people used to learn from the angels the art which caused division between husband and wife. Although it was obvious that they could not do any harm to anyone by means of this magic without Allah's permission, yet they learnt that art which could not be profitable even for them but was actually harmful. Moreover, they knew it full well that anyone, who purchased that art, would have no share in the Hereafter. What a vile commodity it was for which they sold off their souls, if they had but known it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They followed the incantations that the devils used against the kingdom of Solomon. Solomon did not hide the truth but the devils did. They taught magic to the people and whatever was revealed to the two angels, Harut and Marut, in Babylon. The two angels did not teach anything to anyone without saying, \"Our case is a temptation for the people, so do not hide the truth.\" People learned something from the two angels that could cause discord between a man and his wife. However, they could harm no one except by the permission of God. In fact, the (people) learned things that would harm them and render them no benefit. They knew very well that one who engaged in witchcraft would have no reward in the life hereafter. Would that they had known that they had sold their souls for that which is vile!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they followed what the devils used to read during the rule of Sulaiman (Solomon – peace and blessings be upon him); and Sulaiman did not disbelieve, but the devils disbelieved – they teach people magic; and that which was sent down to the two angels, Harut and Marut in Babylon; and the two (angels) never taught a thing to anyone until they used to say, “We are only a trial, therefore do not lose your faith” and they used to learn from them that by which they cause division between man and his wife; and they cannot harm anyone by it except by Allah’s command; and they learn what will harm them, not benefit them; and surely they know that whoever bargains for this will not have a share in the Hereafter; and for what an abject thing they have sold themselves; if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They followed what the Shayatin (devils) gave out (falsely of the magic) in the lifetime of Sulayman (Solomon). Sulayman did not disbelieve, but the Shayatin (devils) disbelieved, teaching men magic and such things that came down at Babylon to the two angels, Harut and Marut, but neither of these two (angels) taught anyone (such things) till they had said, \"We are for trial, so disbelieve not (by learning this magic from us).\" And from these (angels) people learn that by which they cause separation between man and his wife, but they could not thus harm anyone except by Allah's leave. And they learn that which harms them and profits them not. And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. And how bad indeed was that for which they sold their own selves, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they followed what the Shaitans chanted of sorcery in the reign of Sulaiman, and Sulaiman was not an unbeliever, but the Shaitans disbelieved, they taught men sorcery and that was sent down to the two angels at Babel, Harut and Marut, yet these two taught no man until they had said, \"Surely we are only a trial, therefore do not be a disbeliever.\" Even then men learned from these two, magic by which they might cause a separation between a man and his wife; and they cannot hurt with it any one except with Allah's permission, and they learned what harmed them and did not profit them, and certainly they know that he who bought it should have no share of good in the hereafter and evil was the price for which they sold their souls; had they but known this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they follow what the Satans recited over Solomon's kingdom. Solomon disbelieved not, but the Satans disbelieved, teaching the people sorcery, and that which was sent down upon Babylon's two angels, Harut and Marut; they taught not any man, without they said, 'We are but a temptation; do not disbelieve.' From them they learned how they might divide a man and his wife, yet they did not hurt any man thereby, save by the leave of God, and they learned what hurt them, and did not profit them, knowing well that whoso buys it shall have no share in the world to come; evil then was that they sold themselves for, if they had but known.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And follow that which the devils falsely related against the kingdom of Solomon. Solomon disbelieved not; but the devils disbelieved, teaching mankind magic and that which was revealed to the two angels in Babel, Harut and Marut. Nor did they (the two angels) teach it to anyone till they had said: We are only a temptation, therefore disbelieve not (in the guidance of Allah). And from these two (angles) people learn that by which they cause division between man and wife; but they injure thereby no-one save by Allah's leave. And they learn that which harmeth them and profiteth them not. And surely they do know that he who trafficketh therein will have no (happy) portion in the Hereafter; and surely evil is the price for which they sell their souls, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They pursued what the devils falsely attributed to the kingdom of Solomon. Solomon was not an unbeliever: it is the devils who are unbelievers. They taught people witchcraft, and that which was sent down to Harut and Marut, the two angels in Babylon. But these two taught no one until they had said, \"We are but a trial, therefore, do not disbelieve [in God's guidance].\" So men learnt from them that by which they caused discord between man and wife; but they harmed no one thereby, except by the command of God; [on the contrary], these people learned that which would harm them and do them no good, knowing full well that whoever acquired [this knowledge] would have no share in the Hereafter. Evil indeed was the [price] for which they sold their souls, if only they had known it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they follow that which the Satans recited in the reign of Sulaiman; and Sulaiman blasphemed not, but the Satans blasphemed.; teaching people magic; and they follow that also which was sent down unto the two angels in Babil, Harut, and Marut. Unto none the twain taught it until they had said: We are but a temptation, so blaspheme not; but they learned from the twain that wherewith they might separate man from his wife; and they could harm none thereby save by Allah's will. And they have learnt that which harmeth them, and profiteth them not; and assuredly they know that whosoever purchaseth it, his is no portion in the Hereafter. And surely vile is the price for which they have bartered themselves, if they but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they followed what the devils pursued during Solomon’s reign —and Solomon was not faithless but it was the devils who were faithless—teaching the people magic and what was sent down to the two angels at Babylon, Harut and Marut, who would not teach anyone without telling [him], ‘We are only a test, so do not be faithless.’ But they would learn from those two that with which they would cause a split between man and his wife—though they could not harm anyone with it except with Allah’s leave. They would learn that which would harm them and bring them no benefit; though they certainly knew that anyone who buys it has no share in the Hereafter. Surely, evil is that for which they sold their souls, had they known!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They followed what the evil ones gave out (falsely) against the power of Solomon: the blasphemers Were, not Solomon, but the evil ones, teaching men Magic, and such things as came down at babylon to the angels Harut and Marut. But neither of these taught anyone (Such things) without saying: \"We are only for trial; so do not blaspheme.\" They learned from them the means to sow discord between man and wife. But they could not thus harm anyone except by Allah's permission. And they learned what harmed them, not what profited them. And they knew that the buyers of (magic) would have no share in the happiness of the Hereafter. And vile was the price for which they did sell their souls, if they but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They followed what the Shayatin (devils) gave out (falsely of the magic) in the lifetime of Sulaiman (Solomon). Sulaiman did not disbelieve, but the Shayatin (devils) disbelieved, teaching men magic and such things that came down at Babylon to the two angels, Harut and Marut, but neither of these two (angels) taught anyone (such things) till they had said, \"We are only for trial, so disbelieve not (by learning this magic from us).\" And from these (angels) people learn that by which they cause separation between man and his wife, but they could not thus harm anyone except by Allah's Leave. And they learn that which harms them and profits them not. And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. And how bad indeed was that for which they sold their ownselves, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and follow what the devils recited over the Kingdom of Solomon. Solomon did not disbelieve, it is the devils who disbelieved, teaching people magic and that which was sent down upon the angels Harut and Marut in Babylon. They did not teach anyone, until both had said: 'We have been sent as a trial; do not disbelieve' From them they learned how they might separate a husband and his wife. However, they did not harm anyone with it, except by the permission of Allah. Indeed, they learned what harms them and does not profit them, yet they knew that anyone who buys it would have no share in the Everlasting Life. Evil is that for which they have sold their souls, if they but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they followed what the devils taught during the reign of Salomon. It was not Solomon who disbelieved, but it was the devils who disbelieved. They taught the people witchcraft and what was revealed in Babylon to the two angels Harut and Marut. They did not teach anybody until they had said, “We are a test, so do not lose faith.” But they learned from them the means to cause separation between man and his wife. But they cannot harm anyone except with God's permission. And they learned what would harm them and not benefit them. Yet they knew that whoever deals in it will have no share in the Hereafter. Miserable is what they sold their souls for, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they followed [instead] what the devils had recited during the reign of Solomon. It was not Solomon who disbelieved, but the devils disbelieved, teaching people magic and that which was revealed to the two angels at Babylon, Harut and Marut. But the two angels do not teach anyone unless they say, \"We are a trial, so do not disbelieve [by practicing magic].\" And [yet] they learn from them that by which they cause separation between a man and his wife. But they do not harm anyone through it except by permission of Allah. And the people learn what harms them and does not benefit them. But the Children of Israel certainly knew that whoever purchased the magic would not have in the Hereafter any share. And wretched is that for which they sold themselves, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:102] And they follow (wa’ttaba‘ū is a supplement to nabadha, ‘[it] cast away’) what the devils used to relate, during the time of, Solomon’s kingdom, in the way of sorcery: it is said that they [the devils] buried these [books of sorcery] underneath his throne when his kingdom was taken from him; it is also said that they used to listen stealthily and add fabrications to what they heard, and then pass it on to the priests, who would compile it in books; this would be disseminated and rumours spread that the jinn had knowledge of the Unseen. Solomon gathered these books and buried them. When he died, the devils showed people where these books were, and the latter brought them out and found that they contained sorcery, and said, ‘Your kingdom was only thanks to what is in here’; they then took to learning them and rejected the Scriptures of their prophets. In order to demonstrate Solomon’s innocence and in repudiation of the Jews when they said, ‘Look at this Muhammad, he mentions Solomon as one of the prophets, when he was only a sorcerer’, God, exalted, says: Solomon disbelieved not, that is, he did not work magic because he disbelieved, but the devils disbelieved, teaching the people sorcery (this sentence is a circumstantial qualifier referring to the person governing the verb kafarū); and, teaching them, that which was revealed to the two angels, that is, the sorcery that they were inspired to [perform] (al-malakayn, ‘the two angels’: a variant reading has al-malikayn, ‘the two kings’) who were, in Babylon — a town in lower Iraq — Hārūt and Mārūt (here the names are standing in for ‘the two angels’, or an explication of the latter). Ibn ‘Abbās said, ‘They were two sorcerers who used to teach [people] magic’; it is also said that they were two angels that had been sent to teach [sorcery] to people as a trial from God. They taught not any man, without them saying, by way of counsel, ‘We are but a temptation, a trial from God for people, so that He may test them when   they are taught it: whoever learns it is a disbeliever, but whoever renounces it, he is a believer; do not disbelieve’, by learning it; if this person refused and insisted on learning it, they would teach him. From them they learned how they might cause division between a man and his wife, so that they would hate each other, yet they, the sorcerers, did not hurt any man thereby, that is, by this magic, save by the leave of God, by His will; and they learned what hurt them, in the Hereafter, and did not profit them, and this was sorcery. And surely (the lām [of la-qad, ‘surely’] is for oaths) they, the Jews, knew well that whoever (laman: the lām denotes [part of] the subject of the sentence and is semantically connected to what precedes it; the man introduces the relative clause) buys it, [whoever] chooses it and took it in place of God’s Book, he shall have no share in the Hereafter, that is, no portion of Paradise; evil then would have been, the thing, that they sold themselves for, those sellers, that is to say, the portion due for this [act] in the Hereafter, if they were to learn it; for it would have made the Fire obligatory in their case; if they had but known, the reality of the chastisement they would be destined for, they would not have learnt it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The Jews left the guidance of all the prophets (And they followed that which the devils falsely related) they acted upon what the devils had written (against the kingdom of Solomon) about the collapse of Solomon's kingdom, and 40 days of sorcery and white magic. (Solomon disbelieved not) did not write this sorcery and white magic; (but the devils disbelieved) did write it, (teaching mankind) the devils taught people, as it is said that the Jews taught people (magic and that which was revealed to the two angels) but the angels were not taught sorcery and white magic; and it is said that this means: they also taught what the angels were inspired with (in Babel, Harut and Marut. Nor did they teach it to anyone) nor did the angels describe anything to anyone (till they had said) at the outset: (We are only a temptation) we have been tried with calling people to this in order that we reduce the intensity of the torment inflicted on ourselves, (therefore disbelieve not) do not learn or act upon it. (And from these two (angels) people learn) without being taught by them (that by which they cause division between man and wife) that by which a man finds excuse to leave his wife; (but they injure thereby) with sorcery and causing rift (no one save by Allah's leave) except through Allah's will and with His knowledge. (And they learn) the devils, the Jews and sorcerers learn from each other (that which harms them) in the Hereafter (and profits them not) in this world or the next. (And surely they do know) this refers to the angels, and it is said that it refers to the Jews in their Book, as it is said that his refers to the devils (that he who trafficketh therein) chooses sorcery and white magic (will have no (happy) portion in the Hereafter) in Paradise; (and surely evil is the price for which they sold their souls) by choosing sorcery for themselves, and the reference here is to the Jews, (if they but knew) but they do not know; and it is said that this means: and they did know this from their own Book. 17\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱتَّبَعُواْ مَا تَتْلُواْ ٱلشَّيَـٰطِينُ } معناهُ تَتبعُ\n وتَتْلوا أيضاً: تَقرأ\n\n\n\n\nوقولهُ تعالى: { مَا لَهُ فِي ٱلآخِرَةِ مِنْ خَلَٰـقٍ } [معناهُ] من نَصِيبٍ خَيرٍ\n\n\n\n\nوقولهُ تعالى: { وَلَبِئْسَ مَا شَرَوْاْ بِهِ أَنْفُسَهُمْ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ بَاعوا بِهِ أَنفُسَهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما نبذوا التوراة وراء ظهورهم؛ لاشتمالها على أوصافك وظهورك يا أكمل الرسل أخذوا في معارضتك بالسحر { ٱتَّبَعُواْ مَا تَتْلُواْ } تنسب وتفتري { ٱلشَّيَـٰطِينُ } المردة من الجن { عَلَىٰ مُلْكِ سُلَيْمَـٰنَ } بأن استيلاءه وتسلطه وتسخير الجن والإنس والوحوش والطيور والريح، إنما تم بالسحر { وَ } الحال أنه { مَا كَفَرَ } وسحر { سُلَيْمَـٰنُ } قط بل أمره على الوحي والإلهام الوارد الغيبي { وَلَـٰكِنَّ ٱلشَّيَـٰطِينَ } يسترقون من الملائكة وينسبون الأمور إلى الوسائط أصالة، بواسطة ذلك { كَفَرُواْ } وبعدما كفروا { يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحْرَ } أي: الذي يسترقن منهم { وَ } خصوصاً ما يسترقون من { مَآ أُنْزِلَ عَلَى ٱلْمَلَكَيْنِ } المحبوسين { بِبَابِلَ } المسميان: { هَـٰرُوتَ وَمَـٰرُوتَ } مع أن المنزل إليهما مكر الله مع عباده وابتلاهم وفتنهم { وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولاَ } له طريقة وكيفية، بل يقول لمن ظهر له بالسحر: { إِنَّمَا نَحْنُ فِتْنَةٌ } من الله وابتلاء لعباده { فَلاَ تَكْفُرْ } بنسبة الأمور إلينا، ولا تكفر بصدد التعليم أيضاً { فَيَتَعَلَّمُونَ } المسترقون { مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ ٱلْمَرْءِ وَزَوْجِهِ } مما يورث قطع المحبة والعلاقة المستلزمين لحفظ النسب إضراراً للدين والإيمان { وَ } الحال أنهم { مَا هُم بِضَآرِّينَ بِهِ مِنْ أَحَدٍ إِلاَّ بِإِذْنِ ٱللَّهِ } ومشيئته وتقديره؛ إذ لا يجرى في ملكه إلا ما يشاء\n\n\n\n\nوهم مع إذعانهم العلم والعقل { وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ } ضراراً فاحشاً في النشأة الأولى والأخرى { وَلاَ يَنفَعُهُمْ } نفعاً فيهما أصلاً { وَ } الله { لَقَدْ عَلِمُواْ } أي: اليهود { لَمَنِ ٱشْتَرَاهُ } أي: استبدله؛ أي: كتاب الله بالسحر { مَا لَهُ } للمستبدل { فِي ٱلآخِرَةِ مِنْ خَلَٰـقٍ } نصيب لا متنعوا عن الاستبدال، لكنهم لم يعلموا فاستبدلوا، فثبت أنهم ليسوا من العقلاء العالمين، وبعدما عيرهم سبحانه بما عيرهم وجهلهم، كرر تعييرهم مبالغة وتذكيراً للمتذكرين بها، فقال مقسماً: { وَ } الله { لَبِئْسَ مَا شَرَوْاْ } وأباحوا { بِهِ أَنْفُسَهُمْ } حقائقها ومعارفها ولذاتها الروحانية بالسحر المبني على الكفر بالله وكتبه ورسله وملائكته؛ لأن المشهور من أصحاب السحر أن سحرهم لا يؤثر بالكفر والخباثة والكثافة { لَوْ كَانُواْ يَعْلَمُونَ } [البقرة: 102] يفهمون قباحته لما ارتكبوا، لكنهم لم يعلموا فارتكبوا، فثبت أيضاً جهلهم وسخافتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { عَلَى مُلْكِ سُلَيْمَانَ } على حذف مضاف، أي: على عهد ملك سليمان، أو { عَلَى } بمعنى { في } ، وقوله: { وَمَا أُنزِل } عطفٌ على السحر، عَطْفَ تفسير، والفتنة في الأصل: الاختبار، تقول: فتنت الذهب والفضة إذا أدخلتهما النار لتعلم جودتهما من رداءتهما، وقوله: { لَمَثُوبَةٌ } جواب { لَّوْ } ، والأصل: لأثِيبوا، ثم عَدَلَ إلى الجملة الاسمية لتدل على الثبوت\n يقول الحقّ جلّ جلاله: في شأن اليهود: ولما جاءهم كتاب من عند الله نبذوه { وَاتَّبَعُوا } ما تقرأ { الشَّيَاطِينُ } على الناس من السحر { عَلَى } عهد { مُلْكِ سُلَيْمَانَ } ، وذلك أن الشياطين كانوا يسترقون السمع ويضمون إلى ما سمعوا أكاذيب، ويلقونها إلى الكهنة، وهم يدونونها ويعلمونها الناس، وفَشَا ذلك في عهد سليمان حتى قيل: إن الجن يعلم الغيب، وإن ملك سليما إنما قام بهذا، وأنه به سخر الجن والإنس والريح، فجمع سليمان ما دُوِّن منه ودفنه، فاستخرجته الشياطين بعد موته، فردَّ الله تعالى قولهم بقوله: { وَمَا كَفَرَ سُلَيْمَانُ } باستعمال السحر لأنه تعظيم غير الله بالتقرب للشيطان، والنبيّ معصوم { وَلَكِنَّ الشَّيَاطِينَ } هم الذين { كَفَرُوا } باستعماله { يُعلِّمُونَ النَّاسَ السِّحْرَ } إغواء وإضلالاً، ويعلمون { مَا أُنزِلَ عَلَى الْمَلَكَينِ } في بلد بابل من سواد الكوفة، وهما { هَارُوتَ وَمَارُوتَ }\n كانا ملكين من أعبد الملائكة، ولما رأت الملائكة ما يصعد إلى السماء من أعمال بني آدم الخبيثة في زمن إدريس عليه السلام عيروهم بذلك، وقالوا: يا ربنا هؤلاء الذين جعلهم خليفة في الأرض يعصونك؟ فقال الله تعالى: لو أنزلتكم إلى الأرض، وركَّبْتُ فيكم ما ركبت ُ فيهم لارتكبتم ما ارتكبوا، قالوا: سبحانك ما كان ينبغي لنا أن نعصيك\n فقال الله تعالى: فاختاروا ملكين من خِياركم أُهبطهما إلى الأرض\n فاختاروا هاروت وماروت، وكانا من أعبد الملائكة، فركّب الله تعالى فيهما الشهوة، وأمرهما أن يحكما في الأرض بين الناس بالحق، في الأرض بين الناس بالحق، ونهاهما في الشرك والقتل بغير الحق، والزنا وشرب الخمر، فكانا يقضيان بين الناس يومهما، فإذا أمسيا ذكرا اسم الله الأعظم وصعدا إلى السماء، فاختصمت إليهما ذات يوم امرأة يقال لها الزهرة: وكانت من أجمل النساء من أهل فارس، فأخذت بقلبيهما، فراوداها عن نفسها، فأبت ثم عاودت في اليوم الثاني، ففعلا مثل ذلك فأبت، وقالت: إلا أن تعبدا ما أعبد، وتصليا لهذا الصنم، وتقتلا النفس وتشربا الخمر، فأبيا هذه الأشياء، وقالا: إن الله نهاهنا عنها، فانصرفت، ثم عادت في اليوم الثالث، فراداها، فعرضت عليهما ما قالت بالأمس، فقالا: الصلاة لغير الله ذنب عظيم، وأهونُ الثلاث شرب الخمر، فشربا، وانتشيا، ووقعا بالمرأة، فلما فرغا رآهما إنسان فخاف أن يظهر عليهما فقتلاه\n وفي رواية عن سيّدنا عليّ – كرّم الله وجهه – أنه قال: قالت لهما: لن تدركاني حتى تخبراني بالذي تصعدان به إلى السماء، فقالا: باسم الله الأعظم، فعلماها ذلك، فتكلمت به، وصعدت إلى السماء فمسخها الله كوكباً\n\n\nولذلك كان عليه الصلاة والسلام إذا رأى سهيلاً قال:\n\n \" لَعَنَ اللّهُ سُهيلاً كَانَ عَشَّاراً بِاليمن، ولَعَنَ اللّهُ الزهْرةَ، وقال: إِنَها فتنت مَلَكَين \"\n \n\nقلت: قصة هارون وماروت ذكرها المنذري في شرب الخمر، وقال في حديثها: رواه أحمد وابن حبان في صحيحه من طريق زهير بن محمد، وقد قيل: إن الصحيح وقفه على كعب\n هـ\n وقال ابن حجر: قصة هاروت وماروت جاءت بسند حسن، خلافاً لمن زعم بطلانها كعياض ومن تبعه\n وتمام قصتهما: أنهما لما قارفا الذنب وجاء المساء همّا بالصعود، فلم تطاوعهما أجنحتهما، فعلما ما حلّ بهما، فقصدا إدريس عليه السلام، فأخبراه، وسألاه الشفاعة إلى الله تعالى فشفع فيهما، فخيّرهما الله تعالى بين عذاب الدنيا وعذاب الآخرة، فاختارا عذاب الدنيا لانقطاعه، فهما يعذبان في بئر ببابل، منكسان معلقان بالسلاسل من أجر لهما، مزرقة أعينهما، ليس بينهما وبين الماء إلا قدر أربعة أصابع، وهما يعذبان بالعطش\n هـ\n فإن قلت: الملائكة معصومون فكيف يصح هذا من هاروت وماروت؟ قلنا: لما ركب الله فيهما الشهوة النسلخا من حكم المَلَكيَّة إلى حكم البشرية ابتلاء من الله تعالى لهما، فلم يبق لهما حكم الملائكة من العصمة\n { وَمَا يُعَلِّمَانِ مِنْ أَحَدِ } السحر حتى ينصحاه ويقولا: { إِنَّمَا نَحْنُ فِتْنَةٌ } لكم، واختبار من الله تعالى لعباده، ليظهر من يصبر عنه ومن لا يصبر، وكان تعلمه في ذلك الوقت كفراً، فيقولان له: { فَلا تَكْفُرْ } بتعلُّمه، فكانوا يتعلمون { مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلاَّ بِإِذْنِ اللّهِ } وقدرته، فلا تأثير لشيء إلا بإذن الله، ويتعلمون منهما { مَا يَضُرُّهُمْ } يوم القيامة { وَلا يَنفَعُهُمْ } ، ولقد علم بنو إسرائيل أن من اشتراه واستبدله بكتاب الله والعلم بما فيه { مَا لَهُ فِي الآخِرَةِ مِنْ } نصيب، { وَلَبِئْسَ } ما باعوا به حظ أنفسهم من النعيم { لَوْ كَانُوا يَعْلَمُونَ } ، ولكن لما لم يعملوا بعلمهم كانوا كمن لا علم عنده",
      "translations": []
    }
  ]
}