{
  "chapter": "البقرة",
  "text": "وقالوا۟ اتخذ الله ولدا سبحنه بل له ما فى السموت والارض كل له قنتون",
  "translations": [
    {
      "translation": "Yet they say that God has begotten a son. May He be praised! Indeed everything in the heavens and the earth belongs to Him, and all are obedient to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say \"Allah has adopted a son.\" Allah is above such things. As a matter of fact, whatever is in the heavens and on the earth belongs to Him and all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They, (the People of the Book), have said that God has taken for Himself a son. He is too glorious to have a son. To Him belongs all that is in the heavens and the earth. All pray in obedience to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Allah has taken an offspring for Himself” – Purity is to Him! In fact, all that is in the heavens and the earth, is His dominion; all are submissive to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews, Christians and pagans) say: Allah has begotten a son (children or offspring). Glory is to Him (Exalted is He above all that they associate with Him). Nay, to Him belongs all that is in the heavens and on earth, and all are Qanitun to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Allah has taken to himself a son. Glory be to Him; rather, whatever is in the heavens and the earth is His; all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'God has taken to Him a son. Glory be to Him! Nay, to Him belongs all that is in the heavens and the earth; all obey His will --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Allah hath taken unto Himself a son. Be He glorified! Nay, but whatsoever is in the heavens and the earth is His. All are subservient unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"God has taken a son.\" Glory be to Him! Everything in the heavens and the earth belongs to Him; all things are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they Say: God hath betaken unto Him a son! Hallowed be He: Aye unto Him belongeth whatsoever is in the heavens and the earth: ', all are unto Him devout\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘Allah has taken a son.’ Immaculate is He! Rather, to Him belongs whatever there is in the heavens and the earth. All are obedient to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Allah hath begotten a son\": Glory be to Him.-Nay, to Him belongs all that is in the heavens and on earth: everything renders worship to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews, Christians and pagans) say: Allah has begotten a son (children or offspring). Glory be to Him (Exalted be He above all that they associate with Him). Nay, to Him belongs all that is in the heavens and on earth, and all surrender with obedience (in worship) to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Allah has taken (to Himself) a son' Exaltations to Him (Allah). For Him is what is in the heavens and the earth, all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “God has begotten a son.” Be He glorified. Rather, His is everything in the heavens and the earth; all are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Allah has taken a son.\" Exalted is He! Rather, to Him belongs whatever is in the heavens and the earth. All are devoutly obedient to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:116] And they, the Jews and the Christians, and those that claim that the angels are God’s daughters, say (read wa-qālū or [simply] qālū) ‘God has taken to Himself a son’; God says: Glory be to Him!, as a way of exalting Himself above this; Nay, to Him belongs all that is in the heavens and the earth, as possessions, creatures and servants, and this sovereignty contradicts having a child, and is expressed by [the particle] mā, ‘all that’, in order to include all [creation] that is not rational; all obey His will, submitting to that which is required from each one of them: here the emphasis is on rational beings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentions the claims of the Jews and Christians that Ezra and Jesus are the sons of Allah, saying: (And they) the Jews and Christians (say: Allah hath taken unto Himself a Son) Ezra and the Messiah (Jesus). (Be He glorified!) He is far exalted to have a son or partner (Nay) it is not as they say, (but whatsoever is in the heavens and the earth) of creation (is His) are His servants. (All are subservient unto Him) linked to Him by the bond of servitude and the declaration of His Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { كُلٌّ لَّهُ قَانِتُونَ } معناهُ مُطِيعونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n[البقرة: 255] حصروه سبحانه في شخص وتخيلوه جسماً، وأثبتوا له لوازم الأجسام { وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَداً } قتل وإجلاء وسبي وذلة { وَلَهُمْ فِي ٱلآخِرَةِ عَذَابٌ عَظِيمٌ } كعيسى وعزير عليهما السلام { سُبْحَـٰنَهُ } وتعالى، عز الصمد الذين شأنه\n\n[الإخلاص: 3-4] أن يتخذ صاحبة وولداً { بَل لَّهُ } مظاهر { مَا فِي ٱلسَّمَـٰوَٰتِ وَ } مظاهر { ٱلأَرْضِ } ليظهر عليها ويتجلى لها؛ إظهاراً لكمالاتها المترتبة على صفاته المندرجة في ذاته ونسبته تعالى إلى جميع المظاهر في التكوين والخلق على السوى من غير تفاوت، وعيسى وعزير - عليهما السلام - أيضاً من جملة المظاهر، ومرجع جميع المظان إلى الظاهر؛ إذ { كُلٌّ لَّهُ قَانِتُونَ } [البقرة: 116] خاضعون منقادون مقرون على ما هم عليه قبل ظهورهم من العدم مقرون بأنه:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: هذه الجملة معطوفة على قوله: { وقالت اليهود\n\n",
      "translations": []
    }
  ]
}