{
  "chapter": "البقرة",
  "text": "وقالوا۟ لن يدخل الجنة الا من كان هودا او نصرى تلك امانيهم قل هاتوا۟ برهنكم ان كنتم صدقين",
  "translations": [
    {
      "translation": "And they say: \"None will go to Paradise but the Jews and the Christians;\" but this is only wishful thinking. Say: \"Bring the proof if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"None shall enter Paradise unless he be a Jew or according to the Christians) a Christian.\" These are their wishful fancies. Say to them, \"Bring your proof, if you are right in your claim.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said that no one can ever go to Paradise except the Jews or Christians, but this is only what they hope. Ask them to prove that their claim is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the People given the Book(s) said, “None will enter Paradise unless he is a Jew or a Christian”; these are their own imaginations; say (O dear Prophet Mohammed – peace and blessings be upon him), “Bring your proof, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"None shall enter Paradise unless he be a Jew or a Christian.\" These are their own desires. Say (O Muhammad), \"Produce your Burhan if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: None shall enter the garden (or paradise) except he who is a Jew or a Christian. These are their vain desires. Say: Bring your proof if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'None shall enter Paradise except that they be Jews or Christians.' Such are their fancies. Say: 'Produce your proof, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: None entereth paradise unless he be a Jew or a Christian. These are their own desires. Say: Bring your proof (of what ye state) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They declare, \"None shall ever enter Heaven unless he be a Jew or a Christian.\" This is their own wishful thinking. [Prophet], say, \"Produce your evidence if you are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: none shall enter the Garden except he be a Jew or a Nazarene. Such are their vain desires! Say thou: forthwith your proof if ye say\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘No one will enter paradise except one who is a Jew or Christian.’ Those are their [false] hopes! Say, ‘Produce your evidence, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"None shall enter Paradise unless he be a Jew or a Christian.\" Those are their (vain) desires. Say: \"Produce your proof if ye are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"None shall enter Paradise unless he be a Jew or a Christian.\" These are their own desires. Say (O Muhammad Peace be upon him), \"Produce your proof if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'None but Jews and Nazarenes shall be admitted to Paradise' Such are their wishful fancies. Say: 'Bring us your proof, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “None will enter Heaven unless he is a Jew or a Christian.” These are their wishes. Say, “Produce your proof, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"None will enter Paradise except one who is a Jew or a Christian.\" That is [merely] their wishful thinking, Say, \"Produce your proof, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:111] And they say, ‘None shall enter Paradise except those who are Jews (hūd is the plural of hā’id) or Christians’: this is what the Jews of Medina and the Christians of Najrān said when they disputed with the Prophet (s), each party separately claiming Paradise for its members exclusively. Such, sayings, are their desires, their false passions. Say, to them: ‘Produce your proof, your evidence for this, if you speak truly’, in this matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the Jews: (None entereth Paradise unless he be a Jew) unless he dies as a Jew, allegedly (or a Christian) as the Christians also claimed. (These are their own desires) what they wish from Allah even though it is not in their Books. (Say) Muhammad, to both parties: (Bring your proofs) from your own respective Books (if ye are truthful) in your claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { قُلْ هَاتُواْ بُرْهَانَكُمْ } قالَ زيدُ بن علي عليهما السلام معناهُ بَيانُكُمْ وحُجَجُكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة حيلتهم معكم ووداداتهم كفركم أنهم { قَالُواْ } لكم على وجه العظة والتذكير { لَن يَدْخُلَ ٱلْجَنَّةَ } من أهل الأديان { إِلاَّ مَن كَانَ هُوداً أَوْ نَصَارَىٰ تِلْكَ } المهملات ما هي إلا { أَمَانِيُّهُمْ } التي يخرمونها في نفوسهم بلا كتاب ولا دليل، وإن ادعوا الدليل { قُلْ } له يا أكمل الرسل إلزاماً: { هَاتُواْ } أيها المدعون { بُرْهَانَكُمْ } من آيات الله وسنن رسله { إِن كُنْتُمْ صَادِقِينَ } [البقرة: 111] في دعوة الاختصاص\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}