{
  "chapter": "البقرة",
  "text": "واذا قيل لهم لا تفسدوا۟ فى الارض قالوا۟ انما نحن مصلحون",
  "translations": [
    {
      "translation": "When asked to desist from spreading corruption in the land they say: \"Why, we are reformers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever it is said to them, \"Spread not disorder on the earth\", their reply is, \"We only seek to put things aright\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told not to commit corruption in the land, they reply, \"We are only reformers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Do not cause turmoil in the earth”, they say, “We are only peacemakers!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Do not make mischief on the earth,\" they say: \"We are only peacemakers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, Do not make mischief in the land, they say: We are but peace-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, 'Do not corruption in the land', they say, 'We are only ones that put things right.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Make not mischief in the earth, they say: We are peacemakers only.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Do not cause corruption in the land,\" they say, \"We are only promoters of peace,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them: act not corruptly on the earth, they say: we are but reconcilers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Do not cause corruption on the earth,’ they say, ‘We are only reformers!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Make not mischief on the earth,\" they say: \"Why, we only Want to make peace!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Make not mischief on the earth,\" they say: \"We are only peacemakers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, 'Do not corrupt in the land,' they reply, 'We are only reformers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Do not make trouble on earth,” they say, “We are only reformers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Do not cause corruption on the earth,\" they say, \"We are but reformers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:11] When it is said to them, that is, these latter, ‘Do not spread corruption in the land’, through unbelief and hindering [people from] faith, They say, ‘We are only putting things right’, that is, ‘we are not engaging in corruption’. God, exalted be He, refutes them, saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto them), i.e. the Jews (Make not mischief in the land) by preventing people from the Religion of Muhammad (pbuh) (they say: we are reformers only), we are reforming it through obedience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع ظهور حالهم وخداعهم عند الله وعند المؤمنين { إِذَا قِيلَ لَهُمْ } إمحاضاً للنصح: { لاَ تُفْسِدُواْ فِي ٱلأَرْضِ } بتكذيب كتاب الله ورسوله المنزل عليه حتى لا يخرجوا من مرتبة الخلافة؛ لأن خلافة البشر إنما هي بالتوحيد وإسقاط الإضافات، والتوحيد إنما يحصل بالله وبكتابه ورسوله { قَالُوۤاْ } في الجواب على سبيل الحصر: { إِنَّمَا نَحْنُ مُصْلِحُونَ } [البقرة: 11] لا نتجاوز من الصلاح أصلاً تتميماً لخداعهم الفاسد، وترويجاً له على المؤمنين وتلبيساً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذا } ظرف خافض لشرطه منصوب بجوابه، أي: قالوا نحن مصلحون، وقت قول القائل لهم: لا تفسدوا، والجملة بيان وتقرير لخداعهم، أو معطوفة على\n\n[البقرة: 8]، أي: ومن الناس فرقة إذا قيل لهم: لا تفسدوا، قالوا: إنما نحن مصلحون\n يقول الحقّ جلّ جلاله: { وَإذَا قيل } لهؤلاء المنافقين: { لا تُفْسِدُوا فِي الأرْضِ } بالمعاصي والتعويق عن الإيمان، وإغراء أهل الكفر والطغيان على أهل الإسلام والإيمان، وتهييج الحروب والفتن، وإظهار الهرج والمرج والمحن، وإفشاء أسرار المسلمين إلى أعدائهم الكافرين، فإن ذلك يؤدي إلى فساد النظام، وقطع مواد الإنعام، { قَالُوا } في جوابهم الفاسد: { إنما نحن مصلحون } في ذلك، فلا تصح مخاطبتنا بذلك، فإن من شأننا الإصلاح والإرشاد، وحالنا خالص من شوائب الفساد، قال تعالى: { ألا إنَّهُمْ هُمُ المُفْسِدُونَ } هنالك، ولكن لا شعور لهم بذلك\n قلت: فردّ الله ما ادعوه من الانتظام في سلك المصلحين بأقبح رد وأبلغه، من وجوه الاستئناف الذي في الجملة، والاستفتاح بالتنبيه، والتأكيد بإن وضمير الفعل، وتعريف الخبر، والتعبير بنفي الشعور، إذ لو شعروا أدنى شعور لتحققوا أنهم مفسدون\n وهذه الآية عامة لكل مَن اشتغل بما لا يعنيه، وعوق عن طريق الخصوص، ففيه شعبة من النفاق، وفي صحيح البخاري:\n\n \" ثَلاثٌ من كُنَّ فِيهِ كان مُنَافِقاً خالِصاً: إذا حَدَّثَ كَذَبَ، وإذا وَعَدَ أَخْلَفَ، وإذا أوْتُمِنَ خانَ \"\n \n\nالإشارة: وإذ قيل لمن يشتغل بالتعويق عن طريق الله والإنكار على أولياء الله: أقصر من هذا الإفساد، وارجع عن هذا الغي والعناد، فقد ظهرت معالم الإرشاد لأهل المحبة والوداد\n قال: إنما أنا مصلح ناصح، وفي أحوالي كلها صالح، يقول له الحق جلّ جلاله: بل أفسدت قلوب عبادي، ورددتهم عن طريق محبتي وودادي، وعوقتهم عن دخول حضرتي، وحرمتهم شهود ذاتي وصفاتي، سددت بابي في وجه أحبابي، آيستهم من وجود التربية، وتحكمت على القدرة الأزلية، ولكنك لا تشعر بما أنت فيه من البلية\n ولقد صدق من سبقت له العناية، وأُتحف بالرعاية والهداية، حيث يقول:\n\nوقال أيضاً:\n",
      "translations": []
    }
  ]
}