{
  "chapter": "البقرة",
  "text": "واقيموا۟ الصلوة وءاتوا۟ الزكوة وما تقدموا۟ لانفسكم من خير تجدوه عند الله ان الله بما تعملون بصير",
  "translations": [
    {
      "translation": "Fulfil your devotional obligations and pay the zakat. And what you send ahead of good you will find with God, for He sees all that you do ill.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Rest assured that) Allah has full power over everything: establish the Salat and pay the Zakat. you will find with Allah whatever good you send forward for your future; Allah is watching everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be steadfast in your prayer and pay the religious tax. You will receive a good reward from God for all your good works. God is Well-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep the prayer established, and pay the charity; and whatever good you send ahead for yourselves, you will find it with Allah; indeed Allah is seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform the Salah and give the Zakah, and whatever of good you send forth for yourselves before you, you shall find it with Allah. Certainly, Allah is the Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep up prayer and pay the poor-rate and whatever good you send before for yourselves, you shall find it with Allah; surely Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform the prayer, and pay the alms; whatever good you shall forward to your souls' account, you shall find it with God; assuredly God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish worship, and pay the poor-due; and whatever of good ye send before (you) for your souls, ye will find it with Allah. Lo! Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Attend to your prayers and pay the prescribed alms; any good you store up for yourselves, you will find it with God. Certainly, God sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish prayer and give the poor-rate. and whatsoever of good ye send forth for your souls ye shall find with Allah; verily Allah is the Beholder of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And maintain the prayer and give the zakat. Any good that you send ahead for your own souls, you shall find it with Allah. Indeed Allah watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be steadfast in prayer and regular in charity: And whatever good ye send forth for your souls before you, ye shall find it with Allah: for Allah sees Well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform As-Salat (Iqamat-as-Salat), and give Zakat, and whatever of good (deeds that Allah loves) you send forth for yourselves before you, you shall find it with Allah. Certainly, Allah is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish your prayers and pay the obligatory charity. Whatever good you shall forward for your soul you shall find it with Allah. He is the Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform the prayer, and give alms. Whatever good you forward for yourselves, you will find it with God. God is Seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish prayer and give zakah, and whatever good you put forward for yourselves - you will find it with Allah. Indeed, Allah of what you do, is Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:110] And perform the prayer, and pay the alms; whatever good, in the way of obedience, such as [observing] kinship and charity, you shall offer for your own souls, you shall find it, that is, its reward, with God; assuredly God sees what you do, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And establish prayer) perfect the five daily prayers, (and pay the poor-due) pay the poor what is due from your wealth; (and whatever of good) of righteous deeds, and the poor-due and charitable works (ye send before for your souls) you save for yourselves, (ye will find it) you will find its reward (with Allah) from Allah. (Lo! Allah is Seer) knows your intentions (of what ye do) of what you spend in charity and the poor-due.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَآتُواْ ٱلزَّكَاةَ } معناهُ اعْطُوهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما فوضتم أموركم إلى الله، واتخذتموه وكيلاً حفيظاً لكم عن أدائكم { أَقِيمُواْ ٱلصَّلاَةَ } رابطوا ظواهركم وبواطنكم إليه سبحانه دائماً على وجه التذلل والخضوع والانكسار والخشوع { وَآتُواْ ٱلزَّكَاةَ } طهروا قلوبكم عن الميل إلى ما سوى الحق { وَ } اعلموا أن { } مَا تُقَدِّمُواْ في هذه النشأة { لأَنْفُسِكُم مِّنْ خَيْرٍ } من التوجه الدائم والإعراض الدائم عن محبة الغير { تَجِدُوهُ عِندَ } ظهور توحيد { ٱللَّهِ } وتجريده وتفريده على قلوبكم { إِنَّ ٱللَّهَ } المحيط بذواتكم { بِمَا تَعْمَلُونَ } من خير { بَصِيرٌ } [البقرة: 110] عليم خبير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}