{
  "chapter": "البقرة",
  "text": "وقالت اليهود ليست النصرى على شىء وقالت النصرى ليست اليهود على شىء وهم يتلون الكتب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيمة فيما كانوا۟ فيه يختلفون",
  "translations": [
    {
      "translation": "The Jews say: \"The Christians are not right,\" and the Christians say: \"The Jews are in the wrong;\" yet both read the Scriptures; and this is what the unread had said too. God alone will judge between them in their differences on the Day of Reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say that the Christians have nothing (of the Truth) and the Christians say that the Jews have nothing of it, though both read the Scripture. And those who have no knowledge of the Scripture also make similar claims. Allah will surely give His judgement on the Day of Resurrection in all the matters in which they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews accuse the Christians of having no basis for their religion and the Christians accuse the Jews of having no basis for their religion, even though both sides read the Scripture. The ignorant ones say the same thing. God will issue His decree about their dispute on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews said, “The Christians are nothing” – and the Christians said, “The Jews are nothing” whereas they both read the Book; and the ignorant spoke similarly; so Allah will judge between them on the Day of Resurrection, concerning the matter in which they dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews said that the Christians follow nothing (i.e. are not on the right religion); and the Christians said that the Jews follow nothing (i.e. are not on the right religion); though they both recite the Scripture. Like unto their word, said those (the pagans) who know not. Allah will judge between them on the Day of Resurrection about that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: The Christians do not follow anything (good) and the Christians say: The Jews do not follow anything (good) while they recite the (same) Book. Even thus say those who have no knowledge, like to what they say; so Allah shall judge between them on the day of resurrection in what they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, 'The Christians stand not on anything'; the Christians say, 'The Jews stand not on anything'; yet they recite the Book. So too the ignorant say the like of them. God shall decide between them on the Day of Resurrection touching their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say the Christians follow nothing (true), and the Christians say the Jews follow nothing (true); yet both are readers of the Scripture. Even thus speak those who know not. Allah will judge between them on the Day of Resurrection concerning that wherein they differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, \"The Christians have no ground to stand on,\" and the Christians say, \"The Jews have no ground to stand on.\" Yet they both recite the Book, and those who have no knowledge say the same; God will judge between them on the Day of Resurrection concerning their disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: the Nazarenes are not grounded on aught: and the Nazarenes say: the Jews are not grounded on aught While they recite the same Book. Even so say those who know not, the like of their saying. Allah will judge between them on the Day of Resurrection regarding that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, ‘The Christians stand on nothing,’ and the Christians say, ‘The Jews stand on nothing,’ though they follow the [same] Book. So said those who had no knowledge, [words] similar to what they say. Allah will judge between them on the Day of Resurrection concerning that about which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"The Christians have naught (to stand) upon; and the Christians say: \"The Jews have naught (To stand) upon.\" Yet they (Profess to) study the (same) Book. Like unto their word is what those say who know not; but Allah will judge between them in their quarrel on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews said that the Christians follow nothing (i.e. are not on the right religion); and the Christians said that the Jews follow nothing (i.e. are not on the right religion); though they both recite the Scripture. Like unto their word, said (the pagans) who know not. Allah will judge between them on the Day of Resurrection about that wherein they have been differing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say the Nazarenes are not on anything, and the Nazarenes say it is the Jews who are not on anything. Yet they both read the Book. And those who do not know say like their saying. Allah will judge between them their disputes on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, “The Christians are not based on anything;” and the Christians say, “The Jews are not based on anything.” Yet they both read the Scripture. Similarly, the ignorant said the same thing. God will judge between them on the Day of Resurrection regarding their differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say \"The Christians have nothing [true] to stand on,\" and the Christians say, \"The Jews have nothing to stand on,\" although they [both] recite the Scripture. Thus the polytheists speak the same as their words. But Allah will judge between them on the Day of Resurrection concerning that over which they used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:113] The Jews say, ‘The Christians stand on nothing’, that can be used as support [for their claims], and they rejected Jesus; and the Christians say, ‘The Jews stand on nothing’, that can be used as support [for their claims], and they rejected Moses; yet they, both groups, recite the Scripture, revealed to them: in the Scripture of the Jews there is the confirmation of Jesus, and in that of the Christians there is the confirmation of Moses (yatlūna’l-kitāba, ‘they recite the Scripture’: the sentence is a circumstantial qualifier). Thus, in the way that these have said, the ignorant, from among the Arabs and others, say the like of what these say (this last phrase [mithla qawlihim, ‘the like of what they say’] is the explication of dhālika, ‘that [way]’): that is to say, to every person of religion they would say, ‘You have no basis’; God shall decide between them on the Day of Resurrection regarding their differences, in religion and will admit the confirmer into Paradise and the falsifier into the Fire.1568039483\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the claims of the Jews and Christians that their respective religion is the true Religion, saying: (And Jews) the Jews of Medina (say Christians follow nothing) as religion from God and there is no true religion except Judaism, (and Christians) the Christians of Najran (say Jews follow nothing) as religion from God and there is no true religion except Christianity; (though both are readers of the Scripture) both parties read the Book and do not believe in it and further claim things that are not mentioned therein. (Even thus spoke those who know not) knew the Oneness of Allah through their own forefathers; and it is said this means: they knew the Book of Allah from others. (Allah will judge between them) between the Jews and Christians (on the Day of Resurrection concerning that wherein they differ).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عدم تفطنهم للإيمان والإذعان وعدم تنبههم على طريق التوحيد و العرفان { قَالَتِ ٱلْيَهُودُ }: الدين ديننا والكتاب كتابنا والنبي نبينا { لَيْسَتِ ٱلنَّصَارَىٰ عَلَىٰ شَيْءٍ } في أمر الدين، بل هم ضالون عن طريق الحق، لا يهتدون النبي أصلاً إلا أن يؤمنوا بديننا { وَ } أيضاً { قَالَتِ ٱلنَّصَارَىٰ }: ديننا حق وشريعتنا مؤيدة ونبينا مخلد { لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَيْءٍ } في الدين والإيمان، بل الدين ديننا { وَ } الحال أن { هُمْ } أي: كلا الفريقين { يَتْلُونَ ٱلْكِتَابَ } المنزل على نبيهم، ويدعون الإيمان والإذعان، ومع ذلك لم يخلصوا من الجهل والعناد، ولم ينتبهوا على التوحيد المزيح للاختلاف، المشعر للوفاق والاتحاد، بل فرق بينهم وبين المشركين النافيين للصانع؛ إذ { كَذَلِكَ قَالَ ٱلَّذِينَ لاَ يَعْلَمُونَ } الكتاب والنبي والدين والإيمان { مِثْلَ قَوْلِهِمْ } بأن الحق ما نحن عليه بلا كتابٍ ولا نبيٍ؛ لأن الإنسان مجبول على تجريح ما هو عليه سواء كان حقاً أو باطلاً، صلاحاً أو فساداً، والأنبياء إنما يرسلون ويبعثون؛ ليميزوا لهم الحق عن الباطل والصالح عن الفاسد، وهم مع بعثة الرسل إليهم سواء كان مع المشركين الذين لا كتاب لهم ولا نبي { فَٱللَّهُ } المحيط بسرائرهم وضمائرهم { يَحْكُمُ بَيْنَهُمْ } على مقتضى علمه بأعمالهم وأحوالهم { يَوْمَ ٱلْقِيَامَةِ } المعد لجزاء الأعمال { فِيمَا كَانُواْ فِيهِ يَخْتَلِفُونَ } [البقرة: 113] على مقتضى آرائهم وأهوائهم فيجازيهم بمقتضى ما يعملون ويعلمون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: إخباراً عن مقالات اليهود والنصارى وتقبيحاً لصنيعهم: { وقالت اليهود } في الرد على النصارى: { ليست النصارى على شيء } يعتد به، { وقالت النصارى } في سَبِّ اليهود، { ليست اليهود على شيء } يعتمد عليه، والحالة أنهم { يتلون الكتاب } ، فاليهود يتلون التوراة وفيها البشارة بعيسى عليه السلام، والنصارى يتلون الإنجيل، وفيه تقرير شريعة التوراة وصحة نبوة موسى عليه السلام، فقد كفرت كلُّ فرقة بكتابها غضباً وتعصباً، ومثل مقالتهم هذه { قال الذين لا يعلمون } وهم المشركون، فقالوا: ليس المسلمون على شيء، { فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون } فيُدْخل أهلَ الحِقّ الجنةَ وأهلَ الباطل النار، وبالله التوفيق\n الإشارة: كل ما قصه الحق تعالى علينا من مساوئ غيرنا فالمقصود به التنفير والتحذير من مثل ما راتكبوه، والتخلق بضد ما فعلوه، فكل من تراه ينقص الناس ويصّرُهم فهو أصغرهم، وكل من تراه يقول: أصحاب سيدي فلان ليسوا على شيء، وأصحاب سيدي فلان ليس عندهم شيء، فليس هو على شيء، وقد ابتلي بعض المتصوفة بهذا الوصف الذميم، ينصب الميزان على الناس، فيسقط ثوماً ويرفع آخرين، وهو يتلو كتاب الله، ويسمع قوله تعالى:\n\n[الحُجرَات: 12] الآية\n وأكثر ما تجد هذا الوصف في بعض الفقهاء المتجمدين على ظاهر الشريعة، يعتقد ألا علم فوق علمه، ولا فهم فوق فهمه، كيف؟ والله تعالى يقول:\n\n[الإسرَاء: 85]،\n\n[يُوسُفِ: 76]، وقد قال إمام الحرمين: لإِنْ أُدْخلَ ألْفَ كَافرٍ في الإسْلامِ بِشُبْهَةٍ خَيْرٌ مِنْ إِخراجِ واحدٍ منْه بشُبْهة\n فالواجب على مَن أراد السلامة أن يُحسن الظن بجميع المسلمين، ويعتقد فيهم أنهم كلهم صالحون، ففي الحديث:\n\n \" خَصْلَتَان لَيْسَ فوقَهُما شَيءٌ منَ الخير: حُسْنُ الظن بالله، وحُسْنُ الظن بِعباد الله، وخَصْلَتَان لَيْسَ فوقَهما شيءٌ مِن الشرِّ: سُوءُ الظنّ بِالله، وسُوءُ الظنِّ بِعِبادِ اللّه \" \n",
      "translations": []
    }
  ]
}