{
  "chapter": "البقرة",
  "text": "واذ يرفع ابرهم القواعد من البيت واسمعيل ربنا تقبل منا انك انت السميع العليم",
  "translations": [
    {
      "translation": "And when Abraham was raising the plinth of the House with Ishmael, (he prayed): \"Accept this from us, O Lord, for You hear and know everything;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember that when Abraham and Ishmael were raising the walls of the House, they prayed, \"Lord, accept this service from us; You are All-Hearing and All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While Abraham and Ishmael were raising the foundation of the house, they prayed, \"Lord, accept our labor. You are All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim was raising the foundations of the House, along with Ismail; (saying), “Our Lord! Accept it from us; indeed You only are the All Hearing, the All Knowing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim and (his son) Isma`il were raising the foundations of the House (the Ka`bah at Makkah), (saying), \"Our Lord! Accept (this service) from us. Verily, You are the Hearer, the Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Ibrahim and Ismail raised the foundations of the House: Our Lord! accept from us; surely Thou art the Hearing, the Knowing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham, and Ishmael with him, raised up the foundations of the House: 'Our Lord, receive this from us; Thou art the All-hearing, the All-knowing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham and Ishmael were raising the foundations of the House, (Abraham prayed): Our Lord! Accept from us (this duty). Lo! Thou, only Thou, art the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham and Ishmael were laying the foundations of the House, [they prayed], \"Our Lord, accept this from us; for You are All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Ibrahim was raising the foundation of the House and also Ismai'l, praying: our Lord! accept of us; verily Thou! Thou art the Hearer, the Knower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As Abraham raised the foundations of the House with Ishmael, [they prayed]: ‘Our Lord, accept it from us! Indeed You are the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Abraham and Isma'il raised the foundations of the House (With this prayer): \"Our Lord! Accept (this service) from us: For Thou art the All-Hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim (Abraham) and (his son) Isma'il (Ishmael) were raising the foundations of the House (the Ka'bah at Makkah), (saying), \"Our Lord! Accept (this service) from us. Verily! You are the All-Hearer, the All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham and Ishmael raised the foundations of the House (supplicating): 'O our Lord, accept this from us, You are the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As Abraham raises the foundations of the House, together with Ishmael, “Our Lord, accept it from us, You are the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], \"Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:127] And, mention, when Abraham raised up the foundations, the supports or the walls, of the House, building it (min al-bayt, ‘of the House’, is semantically connected to yarfa‘u, ‘raises up’), and Ishmael with him (waIsmā‘īlu is a supplement to Ibrāhīmu), both of them saying: ‘Our Lord! Receive this, building, from us. Truly You are the Hearing, of words, the Knowing, of deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Abraham and Ishmael were raising the foundation of the House) built the foundation of the House and Ishmael was helping him and when they finished, they prayed: (Our Lord!) our Lord! (Accept from us) the building of Your house. (Lo! Thou, only Thou, art the Hearer) of our prayer, (the Knower) of the answer to this prayer; it is also said that this means: the Knower of our intention in building Your house.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَإِذْ يَرْفَعُ إِبْرَٰهِيمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ } فالقَواعدُ: الأَسَاسُ\n والوحدةُ قَاعِدةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ يرفع إبراهيم القواعد من البيت } قيل: إنّ الكعبة أنزلت من السماء في زمان آدم ولها بابان إلى المشرق والمغرب، فحجّ آدم عليه السلام من أرض الهند واستقبله الملائكة أربعين فرسخاً فطاف بالبيت ودخله\n ثم رفعت في زمان طوفان نوح عليه السلام، ثم أنزلت مرة أخرى في زمان إبراهيم صلوات الله عليه، فزارها ورفع قواعدها وجعل بابيها باباً واحداً\n وقيل: ثم تمخض أبو قبيس فانشق عن الحجر الأسود وكان ياقوتة بيضاء من يواقيت الجنة نزل بها جبرائيل فخبئت فيه في زمان الطوفان إلى زمن إبراهيم عليه السلام، فوضعه إبراهيم مكانه، ثم اسودّ بملامسة النساء الحيض\n فنزولها في زمان آدم إشارة إلى ظهور القلب في زمانه بوجوده عليه\n وكونه ذا بابين شرقيّ وغربيّ إشارة إلى ظهور علم المبدأ والمعاد، ومعرفة عالم النور، وعالم الظلمة في زمانه دون علم التوحيد\n وقصده زيارتها من أرض الهند إشارة إلى توجهه بالتكوين والاعتدال من عالم الطبيعية الجسمانية المظلمة إلى مقام القلب، واستقبال الملائكة إشارة إلى تعلق القوى الحيوانية والنباتية بالبدن وظهور آثارها فيه قبل آثار القلب في الأربعين التي تكوّنت فيها بنيته وتخمرت طينته أو توجهه بالسير والسلوك من عالم النفس الظلماني إلى مقام القلب\n واستقبال الملائكة تلقي القوى النفسانية والبدنية إياه بقبول الإذعان والأخلاق الجميلة والملكات الفاضلة والتمرّن فيها والتنقل في المقامات قبل وصوله إلى مقام القلب\n وطوافه بالبيت إشارة إلى وصوله إلى مقام القلب وسلوكه فيه مع التلوين، ودخوله إشارة إلى تمكنه واستقامته فيه\n ورفعه في زمان الطوفان إلى السماء إشارة إلى احتجاب الناس بغلبة الهوى وطوفان الجهل في زمان نوح عليه السلام عن مقام القلب\n وبقاؤه في السماء الرابعة، أي: البيت المعمور الذي هو قلب العالم ونزوله مرة أخرى في زمان إبراهيم عليه السلام إشارة إلى اهتداء الناس في زمانه إلى مقام القلب بهدايته\n ورفع إبراهيم قواعده وجعله ذا باب واحد إشارة إلى تلقي القلب بسلوكه عليه السلام من مقامه إلى مقام الروح الذي هو السر وارتفاع مراتبه ووصوله إلى مقام التوحيد، إذ هو أوّل من ظهر عليه التوحيد الذاتيّ كما قال عليه السلام:\n\n[الأنعام، الآية: 79]\n والحجر الأسود إشارة إلى الروح\n وتمخض أبي قبيس وانشقاقه عنه إشارة إلى ظهوره بالرياضة وتحرّك آلات البدن باستعمالها بالتفكر والتبعد في طلب ظهوره، ولهذا قيل: خبئت فيه، يعني: احتجبت بالبدن\n واسوداده بملامسة النساء الحيض إشارة إلى اختفائه وتكدّره بغلبة القوى النفسانية على القلب واستيلائها عليه وتسويدها الوجه النورانيّ الذي يلي الروح منه\n وكذا إسماعيل أيضاً كان من الموحدين لعطفه عليه في رفع قواعد البيت\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل { إِذْ يَرْفَعُ } يحمل جدك { إِبْرَٰهِيمُ } الاواه المنيب { ٱلْقَوَاعِدَ } أي: التكاليف الشاقة الناشئة { مِنَ } إنشاء { ٱلْبَيْتِ } المعد للاهتداء إلى كعبة الوصول من التجريد عن لوازم الحياة ومقتضيات الأوصاف المترتبة عليها، وترك المألوفات وقطع التعلقات العائقة عن الموت الإداري الموصل إلى مقر الوحدة المغنية للكثرة الموهمة، المستتبعة للبعد والفراق عن فضاء التوحيد { وَ } أبوك أيضاً { إِسْمَٰعِيلُ } الراضي بقضاء الله، المرضي بما جرى عليه من البلاء، واذكر أيضاً دعاءهما بعدما احتملا المشاق والمتاعب بقولهما: { رَبَّنَا } يا من ربانا بأنواع المنح التي ليست في وسعنا وقدرتنا { تَقَبَّلْ مِنَّآ } ما أقدرنا عليه { إِنَّكَ أَنتَ } القادر لما جئتنا به { ٱلسَّمِيعُ } لمناجاتنا قبل إلقائنا { ٱلْعَلِيمُ } [البقرة: 127] لحاجاتنا وإخلاصنا في نياتنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}