{
  "chapter": "البقرة",
  "text": "يبنى اسرءيل اذكروا۟ نعمتى التى انعمت عليكم وانى فضلتكم على العلمين",
  "translations": [
    {
      "translation": "O children of Israel, remember the favours I bestowed on you, and made you exalted among the nations of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel, remember that special favour I bestowed upon you, and that I exalted you above all the communities of the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, recall My favor to you and the preference that I gave to you over all the other nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Israel! Remember the favour of Mine which I bestowed upon you and made you superior to all others of your time. (By sending Noble Messengers among you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! Remember My favor which I bestowed upon you and that I preferred you over the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Israel, call to mind My favor which I bestowed on you and that I made you excel the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, remember My blessing wherewith I blessed you, and that I have preferred you above all beings;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! Remember My favour wherewith I favoured you and how I preferred you to (all) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, remember My favour which I have bestowed upon you, and how I preferred you above all other people;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Isra'il! remember My favour wherewith favoured you, and that I preferred you over the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel, remember My blessing which I bestowed upon you, and that I gave you an advantage over all the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! call to mind the special favour which I bestowed upon you, and that I preferred you to all others (for My Message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! Remember My Favour which I bestowed upon you and that I preferred you to the 'Alamin (mankind and jinns) (of your time-period, in the past).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, remember My favor which I bestowed upon you and that I preferred your (prophets among you) above the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel! Remember My blessing which I bestowed upon you, and that I have favored you over all people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Israel, remember My favor which I have bestowed upon you and that I preferred you over the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:122] O Children of Israel, remember My favour wherewith I favoured you, and that I have preferred you over all the worlds: a similar verse has already been mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "20 Allah then mentions His favour upon the Children of Israel, saying: (0 Children of Israel!) Children of Jacob (Remember) recollect (My favour wherewith I favoured you) favoured your forefathers by delivering them from Pharaoh and his people as well as by the blessings and bounties that I favoured them with (and how I preferred you) with Islam (to the worlds) the people of your time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما خاطب سبحانه بني إسرائيل أولاً بإيفاء العهد الذي هو شعار الإيمان، وما يتعلق بإيفاء العهد من الرجوع إليه، والإيمان بكتبه ورسله وعدم المبادرة إلى الفكر، وعدم استبدال آيات الله الدالة على ذاته علماً وعيناً وحقاً بالمزخرفات الفانية التي لا مداد لها أصلاً، وعدم لبس الحق الظاهر المكشوف المحقق بالباطل الموهوم المعدوم، وإقام الصلاة وإيتاء الزكاة المنبئين من التوجه الفطري، والرجوع الحقيقي الأصلي، الركوع والخشوع على وجه التذلل والانكسار، إلى أن يصل إلى الفناء في ذاته بل إلى فناء الفناء لينعكس البقاء\n\n\n\n\nثم عبر سبحانه تعبيراً فوق تعبيرٍ على الناسين نفوسهم في الغفلة بلا توجهٍ ورجوعٍ، ثم أمر خلص عباده باستعانة الصبر المورث للتمكين، والصلاة المشعر بالتوجه التام المسقط لجميع الآثام، هذا لتصفية ذواتهم\n\n\n\n\nثم خاطبهم سبحانه ثانياً وأوصاهم بشكر نعم تفضيلهم وتكريمهم على بني نوعهم بأنواع الكرامات الدينية والدنيوية\n\n\n\n\nثم حذرهم وخوفهم عن يوم الجزاء على وجه المبالغة والتأكيد؛ لتصفية أوصافهم في معاشهم في النشأة الأولى\n\n\n\n\nثم لما ذكر سبحانه كفرانهم وطغيانهم وعدم انقيادهم بالكتب والرسل، وتكذيبهم وقتلهم وخبث طينتهم ودناءة طبعهم، وقساوة قلبهم وشدة عداوتهم مع المؤمنين، وقبح صنيعهم مع الأنبياء الماضين كرر خطابه سبحانه إليهم ثالثاً بما سبق ثانياً، مبالغةً وتأكيداً وتلطفاً وإمهالاً لهم؛ كي يتنبهوا، ومع ذلك لم يتنبهوا لخبث طينتهم، فقال: { يَابَنِي إِسْرَائِيلَ } المعرضين عني بأنواع الإعراضات، والمعترضين لآيأتي بأصناف الاعتراضات مضى ما مضى { ٱذْكُرُواْ } واشكروا { نِعْمَتِيَ ٱلَّتِيۤ أَنْعَمْتُ عَلَيْكُمْ } بفضلي وإحساني مع عدم شكركم وكفرانكم { وَ } خصوصاً اذكروا من النعم نعمة الجاه والتفضيل على جميع البرايا؛ إذ { أَنِّي } بحولي وطولي { فَضَّلْتُكُمْ عَلَى ٱلْعَالَمِينَ } [البقرة: 122] من بني نوعكم، وامتثلوا أمري ولا تجاوزوا عن حكمي، واحذروا عن قهري وانتقامي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}