{
  "chapter": "البقرة",
  "text": "الذين ءاتينهم الكتب يتلونه حق تلاوته او۟لئك يؤمنون به ومن يكفر به فاو۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "Those to whom We have sent down the Book, and who read it as it should be read, believe in it truly; but those who deny it will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are those, even among the people of the Scripture, who read the Book as it should be read and believe in it sincerely; as for those who reject it, they are indeed the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (of the People of the Book) who have received Our Book (Quran), and read it thoroughly, believe in it. Those who disbelieve the Book are certainly losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book, read it in the manner it should be read; it is they who believe in it; and those who deny it – it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom we gave the Book recite it as it should be recited (Yatlunahu Haqqa Tilawatihi) they are the ones who believe therein. And whoso disbelieve in it, those are they who are the losers.) Ibn Jarir said, \"Allah said,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book read it as it ought to be read. These believe in it; and whoever disbelieves in it, these it is that are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book and who recite it with true recitation, they believe in it; and whoso disbelieves in it, they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We have given the Scripture, who read it with the right reading, those believe in it. And whoso disbelieveth in it, those are they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given this Book follow it as it ought to be followed; it is they who [truly] believe in it; those who deny it will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We have vouchsafed the Book and they recite it as it ought to be recited - they shall believe therein and whosoever disbelieveth therein, those then! they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book follow it as it ought to be followed: they have faith in it. As for those who deny it—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have sent the Book study it as it should be studied: They are the ones that believe therein: Those who reject faith therein,- the loss is their own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those (who embraced Islam from Bani Israel) to whom We gave the Book [the Taurat (Torah)] [or those (Muhammad's Peace be upon him companions) to whom We have given the Book (the Quran)] recite it (i.e. obey its orders and follow its teachings) as it should be recited (i.e. followed), they are the ones that believe therein. And whoso disbelieves in it (the Quran), those are they who are the losers. (Tafsir Al-Qurtubi. Vol. 2, Page 95).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book, and who recite it as it ought to be read, truly believe in it; those who disbelieve it shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture follow it, as it ought to be followed—these believe in it. But as for those who reject it—these are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recite it with its true recital. They [are the ones who] believe in it. And whoever disbelieves in it - it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:121] Those to whom We have given the Scripture (this is the subject of the sentence), and who recite it with true recitation, that is, who recite it as it was revealed (haqqa tilāwatihi, ‘its true recitation’, is a circumstantial qualifier; haqqa is in the accusative because it is the object of the verbal noun), they believe in it (this is the predicate): this was revealed concerning a group of Ethiopians that presented themselves [to the Prophet] and accepted Islam; and whoever disbelieves in it, that is, in the revealed Book, by distorting it, they shall be the losers, because they will be destined for the Fire, made everlasting for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the believers from among the people of the Book: 'Abdullah Ibn Salam and his companions, Bahirah the Monk and the Negus and his followers, saying: (Those unto whom We have given the Scripture) given knowledge of the Scripture, i.e. the Torah, (who read it with the right reading) describe it as it is and do not alter it: expositing what is lawful and unlawful, its commands and prohibitions to whomever asks them, and they further act according to what is clear and unambiguous and believe in that which is ambiguous therein, (those believe in it) in Muhammad and the Qur'an. (And who disbelieveth in it) in Muhammad and the Qur'an, (those are they who are losers) who are duped in that they lose both this world and the world to come.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { يَتْلُونَهُ حَقَّ تِلاَوَتِهِ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ يعلمونَ حَقَّ عِلمهِ ويتَّبِعونَهُ حقَّ اتباعِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقال سبحانه: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَـٰبَ } واصطفيناهم من بين الأمم بإرسال الرسل، وهم { يَتْلُونَهُ } أي: الكتاب، متأملاً متدبراً مما يشتمل عليه من الأمور والنواهي والمعارف والحقائق، مراعياً { حَقَّ تِلاَوَتِهِ } بلا تحريف ولا تبديل { أُوْلَـٰئِكَ يُؤْمِنُونَ بِهِ } وبما فيه من الأحكام والآيات والأخبار { وَمن يَكْفُرْ بِهِ } بتحريفه أو تبديله إلى ما تهوى أنفسهم { فَأُوْلَـٰئِكَ } المحرفون المغيرون كتاب الله لمصلحة نفوسهم { هُمُ ٱلْخَٰسِرُونَ } [البقرة: 121] الذين خسروا أنفسهم في الدنيا والآخرة بسبب تحريف كتاب الله وتبديله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}