{
  "chapter": "البقرة",
  "text": "ربنا وابعث فيهم رسولا منهم يتلوا۟ عليهم ءايتك ويعلمهم الكتب والحكمة ويزكيهم انك انت العزيز الحكيم",
  "translations": [
    {
      "translation": "And send to them, O Lord, an apostle from among them to impart Your messages to them, and teach them the Book and the wisdom, and correct them in every way; for indeed You are mighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, raise up from among them a Messenger who shall recite Your Revelations to them and teach them the Book and Wisdom and purify their lives. You art All-Powerful and AllWise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, send to them (our descendants) a Messenger of their own who will recite to them Your revelations, teach them the Book, give them wisdom, and purify them. You alone are the Majestic and the Most Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord! And send towards them a Noble Messenger, from amongst them, to recite to them Your verses, and to instruct them in Your Book and sound wisdom*, and to fully purify them; indeed You only are the Almighty, the Wise.” (The traditions of the Holy Prophet – sunnah and hadith – are called wisdom.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Send amongst them a Messenger of their own, who shall recite unto them Your verses and instruct them in the Book (this Qur'an), and purify them. Verily, You are the Mighty, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! and raise up in them an Apostle from among them who shall recite to them Thy communications and teach them the Book and the wisdom, and purify them; surely Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, our Lord, do Thou send among them a Messenger, one of them, who shall recite to them Thy signs, and teach them the Book and the Wisdom, and purify them; Thou art the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! And raise up in their midst a messenger from among them who shall recite unto them Thy revelations, and shall instruct them in the Scripture and in wisdom and shall make them grow. Lo! Thou, only Thou, art the Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, send forth to them a messenger of their own to recite Your revelations to them, to teach them the Scripture and wisdom, and purify them. You are the Mighty, the Wise One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! raise up unto them an apostle from among them, who shall recite unto them Thy revelations, and shall teach them the Book and wisdom, and shall cleanse them. Verily Thou! Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Our Lord, raise amongst them an apostle from among them, who will recite to them Your signs and teach them the Book and wisdom and purify them. Indeed You are the All-mighty, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! send amongst them a Messenger of their own, who shall rehearse Thy Signs to them and instruct them in scripture and wisdom, and sanctify them: For Thou art the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Send amongst them a Messenger of their own (and indeed Allah answered their invocation by sending Muhammad Peace be upon him), who shall recite unto them Your Verses and instruct them in the Book (this Quran) and Al-Hikmah (full knowledge of the Islamic laws and jurisprudence or wisdom or Prophethood, etc.), and sanctify them. Verily! You are the All-Mighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, send among them a Messenger from them who shall recite to them Your verses and teach them the Book and wisdom, and purify them; You are the Mighty, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and raise up among them a messenger, of themselves, who will recite to them Your revelations, and teach them the Book and wisdom, and purify them. You are the Almighty, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, and send among them a messenger from themselves who will recite to them Your verses and teach them the Book and wisdom and purify them. Indeed, You are the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:129] Our Lord! And send among them, the people of this House, a messenger, one of them and God granted him this petition with [the sending of] Muhammad (s), who shall recite to them Your signs, the Qur’ān, and teach them the Book, the Qur’ān, and Wisdom, that is, what the former contains of judgments, and purify them, cleanse them of idolatry; You are the Mighty, the Victor, the Wise, in His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) our Lord (And raise up in their midst) the offspring of Ishmael (a Messenger from among them) from their own lineage (who shall recite unto them Your revelations) the Qur'an, (and shall instruct them in the Scripture) the Qur'an (and in wisdom) the lawful and the prohibited (and shall make them pure) from sins through the declaration of the Oneness of God. (Lo! Thou, only Thou, art the Mighty) Who is vengeful against whosoever does not answer Your Messenger whom You sent to them, (the Wise) in sending the Messenger. And Allah answered his prayers and sent unto them Muhammad (pbuh); and these are the words with which Allah tried him, and he fulfilled them by asking Allah for them in his prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَيُزَكِّيهِمْ } معناهُ يُطهرُهُمْ\n وقالَ فِي سورةٍ أُخرى:\n\n[الكهف: 74] معناهُ مُطهَّرةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كان الغالب عليهما توحيد الصفات والأفعال، دعوا ربهما متضرعين أن يبعث من ذريتهما من يغلب عليه توحيد الذات فقالا: { رَبَّنَا وَٱبْعَثْ فِيهِمْ } أي: في الأمة المسلمة { رَسُولاً مِّنْهُمْ } هداياً إلى توحيد الذات { يَتْلُواْ عَلَيْهِمْ } أولاً { آيَٰتِكَ } الدالة على ذلك ظاهراً { وَ } ثانياً: { يُعَلِّمُهُمُ } يفهمهم { ٱلْكِتَٰبَ } المبين سرائر الآيات { وَ } ثالثاً: بكشف ويوضح لهم { ٱلْحِكْمَةَ } التي هي سلوك طريق التوحيد الذاتي { وَ } ورابعاً: { يُزَكِّيهِمْ } أي: يطهرهم عن رؤية الغير في الوجود مطلقاً { إِنَّكَ أَنتَ ٱلعَزِيزُ } الغالب القاهر للأغيار { ٱلحَكِيمُ } [البقرة: 129] في إيجادها وإظهارها على وفق مشيئتك وإرادتك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربنا وابعث فيهم } أي: في الذرية { رسولاً منهم } وهو مولانا محمد صلى الله عليه وسلم قال - عليه الصلاة والسلام -:\n\n \" أنا دعوة أبي إبراهيم، وبشارة عيسى \" \n",
      "translations": []
    }
  ]
}