{
  "chapter": "البقرة",
  "text": "واذ قال ابرهم رب اجعل هذا بلدا ءامنا وارزق اهله من الثمرت من ءامن منهم بالله واليوم الءاخر قال ومن كفر فامتعه قليلا ثم اضطره الى عذاب النار وبئس المصير",
  "translations": [
    {
      "translation": "And when Abraham said: \"O Lord, make this a city of peace, and give those of its citizens who believe in God and the Last Day fruits for food,\" He answered: \"To those will I also give a little who believe not, for a time, then drag them to Hell, a dreadful destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember that Abraham prayed, \"Lord, make this city a city of peace and security, and provide with every kind of fruit those of its people, who believe in Allah and the Last Day'. Allah answered, \"As for the disbelievers, I will also provide them with the necessities of life in this world, though in the Next World I will drag them to the torment of Hell, and that is the worst abode.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Abraham prayed to the Lord saying, \"Lord, make this town a place of security and provide those in the town who believe in God and the Day of Judgement, with plenty,\" God replied, \"I shall allow those who hide the truth to enjoy themselves for a while. Then I shall drive them into the torment of hell fire, a terrible destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim prayed, “My Lord! Make this city a place of security and bestow upon its people various fruits as providence – for those among them who believe in Allah and the Last Day (of Resurrection)”; He answered, “And whoever disbelieves, I shall provide him also some subsistence and then compel him towards the punishment of fire (hell); and that is a wretched place to return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim said, \"My Lord, make this city (Makkah) a place of security and provide its people with fruits, such of them as believe in Allah and the Last Day.\" He (Allah) answered: \"As for him who disbelieves, I shall leave him in contentment for a while, then I shall compel him to the torment of the Fire, and worst indeed is that destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Ibrahim said: My Lord, make it a secure town and provide its people with fruits, such of them as believe in Allah and the last day. He said: And whoever disbelieves, I will grant him enjoyment for a short while, then I will drive him to the chastisement of the fire; and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said, 'My Lord, make this a land secure, and provide its people with fruits, such of them as believe in God and the Last Day.' He said, 'And whoso disbelieves, to him I shall give enjoyment a little, then I shall compel him to the chastisement of the Fire -- how evil a homecoming!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham prayed: My Lord! Make this a region of security and bestow upon its people fruits, such of them as believe in Allah and the Last Day, He answered: As for him who disbelieveth, I shall leave him in contentment for a while, then I shall compel him to the doom of Fire - a hapless journey's end!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham prayed, \"My Lord, make this city a city of peace, and provide its inhabitants with fruits, such of them as believe in God and the Last Day.\" God said, \"As for those who deny the truth, I will grant them benefits for a short while and then subject them to the punishment of the Fire -- an evil destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Ibrahim said: my Lord! make this city a place of security, and provide the People thereof with fruits, - such of them as will believe in Allah and the last Day. Allah said: and whosoever will disbelieve, him also shall give enjoyment for a while; thereafter I shall drive him to the torment of the Fire, - an ill abode!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said, ‘My Lord, make this a secure town, and provide its people with fruits—such of them as have faith in Allah and the Last Day,’ He said, ‘As for him who is faithless, I will provide for him [too] for a short time, then I will shove him toward the punishment of the Fire and it is an evil destination.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Abraham said: \"My Lord, make this a City of Peace, and feed its people with fruits,-such of them as believe in Allah and the Last Day.\" He said: \"(Yea), and such as reject Faith,-for a while will I grant them their pleasure, but will soon drive them to the torment of Fire,- an evil destination (indeed)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim (Abraham) said, \"My Lord, make this city (Makkah) a place of security and provide its people with fruits, such of them as believe in Allah and the Last Day.\" He (Allah) answered: \"As for him who disbelieves, I shall leave him in contentment for a while, then I shall compel him to the torment of the Fire, and worst indeed is that destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said: 'My Lord, make this country safe and provide its inhabitants whosoever of them believes in Allah and the Last Day with fruits' He said: 'And whosoever disbelieves, to him I shall give enjoyment for a while. Then I shall compel him to the punishment of the Fire, how evil an arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Abraham said, “O My Lord, make this a peaceful land, and provide its people with fruits—whoever of them believes in God and the Last Day.” He said, “And whoever disbelieves, I will give him a little enjoyment, then I will consign him to the punishment of the Fire; how miserable the destiny!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when Abraham said, \"My Lord, make this a secure city and provide its people with fruits - whoever of them believes in Allah and the Last Day.\" [Allah] said. \"And whoever disbelieves - I will grant him enjoyment for a little; then I will force him to the punishment of the Fire, and wretched is the destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:126] And when Abraham said, ‘My Lord, make this, place, a land secure, in which there is safety: God granted   him his request, making it a sanctuary in which no human blood is shed, no injustice is committed towards anyone, no prey is hunted and which is never deserted in any of its parts; and provide its people with fruits: something which actually happened when there came itinerants from as far as Syria, whereas before, it had been devoid of any vegetation or water; such of them as believe in God and the Last Day’ (this phrase stands in place of its people, and they are here singled out for mention in the request in accordance with God’s saying My covenant shall not reach the evildoers); He, exalted, said, ‘And whoever disbelieves, I will also provide with fruits, to him I shall give enjoyment (read either umti‘uhu or umatti‘uhu), by granting him sustenance in this life, a little, the length of his life, but then I shall compel him, I shall drive him in the Hereafter to the chastisement of the Fire, so that he cannot find an escape — how evil a journey’s end!’, a place to which to return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Abraham prayed: My Lord! Make this a region of security) free of perturbation (and bestow upon its people fruits) different kinds of fruit, (such of them as believe in Allah and the Last Day) in resurrection after death, (He) Allah (answered: As for him who disbelieveth) as well, (I shall leave him in contentment for a while) I shall provide for him a little in this life, (then I shall compel him) force him (to the doom of fire, a hapless journey's end!) to which he shall come.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد { إِذْ } أمرنا وابنه بطهارة البيت وامتثالا بالمأمور { قَالَ إِبْرَاهِيمُ } منيباً إلينا، داعياً راجياً في دعائه النفع العام: { رَبِّ ٱجْعَلْ } بيتك { هَـٰذَا بَلَداً آمِناً } ذا أمن للمتوجهين إليها والعاكفين ببابها عن العلائق المانعة عن التوحه المعنوي { وَ } بعدما توجهوا نحوه { ٱرْزُقْ أَهْلَهُ مِنَ ٱلثَّمَرَاتِ } المترتبة على سرائر تعيينه وتخصيصه، ووجوب طوافه على المستطيعين المنهمكين في الشواغل المانعة عن التوجه إلى الكعبة الحقيقية الممثلة عنها هذا البلد\n\n\n\n\nولما دعا إبراهيم بهذا الدعاء المجمل المطلق لهم، فصله سبحانه إجابة دعائه بقوله: { مَنْ آمَنَ مِنْهُمْ } من المتوجهين الزائرين { بِٱللَّهِ } الواحد الأحد تعبداً وانقياداً { وَٱلْيَوْمِ ٱلآخِرِ } المحقق الوقوع إذعاناً وتصديقاً، فلهم ما دعوت لهم من أنواع الإفضال والإنعام؛ جزاء لهم وإجابة لدعائك ثم { قَالَ } سبحانه: { وَمَن كَفَرَ } منهم وجحد بعدما وضح لهم الطريق { فَأُمَتِّعُهُ } متاعاً { قَلِيلاً } من مفاخرة الأقران والاستكبار على الإخوان وتفرج البلدان { ثُمَّ أَضْطَرُّهُ } بعد جحوده وإنكاره { إِلَىٰ عَذَابِ ٱلنَّارِ } بل أشد منها، وهو حرمانه عن الفوائد المرتبة على الطواف والزيادة المنبئة عن الوصول إلى مرتبة العبودية والمخلصة، عن جهنم الإمكان الذي هو مصير أهل الكفر والطغيان { وَبِئْسَ ٱلْمَصِيرُ } [البقرة: 126] مصيرهم الذي لا ينجو منه أحد من أهله، عصمنا الله منه بمنه وجوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}