{
  "chapter": "البقرة",
  "text": "وقالوا۟ كونوا۟ هودا او نصرى تهتدوا۟ قل بل ملة ابرهم حنيفا وما كان من المشركين",
  "translations": [
    {
      "translation": "They say: \"Become Jews or become Christians, and find the right way.\" Say: \"No. We follow the way of Abraham the upright, who was not an idolater.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, \"Become Jews and you will be rightly guided\"; the Christians say, \"Become Christians and you will have the true guidance.\" Say to them, \"Nay, we turn away from every other way and accept the way of Abraham, and Abraham did not associate other gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians have asked the Muslims to accept their faith to have the right guidance. (Muhammad) tell them, \"We would rather follow the upright religion of Abraham who was not a pagan\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the People given the Book(s) said, “Become Jews or Christians – you will attain the right path”; say (O dear Prophet Mohammed – peace and blessings be upon him), “No – rather we take the religion of Ibrahim, who was far removed from all falsehood; and was not of the polytheists.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Be Jews or Christians, then you will be guided.\" Say (to them O Muhammad), \"Nay, (we follow) only the religion of Ibrahim, Hanif (Islamic Monotheism), and he was not of Al-Mushrikin (those who worshipped others along with Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Be Jews or Christians, you will be on the right course. Say: Nay! (we follow) the religion of Ibrahim, the Hanif, and he was not one of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'Be Jews or Christians and you shall be guided.' Say thou: 'Nay, rather the creed of Abraham, a man of pure faith; he was no idolater.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Be Jews or Christians, then ye will be rightly guided. Say (unto them, O Muhammad): Nay, but (we follow) the religion of Abraham, the upright, and he was not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Be Jews or Christians, and you shall be rightly guided.\" Say, \"By no means! We believe in the faith of Abraham, who was ever inclined [to God]; he was not one of those who set up partners with God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: become Jews or Nazarenes, and ye shall be guided. Say thou: Aye! we follow the faith of Ibrahim, the upright, and he was not of the associators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Be either Jews or Christians, that you may be [rightly] guided.’ Say, ‘No, rather, [we will follow] the creed of Abraham, a Hanif, and he was not one of the polytheists.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Become Jews or Christians if ye would be guided (To salvation).\" Say thou: \"Nay! (I would rather) the Religion of Abraham the True, and he joined not gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Be Jews or Christians, then you will be guided.\" Say (to them, O Muhammad Peace be upon him), \"Nay, (We follow) only the religion of Ibrahim (Abraham), Hanifa [Islamic Monotheism, i.e. to worship none but Allah (Alone)], and he was not of Al-Mushrikun (those who worshipped others along with Allah - see V. 2:105).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Be Jews or Nazarenes and you shall be guided' Say: 'No, rather the Creed of Abraham, the upright one. He was not among the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Be Jews or Christians, and you will be guided.” Say, “Rather, the religion of Abraham, the Monotheist; he was not an idolater.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Be Jews or Christians [so] you will be guided.\" Say, \"Rather, [we follow] the religion of Abraham, inclining toward truth, and he was not of the polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:135] And they say, ‘Be Jews or Christians (the particle aw is for detail; the first of these is the saying of the Medinan Jews, while the second is that of the Christians of Najrān), and you shall be guided’. Say, to them: ‘Nay, we follow, rather the creed of Abraham, a hanīf (hanīfan is a circumstantial qualifier referring to Ibrāhīma, that is to say, one that inclines away from all other religions to the upright religion); and he was not of the idolaters’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah mentioned after this the dispute of the Jews and Christians with the believers, saying: (And they say) i.e. the Jews: (Be Jews) you shall be guided from error (or Christians) and the Christians also say the same, (then ye will be rightly guided. Say) to them, Muhammad: it is not as you claim: (Nay, but the religion of Abraham, the upright) the Muslim; rather follow the religion of Abraham, the upright, the Muslim, the sincere-only then you will be guided, (and he was not of the idolaters) i.e. he did not follow the religion of the Jews or Christians.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { بَلْ مِلَّةَ إِبْرَاهِيمَ حَنِيفاً } قالَ زيدُ بن علي عليهما السلامُ فالحَنِيفُ: المُسلِمُ، وكانَ الحَنيفُ فِي الجَاهليةِ مَنْ اخْتَتَنَ وَحَجَّ البيتَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن { قَالُواْ } أي: كل من الفريقين لكم { كُونُواْ هُوداً أَوْ نَصَارَىٰ } لكي { تَهْتَدُواْ } إلى طريق الحق { قُلْ } لهم لا نتبع آراءكم الفاسدة وأهواءكم الباطلة { بَلْ } نتبع { مِلَّةَ إِبْرَاهِيمَ حَنِيفاً } مائلاً عن الآراء الباطلة مهذباً منها { وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ } [البقرة: 135] بالله باعتقاد الوجود لغير الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في { قالوا } لأهل الكتاب، و { أو } للتفصيل، أي: قالت اليهود: كونوا هوداً، وقالت الصنارى: كونوا نصارى\n و { تهتدوا } جواب الأمر، و { ملة } منصوب بفعل محذوف، على حذف مضاف، أي: بل نكون أهل ملة إبراهيم، أو نتبع او نلزم ملة إبراهيم، و { حنيفاً } حال من المضاف إليه، لأنه كجزئه، أي: مائلاً عن الباطل، إلى الحق\n يقول الحقّ جلّ جلاله: وقالت اليهود للمسلمين: { كونوا } معنا هوداً { تهتدوا } فإن ديننا أقدم، وقالت النصارى لهم أيضاً، كونوا { نصارى } معنا { تهتدوا } فإن ديننا أصوب، { قل } لهم يا محمد: { بل } نلزم { ملة إبراهيم } الذي كان مائلاً عن الباطل متبعاً للحق، ومشاهداً له وحده\n ولم يكن من المشركين كما أشركتم بعُزير وعيسى وغيرهما، تعالى الله عن قولكم علواً كبيراً\n الإشارة: قد سرى هذا الطبع في بعض المنتسبين، يُرَغِّبُون الناس في طريقهم، ويحرصون على اتباعهم والدخول معهم، وينقصون طريق غيرهم، وهو وصف مذموم، بل الواجب أن ينظر الإنسان بعين البصيرة، فمن وجده يدل على الله ويغيب عما سواه، ينهض حاله ويدل على الله مقاله، اتبعه وحطَّ رأسه له، ولزم ملته وطريقه إينما كان، وكيفما كان\n ومن وجده على غير هذا الوصف، أعرض عنه، والتمس غيره، وليس من شأن الدعاة إلى الله الحرص على الناس، أو الترغيب في اتباعهم، بل هم أزهد الناس في شأن الدعاة إلى الله الحرص على الناس، أو الترغيب في اتباعهم، بل هم أزهد الناس في الناس، من أتاهم دلّوه على الله، ومن لقيهم نصحوه في الله، هم على قدَم الرسول صلى الله عليه وسلم وقد قال له الحقّ تعالى:\n\n[يُونس: 99]\n\n\n[الغاشية: 22]،\n",
      "translations": []
    }
  ]
}