{
  "chapter": "البقرة",
  "text": "ام كنتم شهداء اذ حضر يعقوب الموت اذ قال لبنيه ما تعبدون منۢ بعدى قالوا۟ نعبد الهك واله ءابائك ابرهم واسمعيل واسحق الها وحدا ونحن له مسلمون",
  "translations": [
    {
      "translation": "Were you present at the hour of Jacob's death? \"What will you worship after me?\" he asked his sons, and they answered: \"We shall worship your God and the God of your fathers, of Abraham and Ishmael and Isaac, the one and only God; and to Him we submit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you present at the time when Jacob was on the point of death? He asked his children, \"Whom will you worship after me?\" They all answered, \"We will worship the same One Allah Whom you, your forefathers Abraham. Ismail and Isaac acknowledged as their Allah and to Him we all surrender as Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you (believers) there when death approached Jacob? When he asked his sons, \"Whom will you worship after my death?\" They replied, \"We will worship your Lord, the Lord of your fathers, Abraham, Ishmael, and Isaac. He is the only Lord, and to Him we have submitted ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, some of you yourselves were present when death approached Yaqub and when he said to his sons, “What will you worship after me?” They said, “We shall worship Him Who is your God, and is the God of your fathers, Ibrahim and Ismail and Ishaq (Isaac) – the One God; and to Him we have submitted ourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or were you witnesses when death approached Ya`qub (Jacob) When he said unto his sons, \"What will you worship after me\" They said, \"We shall worship your AIlah (God ـ Allah) the Ilah of your fathers, Ibrahim (Abraham), Isma`il (Ishmael), Ishaq (Isaac), One Ilah, and to Him we submit (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! were you witnesses when death visited Yaqoub, when he said to his sons: What will you serve after me? They said: We will serve your God and the God of your fathers, Ibrahim and Ismail and Ishaq, one God only, and to Him do we submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, were you witnesses, when death came to Jacob? When he said to his sons, 'What will you serve after me?' They said, 'We will serve thy God and the God of thy fathers Abraham, Ishmael and Isaac, One God; to Him we surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or were ye present when death came to Jacob, when he said unto his sons: What will ye worship after me? They said: We shall worship thy god, the god of thy fathers, Abraham and Ishmael and Isaac, One Allah, and unto Him we have surrendered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you present when Jacob faced the hour of death and he asked his sons, \"Who will you worship after me?\" They answered, \"We will worship your God and the God of your fathers, Abraham and Ishmael and Isaac: the one God; we have submitted ourselves to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were ye witnesses when death presented itself to Ya'qub, what time he said unto his sons: what will ye worship after me! They said: we shall worship the God the God of thy fathers, Ibrahim and Ismai'l and Ishaq, and unto Him we are submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you witnesses when death approached Jacob, when he said to his children, ‘What will you worship after me?’ They said, ‘We will worship your God and the God of your fathers, Abraham, Ishmael, and Isaac, the One God, and to Him do we submit.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were ye witnesses when death appeared before Jacob? Behold, he said to his sons: \"What will ye worship after me?\" They said: \"We shall worship Thy god and the god of thy fathers, of Abraham, Isma'il and Isaac,- the one (True) Allah: To Him we bow (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or were you witnesses when death approached Ya'qub (Jacob)? When he said unto his sons, \"What will you worship after me?\" They said, \"We shall worship your Ilah (God - Allah), the Ilah (God) of your fathers, Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), One Ilah (God), and to Him we submit (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, were you witnesses when death came to Jacob! He said to his children: 'What will you worship after me' They replied: 'We will worship your God and the God of your forefathers, Abraham, Ishmael, and Isaac, the One God. To Him, we are submissive'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or were you witnesses when death approached Jacob, and he said to his sons, “What will you worship after Me?” They said, “We will worship your God, and the God of your fathers, Abraham, Ishmael, and Isaac; One God; and to Him we submit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or were you witnesses when death approached Jacob, when he said to his sons, \"What will you worship after me?\" They said, \"We will worship your God and the God of your fathers, Abraham and Ishmael and Isaac - one God. And we are Muslims [in submission] to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:133]   When the Jews said to the Prophet (s), ‘Do you not know that on the day of his death Jacob charged his sons with Judaism?’, the following was revealed: Or, were you witnesses, present, when death came to Jacob? When (idh, ‘when’, substitutes for the preceding idh) he said to his sons, ‘What will you worship after me?’, after I die?; They said, ‘We will worship your God and the God of your fathers Abraham and Ishmael and Isaac (in recognition of the predominant [mention of the father figures] Ishmael is also counted as a father, and also because the status of an uncle is akin to that of a father), One God (ilāhan wāhidan, ‘One God’, substitutes for ilāhaka, ‘your God’), to Him we submit’ (the initial am [of the phrase am kuntum, ‘Or, were you …’] is similar to the hamza of denial [sc. a-kuntum], the sense being, ‘You were not present at his death, so how do you ascribe to him what does not befit him?’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the dispute among the Jews concerning the religion of Abraham, saying: (Or were ye witnesses) or were you, assembly of Jews, present (when death came to Jacob) regarding what he enjoined his children, i.e. whether he enjoined them to follow Judaism or Islam, (when he said unto his sons: What will ye worship after me?) after I die? (They said: We shall worship thy God) we worship, (the God of your fathers, Abraham, Ishmael and Isaac, one God) i.e. we worship one God, (and unto Him we have surrendered) we acknowledge to worship Him and declare that there is only one true God.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اعتقد اليهود أن يعقوب وبنيه كانوا هوداً، والنصارى اعتقدوهم نصارى، أراد سبحانه أن يظهر فساد عقائدهم، فقال: أتسمعون أيها اليهود والنصارى يهودية يعقوب وبنفيه ونصرانيتهم لمن أنزل عليكم { أَمْ كُنتُمْ شُهَدَآءَ } حضراء { إِذْ حَضَرَ يَعْقُوبَ ٱلْمَوْتُ } ولولا هذا ولولا ذاك كنتم مفتشرين عليهم جاهلين بحالهم، اذكر لهم يا أكمل الرسل { إِذْ قَالَ } حين أشرف على الموت { لِبَنِيهِ } إرشاداً لهم: { مَا تَعْبُدُونَ مِن بَعْدِي } با بني؟ { قَالُواْ نَعْبُدُ إِلَـٰهَكَ وَإِلَـٰهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ إِلَـٰهاً وَاحِداً } أحداً صمداً، لم يتخذ صاحبة ولا ولداً { وَنَحْنُ لَهُ } لا لغيره من الآلهة الباطلة { مُسْلِمُونَ } [البقرة: 133] منقادون متوجهون، خالياً عن المكابرات والعناد، قالعاً عرف التقليدات الراسخة في قلوب العباد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أم }: منقطعة، والاستفهام فيها للإنكار، أي: ما كنتم حاضرين حين حضر يعقوب الموت، وقال لبنيه ما قال، فكيف تدعون اليهودية عليه، و { إلهاً واحداً } بدل من { إله آبائك } ، وفائدته التصريح بالتوحيد، ونفي التوهم الناشىء عن تكرير المضاف، لتعذر العطف على المجرور، والتأكيد، أو نصب على الاختصاص أو الحال، وعد إسماعيل من الآباء تغليباً، أو لأنه كالأب لقوله - عليه الصلاة والسلام-:\n\n \" عَمُّ الرُجلِ صِنْوُ أبيه \" \n\nوقال في العباس:\n\n \" هذا بقية آبائي \" \n\nقاله البيضاوي\n يقوله الحق جلّ جلاله: في توبيخ اليهود على زعمهم أن اليهودية كانت ملة إبراهيم، وأن يعقوب عليه السلام أوصى بها عند موته، فقال: هل كنتم حاضرين عند يعقوب حين حضرته الوفاة حتى أوصى بما زعمتهم؟ وإنما كانت وصيته أن قال لبنيه: { ما تعبدون من بعدي } أيْ: أيّ شيء تعبدونه؟ أراد به تقريرهم على التوحيد وأخذ ميثاقهم على الثبات عليه، { قالوا } في جوابه: { نعبد إلهك } المتفق على وجوب وجوده وثبوت ألوهيته الذي هو { إلهك وإله آبائك } قبلك { إبراهيم } وولده { إسماعيل وإسحاق } الذي هو إلهٌ واحدٌ\n ونحون منقادون لأحكامه، مستسلمون لأمره إلى مماتنا، فلم يوص يعقوب إلا بما سمعتم، فانتسابكم يا معشر اليهود إليهم لا يوجب انتفاعكم بأعمالهم، وإنما تنتفعون بموافقتهم واتباعهم",
      "translations": []
    }
  ]
}