{
  "chapter": "البقرة",
  "text": "فان ءامنوا۟ بمثل ما ءامنتم به فقد اهتدوا۟ وان تولوا۟ فانما هم فى شقاق فسيكفيكهم الله وهو السميع العليم",
  "translations": [
    {
      "translation": "If they come to believe as you did, they will find the right path. If they turn away then they will only oppose; but God will suffice you against them, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they believe the way you have believed, they have the right guidance, and if they turn away from this, it will become obvious that they are obdurate. Therefore, rest assured that AIIah will suffice to defend you against them: He hears everything and knows every thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they have faith in all that you believe, they will have the right guidance, but if they turn away, it would be for no reason other than their own malice. God is a Sufficient defender for you against them; He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they believe in the same way you have believed, they have attained guidance; and if they turn away, they are clearly being stubborn; so Allah will soon suffice you (O dear Prophet Mohammed – peace and blessings be upon him) against them; and He only is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe in the like of that which you believe then they are rightly guided; but if they turn away, then they are only in opposition. So Allah will suffice for you against them. And He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If then they believe as you believe in Him, they are indeed on the right course, and if they turn back, then they are only in great opposition, so Allah will suffice you against them, and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they believe in the like of that you believe in, then they are truly guided; but if they turn away, then they are clearly in schism; God will suffice you for them; He is the All-hearing, the All-knowing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they believe in the like of that which ye believe, then are they rightly guided. But if they turn away, then are they in schism, and Allah will suffice thee (for defence) against them. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they believe as you have believed, then are they rightly guided; but if they turn back, then know that they are entrenched in hostility. God will surely suffice to defend you against them, for He is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe in the like of that which ye believe in, surely they are guided; but if they turn away, then they are but in Cleavage. So Allah will suffice thee against them and He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe in the like of what you believe in, then they are surely guided; but if they turn away, then [know that] they are only [steeped] in defiance. Allah will suffice you against them, and He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe as ye believe, they are indeed on the right path; but if they turn back, it is they who are in schism; but Allah will suffice thee as against them, and He is the All-Hearing, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe in the like of that which you believe, then they are rightly guided, but if they turn away, then they are only in opposition. So Allah will suffice you against them. And He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they believe as you have believed they shall be guided; if they reject it, they shall surely be in clear dissension. Allah will suffice you. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they believe in the same as you have believed in, then they have been guided. But if they turn away, then they are in schism. God will protect you against them; for He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they believe in the same as you believe in, then they have been [rightly] guided; but if they turn away, they are only in dissension, and Allah will be sufficient for you against them. And He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:137] And if they, the Jews and the Christians, believe in the like (mithl, ‘the like’ is extra) of what you believe in, then they are truly guided; but if they turn away, from belief in it, then they are clearly in schism, in opposition to you; God will suffice you, O Muhammad (s), against them, and their schisms; He is the Hearer, of their sayings, the Knower, of their circumstances: God sufficed him [with regard to them] by killing Qurayza, expelling Nadīr and exacting the jizya from them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they) i.e. the people of the Book (believe in the like of that which you believe) in all the prophets and their Scriptures (then are they right guided) from error by following the religion of Muhammad and Abraham. (But if they turn away) refuse to believe in all the prophets and their Scriptures, (then are they in schism) in conflict with the true religion, (and Allah will suffice thee (for defence) against them) Allah will lift their burden from you, by killing and expelling them. (And He is the Hearer) of what they say, (the Knower) of their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَإِنَّمَا هُمْ فِي شِقَاقٍ } معناهُ فِي عَداوةٍ وَحربٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وقالوا كونوا هوداً أو نصارى } كلّ محجوب بدينه يزعم أنّ الحق دينه لا غير { قل بل ملّة إبراهيم } فإنّ الهدى المطلق هو التوحيد الذي يشمل كلّ دين، ويرفع كل حجاب كما ذكر بعده في قوله { قولوا آمنا بالله } إلى آخره { لا نفرّق بين أحد منهم } بنفي دين البعض وإبطال ملّته وإثبات الآخر وحقيته، بل نقول باجتماعهم على الحق واتفاقهم على التوحيد، ونقبل جميع أديانهم بالتوحيد الشامل لكلها { فإن آمنوا بمثل ما آمنتم به } من التوحيد الجامع من كل دين ومذهب { فقد اهتدوا } الاهتداء المطلق، أي: كل الاهتداء { وإن تولوا فإنما هم } في طرف من الدين وشقّ من الهداية يشاقونكم فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِنْ آمَنُواْ } بعدما سمعوا منكم هذه الأقوال { بِمِثْلِ مَآ آمَنْتُمْ بِهِ } بعد سماعكم طريق الإيمان من رسولكم { فَقَدِ ٱهْتَدَواْ } إلى طريق التوحيد كما اهتديتم { وَّإِن تَوَلَّوْاْ } أعرضوا عن أقوالكم لهم تذكيراً وعظة { فَإِنَّمَا هُمْ فِي شِقَاقٍ } أي: ما هم إلا في خلافهم وشقاقهم الأصلية وعداوتهم الجلية { فَسَيَكْفِيكَهُمُ ٱللَّهُ } المحيط بكم وبهم، المطلع على سرائرهم وضمائرهم مؤنة خلوفهم وشقاقهم { وَ } لا تشكو في كفايته؛ إذ هُوَ ٱلسَّمِيعُ { } لأقوالهم الكاذبة { ٱلْعَلِيمُ } [البقرة: 137] بكفرهم ونفاقهم الكامنة في قلوبهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الأسباط: الأحفاد، والسِّبطُ في بني إسرائيل بمنزلة القبيلة في ولد إسماعيل، والباء في { بمثل }: يحتمل أن تكون زائدة كقوله تعالى:\n\n[يونس: 27]، أو { مثل } مُقْحَم، أي: فإن آمنوا بما آمنتم به، كقوله تعالى:\n\n[الأحقاف: 10]",
      "translations": []
    }
  ]
}