{
  "chapter": "البقرة",
  "text": "قولوا۟ ءامنا بالله وما انزل الينا وما انزل الى ابرهم واسمعيل واسحق ويعقوب والاسباط وما اوتى موسى وعيسى وما اوتى النبيون من ربهم لا نفرق بين احد منهم ونحن له مسلمون",
  "translations": [
    {
      "translation": "Say: \"We believe in God and what has been sent down to us, and what had been revealed to Abraham and Ishmael and Isaac and Jacob and their progeny, and that which was given to Moses and Christ, and to all other prophets by the Lord. We make no distinction among them, and we submit to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Muslims, say to them, \"We believe in Allah and the Guidance which has been sent down to us and which was sent to Abraham, Ismail, Isaac and Jacob and his descendants and which was given by their Lord to Moses and Jesus and to all other Prophets. We do not discriminate against any of them and we have completely surrendered to Allah as Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muslims), say, \"We believe in God and what He has revealed to us and to Abraham, Ishmael, Isaac, and their descendants, and what was revealed to Moses, Jesus, and the Prophets from their Lord. We make no distinction among them and to God we have submitted ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “We believe in Allah and what is sent down to us and what was sent down to Ibrahim, and Ismael, and Ishaq, and Yaqub, and to their offspring, and what was bestowed upon Moosa and Eisa (Jesus), and what was bestowed upon other Prophets – from their Lord; we do not make any distinction, in belief, between any of them; and to Allah we have submitted ourselves.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muslims): \"We believe in Allah and that which has been sent down to us and that which has been sent down to Ibrahim (Abraham), Isma`il (Ishmael), Ishaq (Isaac), Ya`qub (Jacob), and to Al-Asbat (the offspring of the twelve sons of Ya`qub), and that which has been given to Musa (Moses) and `Isa (Jesus), and that which has been given to the Prophets from their Lord. We make no distinction between any of them, and to Him we have submitted (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: We believe in Allah and (in) that which had been revealed to us, and (in) that which was revealed to Ibrahim and Ismail and Ishaq and Yaqoub and the tribes, and (in) that which was given to Musa and Isa, and (in) that which was given to the prophets from their Lord, we do not make any distinction between any of them, and to Him do we submit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say you: 'We believe in God, and in that which has been sent down on us and sent down on Abraham, Ishmael, Isaac and Jacob, and the Tribes, and that which was given to Moses and Jesus and the Prophets, of their Lord; we make no division between any of them, and to Him we surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muslims): We believe in Allah and that which is revealed unto us and that which was revealed unto Abraham, and Ishmael, and Isaac, and Jacob, and the tribes, and that which Moses and Jesus received, and that which the prophets received from their Lord. We make no distinction between any of them, and unto Him we have surrendered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"We believe in God and what was revealed to us; and what was revealed to Abraham, Ishmael, Isaac, Jacob, and their descendants, and what was given to Moses and Jesus and what was given to the [other] prophets by their Lord. We make no distinction between any of them. It is to Him that we surrender ourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: we believe in Allah and that which hath been sent down unto us and that which was sent down unto Ibrahim and Ismai'l and Ishaq and Ya'qub and the tribes, and that which was vouchsafed unto Musa and lsa, and that which was vouchsafed unto the prophets from their Lord; we differentiate not between any of them, and unto Him are submissive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘We have faith in Allah and what has been sent down to us, and what was sent down to Abraham, Ishmael, Isaac, Jacob and the Tribes, and that which Moses and Jesus were given, and that which the prophets were given from their Lord; we make no distinction between any of them and to Him do we submit.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say ye: \"We believe in Allah, and the revelation given to us, and to Abraham, Isma'il, Isaac, Jacob, and the Tribes, and that given to Moses and Jesus, and that given to (all) prophets from their Lord: We make no difference between one and another of them: And we bow to Allah (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muslims), \"We believe in Allah and that which has been sent down to us and that which has been sent down to Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), Ya'qub (Jacob), and to Al-Asbat [the twelve sons of Ya'qub (Jacob)], and that which has been given to Musa (Moses) and 'Iesa (Jesus), and that which has been given to the Prophets from their Lord. We make no distinction between any of them, and to Him we have submitted (in Islam).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'We believe in Allah and that which is sent down to us, and in what was sent down to Abraham, Ishmael, Isaac, Jacob, and the tribes; to Moses and Jesus and the Prophets from their Lord. We do not differentiate between any of them, and to Him we are submissive (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “We believe in God; and in what was revealed to us; and in what was revealed to Abraham, and Ishmael, and Isaac, and Jacob, and the Patriarchs; and in what was given to Moses and Jesus; and in what was given to the prophets—from their Lord. We make no distinction between any of them, and to Him we surrender.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O believers], \"We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Descendants and what was given to Moses and Jesus and what was given to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [in submission] to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:136] Say: (this address is to the believers) ‘We believe in God, and in that which has been revealed to us, the Qur’ān, and revealed to Abraham, the ten scrolls, Ishmael, Isaac, Jacob, and the Tribes, his sons, and that which was given to Moses, the Torah, and Jesus, the Gospel, and the prophets, from their Lord, of Books and signs, we make no division between any of them, believing in some and disbelieving in others in the manner of Jews and Christians, and to Him we submit’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He taught the believers the path of divine Oneness so that the Jews and Christians had an indication of what this divine Oneness means, saying: (Say (0 Muslims): We believe in Allah and that which is revealed unto us) i.e. in Muhammad and the Qur'an (and that which was revealed unto Abraham) i.e. we believe in Abraham and his Scripture, (and Ishmael) and we believe in Ishmael and his Scripture, (and Isaac) and in Isaac and his Scripture, (and Jacob) and in Jacob and his Scripture, (and the tribes) and in the sons of Jacob and their Scriptures, (and that which Moses and Jesus received) i.e. we believe in Moses and the Torah and in Jesus and the Gospel, (and that which the Prophets received) we also believe in all the prophets and their Scriptures (from their Lord. We make no distinction between any of them) that Allah sent them as prophets to teach divine Oneness, (and unto Him we have surrendered) we acknowledge that we worship Him and declare that there is only one true God.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُولُوۤاْ } لهم في مقابلة قولهم أيها المؤمنون المتبعون لملة إبراهيم، إرشاداً لهم وإسماعاً إياهم طريق الحق: { آمَنَّا بِٱللَّهِ } الواحد المتجلي في الآفاق بالاستحقاق بأسمائه الحسنى وصفاته العليا { وَ } آمنا أيضاً { مَآ أُنْزِلَ إِلَيْنَا } بوسيلة رسولنا من الكتاب المبين لمصلحتنا، المتعلق بمبدئنا ومعادنا في زماننا { وَ } آمنا آيضاً { مَآ أُنزِلَ } إلى المتبوعين الماضين { إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَٱلأَسْبَاطِ } المورثين وديننا { وَ } كذلك آمنا { مَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ } من الكتب والآيات الدالة على توحيد الذات وتصديق من جاء به من عند ربه { وَ } الحاصل أنا آمنا بجميع { مَا أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمْ } لإهداء المضلين من عباده إلى توحيده { لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ } بالإيمان والإنكار، بل نؤمن بجميعهم ونصدقهم؛ لكونهم هادين إلى توحيد الله وإن تفاوتت طرقهم { وَنَحْنُ لَهُ } لتوحيد الله { مُسْلِمُونَ } [البقرة: 136] منقادون متوجهون؛ وإن بين بطرقٍ متعددةٍ وكتبٍ مختلفةٍ بحسب الأعصار والأزمان المتوهمة من تجليات الذات بالأسماء والصفات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}