{
  "chapter": "البقرة",
  "text": "صبغة الله ومن احسن من الله صبغة ونحن له عبدون",
  "translations": [
    {
      "translation": "We have taken the colouring of God; and whose shade is better than God's? Him alone we worship.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Take Allah's colour, and who can give a better colour than Allah? Therefore, we worship and submit to Him alone. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Belief in God and following the guidance of Islam are God's means of purification for us. Islam is the baptism of God. No one is a better baptizer than He and we Muslims worship Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We have taken the colour (religion) of Allah; and whose colour (religion) is better than that of Allah? And only Him do we worship.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Our Sibghah (religion) is] the Sibghah of Allah (Islam) and which Sibghah can be better than Allah's And we are His worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Receive) the baptism of Allah, and who is better than Allah in baptising? and Him do we serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the baptism of God; and who is there that baptizes fairer than God? Him we are serving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We take our) colour from Allah, and who is better than Allah at colouring. We are His worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We take on God's own dye. Who has a better dye than God's? We worship Him alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ours is the dye of Allah! and who is better at dyeing than Allah! And we are His worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘The baptism of Allah, and who baptizes better than Allah? And Him do we worship.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Our religion is) the Baptism of Allah: And who can baptize better than Allah? And it is He Whom we worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Our Sibghah (religion) is] the Sibghah (Religion) of Allah (Islam) and which Sibghah (religion) can be better than Allah's? And we are His worshippers. [Tafsir Ibn Kathir.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (indelible) marking of Allah. And who marks better than Allah! And for Him we are worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God’s coloring. And who gives better coloring than God? “And we are devoted to Him.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And say, \"Ours is] the religion of Allah. And who is better than Allah in [ordaining] religion? And we are worshippers of Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:138] The mark of God (sibghata’Llāhi: a verbal noun reaffirming the earlier āmannā, and it is in the accusative, because of the verbal construction implied, that is to say, sabaghanā’Llāhu, ‘God has marked us’): this denotes His religion, the one towards which He made human beings naturally inclined, as it leaves its mark on a person, in the same way that a dye leaves its mark on a garment; and who has, that is, none [has], a better mark (sibghatan, ‘marking’, is for specification) than God? And Him we worship: the Jews said to the Muslims, ‘We are the people of the first Book and our direction of prayer (qibla) is more ancient, and prophets were never sent from among the Arabs; if Muhammad were a prophet, he would have been one of us’. Thus, the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((We take our) colour from Allah) i.e. follow the Religion of Allah, (and who is better than Allah at colouring) better than the Religion of Allah. (And We are His worshippers) say: we are monotheists and acknowledge that we worship Him and declare that there is only one true God.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { صِبْغَةَ ٱللَّهِ } معناهُ دينُ الله\n\n\n\n\nوقولهُ تعالى:\n\n[الروم: 30] معناهُ ابْتِداءُ خَلْقِهمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { صبغة الله } أي: آمنا بالله وصبغنا الله صبغة، فإن كل ذي اعتقاد ومذهب باطنه مصبوغ بصبغ اعتقاده ودينه ومذهبه\n فالمتعبدون بالملل المتفرّقة مصبوغون بصبغ نيتهم، والمتمذهبون بصبغ إمامهم وقائدهم، والحكماء بصبغ عقولهم، وأهل الأهواء والبدع المتفرّقة بصبغ أهوائهم ونفوسهم، والموحدون بصبغة الله خاصة التي لا صبغ أحسن منها ولا صبغ بعدها\n كما قال رسول الله صلى الله عليه وسلم:\n\n \" إن الله تعالى خلق الخلق في ظلمة ثم رشّ عليهم من نوره، فمن أصاب من ذلك النور اهتدى، ومن أخطأ ضلّ \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قولوا لهم بعدما أظهروا الخلاف والشقاق: ما جئتنا به عن التوحيد الحاصل من متابعة الملة الحنيفية { صِبْغَةَ ٱللَّهِ } المحيط بنا، صبغ بها قلوبنا؛ لنتهدي إلى صفاء تجريده وزلال تفريده { وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ صِبْغَةً } حتى نتبعه؛ إلا ذ وجود لغيره { وَ } إذ لم يكن للغير وجود { نَحْنُ لَهُ } لا لغيره { عَابِدونَ } [البقرة: 138] عائدون راجعون رجوع الظل إلى ذي ظل، والصور المرئية في المرآة إلى الرائي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والشقاق: المخالفة، كأن كل واحد من المتخالفين في شق غير شق الآخر، و { صبغة الله }: مصدر مؤكد لآمنا لأن الإيمان ينصبغ في القلوب، ويظهر أثره على الجوارح ظهور الصبغ على المصبوغ، ويتداخل في قلوبهم تداخل الصبغ للثوب\n أي: آمنا وصبغنا الله به صبغة\n وهي فطرة الله التي فطر الناس عليها، وعبَّر عنها بالصبغ للمشاكلة فإن النصارى كانوا يغمسون أولادهم في ماء أصفر يسمونه المعمودية، ويقولون: هو تطهير لهم، وبه تحق نصرانيتهم، فردَّ الله تعالى عليهم بأن صبغة، الله أحسن من صبغتهم وقيل: نصب على البدل من { ملة إبراهيم } ، أو على الإغراء، أي: الزموا صبغة الله\n يقول الحق جلّ جلاله: { قولوا } يا معشر المسلمين في تحقيق إيمانكم: { آمنا بالله } أي: صدقنا بوجوده متصفاً بصفة الكمال، منزّهاً عن النقائص، { و } بما { أُنزل إلينا } وهو القرآن، { و } بما { أُنزل } من الصحف { إلى إبراهيم وإسماعيل وإسحاق ويعقوب } ولد إسحاق، { والأسباط } أولاد يعقوب عليه السلام وهم: روبيل وشمعون ولاوى ويهوذا وربالون ويشحُرْ، ودنية بنته، وأمهم لَيَا، ثم خلف على أختها راحيل، فولدت له يوسف وبنيامين، وَوُلد له من سرِّيَّتينِ: دان ونفتالى وجاد وآشر\n قال ابن حجر: اختلف في نبوتهم، فقيل: كانوا أنبياء، وقيل: لم يكن فيهم نبيّ، وإنما المراد بأسباط قبائل من بني إسرائيل، فقد كان فيهم من الأنبياء عدد كثير\n هـ\n وممن صرّح بنفي نبوتهم عياض وجمهور المفسرين\n انظر: المحشي الفاسي\n وقولوا: آمنا بما أنزل إلى { موسى } وهو التوراة، { وعيسى } وهو الإنجيل، وبما { أوتي النبيون } كلهم { من ربهم } من عرفنا منهم ومن لم نعرف، { لا نفرق بين أحد } واحد { منهم } كما فرقت اليهود والنصارى، فقد آمنا بالله وبجميع أنبيائه { ونحن له مسلمون } أي: منقادون لأحكامه الظاهرة والباطنة\n يقول الحقّ جلّ جلاله: { فإن آمنوا } أي: أهل الكتاب إيماناً مثل إيمانكم، { فقد اهتدوا } إلى الحق والصواب، وإن أعرضوا عن ذلك فاتركهم حتى نأمرك فيهم، { فإنما هم في شقاق } وخلاف لك، فلا تهتم بشأنهم، { فسيكفيكهم الله } أي سيكفيك شرهم وينصرك عليهم، { وهو السميع } لدعائكم، { العليم } بإخلاصكم، فالزموا { صبغة الله } التي صُبغتم بها، هي الإيمان بما ذكرت لكم فإنه لا أحسن صبغة من صبغة الله، { و } قولوا: { نحن له عابدون }\n الإشارة: كما أوجب الله تعالى الإيمان بجميع الرسل في طريق العموم، كذلك أوجب الله التصديق بكل من ثبتت ولايته في طريق الخصوص، فمن فرق بينهم فقد كفر بطريقهم، ومن كفر بطريقهم طُرد عن بابهم، ومن طرد عن بابهم طرد عن باب الله، لأن إسقاطه من الولاية إيذاء له، ومن آذى ولياً فقد آذن الله بالحرب، فالواجب، على مَن أراد أن يرد مناهلهم، أن يصدق بجميعهم، ويعظم من انتسب إليهم، حتى تتصبغ في قلبه حلاوة الإيمان، وتشرق عليه شموس العرفان، فمن فعل هذا فقد اهتدى إلى الحق والصواب، واستحق الدخول مع الأحباب، ومن أعرض عن هذا فإنما هو في شقاق، وربما يخاف عليه من شؤم الكفر والنفاق، فسيكفي الله أولياءه سوءَ شره، والله غالب على أمره\n\n\nقال القشيري: فللقلوب صبغة، وللأرواح صبغة، وللسرائر صبغة، وللظواهر صبغة، فصبغة الأشباح والظواهر بآثار التوفيق، وصبغة الأرواح والسرائر بأنوار التحقيق\n هـ\n وقال الورتجبي: صبغة الله: صفته الخاصة التي خلق آدم عليها، وأورثت ذلك في أرواح ذريته من الأنبياء والأولياء\n ثم قال: وسقاها من شراب الزلفة، وألهمها خصائص علوم الربوبية، فاستنارت بنور المعرفة، وخاضت في بحر الربوبية، وخرجت منها تجليات أسرار الوحدانية، وتكوّنت بصبغ الصفات\n هـ\n وبالله التوفيق\n\n",
      "translations": []
    }
  ]
}