{
  "chapter": "البقرة",
  "text": "ووصى بها ابرهم بنيه ويعقوب يبنى ان الله اصطفى لكم الدين فلا تموتن الا وانتم مسلمون",
  "translations": [
    {
      "translation": "And Abraham left this legacy to his sons, and to Jacob, and said: \"O my sons, God has chosen this as the faith for you. Do not die but as those who have submitted (to God).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also enjoined on his children to follow the same way. Jacob also did the same and his last will to his sons was, \"O my children, Allah has chosen the same way of life for you. Hence remain Muslims up to your last breath.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham left this legacy to his sons and, in turn, so did Jacob saying, \"God has chosen this religion for you. You must not leave this world unless you are a Muslim (submitted to the will of the Lord of the Universe).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim willed the same religion upon his sons, and also did Yaqub (Jacob); (saying), “O my sons – indeed Allah has chosen this religion for you; therefore do not die except as Muslims (those who submit to Him).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (submission to Allah, Islam) was enjoined by Ibrahim (Abraham) upon his sons and by Ya`qub (Jacob) (saying), \"O my sons! Allah has chosen for you the (true) religion, then die not except as Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the same did Ibrahim enjoin on his sons and (so did) Yaqoub. O my sons! surely Allah has chosen for you (this) faith, therefore die not unless you are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham charged his sons with this and Jacob likewise: 'My sons, God has chosen for you the religion; see that you die not save in surrender.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The same did Abraham enjoin upon his sons, and also Jacob, (saying): O my sons! Lo! Allah hath chosen for you the (true) religion; therefore die not save as men who have surrendered (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Abraham enjoined his sons to do the same, as did Jacob, \"My sons, God has chosen this religion for you; so do not let death overtake you, except when you are in a state of submission.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Ibrahim enjoined his sons the same and did Ya'qub also, saying: O my sons! verily Allah hath chosen for you the religion, so die not except ye be Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham enjoined this [creed] upon his children, and [so did] Jacob, [saying], ‘My children! Allah has indeed chosen this religion for you; so do not die except as those who have surrendered themselves [to Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this was the legacy that Abraham left to his sons, and so did Jacob; \"Oh my sons! Allah hath chosen the Faith for you; then die not except in the Faith of Islam.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (submission to Allah, Islam) was enjoined by Ibrahim (Abraham) upon his sons and by Ya'qub (Jacob), (saying), \"O my sons! Allah has chosen for you the (true) religion, then die not except in the Faith of Islam (as Muslims - Islamic Monotheism).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham charged his children with this, and so did Jacob, saying: 'My sons, Allah has chosen for you the religion. Do not die except being submissive (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham exhorted his sons, and Jacob, “O my sons, God has chosen this religion for you, so do not die unless you have submitted.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Abraham instructed his sons [to do the same] and [so did] Jacob, [saying], \"O my sons, indeed Allah has chosen for you this religion, so do not die except while you are Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:132] And Abraham enjoined (wassā; may also be read awsā) upon his sons this, creed, and [so did] Jacob, upon his sons, saying: ‘My sons, God has chosen for you the [true] religion, the religion of submission [to God] (islām), see that you die not save in submission: he forbade them from abandoning this submission [to God], and enjoined them to adhere firmly to it until death overtook them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The same did Abraham enjoin) enjoined that there is no god except Allah (upon his sons) when he was dying, (and also Jacob) he also enjoined his children with the same: (0 my sons! Lo! Allah hath chosen for you the (true) religion) the Religion of Islam; (therefore die not save as men who have surrendered) hold fast to Islam until you die as Muslims, sincere to Him in your worship and in your declaration of divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱللَّهَ ٱصْطَفَىٰ لَكُمُ ٱلدِّينَ } معناهُ أَخلَصَهُ لَكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: سفه نفساً على التمييز أو في نفسه على انتزاع الخافض { ولقد اصطفيناه } أي: من كان من المحبوبين المرادين بالسابقة الأزلية فاخترناه حالة الفناء في التوحيد { وهو في الآخرة } أي: حالة البقاء بعد الفناء من أهل الاستقامة الصالحين لتدبير النظام وتكميل النوع { إذ قال له ربه أسلم } أي: وحد وأسلم ذاتك إلى الله، يعني: جعله في الأزل من أهل الصف الأول مسلماً موحداً مذعناً لربّ العالمين، فانياً فيه { ووصى بها } أي: بكلمة التوحيد { إبراهيم بنيه ويعقوب } بنيه تأسياً { يا بنيّ إن الله اصطفى لكم الدين } أي: دينه الذي يدين به الموحد، لا دين له غيره، ولا ذات، فدينه دين الله وذاته ذات الله { فلا تموتنّ } إلا على هذا الدين، أي: لا تموتنّ بالموت الطبيعي موت الجهل، بل كونوا ميتين بأنفسكم، أحياء بالله أبداً، فيدرككم موت البدن على هذه الحالة\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَوَصَّىٰ بِهَآ } أي: بالتوحيد الذاتي { إِبْرَاهِيمُ بَنِيهِ } إرشاداً إلى طريق الحق ووصى أيضاً بنوه بنيه { وَ } وصى أيضاً { يَعْقُوبُ } بنيه بما وصى أبوه وجده، وقالوا: { يَابَنِيَّ إِنَّ ٱللَّهَ ٱصْطَفَىٰ لَكُمُ ٱلدِّينَ } دين الإسلام المشتمل، على توحيد الذات والصفات والأفعال { فَلاَ تَمُوتُنَّ } فلا تكونن في حال من الأحوال عند الموت { إِلاَّ وَأَنْتُم مُّسْلِمُونَ } [البقرة: 132] موحدون بالتوحيد الذاتي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وضمير { بها } يعود على كلمة { أسلمت } ، أو الملة، و { يعقوب } معطوف على { إبراهيم } ، و { بني } محكي بحال محذوفة، أي: قائلين يا بني، أو مبتدأ، والخبر محذوف، أي: قال يا بني\n\n\n الخ، فيوقف على { بينه }\n يقول الحقّ جلّ جلاله: { ومَن } هذا الذي { يرغب عن ملة إبراهيم } الواضحة { إلا } من جهل قدر { نفسه } وبسخها حقها؟ أو إلا من خف رأيه وسفهت نفسه؟ وكيف يرغب عاقل عنها وقد اخترناه أماماً { في الدنيا } يقتدي به أهل الظاهر والباطن؟ { وإنه في الآخرة لمن الصالحين } لحضرتنا، والساكنين في جوارنا\n وإنما اخترناه لذلك لأنه حين { قال له ربه }: استسلم لحكمنا، وانقد لأمرنا، قال سريعاً: { أسلمت } وجهي { لرب العالمين } ، وانقدْتُ بكُلّيتي إليه\n { ووصى } بهذه الكلمة أو الملة { إبراهيم } ، عند موته، { بنيه } ، وكانوا أربعة: إسماعيل وإسحاق ومدين ومدان\n وكذلك حفيده { يعقوب } أوصى بهذه الكلمة بنيه\n وكانوا اثني عشر، على ما يأتي في الأسباط، قائلين في تلك الوصية: { يا بني إن الله } اختار لكم { الدين } الحنيف الواضح المنيف، فتمسكوا به ما عِشْتُّم ولا تموتُن { إلا وأنتم مسلمون } متمسكون به\n الإشارة: ملة أبينا إبراهيم عليه السلام هي رفع الهمة عن الخلق، وإفراد الوجهة للملك الحق، ورفض الوسائط والأسباب، والتعلق بربّ الأرباب، وفي ذلك يقول الشاعر، وهو الششتري:\n",
      "translations": []
    }
  ]
}