{
  "chapter": "البقرة",
  "text": "اذ قال له ربه اسلم قال اسلمت لرب العلمين",
  "translations": [
    {
      "translation": "(For) when his Lord said to him: \"Obey,\" he replied: \"I submit to the Lord of all the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, \"Surrender,\" he promptly responded, \"I have surrendered to the Lord of the Universe (and become a Muslim).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God commanded Abraham to submit, he replied, \"I have submitted myself to the Will of the Lord of the universe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, “Submit”, he said, “I have submitted to the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, \"Submit (i.e. be a Muslim)!\" He said, \"I have submitted myself (as a Muslim) to the Lord of the `Alamin (mankind, Jinn and all that exists).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, Be a Muslim, he said: I submit myself to the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, 'Surrender,' he said, 'I have surrendered me to the Lord of all Being.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said unto him: Surrender! he said: I have surrendered to the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, \"Surrender!\" he responded, \"I have surrendered to the Lord of the Universe,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time his Lord said unto him: submit, he said: I submit to the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, ‘Submit,’ he said, ‘I submit to the Lord of all the worlds.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! his Lord said to him: \"Bow (thy will to Me):\" He said: \"I bow (my will) to the Lord and Cherisher of the Universe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, \"Submit (i.e. be a Muslim)!\" He said, \"I have submitted myself (as a Muslim) to the Lord of the 'Alamin (mankind, jinns and all that exists).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him: 'Submit' he answered: 'I have submitted to the Lord of the Worlds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, “Submit!” He said, “I have submitted to the Lord of the Worlds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his Lord said to him, \"Submit\", he said \"I have submitted [in Islam] to the Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:131] And mention: When his Lord said to him, ‘Submit’, obey God and devote your religion purely to Him, he said, ‘I have submitted to the Lord of the Worlds’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When his Lord said unto him) when he came out of the pit of fire: (Surrender) say specifically: there is no god save Allah! (He said: I have surrendered to the Lord of the Worlds) I submit to the Lord of all the worlds, and declare that Allah is the only One God, without partner. It is also said that when Abraham invited his people to accept that Allah is One without partners, his Lord said unto him: make your Religion and works sincere to Allah; and he answered: I make my Religion and works sincere to the Lord of the worlds. And it is also said that when Abraham was thrown in the Fire, his Lord said unto him: make your religion and works sincere to Allah; he replied: I comply and make my Religion and works sincere to Allah, Lord of all the worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواذكر يا أكمل الرسل { إِذْ قَالَ لَهُ رَبُّهُ } اختباراً له { أَسْلِمْ } توجه إلي بمقتضى علمك وكشفك مني { قَالَ } على مقتضى علمه بربه { أَسْلَمْتُ لِرَبِّ ٱلْعَالَمِينَ } [البقرة: 131] إذ كشف له ربه عن ذرائر الكائنات لذلك لم يخصصه ولم يقيده بمظهر دون مظهر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}