{
  "chapter": "البقرة",
  "text": "ومن حيث خرجت فول وجهك شطر المسجد الحرام وانه للحق من ربك وما الله بغفل عما تعملون",
  "translations": [
    {
      "translation": "Wherever you come from turn towards the Holy Mosque: This in truth is from your Lord. God is not negligent of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At whatever place you may be, turn your face towards Masjid Haram (at Prayer time) for this is, in fact, a Commandment of your Lord, and Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), wherever you go, turn your face towards the Sacred Mosque (in Mecca). This is the truth from your Lord who is not unaware of what you do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherever you come from, turn your face towards the Sacred Mosque; and indeed it is the truth from your Lord; and Allah is not unaware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from wheresoever you start forth (for prayers), turn your face in the direction of Al-Masjid Al-Haram (at Makkah), that is indeed the truth from your Lord. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from whatsoever place you come forth, turn your face towards the Sacred Mosque; and surely it is the very truth from your Lord, and Allah is not at all heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From whatsoever place thou issuest, turn thy face towards the Holy Mosque; it is the truth from thy Lord. God is not heedless of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whencesoever thou comest forth (for prayer, O Muhammad) turn thy face toward the Inviolable Place of Worship. Lo! it is the Truth from thy Lord. Allah is not unaware of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you set out from, turn your face in the direction of the Sacred Mosque -- this is the truth from your Lord: He is not unaware of what you do --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from whencesoever thou goest forth, turn thy face toward the Sacred Mosque, and verily it is the very truth from thy Lord; and Allah is not neglectful of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whencesoever you may go out, turn your face towards the Holy Mosque. Indeed it is the truth from your Lord, and Allah is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From whencesoever Thou startest forth, turn Thy face in the direction of the sacred Mosque; that is indeed the truth from the Lord. And Allah is not unmindful of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from wheresoever you start forth (for prayers), turn your face in the direction of Al-Masjid-al-Haram (at Makkah), that is indeed the truth from your Lord. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From wherever you emerge, turn your face towards the Sacred Mosque. This is surely the truth from your Lord. Allah is never inattentive of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wherever you come from, turn your face towards the Sacred Mosque. This is the truth from your Lord, and God is not heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So from wherever you go out [for prayer, O Muhammad] turn your face toward al- Masjid al-Haram, and indeed, it is the truth from your Lord. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:149] From whatever place you issue, on a journey, turn your face towards the Sacred Mosque; it is the truth from your Lord. God is not heedless of what you do (ta‘malūna, ‘you do’, may also be read as ya‘malūna, ‘they do’, as already appears above [sc. 2:144]; its repetition is intended to point out that the stipulation applies equally to being on a journey or otherwise).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whencesoever you comest forth (for prayer, Muhammad) turn thy face) in prayer (towards the Inviolable Place of Worship; Lo! It) the Inviolable Place of Worship (is the Truth from your Lord) it is the Qiblah of Abraham, Allah bless him. (And Allah is not unaware) heedless (of what ye do) of what you conceal about the Qiblah of Abraham and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْ حَيْثُ خَرَجْتَ } يا أكمل الرسل من مقتضى كعبة الذات يغلبه حكم بعض الصفات { فَوَلِّ وَجْهَكَ } منها متذكراً { شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ } المحرم للتوجيه إلى السوى والغير { وَإِنَّهُ } أي: شأن التوجه نحوه { لَلْحَقُّ } الثابت النالز { مِن رَّبِّكَ } الذي رباك بمقتضى جميع أوصافه وأسمائه { وَ } اعلم أنه { مَا ٱللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ } [البقرة: 149] أنت ومن تبعك، وعلى مقتضى علمه تثابون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإذاعلمت أن لكل قوم جهة يستقبلونها، فمن { حيث خرجت } وفي أي مكان حللت { فولّ وجهك شكر المسجد الحرام } ، والله { إنه للحق من ربك } فبادر إلى امثاله، { وما الله بغافل عما تعملون } من خير أو شر، فيجازي كل واحد على ما أسلف",
      "translations": []
    }
  ]
}