{
  "chapter": "البقرة",
  "text": "الحق من ربك فلا تكونن من الممترين",
  "translations": [
    {
      "translation": "The truth is from your Lord, so be not among those who are sceptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is in fact a Commandment from your Lord; so you should not have any doubt concerning this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never doubt that the essence of truth comes from your Lord\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Truth from your Lord, therefore (O those who listen) beware – do not be in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is) the truth from your Lord. So be you not one of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, therefore you should not be of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth comes from thy Lord; then be not among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the Truth from thy Lord (O Muhammad), so be not thou of those who waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truth is what comes from your Lord; therefore, do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from thy Lord; be then thou not of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the truth from your Lord; so do not be among the skeptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Truth is from thy Lord; so be not at all in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is) the truth from your Lord. So be you not one of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth comes from your Lord so do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, so do not be a skeptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth is from your Lord, so never be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:147] The truth comes from your Lord; then be not among the doubters, who doubt it, that is to say, ‘[be not] of such a disposition’, which is more eloquent than merely saying, ‘do not waver’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is the Truth from thy Lord (0 Muhammad)) that you are a Prophet sent by Allah. (So be not thou of those who waver) who doubt whether they know or not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَقُّ } الذي هو ظهورك واستيلاؤك عليهم، ونسخك أديانهم وأحكام كتبهم إنما هو ناشئ { مِن رَّبِّكَ } الذي أظهرك مظهراً كاملاً لذاته { فَلاَ تَكُونَنَّ } أنت ومن تبعك { مِنَ ٱلْمُمْتَرِينَ } [البقرة: 147] الشاكين في توحيد الذات كما كانوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n هذا الذي أنت عليه يا محمد هو { الحق من رَبِّك فلا تكونن من الممترين } أي: من الشاكين في أنه الحق، أو في كتمانهم الحق عالمين به\n والخطاب مصروف للسامعين لا للنبيّ صلى الله عليه وسلم لأنه غير متوقع منه، وإنما المراد تحقيق الأمر، وإنه بحيث لا يشك فيه ناظر، أو أمر الأمة باكتساب المعارف المزيحة للشك على الوجه الأبلغ قاله البيضاوي\n\n\nالإشارة: مما جرت به سُنة الله تعالى في خلقه أن أهل الحقيقة منكورون عند أهل الشريعة، أو تقول: علماء الباطن منكورون عند علماء الظاهر، يقابلونهم بالإذاية والإنكار، مع أنه يعلمون أن الحقيقة حق من ربهم، وأن علم الباطن حق لقوله - عليه الصلاة والسلام -:\n\n \" إن من العلم كهيئة المكنون، لا يعلمه إلا العلماء بالله، فإذا سمعه أهل الغرة بالله أنكروه عليهم \" \n\nأو كما قال - عليه الصلاة والسلام-، وقال صلى الله عليه وسلم:\n\n \" لِكلِّ آيةٍ ظَاهرٌ وبَاطِنٌ وحَدٍّ ومَطْلَع \"\n \n\n{ وما الله بغافل عما يعلمون } فجزاؤهم الحرمان عن لذة الشهود والعيان، فيقال لأهل الباطل: ولئن أتيتهم بكل آية وبرهان ما تبعوا وجهتك التي توجهت إليها لأنها مَنُوطة بموت النفوس وحط الرؤوس ودفع الفلوس، وخرق العوائد لاكتساب الفوائد، ومفارقة الأوطان والغيبة عن الأهل والولدان، وما أنت أيها المريد بتابع وجهتهم التي توجهوا إليها، ولئن اتبعت أهواءهم من بعدما ظهر لك من علم التحقيق: إنك إذاً لمن الظالمين لنفوسهم\n الذين آتيناهم الكتاب من علماء الشريعة يعرفون علم الحقيقة، كما يعرفون أبناءهم، أي: يقرون به في الجملة وينكرون وجود أهله مخصوصين، وقد يتحققون به ويكتمون الحق حسداً، وهم يعلمون وجود خصوصيته، فيقال للعارف: هذا الذي أنت عليه من سلوك جادة الطريقة، وعلم التحقيق، هو الحق من ربك فلا تكونن من الممترين أنك على الحق المبين\n\n",
      "translations": []
    }
  ]
}