{
  "chapter": "البقرة",
  "text": "قد نرى تقلب وجهك فى السماء فلنولينك قبلة ترضىها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا۟ وجوهكم شطره وان الذين اوتوا۟ الكتب ليعلمون انه الحق من ربهم وما الله بغفل عما يعملون",
  "translations": [
    {
      "translation": "We have seen you turn your face to the heavens. We shall turn you to a Qiblah that will please you. So turn towards the Holy Mosque, and turn towards it wherever you be. And those who are recipients of the Book surely know that this is the truth from their Lord; and God is not negligent of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have seen you (O Muhammad), turning your face over and over again towards Heaven. Now, therefore, We turn you towards the giblah that you like best: so turn your face towards the Masjid Haram. Henceforth, wheresoever you may be, turn your face at prayer towards it. The people who were given the Book know it well that the commandment (about the change of giblah) is in fact from their Lord, and is based on the Truth, but Allah is not unaware of what they are doing (in spite of this)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly saw you (Muhammad) often turn your face to the sky, so We shall instruct you to face a qibla that you will like. (Muhammad) during prayer, turn your face towards the Sacred Mosque (in Makkah). Muslims, also, wherever you are, during your prayers, turn your faces towards the Sacred Mosque. The People of the Book certainly know that this command (to change the qibla) is truly from their Lord. God is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We observe you turning your face, several times towards heaven (O dear Prophet Mohammed – peace and blessings be upon him); so We will definitely make you turn (for prayer) towards a qiblah which pleases you; therefore now turn your face towards the Sacred Mosque (in Mecca); and O Muslims, wherever you may be, turn your faces (for prayer) towards it only; and those who have received the Book surely know that this is the truth from their Lord; and Allah is not unaware of their deeds. (Allah seeks to please the Holy Prophet – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have seen the turning of your (Muhammad's) face towards the heaven. Surely, We shall turn you to a Qiblah (prayer direction) that shall please you, so turn your face in the direction of Al-Masjid Al-Haram (at Makkah). And wheresoever you people are, turn your faces (in prayer) in that direction. Certainly, the people who were given the Scripture (i.e., Jews and Christians) know well that, that (your turning towards the direction of the Ka`bah at Makkah in prayers) is the truth from their Lord. And Allah is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We see the turning of your face to heaven, so We shall surely turn you to a qiblah which you shall like; turn then your face towards the Sacred Mosque, and wherever you are, turn your face towards it, and those who have been given the Book most surely know that it is the truth from their Lord; and Allah is not at all heedless of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have seen thee turning thy face about in the heaven; now We will surely turn thee to a direction that shall satisfy thee. Turn thy face towards the Holy Mosque; and wherever you are, turn your faces towards it. Those who have been given the Book know it is the truth from their Lord; God is not heedless of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have seen the turning of thy face to heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wheresoever ye may be, turn your faces (when ye pray) toward it. Lo! Those who have received the Scripture know that (this revelation) is the Truth from their Lord. And Allah is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have frequently seen you turn your face towards heaven. So We will make you turn in a direction for prayer that will please you. So turn your face now towards the Sacred Mosque: and wherever you may be, turn your faces towards it. Those who were given the Book know this to be the truth from their Lord. God is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Oft We have seen the turning of thy face to the heaven, wherefore We shall assuredly cause thee to turn towards the Qiblah which shall please thee. Turn then thy face toward the Sacred Mosque; and turn ye, wheresoever ye be, your faces toward it. And verily those who are vouchsafed the Book know this to be the truth and from their Lord. Allah is not neglectful of that which they Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly see you turning your face about in the sky. We will surely turn you to a qiblah of your liking: so turn your face towards the Holy Mosque, and wherever you may be, turn your faces towards it! Indeed those who were given the Book surely know that it is the truth from their Lord. And Allah is not oblivious of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We see the turning of thy face (for guidance to the heavens: now Shall We turn thee to a Qibla that shall please thee. Turn then Thy face in the direction of the sacred Mosque: Wherever ye are, turn your faces in that direction. The people of the Book know well that that is the truth from their Lord. Nor is Allah unmindful of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! We have seen the turning of your (Muhammad's SAW) face towards the heaven. Surely, We shall turn you to a Qiblah (prayer direction) that shall please you, so turn your face in the direction of Al-Masjid- al-Haram (at Makkah). And wheresoever you people are, turn your faces (in prayer) in that direction. Certainly, the people who were given the Scriptures (i.e. Jews and the Christians) know well that, that (your turning towards the direction of the Ka'bah at Makkah in prayers) is the truth from their Lord. And Allah is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have seen you turning your face towards the heaven, We shall surely turn you to a direction that shall satisfy you. So turn your face towards the Sacred Mosque (built by Abraham); wherever you are, turn your faces to it' Those to whom the Book was given know this to be the truth from their Lord. Allah is not inattentive of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have seen your face turned towards the heaven. So We will turn you towards a direction that will satisfy you. So turn your face towards the Sacred Mosque. And wherever you may be, turn your faces towards it. Those who were given the Book know that it is the Truth from their Lord; and God is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly seen the turning of your face, [O Muhammad], toward the heaven, and We will surely turn you to a qiblah with which you will be pleased. So turn your face toward al-Masjid al-Haram. And wherever you [believers] are, turn your faces toward it [in prayer]. Indeed, those who have been given the Scripture well know that it is the truth from their Lord. And Allah is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:144]   We have indeed (qad, ‘indeed’, is for affirmation) seen you turning your face about in the, direction of the, heaven, looking around for the Revelation and longing for the command to face the Ka‘ba: he [the Prophet] wished for this because it was the prayer-direction of Abraham and would be more conducive to the submission of the Arabs [to Islam]; now We will surely turn you to a direction that shall satisfy you, that you will love. Turn your face, in prayer, towards the Sacred Mosque, that is, the Ka‘ba, and wherever you are (addressing the [Muslim] community) turn your faces, in prayer, towards it. Those who have been given the Scripture know that it, the change towards the Ka‘ba, is the, fixed, truth from their Lord, on account of the description in their Scripture of how the Prophet (s) would re-orient himself to it; God is not heedless of what you do, O believers, when you obey His command (alternatively, ta‘malūna, ‘you do’, can be read ya‘malūna, ‘they do’, in other words [it would be referring to] the Jews’ denial of the matter concerning the direction of prayer).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the supplication of His Prophet regarding the changing of the Qiblah towards Mecca, saying: (We have seen the turning of thy face to heaven (for guidance, Muhammad)) turning your sight to heaven in anticipation of Gabriel coming down to announce the change of the Qiblah. (And now surely We shall make thee turn (in prayer) toward a Qiblah that is dear to thee) that you like, namely, the Qiblah of Abraham. (So turn thy face) when in prayer (towards the Inviolable Place of Worship, and ye (0 Muslims), wheresoever ye may be) whether on land or in the sea, (turn your faces (when ye pray)) in prayer (towards it. (Lo! Those who have received the Scripture know that) the Sacred Precinct (is the Truth from their Lord) is the Qiblah of Abraham but they conceal this fact. (And Allah is not unaware) heedless (of what they do) of what they conceal.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ } قَالَ زيدُ بن علي عليهما السلامُ [مَعناهُ] نَحوُهُ وتِلقاؤُهُ، هو بِلُغةِ أَهلِ يَثْربِ والشَطْرُ أَيضاً: النِصفُ والجمعُ أَشْطَارٌ، وشُطُورٌ وهي لُغةُ بني تَغلبٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قد نرى تقلب وجهك } في جهة سماء الروح في مقام الجمع عند الاستغراق في الوحدة والاحتجاب بالحق عن الخلق يؤدك وزر النبوّة ومقام الدعوة، لعدم التفاتك إلى الكثرة، ويعسر عليك الرجوع إلى الحق في أوّل حال البقاء بعد الفناء قبل التمكن لقوة توجهك إلى الحق { فلنولينك قِبلةً ترضاها } فلنجعلنّ وجهك يلي قبلة القلب بانشراح الصدر، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما انكشف له صلى الله عليه وسلم توحيد الذات واستغرق فيها وتوجه وحوها، وانسلخ عن الأفعال والصفات بالمرة، انتظر صلى الله عليه وسلم الوحي المطابق لهذا الانكشاف بحسب الصورة أيضاً، فقال سبحانه: { قَدْ نَرَىٰ } نطلع ونعلم حين انكشافك بذاتنا { تَقَلُّبَ وَجْهِكَ فِي ٱلسَّمَآءِ } منتظراً للوحي المتضمن للتوجه الصوري { فَلَنُوَلِّيَنَّكَ } بعد انكشافك المعنوي { قِبْلَةً } صورية { تَرْضَاهَا } مناسبة لقبلتك المعنوية { فَوَلِّ وَجْهَكَ } يا أكمل الرسل صورة { شَطْرَ } جهة { ٱلْمَسْجِدِ ٱلْحَرَامِ } الذي يحرم فيه التوجه إلى غير الذات البحث المسقط للإضافة { وَ } لا تختص بهذه الكرامة لك، بل تسري منك إلى من تبعك من المؤمنين { حَيْثُ مَا كُنْتُمْ } من مراتب الوجود { فَوَلُّواْ وُجُوِهَكُمْ } الفائضة لكم إيها المؤمنون من ربكم { شَطْرَهُ } لتكونوا من المنكشفين به المهتدين بذاته { وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ } من اليهود والنصارى { لَيَعْلَمُونَ } يقيناً بشهادة كتبهم ورسلهم { أَنَّهُ } أي: شأن انكشافك وتحققك بالتوحيد الذاتي { ٱلْحَقُّ } الثابت المنزل { مِن رَّبِّهِمْ } أي: رباهم بإعطاء العقل المميز بن الحق والباطل، والمحق والمبطل، ومع ذلك ينكرون عناداً { وَمَا ٱللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ } [البقرة: 144] من الإخفاء والستر بعد الوضوح والكشف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: التقلب: التردد، وولَّيْت كذا: جعلته والياً له، والشَّطْر هنا: الجهة\n يقول الحقّ جلّ جلاله لنبيه - عليه الصلاة والسلام - حين تمنى أن يُحَول إلى الكعبة، لأنها قبلة أبيه إبراهيم وأدْعى إلى إسلام العرب، وهي أقدم القبلتين، فكان ينظر إلى السماء، ويقلب وجه فيها انتظاراً لنزول الوحْي، وهذا من كمال أدبه - عليه الصلاة والسلام - حيث انتظر ولم يطلب، فقال له الحق تعالى: { قد نرى } أي: ربما نرى تردد { وجهك في السماء } انتظاراً للوحي، فلنعطينك ما تمنيت، ونوجهك إلى قبلة { ترضاها } وتحبها لمقاصد دينية وافقت المشيئة، واقتضتها الحكمة، { فولِّ وجهك } أي: اجعله موالياً { شطر } أي: جهة { المسجد الحرام وحيثما كنتم } أيها المؤمنون أي في أي مكان كنتم { فولوا وجوهكم شطره } جهته\n وإنما ذكر الحق تعالى شطر المسجد، أي: جهته، دون عين الكعبة، لأنه - عليه الصلاة والسلام - كان في المدينة، والبعيد يكفيه مراعاة الجهة، فإن استقبال عينها حَرجٌ عليه، بخلاف القريب، فإنه يسهل عليه مسامته العين\n وقيل: إن جبريل - عليه السلام - عيّنها له بالوحي فسميت قبلة وحْي\n رُوِيَ أنه صلى الله عليه وسلم قدم المدينة فصلّى نحو بيت المقدس ستة عشر شهراً، ثم وُجِّه إلى الكعبة في رجب بعد الزوال قبل قتال بدر بشهرين، وقد صلّى بأصحابه في مسجد بني سلمة ركعتين من الظهر، فتحوّل في الصلاة، واستقبل الميزاب، وتبادل الرجال والنساء صفوفهم، فسُمي مسجد القبلتين\n قاله البيضاوي\n الإشارة: في الآية إشارة إلى أن ترك التصريح من كمال الأدب، وفي الحكم: \" ربما دلّهم الأدب على ترك الطلب، كيف يكون دعاؤك اللاحق سبباً في قضائه السابق؟! جلّ حكم الأزل أن يضاف إلى العلل \"\n فإذا تمنيت شيئاً وتوقفت على أمر فاصبر وتأدب واقتد بنبيك - عليه الصلاة والسلام - حتى يعطيك ما ترضى، أو يعوضك منها مقام الرضا\n وفي المسألة كلام، والتحقيق أن ينظر إلى ما ينشرح به صدره في الوقت، فإن انشرح للدعاء دعا، وإن انقبض عن الدعاء سكت\n والله يرزق من يشاء بغير حساب ولا علّة ولا أسباب\n وإن شئت قلت: قد نرى فكرتك أيها العارف في سماء المعاني، غائباً في شهود الأواني، فلنولينك قبلة ترضاها، وتتلذذ بشهود جمالها وسناها، وهي الحضرة المطهرة التي هي صلاة القلوب، فولّ وجهك ووجهتك إلى تلك الحضرة، وحيثما كانت فولّ وجهك شطره، ودم على صلاة الفكرة والنظرة، فهي صلاة العارفين، ومنتهى امل القاصدين، وبالله التوفيق",
      "translations": []
    }
  ]
}