{
  "chapter": "البقرة",
  "text": "ولكل وجهة هو موليها فاستبقوا۟ الخيرت اين ما تكونوا۟ يات بكم الله جميعا ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Each has a goal to which he turns. So strive towards piety and excel the others: God will bring you all together wheresoever you be. God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone has a direction towards which he turns in Prayer: so try to excel one another in good works. Allah will find you wheresoever you be, for nothing is out of Allah's reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every one pursues his goal. Compete with each other in performing good deeds. Wherever you are, God will bring you all together. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And each one has a direction towards which he inclines, therefore strive to surpass others in good deeds; Allah will bring you all together, wherever you may be; indeed Allah may do as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation there is a direction to which they face (in their prayers). So hasten towards all that is good. Wheresoever you may be, Allah will bring you together (on the Day of Resurrection). Truly, Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every one has a direction to which he should turn, therefore hasten to (do) good works; wherever you are, Allah will bring you all together; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every man has his direction to which he turns; so be you forward in good works. Wherever you may be, God will bring you all together; surely God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And each one hath a goal toward which he turneth; so vie with one another in good works. Wheresoever ye may be, Allah will bring you all together. Lo! Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each community has its own direction in which it turns: vie, then, with one another in doing good works. Wherever you may be, God will bring you all before Him. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every one is a direction witherward he turnoth; so strive to be foremost in virtues. Wheresoever ye may be, Allah will bring you together. Verily Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone has a cynosure to which he turns; so take the lead in all good works. Wherever you may be, Allah will bring you all together. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To each is a goal to which Allah turns him; then strive together (as in a race) Towards all that is good. Wheresoever ye are, Allah will bring you Together. For Allah Hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation there is a direction to which they face (in their prayers). So hasten towards all that is good. Wheresoever you may be, Allah will bring you together (on the Day of Resurrection). Truly, Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for everyone is a direction for which he turns. So race in goodness. And wherever you are, Allah will bring you all together. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every community is a direction towards which it turns. Therefore, race towards goodness. Wherever you may be, God will bring you all together. God is capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For each [religious following] is a direction toward which it faces. So race to [all that is] good. Wherever you may be, Allah will bring you forth [for judgement] all together. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:148] Every person, of every community, has his direction (wijha), [his] qibla, to which he turns (muwallīhā, ‘he turns to it’, is also read as muwallāhā, ‘he is made to turn to it’), in his prayers, so vie with one another in good works, strive with acts of obedience and acceptance of these. Wherever you may be, God will bring you all together, gathering you on the Day of Resurrection and requiting you for your deeds; surely God has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And each one hath a goal) to each adherent of a religion a Qiblah (towards which he turneth) he faces according to his own whim; it is also said that this means: to each prophet a Qiblah, which is the Ka'bah, towards which he is ordered to face; (so vie with one another in good works) so hasten, community of Muhammad, to perform acts of obedience more than any other nation. (Wheresoever you may be) on land or at sea, (Allah will bring you all together) gather you together and reward you for the good works you performed. (Lo! Allah is Able to do all things) like gathering you together as well as other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلِكُلٍّ وِجْهَةٌ } معناهُ قِبلةٌ\n { هُوَ مُوَلِّيهَا } معناهُ هو مُوجِهُهَا\n صلواتهم إِلى بيتِِ المَقْدسِ، وصَلواتُهُم إِلى الكَعبةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أن { لِكُلٍّ } أي: لكل من أفراد الأمم { وِجْهَةٌ } مقصد وقبلة معينة من الأوصاف والأسماء الإلهية { هُوَ مُوَلِّيهَا } بحسب اقتضائها وغلبتها { فَٱسْتَبِقُواْ ٱلْخَيْرَاتِ } أي: بادروا أيها المحمديون إلى منشأ جميع الخيرات، ومنبع جميع المبرات الناشئة من الأسماء والصفات، وهو الذات المستجمع لجميعها { أَيْنَ مَا تَكُونُواْ } من مقتضيات الأوصاف { يَأْتِ بِكُمُ ٱللَّهُ } الجامع لها { جَمِيعاً } مجتمعين بعد رفع التعينات الناشئة من الصفات { إِنَّ ٱللَّهَ } المتجلي بالأوصاف { عَلَىٰ كُلِّ شَيْءٍ } من المظاهر المتعينة المتكثرة بحسب المبدأ والمظاهر { قَدِيرٌ } [البقرة: 148] على رفع التعينات المسقطة لجميع الكثرات بحسب المعاد والباطن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا فَٱسْتَبِقُواْ ٱلْخَيْرَاتِ أَيْنَ مَا تَكُونُواْ يَأْتِ بِكُمُ ٱللَّهُ جَمِيعاً إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ وَإِنَّهُ لَلْحَقُّ مِن رَّبِّكَ وَمَا ٱللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ وَحَيْثُ مَا كُنْتُمْ فَوَلُّواْ وُجُوهَكُمْ شَطْرَهُ\n\n\n }  قلت: التنوين { لكل } تنوين العوض، أي ولكل أمة قبلة، أو لكل قوم من المسلمين جهة وجانب من الكعبة، و { وجهة } مبتدأ، والخبر: المجرور قبله\n و { هو } مبتدأ، و { موليها } خبر مقصور، و ولّى يتعدى إلى مفعلوين، وهو هنا محذوف، أي: موليها وجهه إن كان الضمير يعود على المضاف المحذوف، وهو هنا محذوف، أي: موليها وجهه إن كان الضمير يعود على المضاف المحذوف، ويحتمل أن يعود على الله تعالى، أي: الله تعالى موليها إياه، أي: يجعلها موالية له إن استقبل جهتها\n وقرأ ابن عامر: { هو مُوَلاَّها } بالبناء للمفعول، فالنائب ضمير يعود على { هو } ، وهو المفعول الأول، والثاني: المضاف إليه تخفيفاً، وأصله: مُلي إياها، أي مصروفاً إليها\n يقول الحقّ جلّ جلاله: ولكل فريق من المسلمين جهة من الكعبة يستقبلها ويوليها وجهه، أينما كان وحيثما حل، فأكثروا من الصلوات، واستقبلوا الخيرات قبل هجوم هادم اللذات، { أينما تكونوا } في مشارق الأرض ومغاربها، يأتكم الممات، ويأت بكم إلى المحشر حُفاة عراة، ولا ينفعكم حنيئذٍ إلا صالح عمل قدمتوه، أو فعل خير أسلفتموه، { إن الله على كل شيء قدير } ، فلا يعجزه بعث العباد، ولا جمعهم من أعماق الأرض وأقطار البلاد",
      "translations": []
    }
  ]
}