{
  "chapter": "البقرة",
  "text": "سيقول السفهاء من الناس ما ولىهم عن قبلتهم التى كانوا۟ عليها قل لله المشرق والمغرب يهدى من يشاء الى صرط مستقيم",
  "translations": [
    {
      "translation": "The foolish will now ask and say: \"What has made the faithful turn away from the Qiblah towards which they used to pray?\" Say: \"To God belong the East and the West. He guides who so wills to the path that is straight.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of course, the foolish people will say, \"What has turned them abruptly away from the giblah towards which they formerly used to turn their faces in prayer?\" Tell them, O Messenger, `'East and West all belong to Allah; He shows the Right Way to anyone He wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fools will soon say, \"What has made them (Muslims) change the direction to which they had been facing during their prayers (the qibla)?\" (Muhammad), tell them, \"Both the East and West belong to God and He guides (whomever He wants), to the right direction.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So now the foolish people will say, “What has turned the Muslims away from the qiblah (prayer direction) which they formerly observed?”; proclaim, “To Allah only belong the East and the West; He guides whomever He wills upon the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools (idolators, hypocrites, and Jews) among the people will say: \"What has turned them (Muslims) from their Qiblah [prayer direction (towards Jerusalem)] to which they used to face in prayer.\" Say (O Muhammad): \"To Allah belong both, east and the west. He guides whom He wills to the straight way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: What has turned them from their qiblah which they had? Say: The East and the West belong only to Allah; He guides whom He likes to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say, 'What has turned them from the direction they were facing in their prayers aforetime?' Say: \"To God belong the East and the West; He guides whomsoever He will to a straight path.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish of the people will say: What hath turned them from the qiblah which they formerly observed? Say: Unto Allah belong the East and the West. He guideth whom He will unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish will ask, \"What has made them turn away from their direction of prayer which they used to face?\" Say, \"The East and the West belong to God. He guides whom He pleases to the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon will the foolish among mankind say: what hath turned them away from their Qiblah whereon they had been? Say thou: unto Allah belongeth the east and the west he guideth whomsoever He listeth unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish among the people will say, ‘What has turned them away from the qiblah they were following?’ Say, ‘To Allah belong the east and the west. He guides whomever He wishes to a straight path.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: \"What hath turned them from the Qibla to which they were used?\" Say: To Allah belong both east and West: He guideth whom He will to a Way that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools (pagans, hypocrites, and Jews) among the people will say, \"What has turned them (Muslims) from their Qiblah [prayer direction (towards Jerusalem)] to which they were used to face in prayer.\" Say, (O Muhammad SAW) \"To Allah belong both, east and the west. He guides whom He wills to a Straight Way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fools among the people will say: 'What has made them turn away from the direction they were facing' Say: 'The east and the west belong to Allah. He guides whom He will to the Straight Path'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ignorant among the people will say, “What has turned them away from the direction of prayer they once followed?” Say, “To God belong the East and the West. He guides whom He wills to a straight path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish among the people will say, \"What has turned them away from their qiblah, which they used to face?\" Say, \"To Allah belongs the east and the west. He guides whom He wills to a straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:142] The fools, the ignorant, among the people, that is, the Jews and the idolaters, will say, ‘What, matter, has turned them, the Prophet (s) and the believers, from the direction they were facing in their prayers formerly?’, this being the Holy House (bayt al-maqdis, sc. Jerusalem); the sīn [of sa-yaqūlu, ‘they will say’] denotes the future tense and informs of the Unseen. Say: ‘To God belong the East and the West, that is, all directions. Thus He commands that they face whichever direction He wills, and there can be no objection. He guides whomever He will, His guidance being, to a straight path’, that is, the religion of Islam, and you are among these [guided ones].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The foolish of the people) the ignorant among the Jews and Arab idolaters (will say: What hath turned them) made them change (from the Qiblah which they formerly observed) except that they want to revert to the religion of their ancestors; it is also said that this means: there was no reason to turn from the direction in which they prayed, i.e. Jerusalem? (Say) Muhammad! (unto Allah belong the East) praying to the Ka'bah (and the West) the prayer that you prayed in the direction of Jerusalem-both are with Allah's command. (He guideth whom He will unto a straight path) He confirms whom He wills on a straight Religion and direction of prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ سيقول السفَهَاء من الناس } سمّاهم سفهاء خفاف العقول، لعدم وفاء عقولهم بإدراك حقيقة دين الإسلام وقضائها على ما عرفت بحق مذهبها ووقوفها به، ولذلك كانت محاجتهم في الله مع اتفاقهم في التوحيد واختصاص المسلمين بالإخلاص، إذ لو أدركوا الحق لأدركوا إخلاصهم فلم تبق محاجتهم معهم\n ولو كانت عقولهم رزينة لاستدلت بالآيات وأدركت في كل دين ومذهب حقه، وفرّقت بين ذلك الدين الحق الذي هو كالروح لذلك، وبين باطل أهله الذي اختلط به ولبسه خاصة دين الإسلام، فإن كله حق، بل هو حق الحقوق ولذلك جعلوا أمّة وسطاً أي: عدلاً بين الأمم، فضلاء شهداء عليهم\n { ما ولاّهُم عن قبلتهم التي كانوا عليها } لأنهم كانوا مقيدين بالجهة فلم يقبلوا إلا مقيداً ولم يعرفوا التوحيد الوافي بالجهات كلها { قل لله المَشرق والمَغرب } على ما مرّ من التأويلين { يهدي من يشاء إلى صراطٍ مستقيمٍ } أي: طريق الوحدة التي تتساوى الجهات بالنسبة إليها لكون الحق المتوجه إليه لا في جهة، وكون الجهات كلها فيه وبه وله، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما كان الغالب على رسول الله صلى الله عليه وسلم في أوائل حاله وسلوكه، توحيد الصفات والأفعال المورثين له عن آبائه - صلوات الله عليهم - كان تابعاً لهم في قبلتهم التي كانوا عليها أيضاً صورة، وحين ظهر وانكشف له صلى الله عليه وسلم توحيد الذات، وغلبت عليه تجلياتها وإشراقها استغرق ووله، بل فني واضمحل وتلاشت فيها هويته، وبعدما تنزل عن ولهه واستغراقه، خص له سبحانه قبلة مخصوصة، ووجهة معينة صورة؛ لتكون آية على قبلته الحقيقية المعنوية\n\n\n\n\nثم لما أمره سبحانه بتوجهها واستقبالها وهو في الصلاة إلى القبلة التيكان عليها قبل الأمر وتحول نحوها فيها، أخذ المنافقون في الغيبة، واشتغلوا بالنفاق، ونسبوه إلى ما هو منزه عنه، وانتهزوا واغتنموا الفرصة لمقابلته وصمموا العزم بمجادلته، أراد سبحانه أن ينبه بما هم عليه من النفاق والشقاق في أمر القبلة على وجه الإخبار، فقال: { سَيَقُولُ ٱلسُّفَهَآءُ } المعزولون عن مقتضى العقل الخيري، المتشعب من العقل الكلي، المتفرع على اسم العليم: { مِنَ ٱلنَّاسِ } المحجوبين بظلمة التعينات عن نور الوجود قولاً ناشئاً عن محض الغفلة والسفاهة على سبيل الاستهزاء، وهو قولهم: { مَا وَلَّٰهُمْ } حوَّلهم وصرفهم؛ أي: المؤمنين { عَن قِبْلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيْهَا } ومن قبل مع أنها قبلة من يدعون الانتساب إليهم والاقتداء بملتهم؟\n\n\n\n{ قُل } لهم يا أكمل الرسل على وجه التنبيه والإرشاد وبلسان التوحيد الذاتي بعدما انكشف لك: { للَّهِ } المنزله عن الأماكن والجهات المتجلي فيها { ٱلْمَشْرِقُ وَٱلْمَغْرِبُ } أي: جميع ما يتوهم من الزمان والمكان والجهة، إنما هي مظاهر ذاته ومجالي أسمائه وصفاته { يَهْدِي } بحبه الذاتي { مَن يَشَآءُ } من عباده المتوجهين إلى جنابه { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [البقرة: 142] موصلٍ إلى ذاته من أي مكان كان، وفي أي وجهة وزمانٍ؛ إذ هو محيط بكلها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { سيقول السفهاء من الناس } الذين لا عقل لهم ولا دين، حين تحول القبلة من بيت المقدس إلى الكعبة: ما صرفهم { عن قبلتهم التي كانوا عليها } ، فلو دام عليها لاتبعناه\n { قل } لهم يا محمد: { لله المشرق والمغرب } لا يختص ملكه بمكان دون مكان بخاصية ذاتيه تمنع من إقامة غيره مقامه، بل الأماكن عند الله سواء: والخلق في حقه سواء، { يهدي من يشاء إلى صراط مستقيم } ، ويضل مَن يشاء عن المنهاج القويم\n\n \" لاَ يُسْئَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْئَلُونَ \" \n",
      "translations": []
    }
  ]
}