{
  "chapter": "البقرة",
  "text": "واذا لقوا۟ الذين ءامنوا۟ قالوا۟ ءامنا واذا خلوا۟ الى شيطينهم قالوا۟ انا معكم انما نحن مستهزءون",
  "translations": [
    {
      "translation": "When they meet the faithful they say: \"We believe;\" but when alone with the devils (their fellows), they say: \"We are really with you; we were joking.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say, \"We, too, are believers\", but when they privily meet their evil geniuses, they say, \"Indeed we are with you: we are only mocking at these people\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the believers they declare belief and, in secret to their own devils, they say, \"We were only mocking\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet with the believers, they say, “We believe”; and when they are alone with their devils, they say, “We are undoubtedly with you, we were just mocking!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say: \"We believe,\" but when they are alone with their Shayatin (devils), they say: \"Truly, we are with you; verily, we were but mocking.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say: We believe; and when they are alone with their Shaitans, they say: Surely we are with you, we were only mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say, 'We believe'; but when they go privily to their Satans, they say, 'We are with you; we were only mocking.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they fall in with those who believe, they say: We believe; but when they go apart to their devils they declare: Lo! we are with you; verily we did but mock.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say, \"We believe.\" But when they are alone with their evil leaders, they say, \"We are really with you; we were only mocking.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who have believed, they say: We believe. And when they are alone with their Satans, they say: verily we are with you, we were but mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet the faithful, they say, ‘We believe,’ but when they are alone with their devils, they say, ‘We are with you; we were only deriding [them].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say: \"We believe;\" but when they are alone with their evil ones, they say: \"We are really with you: We (were) only jesting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say: \"We believe,\" but when they are alone with their Shayatin (devils - polytheists, hypocrites, etc.), they say: \"Truly, we are with you; verily, we were but mocking.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say, 'We, too believe.' But when they are alone with their devils, they say to them: 'We follow none but you, we were only mocking\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they come across those who believe, they say, “We believe”; but when they are alone with their devils, they say, “We are with you; we were only ridiculing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say, \"We believe\"; but when they are alone with their evil ones, they say, \"Indeed, we are with you; we were only mockers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:14] When they meet (laqū is actually laquyū, but the damma has been omitted, being too cumbersome for pronunciation; likewise the yā’ [is omitted], because it is unvocalised and is followed by a wāw); those who believe, they say, ‘We believe’; but when they go apart, away from them and return, to their devils, their leaders, they say, ‘We are with you, in religion; we were only mocking, them [the believers] by feigning belief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they), i.e. the hypocrites, (fall in with those who believe), i.e. Abu Bakr and his companions, (they say: We believe) deep in our hearts and are genuine in our faith just as you believe deep in your hearts and are genuine in your faith; (but when they go apart to their devils), to their soothsayers and leaders who were five in number, namely, Ka'b Ibn al-Ashraf in Medina, Abu Burdah al-Aslami in Banu Aslam, Ibn al-Sawda' in Historic Syria (al-Sham), 'Abd al-Dar in Juhaynah and 'Awf Ibn 'Amir in Banu 'Amir, (they declare) to their leaders: (Lo! We are with you) we follow your religion in secret; (surely we did but mock) Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَإِذَا خَلَوْاْ إِلَىٰ شَيَاطِينِهِمْ } وهو كلُّ غاوٍ، ومُتردٍ من الجِّنِ والإِنسِ، والدَوابِّ\n واحدُهُمْ: شَيْطَانٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } علامة نفاق هؤلاء المضلين وخداعهم أنهم { إِذَا لَقُواْ ٱلَّذِينَ آمَنُواْ } بالله وكتابه ورسوله { قَالُوۤا } على طريق الإخبار عن الأمور المحققة تروجياً وتغريراً على المؤمنين { آمَنَّا } بالجملة الفعلية الماضية بلا مبالغة وتأكيد لحكمهم سفاهة المؤمنين، بأن السفيه يقبل الأخبار بلا تأكيد؛ لعدم تفطنه على إنكار المتكلم، فنزلوهم - وإن كان من حقهم الإنكار حقيقة - منزلة خالي الذهن؛ لسفاهتهم { وَإِذَا خَلَوْاْ } نفوا خالين { إِلَىٰ شَيَاطِينِهِمْ } أي: مع أصحابهم المستمرين على الكفر، الظاهرين بالمخالفة بلا خداع ولا نفاق كالشيطان المصر على الضلال المستمر على الإضلال { قَالُوۤاْ } على طريق المبالغة والتأكيد قلعاً لما اعتقدوا من ظاهر حالهم ومقالهم وموافقتهم مع المؤمنين سراً وجهراً، وتحقيقاً لمؤاخذتهم معهم { إِنَّا } وإن كنا في الظاهر مداهنين معهم لمصلحة دنيوية، متفقون { مَعَكُمْ } لفائدة دينية، أتوا بالجملة الاسمية المصدرة بأن؛ تحقيقاً واهتماماً، وقولنا: آمنا، استهزاء منا إياهم لا تصديق لمدعاهم، وبالجملة ما نحن مؤمنون بمجرد هذا القول بل { إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ } [البقرة: 14] مستخفون تجهيلاً وتسفيهاً واعتذاراً على مجرد القول الكاذب الغير المطابق للاعتقاد والواقع",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اللقاء: المصادفة بلا قصد، والخلو بالشيء أو معه: الانفراد به، ضمنه هنا معنى رجع، ولذلك تعدَّى بإلى، والشيطان فَيْعَالٌ، من شَطَنَ، إذا بعد، أو فَعْلاَن من شاط، إذا بطل، والاستهزاء بالشيء: الاستخفاف بحقه، والعَمَهُ في البصيرة كالعمى في البصر\n يقول الحقّ جلّ جلاله: في وصف المنافقين تقريراً لنفاقهم: إنهم كانوا { إذَا لَقُوا } الصحابة أظهروا الإيمان، وإذا رجعوا { إلَى شَيَاطِينِهِمْ } أي: كبرائهم المتمردين في الكفر والطغيان، { قَالُوا إِنَّا مَعَكُمْ } لم نخرج عن ديننا { إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ } بهم، ومستسخرون بشأنهم، نزلت في عبد الله بن أُبَيّ - رأس المنافقين - كان إذا لقي سعداً قال: نعم الدين دين محمد، وإذا خلا برؤساء قومه من أهل الكفر، شدوا أيديكم على دين آبائكم\n وخرج ذات يوم مع أصحابه فاستقبلهم نفر من الصحابة - رضوان الله عليهم - فقال عبدُ الله لأصحابه: انظروا كيف أرد هؤلاء السفهاء عنكم، فأخذ بيد أبي بكر رضي الله عنه فقال: مرحباً بالصدِّيق سيد بني تيم، وشيخ الإسلام، وثاني رسول الله صلى الله عليه وسلم في الغار، الباذل نفسه وماله لرسول الله صلى الله عليه وسلم، ثم أخذ بيد عمر، فقال: مرحباً بسيد بني عدي بن كعب، الفاروق، القوي في دين الله، الباذل نفسه وماله لرسول الله صلى الله عليه وسلم، ثم أخذ بيد عَلِيّ فقال: مرحباً بابن عم رسول الله صلى الله عليه وسلم وخِتِنِه، سيد بني هاشم، ما وعد رسول الله صلى الله عليه وسلم، فقال عليّ رضي الله عنه: يا عبد الله، اتق الله ولا تنافق، فإن المنافقين شرُّ خليقة الله، فقال عبد الله: مهلاً يا أبا الحسن، أنى تقول هذا؟ والله إن إيماننا كإيمانكم، وتصديقنا كتصديقكم، فنزلت الآية",
      "translations": []
    }
  ]
}