{
  "chapter": "البقرة",
  "text": "ولئن اتيت الذين اوتوا۟ الكتب بكل ءاية ما تبعوا۟ قبلتك وما انت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت اهواءهم منۢ بعد ما جاءك من العلم انك اذا لمن الظلمين",
  "translations": [
    {
      "translation": "Even though you bring all the proof to the people of the Book they will not face the direction you turn to, nor you theirs, nor will they follow each other's direction. And if you follow their whims after all the knowledge that has reached you, then surely you will be among transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though you may show every kind of sign to the people of the Book, they will not adopt your giblah, nor are you going to adopt their giblah; nor will any of them adopt the giblah of the other; therefore if, after the knowledge you have received, you follow their desires, you will certainly be counted among the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you were to bring all kinds of authoritative proof to the People of the Book, they still would not accept your qibla, nor would you accept theirs, nor would they accept each others. Were you to follow their desires after all the knowledge that has come to you, you would certainly have been one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring all the signs to the People given the Book(s), they would not follow your qiblah; nor should you follow their qiblah; nor do they follow each others qiblah; and were you (the followers of this Prophet) to follow their desires after having received knowledge, you would then surely be unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring to the People of the Scripture (Jews and Christians) all the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they would not follow your Qiblah (prayer direction), nor are you going to follow their Qiblah. And they will not follow each other's Qiblah. Verily, if you follow their desires after that which you have received of knowledge (from Allah), then indeed you will be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you bring to those who have been given the Book every sign they would not follow your qiblah, nor can you be a follower of their qiblah, neither are they the followers of each other's qiblah, and if you follow their desires after the knowledge that has come to you, then you shall most surely be among the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if thou shouldst bring to those that have been given the Book every sign, they will not follow thy direction; thou art not a follower of their direction, neither are they followers of one another's direction. If thou followest their caprices, after the knowledge that has come to thee, then thou wilt surely be among the evildoers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if thou broughtest unto those who have received the Scripture all kinds of portents, they would not follow thy qiblah, nor canst thou be a follower of their qiblah; nor are some of them followers of the qiblah of others. And if thou shouldst follow their desires after the knowledge which hath come unto thee, then surely wert thou of the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even if you should produce every kind of sign for those who have been given the Book, they would never accept your prayer direction, nor would you accept their prayer direction: nor would any of them accept one another's direction. If, after all the knowledge you have been given, you yield to their desires, then, you shall surely become a transgressor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And shouldst thou bring unto those who are vouchsafed the Book every sign, they would not follow thy Qiblah, neither art thou to be a follower of their Qiblah; nor doth one part of them follow the Qiblah of the other. And shouldst thou follow their desires, after that which hath come unto thee of the knowledge, then verily thou wilt become one of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you bring those who were given the Book every [kind of] sign, they will not follow your qiblah. Nor shall you follow their qiblah, nor will any of them follow the qiblah of the other. And if you follow their desires, after the knowledge that has come to you, you will be one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if thou wert to bring to the people of the Book all the Signs (together), they would not follow Thy Qibla; nor art thou going to follow their Qibla; nor indeed will they follow each other's Qibla. If thou after the knowledge hath reached thee, Wert to follow their (vain) desires,-then wert thou Indeed (clearly) in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if you were to bring to the people of the Scripture (Jews and Christians) all the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they would not follow your Qiblah (prayer direction), nor are you going to follow their Qiblah (prayer direction). And they will not follow each other's Qiblah (prayer direction). Verily, if you follow their desires after that which you have received of knowledge (from Allah), then indeed you will be one of the Zalimun (polytheists, wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even if you brought those to whom the Book had been given every proof, they would not accept your direction, nor would you accept theirs; nor would any of them accept the direction of the other. If after all the knowledge you have been given you yield to their desires, then you will surely be among the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you were to bring to those who were given the Book every proof, they would not follow your direction, nor are you to follow their direction, nor do they follow the direction of one another. And if you were to follow their desires, after the knowledge that has come to you, you would be in that case one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you brought to those who were given the Scripture every sign, they would not follow your qiblah. Nor will you be a follower of their qiblah. Nor would they be followers of one another's qiblah. So if you were to follow their desires after what has come to you of knowledge, indeed, you would then be among the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:145] Yet if (wa-la-in: the lām is for oaths) you should bring to those who have been given the Scripture every sign, about your truthfulness in the matter of the direction of prayer, they will not follow your direction, out of obduracy, and you are not a follower of their direction (this is a categorical negation of his [the Prophet’s] desire that they become Muslims and of their desire that he return to their direction of prayer; neither are they, the Jews and the Christians, followers of one another’s direction. If you were to follow their whims, the ones to which they summon you, after the knowledge, the revelation, that has come to you, then you, if, hypothetically, you were to follow them, will surely be among the evildoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And even if thou broughtest unto those who have received the Scripture all kinds of portents) all the signs they asked of you, (they would not follow your Qiblah) they would not pray towards your Qiblah nor embrace your Religion, (nor canst thou be a follower of their Qiblah) nor can you pray towards the Qiblah of the Jews or Christians; (nor are some of them followers of others) nor are some of them going to pray towards the Qiblah of the Jews and Christians. (And if thou shouldst follow their desires) after being warned and pray towards their Qiblah (after the knowledge which hath come unto you) that the Sacred Precinct is the Qiblah of Abraham, (then surely) if you do that then surely (wert thou of the evil-doers) who harm themselves. 24\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { لَئِنْ أَتَيْتَ } يا أكمل الرسل { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ بِكُلِّ آيَةٍ } نازلة لك دالة على توحيد الذات الذي هو مقصدك وقبلتك { مَّا تَبِعُواْ قِبْلَتَكَ } لانهماكهم في الغفلة والضلالة { وَمَآ أَنتَ } أيضاً بعدما انكشف لك الأمر يقيناً { بِتَابِعٍ قِبْلَتَهُمْ } التي توجهوا إليها ظناً وتخميناً { وَ } أيضاً { مَا بَعْضُهُم بِتَابِعٍ قِبْلَةَ بَعْضٍ } لتفاوت ظنونهم وآرائهم { وَ } الله { لَئِنِ ٱتَّبَعْتَ } أنت يا أكمل الرسل { أَهْوَاءَهُم } الباطلة { مِّن بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ } اليقيني المطابق للعين بل للحق { إِنَّكَ } مع اصطفائنا إياك واجتنابنا لك { إِذَاً لَّمِنَ ٱلظَّالِمِينَ } [البقرة: 145] المعرضين عنا بعد توفيقنا إياك وإرشادنا لك إلى الكعبة الحقيقة\n\n\n\n\nهذا تهديد لرسول الله صلى الله عليه وسلم بعد تهديد وحث له صلى الله عليه وسلم لدوام التوجه على ما اكشف له من توحيد الذات، تحريض للمؤمنين على متابعته صلى الله عليه وسلم في دوام التوجه والميل إليه، ومثله في القرآن كثير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولمّا تحوّلت القبلة إلى الكعبة غضبت اليهود، حيث ترك قبلتهم، مكابرة وعناداً، وقالوا: لو بقي على قبلتنا لرجونا أن يكون هو النبيّ المبعوث في آخر الزمان فنتبعه، فردَّ الله عليهم وكذبهم فقال: { وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ لَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ وَمَا ٱللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ * وَلَئِنْ أَتَيْتَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ بِكُلِّ آيَةٍ مَّا تَبِعُواْ قِبْلَتَكَ وَمَآ أَنتَ بِتَابِعٍ قِبْلَتَهُمْ وَمَا بَعْضُهُم بِتَابِعٍ قِبْلَةَ بَعْضٍ وَلَئِنِ ٱتَّبَعْتَ أَهْوَاءَهُم مِّن بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ إِنَّكَ إِذَاً لَّمِنَ ٱلظَّالِمِينَ ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ وَإِنَّ فَرِيقاً مِّنْهُمْ لَيَكْتُمُونَ ٱلْحَقَّ وَهُمْ يَعْلَمُونَ ٱلْحَقُّ مِن رَّبِّكَ فَلاَ تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ }  قلت: { ولئن } اللام موطِّئة للقسم، و { إن } شريطة، و { أتيت } فعل اشرط، و { ما تبعوا } جواب القسم المحذوف سد مسد جواب الشرط\n\n\nقال في الألفية:\n\nيقول الحقّ جلّ جلاله: { وإن الذين أوتوا الكتاب } من أحبار اليهود { ليعلمون } أن التحول إلى الكعبة حق { من ربهم } لِمَا يجدون في كتابهم أنه يصلي إلى القبلتين، وأن عادته تعالى تخصيص كل أمة بشريعة، { وما الله بغافل عما يعملون } من التعنت والعناد، وإنما يمهلهم ليوم المعاد، والله لئن أتيتهم بكل حجة وبرهان على صحة التوجه إلى الكعبة { ما تبعوا قبلتك } لأنهم ما تركوا قبلتك لشبهة تُزيلُها الحجة، وإنما خالفوك مكابرة وعناداً\n وقد طمعوا أن ترجع إلى قبلتهم، ولست { بتابع قبلتهم } أبداً، بل لهم قبلتهم صخرة بيت المقدس، وللنصارى قبلتهم مطلع الشمس، وليس بعضهم { بتابع قبلة بعض } لتصلب كل حزب بما هو فيه، وإن كان على خطأ وفساد لأن مفارقة العوائد نا صعب على النفوس إلا من سبقت له العناية\n { ولئن اتبعت أهواءهم } الباطلة وإراءهم الزائفة فَرْضاً وتقديراً { من بعد ما جاءك من العلم } الواضح والوحي الصحيح { إنك إذاً لمن الظالمين } ، لكنك معصوم، فلا يتصور اتباعك لهم أبداً",
      "translations": []
    }
  ]
}