{
  "chapter": "البقرة",
  "text": "تلك امة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسـلون عما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "They were the people, and they have passed away. Theirs the reward for what they did, as yours will be for what you do. You will not be questioned about their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were a people who have passed away and they shall be repaid for what they earned and you for what you earn: you will not be questioned as to what they did. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That nation is gone, they have reaped what they sowed and the same applies to you. You are not responsible for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were a group that has passed away; for them is what they earned, and for you is what you earn; and you will not be questioned about their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation who has passed away. They shall receive the reward of what they earned, and you of what you earn. And you will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a people that have passed away; they shall have what they earned and you shall have what you earn, and you shall not be called upon to answer for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is a nation that has passed away; there awaits them that they have earned, and there awaits you that you have earned; you shall not be questioned concerning the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are a people who have passed away; theirs is that which they earned and yours that which ye earn. And ye will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were a people that have passed away; theirs is what they did and yours what you have done. You shall not be answerable for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That are a community who have passed away; unto them shall be that which they earned, and unto you that which ye earn; and ye shall be questioned not of that which they were wont to Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation that has passed: for it there will be what it has earned, and for you there will be what you have earned, and you will not be questioned about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a people that hath passed away. They shall reap the fruit of what they did, and ye of what ye do! Of their merits there is no question in your case:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a nation who has passed away. They shall receive the reward of what they earned, and you of what you earn. And you will not be asked of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That nation has passed away. Theirs is what they earned and yours what you have earned. You shall not be questioned about what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was a community that has passed. To them is what they have earned, and to you is what you have earned. And you will not be questioned about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is a nation which has passed on. It will have [the consequence of] what it earned, and you will have what you have earned. And you will not be asked about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:141] That is a community that has passed away; theirs is what they have earned, and yours is what you have earned; you shall not be asked about what they did: a similar [verse] has already been mentioned above.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are a people) a group of people (who have passed away) perished; (theirs is that which they earned) of goodness (and yours is that which ye earn) of goodness. (And ye will not be asked) on the Day of Judgement (of what they used to do) in this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لمن تبعك يا أكمل الرسل تذكيراً لهم وتحذيراً: { تِلْكَ أُمَّةٌ } صالحة أو طالحة { قَدْ خَلَتْ } مضت { لَهَا } في النشأة الأخرى جزاء { مَا كَسَبَتْ } من الحسنات والسيئات في النشأة الأولى { وَلَكُمْ } فيها جزاء { مَّا كَسَبْتُمْ } فيها { وَلاَ تُسْأَلُونَ } أنتم في يوم الجزاء { عَمَّا كَانُواْ يَعْمَلُونَ } [البقرة: 141] من الصالحات والفاسدات كما لا يسألون عن أعمالكم بل كل مجزي بصنيعه، مقتضٍ ببضاعته\n\n\n\n\nنعوذ بفضلك من عذابك يا دليل المتحيرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}