{
  "chapter": "البقرة",
  "text": "الذين ءاتينهم الكتب يعرفونه كما يعرفون ابناءهم وان فريقا منهم ليكتمون الحق وهم يعلمون",
  "translations": [
    {
      "translation": "Those to whom We have sent down the Book know this even as they know their sons. Yet a section among them conceals the truth knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those to whom We gave the Book, they recognise the place (which has now been made giblah), as clearly as they recognise their own children. But some of them are knowingly concealing the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book (Bible), know you (Muhammad) just as a well as they know their sons. It is certain that some of them deliberately hide the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We gave the Book(s) recognise the Prophet (Mohammed – peace and blessings be upon him) as men (or they) recognise their own sons; and undoubtedly a group among them purposely conceals the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We gave the Scripture (Jews and Christians) recognise him (Muhammad or the Ka`bah at Makkah) as they recognize their sons. But verily, a party of them conceal the truth while they know it ـ [i.e., the qualities of Muhammad which are written in the Tawrah and the Injil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him as they recognize their sons, and a party of them most surely conceal the truth while they know (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whom We have given the Book, and they recognize as they recognize their sons, even though there is a party of them conceal the truth and that wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We gave the Scripture recognise (this revelation) as they recognise their sons. But lo! a party of them knowingly conceal the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it just as they recognize their own sons. But, some of them knowingly conceal the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We have vouchsafed the Book recognise him even as they recognise their children; and verily a party of them hide the truth while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him just as they recognize their sons, but a part of them indeed conceal the truth while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book know this as they know their own sons; but some of them conceal the truth which they themselves know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We gave the Scripture (Jews and Christians) recognise him (Muhammad SAW or the Ka'bah at Makkah) as they recongise their sons. But verily, a party of them conceal the truth while they know it - [i.e. the qualities of Muhammad SAW which are written in the Taurat (Torah) and the Injeel (Gospel)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We gave the Book know him (Prophet Muhammad) as they know their own sons. But a party of them conceal the truth while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it as they recognize their own children. But some of them conceal the truth while they know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We gave the Scripture know him as they know their own sons. But indeed, a party of them conceal the truth while they know [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:146] Those to whom We have given the Scripture, they recognise him, Muhammad (s), as they recognise their sons, because of the descriptions of him in their Scripture: [‘Abd Allāh] Ibn Salām said, ‘I recognised him the moment I saw him, as I would my own son; but my recognition of Muhammad (s) was more intense’; even though there is a party of them that conceal the truth, that is, his description, while they know, this [truth] which you [Muhammad (s)] follow.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentions the believers of the people of the Book, saying: (Those unto whom We gave the Scripture) gave the knowledge of the Torah, 'Abdullah ibn Salam and his followers (recognise) know Muhammad (pbuh) with his description and traits (as they recognise their children) in the midst of other children. (But lo! A party of them) of the people of the Book (knowingly) knowing it to exist in their Book (conceal the Truth) conceal the description and traits of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } المبين لهم طريق توحيد الصفات والأفعال، المنبه لهم على توحيد الذات، وعلى من يظهر به وهم { يَعْرِفُونَهُ } بالأوصاف والخواص المبين في كتابهم { كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ } الذين خلقوا من أصلابهم، بل أشد من ذلك لإمكان الخلاف فيه دونه { وَ } مع ذلك { إِنَّ فَرِيقاً مِّنْهُمْ } عناداً واستكباراً { لَيَكْتُمُونَ ٱلْحَقَّ } الثابت في كتابهم { وَهُمْ } أيضاً { يَعْلَمُونَ } [البقرة: 146] حقيته جزماً، ويكتمونه مكابرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الدين آتيناهم الكتاب } أي: اليهود { يعرفونه } أي: الرسول - عليه الصلاة والسلام - وإن لم يتقدم ذكره لدلالة الكلام عليه أو القرآن أو التحويل، { كما يعرفون أبناءهم } لا يشكُّون في صحة رسالته كما لايشكون في معرفة أبنائهم\n وعن عمر رضي الله عنه أنه سأل عبد الله بن سلام عن رسول الله صلى الله عليه وسلم فقال: أنا أعلَمُ بِه مِنِّي بِابني، قال له: ولِمَ؟ قال: لأنِّي لستُ أشُكُّ في محمدٍ أنه نبيُّ الله\n وأمَا ولَدِي فلعلَّ والدتَهُ قدْ خَانَتْ\n وبعد حصول هذه المعرفة لهم جحدوه وكتموا صفته، إلا من عصمة الله بالإيمان كعبد الله بن سلام وأصحابه - فقد كتم فريق منهم الحق وهم أحبارهم، وهم يعلمون أنه حق حسداً وعناداً",
      "translations": []
    }
  ]
}