{
  "chapter": "البقرة",
  "text": "ام تقولون ان ابرهم واسمعيل واسحق ويعقوب والاسباط كانوا۟ هودا او نصرى قل ءانتم اعلم ام الله ومن اظلم ممن كتم شهدة عنده من الله وما الله بغفل عما تعملون",
  "translations": [
    {
      "translation": "Or do you claim that Abraham and Ishmael and Isaac and Jacob and their offspring were Jews or Christians? Say: \"Have you more knowledge than God?\" Who is more wicked than he who conceals the testimony he received from God? God is not unaware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you say that Abraham, Ismail, Isaac, Jacob and his children were all Jews or Christians? Ask them, \"Do you know more than Allah does? And who is more unjust than the one who hides the testimony which Allah has entrusted to him? Allah is not unaware of what you are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone will be responsible for his own deeds. Do you (People of the Book) claim that Abraham, Ishmael, Isaac, and their descendants were Jews or Christians?\" Ask them, \"Who possesses greater knowledge, you or God? Who is more unjust than one who refuses to testify to the truth that God has given to him?\" God is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“In fact you claim that Ibrahim, and Ismail, and Ishaq, and Yaqub, and their offspring were Jews or Christians”; say, “Do you know better, or does Allah?”; and who is more unjust than one who has the testimony from Allah and he hides it? And Allah is not unaware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say you that Ibrahim, Isma`il, Ishaq, Ya`qub and Al-Asbat, were Jews or Christians Say, \"Do you know better or does Allah And who is more unjust than he who conceals the testimony he has from Allah And Allah is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! do you say that Ibrahim and Ismail and Yaqoub and the tribes were Jews or Christians? Say: Are you better knowing or Allah? And who is more unjust than he who conceals a testimony that he has from Allah? And Allah is not at all heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you say, \"Abraham, Ishmael, Isaac and Jacob, and the Tribes -- they were Jews, or they were Christians\"?' Say: 'Have you then greater knowledge, or God? And who does greater evil than he who conceals a testimony received from God? And God is not heedless of the things you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say ye that Abraham, and Ishmael, and Isaac, and Jacob, and the tribes were Jews or Christians? Say: Do ye know best, or doth Allah? And who is more unjust than he who hideth a testimony which he hath received from Allah? Allah is not unaware of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you claim that Abraham and Ishmael and Isaac and Jacob and their descendants were all Jews or Christians?\" Say, \"Do you know better or does God? And who could be more unjust than one who conceals a testimony given to him by God? God is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say ye that Ibrahim and Ismai'l and Ishaq and Ya'qub, and the tribes were Jews or Nazarenes? Say thou: are ye the more knowing or is Allah? And who is more unjust than he who hideth a testimony that is with him from Allah? And Allah is not neglectful of that which ye Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Ask them,] ‘Do you say that Abraham, Ishmael, Isaac, Jacob, and the Tribes were Jews or Christians?’ Say, ‘Is it you who know better, or Allah?’ And who is a greater wrongdoer than someone who conceals a testimony that is with him from Allah? And Allah is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do ye say that Abraham, Isma'il Isaac, Jacob and the Tribes were Jews or Christians? Say: Do ye know better than Allah? Ah! who is more unjust than those who conceal the testimony they have from Allah? but Allah is not unmindful of what ye do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say you that Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), Ya'qub (Jacob) and Al-Asbat [the twelve sons of Ya'qub (Jacob)] were Jews or Christians? Say, \"Do you know better or does Allah (knows better that they all were Muslims)? And who is more unjust than he who conceals the testimony [i.e. to believe in Prophet Muhammad Peace be upon him when he comes, written in their Books. (See Verse 7:157)] he has from Allah? And Allah is not unaware of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you say that Abraham, Ishmael, Isaac, Jacob, and the tribes, were Jews or Nazarenes! Say: 'Who knows better, you or Allah? Who is more unjust than he who hides a testimony received from Allah? And Allah is not inattentive of what you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you say that Abraham, Ishmael, Isaac, Jacob, and the Patriarchs were Jews or Christians? Say, “Do you know better, or God?” And who does greater wrong than he who conceals a testimony he has from God? God is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you say that Abraham and Ishmael and Isaac and Jacob and the Descendants were Jews or Christians? Say, \"Are you more knowing or is Allah?\" And who is more unjust than one who conceals a testimony he has from Allah? And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:140] Or, nay, do you say (taqūlūna, also read yaqūlūna, ‘do they say?’): ‘Abraham, Ishmael, Isaac and Jacob, and the Tribes — they were Jews, or they were Christians?’ Say, to them: ‘Have you then greater knowledge, or has God?, that is, God has greater knowledge; He dissociated Abraham from both [groups], when He said, Abraham was not a Jew, nor a Christian [Q. 3:67]; and those mentioned with him [Abraham] are his followers [in not belonging to either group]. And who does greater injustice than he who conceals, hides from people, a testimony, he has, received from God?, that is, there is none more unjust than him: these are the Jews, for they concealed God’s testimony about Abraham’s pure faith in the Torah; And God is not heedless of what you do’: [this is] a threat for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or say ye) Jews and Christians (that Abraham, and Ishmael, and Isaac and Jacob, and the tribes) the children of Jacob (were Jews or Christians) as you claim? (Say) to them, Muhammad! (Do ye know best, or doth Allah?) do you know best about their religion or does Allah? Allah has already informed us that Abraham was neither a Jew nor a Christian. (And who is more unjust) in his disbelief and more insolent and daring vis-a-vis Allah (than he who hideth a testimony which he hath received from Allah) in the Torah concerning the prophethood of this Prophet (pbuh)? (Allah is not unaware) heedless (of what ye do) about concealing your testimony. 23\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nأيسلم اليهود والنصارى ويذعنون بعدما أوضحنا لهم أنا على ملة إبراهيم دونهم؟ { أَمْ } تعاندون { تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَـاقَ وَيَعْقُوبَ وَالأَسْبَاطَ كَانُواْ هُوداً أَوْ نَصَارَىٰ } تابعين لملتنا فإن كابروا وعاندوا وقالوا مثل هذا { قُلْ } لهم يا أكمل الرسل مستفهماً مستوبخاً على وجه التنبيه: { أَأَنْتُمْ أَعْلَمُ } بحالهم { أَمِ ٱللَّهُ }؟ النافي عنهم اليهودية والنصرانية بقوله:\n\n[آل عمران: 67] مائلاً منهما، ثم ذرهم في خوضهم يلعبون { وَ } بعد ما ظهر عندهم حقية دين نبينا صلى الله عليه وسلم، وتحقق موافقة ملة أبيه إبراهيم بشهادة كتبهم ورسلهم { مَنْ أَظْلَمُ } على الله { مِمَّنْ كَتَمَ شَهَادَةً } ثابتة في كتب الله التي صحت { عِندَهُ } أنها منزلة { مِنَ ٱللَّهِ } المنزل للرسل والكتب، مصدقاً بعضها بعضاً كتماناً ناشئاً عن محض العداوة والشقاق بعد جزمهم حقيتها ومع ذلك يتوهمون كتمانها من الله أيضاً { وَمَا ٱللَّهُ } المحيط بمخايلهم { بِغَافِلٍ عَمَّا تَعْمَلُونَ } [البقرة: 140] من الكتمان والنفاق حفظاً لجاههم وجاه آبائهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل } لهم يا محمد: { أأنتم أعلم أم الله } وقد نفى الأمرين معاً عن إبراهيم فقال:\n\n[آل عِمران: 67]، وقال:\n",
      "translations": []
    }
  ]
}