{
  "chapter": "البقرة",
  "text": "ان الصفا والمروة من شعائر الله فمن حج البيت او اعتمر فلا جناح عليه ان يطوف بهما ومن تطوع خيرا فان الله شاكر عليم",
  "translations": [
    {
      "translation": "Truly Safa and Marwa are the symbols of God. Whoever goes on pilgrimage to the House (of God), or on a holy visit, is not guilty of wrong if he walk around them; and he who does good of his own accord will find appreciation with God who knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Safa and Marwah are among the emblems of Allah: it is, therefore, no sin for him, who performs Hajj or `Umrah to the House of AIIah, to run between the two hills; and Allah knows and appreciates him who does any good with a willing heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safa and Marwah (names of two places in Mecca) are reminders of God. It is no sin for one who visits the Sacred House (in Mecca) to walk seven times between (Safa and Marwah.) Whoever willingly does a good deed in obedience to God, will find God All-knowing and Fully Appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Safa and Marwah* are among the symbols of Allah; so there is no sin on him, for whoever performs the Hajj (pilgrimage) of this House (of Allah) or the Umrah (lesser pilgrimage), to go back and forth between them; and whoever does good of his own accord, then (know that) indeed Allah is Most Appreciative (rewards virtue), the All Knowing. (These are 2 hillocks near the Holy Ka’aba)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, As-Safa and Al-Marwah are of the symbols of Allah. So it is not a sin on him who performs Hajj or `Umrah (pilgrimage) of the House to perform Tawaf between them. And whoever does good voluntarily, then verily, Allah is All-Recognizer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the Safa and the Marwa are among the signs appointed by Allah; so whoever makes a pilgrimage to the House or pays a visit (to it), there is no blame on him if he goes round them both; and whoever does good spontaneously, then surely Allah is Grateful, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safa and Marwa are among the waymarks of God; so whosoever makes the Pilgrimage to the House, or the Visitation, it is no fault in him to circumambulate them; and whoso volunteers good, God is All-grateful, All-knowing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! (the mountains) As-Safa and Al-Marwah are among the indications of Allah. It is therefore no sin for him who is on pilgrimage to the House (of Allah) or visiteth it, to go around them (as the pagan custom is). And he who doeth good of his own accord, (for him) lo! Allah is Responsive, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safa and Marwah are among the symbols set up by God; there is nothing wrong if anyone goes on a pilgrimage to the House, or performs a minor pilgrimage, in walking to and fro between them. Of anyone who does good of his own accord, God is appreciative, and aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Safa and Marwa are of the landmarks of Allah; so whosoever maketh a pilgrimage to the House, or performeth the Umra, in him there is no fault if he walketh in-between the twain. And whosoever voluntarily doth good, then verily Allah is Appreciative, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Safa and Marwah are among Allah’s sacraments. So whoever makes hajj to the House, or performs the ‘umrah, there is no sin upon him to circuit between them. Should anyone do good of his own accord, then Allah is indeed appreciative, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! Safa and Marwa are among the Symbols of Allah. So if those who visit the House in the Season or at other times, should compass them round, it is no sin in them. And if any one obeyeth his own impulse to good,- be sure that Allah is He Who recogniseth and knoweth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! As-Safa and Al-Marwah (two mountains in Makkah) are of the Symbols of Allah. So it is not a sin on him who perform Hajj or 'Umrah (pilgrimage) of the House (the Ka'bah at Makkah) to perform the going (Tawaf) between them (As-Safa and Al-Marwah). And whoever does good voluntarily, then verily, Allah is All-Recogniser, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safah and Marwah are the waymarks of Allah. Whoever performs the pilgrimage to the House or the visit, there shall be no guilt on him to circumambulate between both of them. And whoever volunteers good, Allah is Thankful, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Safa and Marwa are among the rites of God. Whoever makes the Pilgrimage to the House, or performs the Umrah, commits no error by circulating between them. Whoever volunteers good—God is Appreciative and Cognizant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, as-Safa and al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs 'umrah - there is no blame upon him for walking between them. And whoever volunteers good - then indeed, Allah is appreciative and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:158] Truly Safā and Marwa, two mountains near Mecca, are among the waymarks (sha‘ā’ir, plural of sha‘īra) of God, the [ritual] ceremonies of His religion, so whoever makes the Pilgrimage to the House, or the Visitation, that is, whoever prepares to perform the Pilgrimage [hajj] or the Visitation [‘umra]: the original sense of both terms [hajja and i‘tamara] is ‘to aim for’ and ‘to visit’, respectively; he would not be at fault, [it would not be] a sin, if he circumambulates them (the original tā’ [of yatatawwafa, ‘circumambulate’] has been assimilated with the tā’), by pacing quickly (sa‘y) between them seven times: this was revealed when the Muslims were averse to this [circumambulation], because the pagan Arabs used to circumambulate them, and there was an idol atop each mountain which they used to stroke. It is reported from Ibn ‘Abbās that this pacing [between the two] is not obligatory, based on the fact that when no sin can be incurred, the context implies free choice. Al-Shāfi‘ī and others, however, considered it to be a pillar [of the Pilgrimage rituals]. The Prophet made clear its obligatory aspect when he said that, ‘God has prescribed for you the pacing [sa‘y]’, as reported by al-Bayhaqī and others; and he [the Prophet] also said, ‘Begin with what God has begun’, meaning, al-Safā, as reported by Muslim; and whoever volunteers (tatawwa‘a: a variant reading is yattawa‘, the ta’ here being assimilated) good, that is, any good deed such as circumambulation or other, that is not obligatory on him; God is Grateful, for such a deed and rewards that person for it, Knowing, it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the believers' dislike of going between al-Safa and al-Marwah in front of the idols which were placed there, saying: (Lo! Al-Safa and al-Marwah) going around al-Safa and al-Marwah (are among the rites of Allah) among the rites of pilgrimage that Allah, Exalted is He, has commanded. (It is therefore no sin) one commits no transgression (for him who is on pilgrimage to the House or visiteth it, to go around them (as the pagan custom is). And he who doeth good of his own accord) and whoever performs extra works other than this obligation of going between al-Safa and al-Marwah, (Lo! Allah is Responsive) accepts such works, (Aware) of your intentions; it is also said that this means: Allah accepts the smallest of your works and His reward is abundant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ } فالصَّفا والمَروَةُ جميعاً: الحَجَرُ\n ويُثنى الصَّفا؛ فيقالُ صفوان، ويُجمعُ\n فيقالُ أَصْفاءٌ وصِفِيٌّ وصَفا وصُفِيٌّ\n وتُثنى المَرْوَةُ؛ فيقالُ مَرْوتان وتُجمعُ؛ فيقالُ ثَلاثُ مَرْواتٍ، والكَثيرُ المَروُ\n\n\n\n\nوقولهُ تعالى: { مِن شَعَآئِرِ ٱللَّهِ } فالشَّعَائِرُ: ما أُشْعِرَ لِموقفٍ\n أَي ما أُعْلِمَ لِذَلِكَ\n واحدتُها شَعِيرةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما نبه سبحانه إلى الكعبة الحقيقية بالكعبة الصورية، أراد أن ينبه على علاماتها بعلاماتها: { إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ } أي: الظاهر والباطن { مِن شَعَآئِرِ ٱللَّهِ } وعلامات توحيجه { فَمَنْ حَجَّ } قصد { ٱلْبَيْتَ } الممثل من المنزل الحقيقي والمرجع الأصلي على الوجه المفروض { أَوِ ٱعْتَمَرَ } على الوجه المسنون قاصداً فيه التوجه إلى الذات الأحدي، معرضاً عن العلائق المانعة منه { فَلاَ جُنَاحَ } لا تعب ولا ضيق { عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا } أي: يسعى بينهما، معتقداً ارتباطهما إلى أن ينكشف باتحادهما { وَمَن تَطَوَّعَ } توجه نحوه { خَيْراً } زائداً على ما أمر وفرض { فَإِنَّ ٱللَّهَ } الميسر له { شَاكِرٌ } راضٍ بفعله { عَلِيمٌ } [البقرة: 158] بحاله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}