{
  "chapter": "البقرة",
  "text": "فاذكرونى اذكركم واشكروا۟ لى ولا تكفرون",
  "translations": [
    {
      "translation": "So, therefore, remember Me, and I shall remember you; and give thanks and do not be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me and I will remember you, and give thanks to Me and be not ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "therefore, remember Me and I shall remember you. Thank Me and do not hide the truth about Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remember Me, I will cause you to be spoken of and acknowledge My rights, and do not be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remember Me (by praying, glorifying). I will remember you, and be grateful to Me (for My countless favors on you) and never be ungrateful to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remember Me, I will remember you, and be thankful to Me, and do not be ungrateful to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me, and I will remember you; and be thankful to Me; and be you not ungrateful towards Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remember Me, I will remember you. Give thanks to Me, and reject not Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me; I will remember you. Be thankful to Me and do not be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Me wherefore, and I shall remember you: and unto Me give thanks, and be notingrate unto Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Me and I will remember you, and thank Me, and do not be ungrateful to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do ye remember Me; I will remember you. Be grateful to Me, and reject not Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remember Me (by praying, glorifying, etc.). I will remember you, and be grateful to Me (for My countless Favours on you) and never be ungrateful to Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me, I will remember you. Give thanks to Me and do not be ungrateful towards Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me, and I will remember you. And thank Me, and do not be ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remember Me; I will remember you. And be grateful to Me and do not deny Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:152] So remember Me, through prayer, glorification and the like, I will remember you: this is said to mean, ‘I will reward you’; in a hadīth about God [that He says]: ‘whoever remembers Me in himself, I will remember him in Myself, and whoever remembers Me in an assembly, I will remember him in an Assembly more excellent than his’; and be thankful to Me, for My grace, by being obedient, and be not ungrateful towards Me, through disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore remember Me) through the performance of acts of obedience, (I will remember you) by granting you Paradise; and it is also said that this means: remember Me in time of ease, I will remember you in times of hardship. (Give thanks to Me) for the blessings I bestowed upon you, (and reject not Me) do not stop 25 giving thanks for these blessings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَٱذْكُرُونِيۤ أَذْكُرْكُمْ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ اذكروني بطاعتي، أَذْكُرْكُمْ بمَغْفِرتِي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا أنعمنا عليكم بهذه النعم العظام وأتممناها لكم { فَٱذْكُرُونِيۤ } أيها المؤمنون بالميل الدائم والتوجه الصادق { أَذْكُرْكُمْ } بنفساتٍ رحمانيةٍ ونسماتٍ روحانيةٍ { وَٱشْكُرُواْ لِي } بإسناد النعم إلي { وَلاَ تَكْفُرُونِ } [البقرة: 152] بإسنادها إلى الوسائط والأسباب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}