{
  "chapter": "البقرة",
  "text": "ولنبلونكم بشىء من الخوف والجوع ونقص من الامول والانفس والثمرت وبشر الصبرين",
  "translations": [
    {
      "translation": "Be sure We shall try you with something of fear and hunger and loss of wealth and life and the fruits (of your labour); but give tidings of happiness to those who have patience,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely put you to trial by involving you in fear and hunger and by causing loss of property, life and earnings. And give good tidings to those who remain steadfast in these trials:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall test you through fear, hunger, loss of life, property, and crops. (Muhammad), give glad news to the people who have patience\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will surely test you with some fear and hunger, and with paucity of wealth and lives and crops; and give glad tidings to those who patiently endure. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly, We shall test you with something of fear, hunger, loss of wealth, lives and fruits, but give glad tidings to As-Sabirin (the patient).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will most certainly try you with somewhat of fear and hunger and loss of property and lives and fruits; and give good news to the patient,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We will try you with something of fear and hunger, and diminution of goods and lives and fruits; yet give thou good tidings unto the patient\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely We shall try you with something of fear and hunger, and loss of wealth and lives and crops; but give glad tidings to the steadfast,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall certainly test you with fear and hunger, and loss of property, lives and crops. Give good news to those who endure with fortitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will surely prove you with aught of fear and hunger and diminution in riches and lives and fruits; and bear thou the glad tidings unto the patient;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely test you with a measure of fear and hunger and a loss of wealth, lives, and fruits; and give good news to the patient\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be sure we shall test you with something of fear and hunger, some loss in goods or lives or the fruits (of your toil), but give glad tidings to those who patiently persevere,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly, We shall test you with something of fear, hunger, loss of wealth, lives and fruits, but give glad tidings to As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall test you with something of fear and hunger, and decrease of goods, life and fruits. Give glad tidings to the patient,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will certainly test you with some fear and hunger, and some loss of possessions and lives and crops. But give good news to the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:155] Surely We will try you with something of fear, of an enemy, and hunger, by way of drought, and diminution of goods, as a result of destruction, and lives, as a result of slaughter, death and disease, and fruits, by way of crop damage: that is to say, We will try you to see if you practise patience or not; yet give good tidings, of Paradise, to the patient, during calamities;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He mentioned His trial to the believer, saying: (And surely We shall try you) test you (with something of fear) fear of the enemy (and hunger) in the years of drought, (and loss of wealth and lives) through killing, death and illnesses (and crops) and the loss of crops;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَنَبْلُوَنَّكُمْ } والله لنختبرن ولنجربن تمكنكم ورسوخكم في توحيد الذات { بِشَيْءٍ } قليلٍ مما يشعر بالكثرة والاثنينية { مِّنَ ٱلْخَوْفِ } الحاصل من المنفرات الخارجية: مثل الحرق والغرق والعدو وغير ذلك { وَٱلْجُوعِ } الحاصل من المنفرات الداخلية، كالحرص والأمل والبخل وغيرها { وَنَقْصٍ مِّنَ ٱلأَمَوَالِ } التي يميل قلوبكم إليها بالطبع { وَٱلأَنفُسِ } التي تظاهرون وتفتخرون بها من الأولاد والإخوان والأقارب والعشائر { وَٱلثَّمَرَاتِ } المرتبة على الأموال والأولاد من الجاه، والمظاهرة في الغلبة على الخصماء { وَبَشِّرِ } يأ اكمل الرسل { ٱلصَّابِرِينَ } [البقرة: 155] من أهل التوحيد وهم:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  ثم قال الحق جلّ جلاله: ولنختبركم يا معشر المسلمين { بشيء } قليل { من الخوف } لهيجان العدو وصولة الكفار، { والجوع } لغلاء الأسعار وقلة الثمار، { ونقص من الأموال } بموت الحيوان وتعذر التجارة أو الخسران، { والأنفس } بالموت في الجهاد، { والثمرات } بذهابها بالجوائح\n وعن الشافعي رضي الله عنه: الخوفُ خوفُ الله، والجوعُ صومُ رمضان، والنقصُ من الأموال بالزكوات والصدقات، ومن الأنفسُ بالأمراض، ومن الثمرات مَوتُ الأولاد\n وعن النبيّ صلى الله عليه وسلم:\n\n \" إذا ماتَ ولَدُ العبد قال اللّهَ للملائكةِ: أقَبَضْتُمْ ولَدَ عَبدي؟ فيقولون: نَعَم\n فيقولُ اللّهُ تعالى: أقبضتم ثمرة قلبه؟ فيقولون: نعم\n فيقول اللّهُ تعالى: ماذا قال؟ فيقولون: حَمِدَك واستَرْجَع، فيقول الله تعالى: ابْنُوا لعَبْدِي بَيْتاً في الجَنَّةِ وسَمُّوه بَيْتَ الحمدِ \"\n \n\n \n",
      "translations": []
    }
  ]
}