{
  "chapter": "البقرة",
  "text": "ولا تقولوا۟ لمن يقتل فى سبيل الله اموتۢ بل احياء ولكن لا تشعرون",
  "translations": [
    {
      "translation": "Do not say that those who are killed in the way of God, are dead, for indeed they are alive, even though you are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say of those who are slain in the way of Allah, \"they are dead.\" In fact, they are alive but you do not perceive that life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consider those who are slain for the cause of God to be dead. They are alive but you are unaware of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not utter regarding those who are slain in Allah's cause as “dead”; in fact they are alive, but it is you who are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not of those who are killed in the way of Allah, \"They are dead.\" Nay, they are living, but you perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not speak of those who are slain in Allah's way as dead; nay, (they are) alive, but you do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not of those slain in God's way, 'They are dead'; rather they are living, but you are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call not those who are slain in the way of Allah \"dead.\" Nay, they are living, only ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not say that those who are killed in God's cause are dead; they are alive, but you are not aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not of those who are slain in the way of Allah: dead. Nay, they are living, but ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not call those who were slain in Allah’s way ‘dead.’ No, they are living, but you are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not of those who are slain in the way of Allah: \"They are dead.\" Nay, they are living, though ye perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say not of those who are killed in the Way of Allah, \"They are dead.\" Nay, they are living, but you perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not say that those killed in the Way of Allah are dead, they are alive, although you are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say of those who are killed in the cause of God, “Dead.” Rather, they are alive, but you do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not say about those who are killed in the way of Allah, \"They are dead.\" Rather, they are alive, but you perceive [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:154] And say not of those slain in God’s way, that, ‘They are dead’; rather they are living, their spirits are, according to a hadīth, contained in green birds that take wing freely wherever they wish in Paradise; but you are not aware, [but you] do not know their condition.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah thereafter mentions the saying of the hypocrites apropos the martyrs of Badr, Uhud and all the other battles: \"So-and-so has died and lost all comfort and happiness\", this in order to aggravate sincere believers, and so Allah says: (And call not those who are slain in the way of Allah) in obedience of Allah, on the Day of Badr or in any other battle (\"dead\") like any other dead people. (Nay they are living) they are rather living like those living in Paradise, being provided with comfort and bounties, (only ye perceive not) you are not aware of the honour bestowed upon them or of their real state.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مما يستعان فيه بالصبر إلى أن ينشكف سترة: الجهاد لذلك { لاَ تَقُولُواْ لِمَنْ يُقْتَلُ فِي سَبيلِ ٱللَّهِ } طالباً الوصول إلى بابه { أَمْوَاتٌ } كالأموات الأخر { بَلْ أَحْيَاءٌ } بحية الله الأزلي السرمدي { وَلَكِن لاَّ تَشْعُرُونَ } [البقرة: 154] بحياتهم بحياتكم المستعارة المستهلكة في الحياة الأزلية، بل هي عكس منها موت في نفسها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أحياء } و { أموات } خبران عن مبتدأ مضمر، والابتلاء هو الاختبار، حيثما ورد في القرآن، ومعناه في حقه تعالى: أنه يظهر في الوجود ما في علمه لتقوم الحجة على العبد، وليس كاختبار الناس بعضهم بعضاً لأن الله علم ما كان وما يكون، والصلاة هنا المغفرة والتطهير، والرحمة: اللطف والإحسان\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا استعينوا } على نيل رضواني وبرِّي وإحساني { بالصبر } على مشاق الطاعات وترك المعاصي والهفوات، وبالصلاة التي هي أم العبادات، ومحل المناجاة ومعدن المصافاة، فيها تشرق شوارق الأنوار، وتتسع ميادين الأسرار، وهي معراج أرواح المؤمنين ومناجاة رب العالمين، فإن تجرعتم مرارة الصبر فإن { الله مع الصابرين } ، وأعظم مواطن الصبر عند مفارقة الأحباب، وذهاب العشائر والأصحاب، فإن كان موتهم في الجهاد فلا ينبغي لأجلهم أسف ولا نكاد لأنهم { أحياء عند ربهم يرزقون } ، وكذلك من ألحق بهم من ذي هَدْم وغَرَق وحرق ونفاسٍ وطاعون، فلا تقولوا لمن يقتل { في سبيل الله } من هؤلاء: هم { أموات } ، { بل } هم { أحياء } حياة روحانية لا بشرية، { ولكن لا تشعرون } بحياتهم لأنهم مجرد أرواح، وأنتم لبستم طلسم الأشباح، فاختفى عنكم مقام الأرواح، وكذلك أرواح المؤمنين كلهم أحياء\n وإنما خصّ الشهداء لمزيد بهجة وكرامة\n وإجراء رزقهم عليهم دون غيرهم، ففي الحديث:\n\n \" أرْواحُ الشُّهَداءِ في حَواصِل طَيرٍ خضرٍ تَعَلقُ مِنْ وَرَقِ الجَنة \" \n\nأي: تأكل، وفي حديث آخر:\n\n \" يَخْلُقُ اللهُ الشهداءَ جُسوماً على صُورةٍ طيرٍ خُضرٍ، فتكونُ في حَواصِلهَا، فَتسْرحُ بِها في الجَنة، وتأكلُ مِنْ ثمارِها، وتنالُ مِنْ خَيراتِها ونَعِيمها، حتى تُحشرَ مِنها يومَ القِيامَةِ \"\n \n\nولا يدخل الجنة أحد غيرهم إلى ميقاتها إلا الصدِّيقون، وهم العارفون، فهم أعظم من الجميع لمزيد تصرف وإدراك وسعة روح وريحان، وتحقق شهود وعيان، فهم في نعيم الجنان كالشهداء، لكن الصديقين غير محصورين في حواصل الطيور، بل لهم هياكل وصور سرحوا بها حيث شاءوا\n وكذلك من فوقهم من الأنبياء والرسل، والله تعالى أعلم",
      "translations": []
    }
  ]
}