{
  "chapter": "البقرة",
  "text": "الذين اذا اصبتهم مصيبة قالوا۟ انا لله وانا اليه رجعون",
  "translations": [
    {
      "translation": "Who say when assailed by adversity: \"Surely we are for God, and to Him we shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when a misfortune comes to them, they say, \"We are Allah's and we shall certainly return to Him,''\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in difficulty say, \"We are the servants of God and to Him we shall all return\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say when calamity befalls them, “Indeed we belong to Allah and indeed it is to Him we are to return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when afflicted with calamity, say: \"Truly, to Allah we belong and truly, to Him we shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when a misfortune befalls them, say: Surely we are Allah's and to Him we shall surely return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, when they are visited by an affliction, say, 'Surely we belong to God, and to Him we return';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who say, when a misfortune striketh them: Lo! we are Allah's and lo! unto Him we are returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, when afflicted with a calamity, \"We belong to God and to Him we shall return,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when there afflicteth them an affliction, say: verily we are Allah's, and verily unto Him we are returners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who, when an affliction visits them, say, ‘Indeed we belong to Allah and to Him do we indeed return.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who say, when afflicted with calamity: \"To Allah We belong, and to Him is our return\":-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when afflicted with calamity, say: \"Truly! To Allah we belong and truly, to Him we shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who, in adversity say: 'We belong to Allah and to Him we shall return'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who, when a calamity afflicts them, say, “To God we belong, and to Him we will return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who, when disaster strikes them, say, \"Indeed we belong to Allah, and indeed to Him we will return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:156] those who, when they are struck by an affliction, a calamity, say, ‘Surely we belong to God, we are His possession and servants, with whom He does as He pleases; and to Him we will return’, in the Hereafter, whereupon He will requite us: in one hadīth [it is said that], ‘whoever pronounces the istirjā‘ [sc. the formula ‘surely we belong to God and to Him we will return’] when an affliction befalls him, God will reward him and compensate him with what is better’. Similarly, it is said that on one occasion when his lamp blew out, the Prophet (s) uttered the istirjā‘, whereupon ‘Ā’isha said to him, saying: ‘But, it is just a lamp’, to which he replied, ‘Whatever bothers a believer is an affliction [of sorts]’: this is reported by Abū Dāwūd in his [section on] mursal reports.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "but then He said: (but give) Muhammad (glad tidings to the steadfast, who say, when a misfortune) like the ones I have mentioned (striketh them: lo! We are Allah's) we are the slaves of Allah (and lo! Unto Him we are returning) after we die; and if we are not pleased with His decree, He will not be pleased with our works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ إِذَآ أَصَابَتْهُم مُّصِيبَةٌ قَالُواْ } بلسان الجمع: { إِنَّا } ظلال { للَّهِ } الواحد الأحد المتجلي بأسمائه الحسنى، وصفاته العليا في النشأة الأولى { وَإِنَّـآ } بعد رجوعنا في النشأة الأخرى { إِلَيْهِ } لا إلى غيره من الأظلال { رَاجِعُونَ } [البقرة: 156] عائدون صائرون رجوع الظل إلى ذل ظل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وبشر الصابرين } يا من تتأتَّى منه البشارة { الذين إذا أصباتهم مصيبة } في بدن أو أهل أو مال أو صاحب { قالوا إنا لله } ملكاً وعبيداً يحكم فينا بما يريد { وإنا إليه راجعون } فيجازينا بما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، فتغيب مصائب الدنيا في جانبه\n وفي الحديث:\n\n \" من أصابته مُصيبةٌ فقال: إنَّا لله وإنا إليه راجعُون\n اللهم أجُرْنِي في مُصيبَتِي واخْلُفْ لي خَيْراً منها، إلا أَخْلَفَ الله له خيراً مما أصابه \" \n\nقالت أم سَلَمَة: فلما ماتَ زوجي أبو سَلَمَة قلتَ ذلك، فأبدلني الله برسوله صلى الله عليه وسلم",
      "translations": []
    }
  ]
}