{
  "chapter": "البقرة",
  "text": "الله يستهزئ بهم ويمدهم فى طغينهم يعمهون",
  "translations": [
    {
      "translation": "But God will turn the joke against them and allow them to sink deeper into evil and wander perplexed in their wickedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Little do they realize that) Allah is mocking at them. He gives them rope enough, and they wander on and on blindly in their mischief and rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God mocks them and gives them time to continue blindly in their transgressions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (befitting His Majesty) mocks them, leaving them to wander blindly in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah mocks at them and leaves them increasing in their deviation to wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah shall pay them back their mockery, and He leaves them alone in their inordinacy, blindly wandering on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall mock them, and shall lead them on blindly wandering in their insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (Himself) doth mock them, leaving them to wander blindly on in their contumacy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will requite them for their mockery, and draw them on, for a while, to wander blindly in their insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah mocketh back at them, and letteth them in their exorbitance wander bewildered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who derides them, and leaves them bewildered in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will throw back their mockery on them, and give them rope in their trespasses; so they will wander like blind ones (To and fro).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah mocks at them and gives them increase in their wrong-doings to wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will mock at them and prolong them in sin, blundering blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who ridicules them, and leaves them bewildered in their transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[But] Allah mocks them and prolongs them in their transgression [while] they wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:15] God [Himself] mocks them, requiting them for their mockery, leaving them, that is, giving them respite, in their insolence, that is, in their transgressing the limits of unbelief; bewildered, wavering, in perplexity (ya‘mahūn is a circumstantial qualifier).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah (Himself) doth mock them), in the Hereafter, i.e. He will open a gate of Paradise for them and then shut it before their eyes and so the believers will mock them. (Leaving them to wander blindly on in their contumacy) He will leave them in this world blind in their disbelief and error, unable to see either faith or guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { ٱللَّهُ يَسْتَهْزِىءُ بِهِمْ } أي يَجهَلهُمْ\n { وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ } أي يُمْهِلُهُمْ\n والطّغْيَانُ: الضَّلالَةُ\n يَعْمَهُونَ: أَي يَتَردَّدُونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم في غاية انهماكهم في الغي والضلال، وهم مقرون جازمون بأنهم يستهزئون، بل هم في الحقيقة مستهزئون إذ: { ٱللَّهُ } المحيط بجميع مخايلهم الباطلة وأفكارهم الفاسدة { يَسْتَهْزِئُ بِهِمْ } في كل لحظة وطرفة آناً فآناً { وَ } لم يشعرهم باستهزائه بل { يَمُدُّهُمْ } يمهلهم ويسوفهم { فِي طُغْيَانِهِمْ } المتجاوز عن الحد في الضلالة بتلبيس الأمر على الله وعلى المؤمنين { يَعْمَهُونَ } [البقرة: 15] يترددون إقداماً وإحجاماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ردّ الله تعالى عليهم فقال: { اللَّهُ يَسْتَهْزِئُ بِهِمْ } أي: يفعل بهم فعل المستهزئ بأن يفتح لهم باباً إلى الجنة وهم في النار، ويطلع المؤمنين عليهم، فيقول لهم: ادخلوا الجنة، فإذا جاءوا يستبقون إليها وطمعوا في الدخول، سُدَّتْ عليهم ورجعوا إلى النار،\n\n[المطفّفِين: 34] الآية",
      "translations": []
    }
  ]
}