{
  "chapter": "البقرة",
  "text": "او۟لئك عليهم صلوت من ربهم ورحمة واو۟لئك هم المهتدون",
  "translations": [
    {
      "translation": "On such men are the blessings of God and His mercy, for they are indeed on the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Lord will bestow great blessings and mercy upon them; such are the people who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who will receive blessings and mercy from God and who follow the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people upon whom are the blessings from their Lord, and mercy; and it is they who are on guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those on whom are the Salawat (i.e., who are blessed and will be forgiven) from their Lord, and (they are those who) receive His mercy, and it is they who are the guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they on whom are blessings and mercy from their Lord, and those are the followers of the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon those rest blessings and mercy from their Lord, and those -- they are the truly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are they on whom are blessings from their Lord, and mercy. Such are the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "are the ones who will have blessings and mercy from their Lord: it is they who are on the right path!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! on them shall be benedictions from their Lord and His mercy, and these! they are the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who receive the blessings of their Lord and [His] mercy, and it is they who are the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those on whom (Descend) blessings from Allah, and Mercy, and they are the ones that receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those on whom are the Salawat (i.e. blessings, etc.) (i.e. who are blessed and will be forgiven) from their Lord, and (they are those who) receive His Mercy, and it is they who are the guided-ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On those will be prayers and mercy from their Lord, those are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon these are blessings and mercy from their Lord. These are the guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones upon whom are blessings from their Lord and mercy. And it is those who are the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:157] Upon those rest blessings, forgiveness, and mercy, grace, from their Lord, and those — they are the truly guided, to rectitude.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such) those who have these traits (are they on whom are blessings) forgiveness (from their Lord) in this world, (and mercy) in that they are not tormented in the Hereafter. (And such are they who are rightly guided) to remember that we are Allah's and unto Him we shall return.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أُولَـٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ } قالَ زيدُ بن علي عليهما السلامُ: فالصَّلاةُ مِنَ الله تَعالى: رَحمةٌ، ومن المَلائكةِ والنَّاسِ: الدعاءُ\n والصَّلواتُ: الكَنائسُ\n وهو قولُهُ تعالى:\n\n[الحج: 40]\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } السعداء المتمكنون في مقر التوحيد المنزهون عن الإطلاق والتقييد { عَلَيْهِمْ } لا على غيرهم من أصحاب المراتب { صَلَوَاتٌ } ميول وتوجيهات متشبعة من بحر الذات، جارية من جداول الأوصاف والأسماء إلى فضاء الظهرو؛ لإنبات المعارف والحقائق الموصلة إلى النعيم الدائم السرمدي واللذة المستمرة الأبدية، نازلة لهم دائماً { مِّن رَّبِّهِمْ } الذي أوصلهم إلى مقر عزه { وَرَحْمَةٌ } شاملة لهم ولغيرهم من سعتها { وَأُولَـٰئِكَ } الواصلون { هُمُ ٱلْمُهْتَدُونَ } [البقرة: 157] إلى المبدأ الحقيقي والمنزل الأصلي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك } الصابرون الراجعون إلى الله { عليهم صلوات } أي: مغفرة وتطهير { من ربهم ورحمة } أي: عطف ولطف { وأولئك هم المهتدون } لكل خير في الدنيا والآخرة\n الإشارة: يا أيها الذين آمنوا بطريق الخصوص استعينوا على سلوك طريق حضرتنا ومشاهدة أنوار قدسنا بالصبر على ما تكره النفوس من ترك الحظوظ والشهوات، والميل إلى العادات والمألوفات، وبالصلاة الدائمة، وهي صلاة القلوب بالعكوف في حضرة الغيوب\n { إن الله مع الصابرين } بالمعونة والتأييد، وإشراق أنوار التوحيد، ولا تقولوا لمن ترونه قتل نفسه بالذل والافتقار، وخرق العوائد وخلع العذار: إنه قد مات، بل هو حي لا يموت، قال الله تعالى: { لا يذوقون فيها الموت إلا الموتة الأولى } فإذا ماتت نفس المريد\n واستوى عنده الذل والعز والمدح والذم، والغنى والفقر، والموت والحياة، فقد حييت روحه واتسع عليها فضاء الشهود، وتمتعت بالنظرة إلى الملك المعبود، فلا يزيدها الموت الحسيّ إلا اتصالاً وتمتعاً وشهوداً، فهي في الترقي أبداً سرمداً، ولكن لا تشعرون بما هم فيه في هذه الدار وفي تلك الدار\n ويقال لهم عند إرادة سلوكهم الطريق إلى عين التحقيق: والله لنبلونكم يا معشر المريدين بشيء من إذاية الخلق وتضييق الرزق، وذهاب الأموال، وضعف الأبدان بالمجاهدة، وتأخير الفتح بظهور ثمرة المشاهدة ليظهر الصادق في الطلب الثبوت في أحكام العبودية، حتى تشرق عليها أنوار الربوبية، ومن الكاذب بالرجوع إلى العوائد والشهوات، والركون إلى الرخص والتأويلات، { وبشر الصابرين } الثابتين في الطلب، بالظفر بكل ما أمَّلُوا، وبالوصول إلى ما إليه رحلوا، الذين إذا أصابتهم نكبة أو وقفة تحققوا بضعف العبودية، وتعلقوا بقوة الربوبية، فرجعوا إلى الله في كل شيء، فآواهم إليه من كل شيء، أولئك عليهم تَحنُّنٌ من ربهم وتقريب، وهم المهتدون إلى جوار الحبيب\n قال ابن جزي: فائدة: وَرَدَ ذكر الصبر في القرآن في أكثر من سبعين موضعاً وذلك لعظم موقعه في الدين، قال بعض العلماء: كل الحسنات لها أجر معلوم إلا الصبر، فإنه لا يحصر أجره لقوله تعالى:\n\n[الزمر: 10]\n وذكر الله للصابرين ثمانياً من الكرامات\n أولها: المحبة، قال:\n\n[آل عِمرَان: 146]، والثاني: النصر، قال:\n\n[البَقَرَة: 153]، والثالث: غرفات الجنة، قال:\n\n[الفرقان: 75] والرابع: الأجر الجزيل، قال: { إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ } والأربعة الأخرى المذكورة في هذه الآية، فمنها البشارة قال: { وبشر الصابرين } ، والصلاة والرحمة والهداية قال: { أُوْلَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةُ وَأُوْلَئِكَ هُمُ الْمُهْتَدُونَ }\n والصبر على أربعة أوجه: صبر على البلاء، وهو منع النفس عن التسخط والهلع والجزع، وصبر على النعم، وهو تقييدها بالشكر وعدم الطغيان والتكبّر بها، وصبر على الطاعة بالمحافظة والدوام عليها، وصبر على المعاصي بكف النفس عنها\n وفوق الصبر التسليم، وهو ترك الاعتراض والتسخط ظاهراً، وترك الكراهية باطناً، وفوق التسليم الرضا بالقضاء، وهو سرور النفس بفعل الله، وهو صادر على المحبة، وكل ما يفعل المحبوب\n هـ\n ولمّا ذكر الحقّ تعالى الكعبة، وأمر بالتوجهة إليها، ناسب أن يذكر الصفا والمروة لقربهما منها ومشاركتهما لها في أمر الدين، وذلك أن الصحابة تحرجوا أن يطوفوا بهما لأن الصفا كان عليه صنم يقال له إِسَاف، وعلى المروة صنم يقال له نائلة، فخافوا أن يكون الطواف بينهما تعظيماً لهما، فرفع الله ذلك\n\n",
      "translations": []
    }
  ]
}