{
  "chapter": "البقرة",
  "text": "ان الذين يكتمون ما انزلنا من البينت والهدى منۢ بعد ما بينه للناس فى الكتب او۟لئك يلعنهم الله ويلعنهم اللعنون",
  "translations": [
    {
      "translation": "They who conceal Our signs and the guidance We have sent them and have made clear in the Book, are condemned of God and are condemned by those who are worthy of condemning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah curses, and the cursers, too, curse those who conceal the clear teachings and guidance We have sent down, after We have made these plain in the Book for the guidance of all mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hide the authoritative proofs and the guidance that We have revealed, after it has been made clear for the People of the Book, will be condemned by God and those who have the right to condemn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who hide the clear proofs and the guidance which We sent down, after We made it clear to mankind in the Book – upon them is the curse of Allah and the curse of those who curse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who conceal the clear proofs, evidences and the guidance, which We have sent down, after We have made it clear for the People in the Book, they are the ones cursed by Allah and cursed by the cursers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who conceal the clear proofs and the guidance that We revealed after We made it clear in the Book for men, these it is whom Allah shall curse, and those who curse shall curse them (too).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal the clear signs and the guidance that We have sent down, after We have shown them clearly in the Book -- they shall be cursed by God and the cursers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Those who hide the proofs and the guidance which We revealed, after We had made it clear to mankind in the Scripture: such are accursed of Allah and accursed of those who have the power to curse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal the evidence of the truth and the guidance We have revealed, after We have made them clear to people in the Scripture, will be rejected by God and so do others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who hide that which We have sent down of evidence and the guidance, after We have expounded its Unto mankind in the Book, these! - curseth them Allah, and shall curse them the cursers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who conceal what We have sent down of manifest proofs and guidance, after We have clarified it in the Book for mankind—they shall be cursed by Allah and cursed by the cursers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who conceal the clear (Signs) We have sent down, and the Guidance, after We have made it clear for the people in the Book,-on them shall be Allah's curse, and the curse of those entitled to curse,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who conceal the clear proofs, evidences and the guidance, which We have sent down, after We have made it clear for the people in the Book, they are the ones cursed by Allah and cursed by the cursers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who hide the clear verses and the guidance We have sent down after We have clarified them in the Book for the people shall be cursed by Allah and cursed by the cursers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who suppress the proofs and the guidance We have revealed, after We have clarified them to humanity in the Scripture—those—God curses them, and the cursers curse them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who conceal what We sent down of clear proofs and guidance after We made it clear for the people in the Scripture - those are cursed by Allah and cursed by those who curse,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:159] The following was revealed concerning the Jews: Those who conceal, from people, the clear proofs and the guidance that We have revealed, such as the ‘stoning’ verse and the description of Muhammad (s), after We have shown them clearly in the Scripture, the Torah — they shall be cursed by God, that is, He will move them far away from His mercy, and by the cursers, the angels, believers, or by every single thing, when they supplicate that they be cursed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who hide the proofs) the commands, prohibitions and the signs mentioned in the Torah (and the guidance) i.e. the description given there of Muhammad (pbuh) and his feature (which We revealed) exposited, (after We had made it clear) to the Children of Israel (in the Scripture) in the Torah: (such are accursed of Allah) Allah will torment them in the grave (and are accursed of those who have the power to curse) all created beings, save human beings and jinn, will curse them upon hearing their screams from the grave. 26\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَيَلْعَنُهُمُ ٱللاَّعِنُونَ } معناهُ هوامُّ الأَرضِ مثل الخَنافِسِ والعَقارِبِ، ومَا أَشبههَا\n ويقالُ المَلائِكةُ عليهمُ السَّلامُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ يَكْتُمُونَ } يسترون { مَآ أَنزَلْنَا } في التوراة { مِنَ ٱلْبَيِّنَاتِ } الدالة على ظهور من يغلب عليه توحيد الذات { وَٱلْهُدَىٰ } المشير إلى أنه مبعوث إلى كافة البرايا، ناسخ لجميع الأديان؛ إذ به يتم أمر التكميل ولا بعثه بعد ظهوره، بل ختم به صلى الله عليه وسلم أمر الإرسال والإنزال والتديين والتشريع، والحال أن كتمانهم { مِن بَعْدِ مَا بَيَّنَّاهُ } أوضحناه بلا ستره { لِلنَّاسِ } الناظرين { فِي ٱلْكِتَابِ } أي: التوراة { أُولَـٰئِكَ } الكاتمون المفرطون { يَلعَنُهُمُ ٱللَّهُ } أي: يطردهم ويبعدهم عن عز حضوره لخروجهم عن اعتدال العبودية بكتمان ما أراد الله ظهوره { وَيَلْعَنُهُمُ } أيضاً { ٱللاَّعِنُونَ } [البقرة: 159] المتمتعون باعتدال العبودية المستقيمون على ما أمروا بقدر وسعهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في { فيها }: يعود على اللعنة أو النار، وإضمارها قبل الذكر تفخيماً لشأنها، وتهويلاً لأمرها\n يقول الحقّ جلّ جلاله في شأن أحبار اليهود حيث كتموا صفة الرسول صلى الله عليه وسلم: { إن الذين يكتمون } ما أنزلناه عليهم في كتابهم من صفة محمد - عليه الصلاة والسلام - من الآيات لاواضحات في شأنه، وبيان صفته وبلده وشريعته، وما يهدي إلى وجوب اتباعه، والإيمان به، { من بعد ما بيناه للناس } في التوراة، { أولئك } الكاتمون { يلعنهم الله } ويطردهم عن ساحة رحمته، { ويلعنهم } الجن والإنس، وكل ما يتأتيى منه اللعن كالملائكة وغيرهم",
      "translations": []
    }
  ]
}