{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ استعينوا۟ بالصبر والصلوة ان الله مع الصبرين",
  "translations": [
    {
      "translation": "O you who believe, seek courage in fortitude and prayer, for God is with those who are patient and persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, seek help with fortitude and Salat, for Allah is with those who show fortitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, help yourselves (in your affairs) through patience and prayer; God is with those who have patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Seek help from patience and prayer; indeed Allah is with those who patiently endure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help in patience and As-Salah (the prayer). Truly, Allah is with As-Sabirin (the patient).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! seek assistance through patience and prayer; surely Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O all you who believe, seek you help in patience and prayer; surely God is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Seek help in steadfastness and prayer. Lo! Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You who believe, seek help through patience and prayer; surely, God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! seek help in patience and prayer; verily Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Take recourse in patience and prayer; indeed Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! seek help with patient perseverance and prayer; for Allah is with those who patiently persevere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help in patience and As-Salat (the prayer). Truly! Allah is with As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, seek assistance in patience and prayer, Allah is with those who are patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Seek help through patience and prayers. God is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:153] O you who believe, seek help, regarding the Hereafter, through patience, in obedience and afflictions, and prayer (He singles it out for mention on account of its frequency and its greatness); surely God is with the patient, helping them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Seek help in steadfastness) to fulfil the obligations of Allah and to abstain from contraventions and shameful works (and prayer) and with abundant supererogatory prayers at night and during the day in order to come clean from sin. (Lo! Allah is with the steadfast) He helps, and protects the steadfast from shameful works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يا أيها الذين آمنوا } الإيمان العيانيّ { استعينوا بالصبر } معي عند سطوات تجليّات عظمتي وكبريائي { والصلاة } أي: الشهود الحقيقي بي { إنّ الله مع الصابرين } المطيقين لتجليات أنواره\n  { ولا تقولوا لمن يقتل في سبيل الله } أي: يجعل فانياً مقتولة نفسه في سلوك سبيل التوحيد ميتاً عن هواه، كما قال رسول الله صلى الله عليه وسلم:\n\n \" موتوا قبل أن تموتوا \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم إنه لما بالغ سبحانه في التنبيه والإرشاد، وناداهم رجاء أن يتنبهوا مع أن فطرتهم الأصلية على التوحيد الذاتي، فقال: { يَآأَيُّهَا ٱلَّذِينَ آمَنُواْ } بتوحيد الذات { ٱسْتَعِينُواْ } لتحققه وانكشافه { بِٱلصَّبْرِ } على ما جرى عليكم من الحوادث المنفرة لنفوسكم { وَٱلصَّلاَةِ } أي: الميل والتوجه إلى جنابه لجميع الأعضاء والجوارح { إِنَّ ٱللَّهَ } المعبر به عن الذات الأحدية { مَعَ ٱلصَّابِرِينَ } [البقرة: 153] المتحملين للبلاء لو كوشفوا\n\n\n\n\nرب اجعلنا منه بفضلك وكرمك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}