{
  "chapter": "البقرة",
  "text": "ومن الناس من يتخذ من دون الله اندادا يحبونهم كحب الله والذين ءامنوا۟ اشد حبا لله ولو يرى الذين ظلموا۟ اذ يرون العذاب ان القوة لله جميعا وان الله شديد العذاب",
  "translations": [
    {
      "translation": "And yet there are men who take others as compeers of God, and bestow on them love due to God; but the love of the faithful for God is more intense. If only the wicked could see now the agony that they will behold (on the Day of Resurrection), they will know that to God belongs the power entirely'. And the punishment of God is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In spite of such clear signs of the Oneness of Allah), there are people who set up equals and rivals with Allah and adore them with the adoration due to Allah. whereas the Believers adore Allah most ardently. Would that these transgressors could realize now what they will realize, when they will see the chastisement before them that power and authority wholly belong to Allah and that Allah is severe in punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people consider certain things equal to God and love them just as one should love God. However, the strongest of the believers' love is their love of God. Had the unjust been able to reflect about their condition, when facing the torment, they would have had no doubt that to God belongs All-power and that He is stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some people create for themselves Gods (objects of worship) other than Allah, with devotion (love) equal to the devotion of Allah; and the believers do not love anybody with love equal to the love of Allah; and what will be their state, when the punishment will be before the eyes of the unjust (disbelievers)? For all power belongs wholly to Allah, and because Allah’s punishment is very severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some among men who take for themselves objects of worship besides Allah, whom they love as they love Allah, and those who believe are stronger in love for Allah and O, that those who are unjust had seen, when they see the chastisement, that the power is wholly Allah's and that Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there be men who take to themselves compeers apart from God, loving them as God is loved; but those that believe love God more ardently. O if the evildoers might see, when they see the chastisement, that the power altogether belongs to God, and that God is terrible in chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet of mankind are some who take unto themselves (objects of worship which they set as) rivals to Allah, loving them with a love like (that which is the due) of Allah (only) - those who believe are stauncher in their love for Allah - Oh, that those who do evil had but known, (on the day) when they behold the doom, that power belongeth wholly to Allah, and that Allah is severe in punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are some who set up equals with God and adore them with the adoration due to God, but those who believe love God most. If only the wrongdoers could see, as they will see when they face the punishment, that all power belongs to God, and that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some that set up compeers; unto Allah they love them as with the love due to Allah. And those who believe are strongest in love of Allah. Would that those who do wrong saw, when they saw the torment, that verily power belonged wholly unto Allah, and that Allah was severe in requital -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who set up compeers besides Allah, loving them as if loving Allah—but the faithful have a more ardent love for Allah—though the wrongdoers will see, when they sight the punishment, that power, altogether, belongs to Allah, and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there are men who take (for worship) others besides Allah, as equal (with Allah): They love them as they should love Allah. But those of Faith are overflowing in their love for Allah. If only the unrighteous could see, behold, they would see the penalty: that to Allah belongs all power, and Allah will strongly enforce the penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah. But those who believe, love Allah more (than anything else). If only, those who do wrong could see, when they will see the torment, that all power belongs to Allah and that Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people are those who take to themselves rivals, other than Allah, loving them as Allah is loved. But those who believe are more loving to Allah. When the harmdoers see when they see the punishment because the power altogether belongs to Allah, and that Allah is firm in punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet among the people are those who take other than God as equals to Him. They love them as the love of God. But those who believe have greater love for God. If only the wrongdoers would realize, when they see the torment; that all power is God’s, and that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [yet], among the people are those who take other than Allah as equals [to Him]. They love them as they [should] love Allah. But those who believe are stronger in love for Allah. And if only they who have wronged would consider [that] when they see the punishment, [they will be certain] that all power belongs to Allah and that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:165] Yet there be people who take to themselves compeers, idols, besides God, that is, other than God, loving them, by magnifying them and being subservient to them, as God is loved, that is, as their love of Him; but those who believe love God more ardently, than those who love their compeers, because the former never reject God, whereas the latter when faced with hardship soon abandon those [compeers] for God; If he, [if you] O Muhammad (s), were to see those who did evil, by taking to themselves compeers, when (idh here denotes idhā) they see (read either as active [yarawna, ‘they see’] or passive [yurawna, ‘they are made to see’]) the chastisement, you would see a grave sight, that, this is because, the might, the power and the vanquishing, altogether (a circumstantial qualifier) belongs to God, and that God is terrible in chastisement (according to one reading, the person listening [to the verse] governs the verb yarā, ‘he sees’, and constitutes the subject [of the clause]; according to another [reading], it is the ‘evildoers’ [who constitute the subject of the clause and govern the verb yarā]; and so it [yarā] has the sense of ya‘lam, ‘he knows’; the particle an, ‘that’, and what comes after it have taken the place of the objects in both cases; the response to the [initial conditional] law, ‘if’, has been omitted). The general meaning [of the verse] then is: ‘If they were aware in this world of the severity of God’s chastisement and of the fact that power is God’s alone, the moment they come to see it with their own eyes, on the Day of Resurrection, they would not take to themselves compeers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah mentions after this the unbelievers' love for their objects of worship in this world, and how they disown each other in the Hereafter, saying: (Yet of mankind) i.e. the unbelievers (are some who take unto themselves) who worship (rivals to Allah) idols, (loving them with a love like (that which is the due) of Allah) like the love that sincere believers have for Allah (-Those who believe are stauncher) more lasting (in their love for Allah) than are the unbelievers vis-a-vis their idols; it is also said that this verse was revealed about the hypocrites who buried their gold and silver or hid it in caves; and it is also said that this means: they took their leaders as gods (-that those who do evil had but known) if only the idolaters knew, (when they behold the doom) on the Day of Judgement, (that power) and might and invincibility (belongeth wholly to Allah, and that Allah is severe in punishment!) in the Hereafter-if they knew this, they would certainly have believed in this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ } معناهُ يَعلَمُ وليسَ برؤيا عينٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن الناس من يَتَخذ من دون الله أنداداً يحبونهم كحبّ الله } أي: من يعبد من دون الله أشياء إمّا أناسيّ من جنسهم كالأزواج، والأولاد، والآباء، والأجداد، والإخوان، والأحباب، والرؤساء، والملوك، وغيرهم\n وإمّا غير أناسيّ كالحيوانات، والجمادات، وسائر أموالهم، بالإقبال عليهم والتوجه نحوهم، ومراعاتهم، وحفظهم، والاهتمام بهم وبحالهم، والتفكّر في بابهم، يحبونهم كحب الله، أي: كما يجب أن يحب الله، فتكون تلك الأشياء عندهم مساوية في المحبة مع الله فتكون أنداداً أو شركاء لله بالنسبة إليهم، أو تكون هي محبوباتهم ومعبوداتهم لا غير، فهي آلهتهم كما أن الله إله الخلق فهم جعلوا لأنفسهم آلهة أنداداً لإله سائر الخلق، إله العالمين\n { والذين آمَنُوا أشدّ حباً لله } من غيره لأنهم لا يحبون إلا الله، لا يختلط حبهم له بحب غيره ولا يتغير، ويحبون الأشياء بمحبة الله ولله، وبقدر ما يجدون فيها من الجهة الإلهية كما قال بعضهم: \" الحق حبيبنا، والخلق حبيبنا وإذا اختلفا فالحق أحبّ إلينا \" أي: إذا لم تبق جهة الإلهية فيهم بمخالفتهم إياه لم تبق محبتنا لهم، أو أشدّ حباً من محبتهم لآلهتهم لأنهم يحبون الأشياء بأنفسهم لأنفسهم، فلا جرم تتغير محبتهم بتغيير إعراض النفوس أنفسهم عند خوف الهلاك ومضرّة النفس عليهم والمؤمنون يحبون الله بأرواحهم وقلوبهم، بل بالله لله، لا تتغير محبتهم لكونها لا لغرض، ويبذلون أرواحهم وأنفسهم لوجهه ورضاه، ويتركون جميع مراداتهم لمراده ويحبون أفعاله وإن كانت بخلاف هواهم، كما قال أحدهم:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع لوام هذه الآيات والدلائل الشواهد وبروق الواردات الغيبية، وشروق المكاشفات العينية الدالة على وحدة الذات { مِنَ ٱلنَّاسِ } المخلوقين على فطرة التوحيد القابلين لها { مَن يَتَّخِذُ } منهم جهلاً وعناداً { مِن دُونِ ٱللَّهِ } المعني للكثرة مطلقاً { أَندَاداً } أمثالاً أحقاء للألوهية والربوبية مستحقين للعابدة إلى حيث { يُحِبُّونَهُمْ } أي: كلاً منه معبودهم { كَحُبِّ ٱللَّهِ } الجامع للكل لحصر كل طائفة منهم مرتبة للألوهية في مظهرٍ مخصوصٍ، ولذلك كفروا { وَٱلَّذِينَ آمَنُواْ } بالله { أَشَدُّ حُبّاً } منهم { للَّهِ } المحيط للكل الحقيق بالحقية؛ لحصرهم الألوهية والربوبية والتحقق والوجود والهوية، والذات والحقيقة والصفات على الله لا على غيره؛ إذ لا غير في الوجود، لا إله إلا هو، كل شيء هالك إلا وجهه، له الحكم في النشأةالأولى، وإليه الرجوع في النشأة الأخرى\n\n\nأذقنا حلاوة اليقين وارزقنا محبة المؤمنين الموقنين\n\n\n\n\n{ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ } حين خرجوا عن طريق التوحيد، وانصرفوا عن الصراط المستقيم واتخذوا أمثالاً يحبونهم كحب الله ما يرون حين { إِذْ يَرَوْنَ ٱلْعَذَابَ } النازل عليهم باتخاذهم من { أَنَّ ٱلْقُوَّةَ } الكاملة والقدرة الشاملة الجامعة { للَّهِ جَمِيعاً } المنفرد بالمجد وإليها { وَ } من { أَنَّ ٱللَّهَ } المتردي برداء العظمة والكبرياء { شَدِيدُ ٱلْعَذَابِ } [البقرة: 165] صعب الانتقام، سريع الحساب، لتبرءوا من متبوعهم في الدنيا كما تبرءوا منهم في الآخرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَاداً يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ وَٱلَّذِينَ آمَنُواْ أَشَدُّ حُبّاً للَّهِ\n\n\n }  قلت: ويُحتمل في وجه المناسبة، أن يكون الحق تعالى لمّا ذكر دلائل التوحيد ذكّر من أعرض بعد وضوحها فأشرك معه، ليرتب بعد ذلك ما أعدَّ له من العذاب، والأنداد: جمع نِدْ وهو المِثْل، والمراد هنا الأصنام أو الرؤساء، والإضافة في { كحُب الله } من إضافة المصدر إلى مفعوله، والحُب: ميل القلب إلى المحبوب، وسأتي في الإشارة إن شاء الله\n يقول الحقّ جلّ جلاله: { ومن الناس من يتخذ من دون الله } أشباهاً وأمثالاً من الأصنام والرؤساء { يحبونهم } ، وينقادون إليهم، كما يحبون الله تعالى، فيُسَوَّون في المحبة بين الله تعالى العلي الكبير، وبين المصنوع الذليل الحقير، { والذين آمنوا } بالله ووحَّدُوه { أشد حبّاً لله } لأن المؤمنين لا يلتفتون عن حبوبهم في الشدة ولا في الرخاء، بخلاف الكفار فإنهم يعبدونهم في وقت الرخاء، فإذا نزل البلاء التجؤوا إلى الله\n قال تعالى:\n\n[النّحل: 53] الآية، وأيضاً: المؤمنون يعبدون الله بلا واسطة، والكفار يعبدونه بواسطة أصنامهم\n\n[الزمر: 3] وأيضاً المؤمنونن يعبدون ربّاً واحداً فاتحدت مبحتهم\n قال سعيد بن جبير: إن الله تعالى يأمر يوم القيامة مَنْ عبد الأصنام أن يدخلوا النار مع أصنامهم، فيمتنعون لعلمهم بالخلود فيها، ثم يقول للمؤمنين بين يدي الكفار: إن كنتم أحبائي فادخلوا، فيقتحم المؤمنون النار، وينادي مُنَأدٍ مِنْ تحت العرش: { والذين آمناو أشد حبّاً لله }\n وفي ذلك يقول ابن الفارض:\n\nوقال أيضاً:\n\nوقال آخر:\n\nالإشارة: المحبةُ: مَيلٌ دائم بقلب هائم، أو مراقبة الحبيب في المشهد والمغيب، أو مواطأةُ القلب لمراد الرب، أو خوف ترك الخدْمة مع إقامة الحُرْمة، أو اسْتِقْلالُ الكثير من نفسك واستكثارُ القليل مِنْ حبيبك، أو معانقة الطاعة ومباينة المخالفة، وقال الشِّبْلِي: أن تَغَار على المحبوب أن يحبه مثلك والمحب على الحقيقة من لا سلطان على قلبه لغير محبوبه، ولا مشيئة له غير مشيئته، وقال الشيخ أبو الحسن رضي الله عنه: المحبة أخْذَةٌ من الله لقلب عبده المؤمن عن كل شيء سواه، فترى النفس مائلة لطاعته، والعقل متحصّناً بمعروفه، والروح مأخوذة في حضرته، والسر مغموراً في مشاهدته، والعبد يستزيد من محبته فيزداد، ويفاتح بما هو أعذب من لذيذ مناجاته، فيكسي حلل التقريب على بساط القربة، ويَمَسُّ أبكارَ الحقائق وثيبات العلوم، فمن أجل ذلك قالوا: أولياء الله عرائس، ولا يَرَى العرائسَ المجرمون\n\n\n\n\n الخ كلامه\n واعلم أن محبة العبد لمولاه سببُها شيئان: أحدهُما: نظر العبد لإحسان الله إليه وضروب امتنانه عليه، وجُبِلَت القلوبُ على حب من أحسن إليها، وهذا هو المسمى بحب الهوى، هو مكتسب، لأن الإنسان مغمور بإحسانات الله إليه، ومتمكن من النظر فيها، فكلما طالَع منةً مِنْ مِنَن الله التي لا تقبل الحصر ولا العدَّ،كان ذلك كحَبة زُرعت في أرض قلبه الطيب الزكي، فلا يزال يطالع مِنّةً بعد منّة، وكلُّ منّة أعظم من التي قبلها، لأنه كلما طالع المنن تنوّر قلبه وزداد إيماناً، وكشف من دقائق المنن ما لم يكن يُكشف له قبلُ، وظهر له خفايا المنن، وعظمت محبته\n  الثاني: كشْف الحجب، وإزالة الموانع عن ناظر القلب، حتى يرى جمال الحقّ وكماله، والجمال محبوب بالطبع، وهذان هما اللذان قصدت رابعة العدوية - رضي الله عنها -:\n\nوإنما خَصَّصَتْ الحُبَّ الناشئ عن شهود الجمال بالأهلية دون الأول، وإن كان أهلاً للجميع لأن هذا منه إليه، لا كسب للعبد فيه، والآخر فيه كسب، وعمل العبد معلول، وقولها: فشغلي بذكر عمن سواك من باب التعبير بالمسبب عن السبب، والأصل: فثمرته شغلي بذكرك عمن سواك، فهو مسبب عن المحبة لأنفسنا، وقولها أيضاً كشفك للحجب حتى أراك، من باب التعبير بالسبب عن المسبب، والأصل، فبسببه كشفك للحجب حتى رأيتك بعينَيْ قلبي\n وقولها: فلا الحمد\n\n\n الخ، إخبار منها بأن الحُبَّيْن معاً منه وإليه وبه في الحقيقة، لا كسب لها في واحد منهما باعتبار الحقيقة، بل هو الحامد والمحمود، وإدراك التفاوت بين المقامين، - أعْني بين المحبة الناشئة عن شهود الإحسان، والناشئة عن شهود الجمال - ضروري عند كل ذائق، وأن الثانية أقوى\n قاله في شرح الشريشية\n قال ابن جُزَيّ: اعلم أن محبة العبد لربه على درجتين أحدهما: المحبة العامة، التي لا يخلو منها كل مؤمن، وهي واجبة، والأخرى: المحبة الخاصة التي ينفرد فيها العلماء الربَّانيون، والأولياء والأصفياء، وهي أعلى المقامات، وغاية المطلوبات، فإنَّ سائر مقامات الصالحين: كالخوف والرجاء والتوكل، وغير ذلك، مَبْنِيَةٌ على حظوظ النفس، ألا ترى أن الخائف إنما يخاف على نفسه، والراجي إنما يرجوا منفعة نفسه، بخلاف المحبة، فإنها من أجل المحبوب فليست من المعاوضة\n واعلم أن سببَ محبةِ الله: معرفتُه، فتقوى المحبة على قدر المعرفة، وتضعف على قدر ضعف المعرفة، فإن الموجب للمحبة أحد أمرين أو كلاهما إذا اجتمعا، ولا شك أنهما اجتمعا في حق الله تعالى على غاية الكمال فالموجب الأول: الحسن والجمال، والآخر الإحسان والإجمال، فأما الجمال فهو محبوب بالطبع، فإن الإنسان بالضرورة يجب كل ما يُستحسن، ولا جمالَ مثلُ جمال الله تعالى، في حكمته البالغة وصنائعه البديعة، وصفاته الجميلة الساطعة الأنوار، التي تَرُوق العقول وتبهج القلوب، وإنما يُدْرَك جمالُه تعالى بالبصائر لا بالأبصار\n\n\nوأما الإحسان فقد جبلت القلوب على حب من أحسن إليها، وإحسان الله إلى عباده متواتر، وإنعامُه عليهم باطن وظاهر،\n\n[إبراهيم: 34]، ويكفيك أنه يُحسن إلى المطيع والعاصي، وإلا المؤمن والكافر، وكل إحسان ينبس إلى غيره فهو في الحقيقة منه وحدَه، فهو المستحق للمحبة وحده\n واعلم أن محبة الله إذا تمكنت من القلب ظهرت آثارها على الجوارح، من الجد في طاعته، والنَّشَطِ لخدمته، والحرص على مرضاته والتلذذ بمناجاته، والرضا بقضائه، والشوق إلى لقائه، والأُنْس بذكره، والاسْتِيحَاش مِنْ غيره، والفرار من الناس، والانفراد في الخلوات، وخروج الدنيا من القلب، ومحبة كل ما يحب الله، وكل من يحب الله، وإيثار الله على كل ما سواه\n قال الحارث المحاسبي: المحبة ميلك إلى المحبوب بِكُلِّيتِكَ، ثم إيثارك له على نفسك ورُوحك، ثم موافقته سرّاً وجهراً، ثم علمك بتقصيرك في حبه\n قلت: ظاهره أن المحبة أعلى من المعرفة، والتحقيق أن المعرفة أعلى من جميع المقامات لأنها لا تبقى معها بقية من الحجاب أصلاً، بخلاف المحبة، فإنها تكون بقية الحجاب، ألا ترى أن المحب يستوحش من الخلق، والعارف لا يستوحش من شيء لمعرفته في كل شيء\n قال في الحِكَم: \" إنما استوحشَ العُبَّاد والزهاد من كل شيء لغيبتهم عن الله في كل شيء، ولو عرفوا الله في كل شيء ما استوحشوا من شيء \"\n وأيضاً\n العارف أكمل أدباً من المحب لأن المعرفة إنما تحصُل بعد كمال التهذيب والتدريب، وقد تحصل المحبة قبل كمال التهذيب، مع أن المعرفة هي غاية المحبة ونهايتها، والله تعالى أعلم\n ثم ذكر الحقّ وعيدَ مَنْ أشرك مع الله في عبادته أو محبته، بعد وضوح برهان وحدانيته، فقال: {\n\n\nوَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوۤاْ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ للَّهِ جَمِيعاً وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلْعَذَابَ وَتَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُواْ مِنَّا كَذَلِكَ يُرِيهِمُ ٱللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ وَمَا هُم بِخَارِجِينَ مِنَ ٱلنَّارِ }\n  قلت: { لو } شرطية، و { ترى } شرطها، قرأ نافع وابن عامر ويعقوب بالخطاب للنبيّ صلى الله عليه وسلم أو لكل سامع، والباقون بالغيب وإسناده إلى الظالم، لأنه المقصود بالوعيد والتهديد، و { إذ } ظرف للرؤية، وموضع { يرون } خفض بالإضافة، قرأ ابن عامر بضم الياء، على البناء للمفعول، والفاعلُ الحقيقي هو الله تعالى، بدليل { يريهم الله } ، والباقون بالفتح على البناء للفاعل، على حد:\n\n\n\n[النّحل: 85]\n و { أن القوة } معمول للجواب المحذوف، تعظيماً لشأنه، والتقدير: لو ترى يا محمد، أو يا مَنْ يسمَع، الذين ظلموا حين يرون العذاب، أو يريهم الله العذاب، لرأيت أمراً فظيعاً وخَطْباً جسيماً، ولعلمت أن القوة لله جميعاً\n و { جميعاً } حال، أي: أن القوة ثابتة في حال اجتماعها، وقرأ أبو جعفر ويعقوب { إنَّ } بالكسر في الموضعين على الاستئناف، و { إذ تبرأ } بدل من { إذ يرون } ، والأسباب: العهود والوُصَل التي كانت بينهم في الدنيا يتوادُّون عليها، وأصل السبب: كل شيء يتوصل به إلى شيء، ومنه قيل للحبل الذي يُصعد به: سبب، وللطريق: سبب، قال الشاعر:\n",
      "translations": []
    }
  ]
}