{
  "chapter": "البقرة",
  "text": "او۟لئك الذين اشتروا۟ الضللة بالهدى فما ربحت تجرتهم وما كانوا۟ مهتدين",
  "translations": [
    {
      "translation": "They are indeed those who bartered away good guidance for error and gained nothing from the deal, nor found the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who have bartered away Guidance for error, but this is a profitless bargain that they have made, and they are not at all on the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have traded guidance for error, but their bargain has had no profit and they have missed the true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people who purchased error in exchange of guidance – so their bargain did not profit them, and they did not know how to trade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased error with guidance, so their commerce was profitless. And they were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who buy error for the right direction, so their bargain shall bring no gain, nor are they the followers of the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that have bought error at the price of guidance, and their commerce has not profited them, and they are not right-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who purchase error at the price of guidance, so their commerce doth not prosper, neither are they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who have taken misguidance in exchange for guidance; but their bargain does not profit them, nor have they found true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who purchased error for guidance, but their traffic profited not, nor have they ever become guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who bought error for guidance, so their trade did not profit them, nor were they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have bartered Guidance for error: But their traffic is profitless, and they have lost true direction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased error for guidance, so their commerce was profitless. And they were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who barter away guidance for error, their trade did not profit (them), nor are they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have bartered error for guidance; but their trade does not profit them, and they are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who have purchased error [in exchange] for guidance, so their transaction has brought no profit, nor were they guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:16] Those are they who have bought error for guidance, that is, they have exchanged the latter for the former; so their commerce has not profited them, that is to say, they have gained nothing from it, indeed, they have lost, because their destination is the Fire, made everlasting for them; nor are they guided, in what they did.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These are they who purchase error at the price of guidance), they chose disbelief instead of faith and exchanged guidance with error, (so their commerce did not prosper), they did not prosper in their bargain but on the contrary (neither were they guided) to overcome their error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أُوْلَـٰئِكَ ٱلَّذِينَ ٱشْتَرَوُاْ ٱلضَّلاَلَةَ بِٱلْهُدَىٰ } أي اسْتَحبوا الضَّلالَةَ على الهُدى\n ويقال آمَنوا ثُمَّ كَفَرُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } البعداء عن طريق الهداية هم { ٱلَّذِينَ ٱشْتَرَوُاْ } استبدلوا واختاروا { ٱلضَّلَـٰلَةَ } المعززة في نفوسهم بتقليد آبائهم { بِٱلْهُدَىٰ } المتفرعة على الإيمان بالله وبرسوله { فَمَا رَبِحَتْ } بهذا الاستبدال والاختيار { تِّجَارَتُهُمْ } أي: ما يتجرون به { وَمَا كَانُواْ مُهْتَدِينَ } [البقرة: 16] رابحين بسبب الاستبدال، وخاسرين ضالين به\n أو يقال: فما يتم الربح { تِّجَارَتُهُمْ } اتجارهم { وَمَا كَانُواْ مُهْتَدِينَ } بسبب هذا الاتجار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وَيَمُدُّهُمْ } أي: يمهلهم { فِي } كفرهم، و { طُغْيَانِهِمْ } يتحيرون إلى يوم يبعثون لأنهم { اشْتَرُوا الضَّلالَةَ بِالْهُدَى } أي: استبدلوا بها رأس مالهم، فضلاً عن الربح، إذ الإيمان رأس المال، وأعمال الطاعات ربح، فإذا ذهب الرأس فلا ربح ولذلك قال تعالى: { فَمَا رَبِحَت تِجَارَتُهُمْ } ، بل خسرت صفقتهم، { وَمَا كَانُوا مُهْتَدِينَ } إلى أسباب الربح أبداً، لاستبدالهم الهدى - التي هي رأس المال - بالضلالة - التي هي سبب الخسران\n وبالله التوفيق\n وها هنا استعارات وبلاغات يطول سردها، إذ مرادنا تربية اليقين بكلام رب العالمين\n الإشارة: الناس في طريق الخصوص على أربعة أقسام: قسم: سبقت لهم من الله العناية، وهبت عليهم ريح الهداية: فصدقوا ودخلوا فيها، وبذلوا أنفسهم وأموالهم في سبيل الله، فَتَجِرُوا فيه وربحوا، فعوّضهم الله تعالى جنة المعارف، يتبوؤون منها حيث شاءوا، فإذا قدموا عليه أدخلهم جنة الزخارف، يسرحون فيها حيث شاءوا، وأتحفهم فيها بالنظر إلى وجهه الكريم\n\n\nوقسم: سبقت لهم من الله الهداية، وحفتهم الرعاية، فصدقوا وأقروا، ولكنهم ضعفوا عن الدخول، ولم تتعلق همتهم بالوصول، فبقوا في ضعفاء المسلمين\n\n[التّوبَة: 91]\n وقسم: أنكروا وأظهروا وجحدوا وكفروا، فتجروا وخسروا، \" مَنْ عَادَى لي وَلِياً فقَد آذنْتُهُ بالْحَربِ \"\n وقسم رابع: هم مذبذبون بين ذلك إذا لقوا أهل الخصوصية قالوا: آمنا وصدقنا فأنتم على الجادة، وإذا رجعوا إلى أهل التمرد من المنكرين - طعنوا وجحدوا، وقالوا: إنما كنا بهم مستهزئين، { الله يستهزئ بهم } بما يظهر لهم من صور الكرامات والاستدراجات، ويمدهم في تعاطي العوائد والشهوات، وطلب العلو والرئاسات، متحيرين في مهامه الخواطر والغفلات، { أولئك الذي اشتروا الضلالة } عن طريق الخصوص من أهل الوصول، { بالهدى } الذي كان بيدهم، لو حصل لهم التصديق والدخول، فما ربحوا في تجارتهم، وما كانوا مهتدين إلى بلوغ المأمول\n قال بعض العارفين: التصديق بطريقتنا ولاية، والدخول فيها عناية، والانتقاد عليها جناية\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n\n",
      "translations": []
    }
  ]
}