{
  "chapter": "البقرة",
  "text": "يايها الناس كلوا۟ مما فى الارض حللا طيبا ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين",
  "translations": [
    {
      "translation": "O men, eat only the things of the earth that are lawful and good. Do not walk in the footsteps of Satan, your acknowledged enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, eat of what is lawful and clean in the earth and do not follow the ways of Satan, for he is your avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, eat of the good and lawful things on earth. Do not follow the footsteps of Satan; he is clearly your enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat from what is lawful and clean in the earth; and do not follow the footsteps of the devil; undoubtedly he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaytan (Satan). Verily, he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! eat the lawful and good things out of what is in the earth, and do not follow the footsteps of the Shaitan; surely he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, eat of what is in the earth lawful and good; and follow not the steps of Satan; he is a manifest foe to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and wholesome in the earth, and follow not the footsteps of the devil. Lo! he is an open enemy for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, eat whatever is lawful and wholesome on the earth; and do not follow in the footsteps of Satan; for he is indeed your avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! eat of whatsoever is, the earth, lawful, and clean and follow not the footsteps of Satan; verily he is an enemy unto you manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of what is lawful and pure in the earth, and do not follow in Satan’s steps. Indeed, he is your manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye people! Eat of what is on earth, Lawful and good; and do not follow the footsteps of the evil one, for he is to you an avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Eat of that which is lawful and good on the earth, and follow not the footsteps of Shaitan (Satan). Verily, he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, eat of what is lawful and good on the earth and do not walk in satan's footsteps, because he is for you a clear enemy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Eat of what is lawful and good on earth, and do not follow the footsteps of Satan. He is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, eat from whatever is on earth [that is] lawful and good and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:168] The following was revealed when some said that it was unlawful to take a camel that has been let loose (sawā’ib): O people, eat of what is in the earth, lawful (halālan is a circumstantial qualifier) and wholesome (tayyiban is an adjective for emphasis), that is to say, what is delicious; and follow not the steps, the ways, of Satan, meaning, what he embellishes [of temptations]; he is a manifest foe to you, whose enmity is clear;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the lawfulness of cultivating land and raising cattle, saying: (0 mankind) people of Mecca! (Eat of that which is lawful and wholesome) that is not prohibited by Allah (in the earth) of what is cultivated in lands and of cattle, (and follow not the footsteps of the devil) the embellishments and whisperings of the devil concerning the unlawfulness of the cultivation of land and of raising cattle. (Lo! He is an open enemy for you) whose enmity towards you is quite manifest.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلاَ تَتَّبِعُواْ خُطُوَاتِ ٱلشَّيْطَانِ } معناهُ آثارُهُ\n وواحدُهَا خُطْوَةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بين سبحانه طريق توحيده على خلص عباده المتوجهين نحو جنابه، تطهيراً لبواطنهم عن خبائث الأهواء العاطلة والآراء الفاسدة، أراد أن يرشدهم إلى تهذيب ظواهرهم أيضاً بالخصائل الحميدة الجميلة والأخلاق المرضية؛ ليكون ظاهرهم عنواناً لباطنهم، فقال تعالى منادياً لهم إشفاقاً وإرشاداً: { يٰأَيُّهَا ٱلنَّاسُ } المجبولون على التوحيد { كُلُواْ } وتناولوا { مِمَّا } من جميع ماخلق لكم { فِي ٱلأَرْضِ } لتقويم مزاجكم وتقويته { حَلاَلاً } إذ الأصل في الأشياء الحل ما الم يرد الشرع على حرمته { طَيِّباً } مما يحصل من كد يمينكم وعرق جبينكم؛ إذ لا رزق أطيب منه { وَلاَ تَتَّبِعُواْ خُطُوَاتِ ٱلشَّيْطَانِ } أي: لا تقتدوا ولا تقنفوا في تحصيل الرزق إثر وساوس شياطين الأهواء والآراء المضلة عن طريق الحق، والمفضية إلى سبيل الظلم والعدون، ولا تغتروا بتمويهات الشيطان وتزييناته { إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ } [البقرة: 168] ظاهر العداوة عند أولي البصائر بنور الله، المقتبسين من مشكاة توحيده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { حلالاًّ } حال، أو مفعول به، و { طيباً } نعت له، و { الخُطُوات } جمع خطوة، وهي بالفتح - مصدر خطَا يَخْطُوا، وبالضم - اسم لمسافة ما بين القدمين، ويُكَسَّر على خطاً، ويُصَحَّح على خطوات، مثلث الطاء، أعني: الضم على الإتباع، كغرفات وقربات، قال ابن مالك:\n\nوالسكون على الأصل في المفرد، والفتح تخفيفاً، قال في الألفية:\n\nوقرئ في المواتر بالضم والإسكان، وفي الشاذِّ بالفتح\n قال الخليل: خطوات الشيطان، آثاره وطرقه، يقول: لا تقتدوا به\n هـ\n وأصل السوء: كل ما يَسُوء صاحبه ويُحزنه\n والفحشاء: ما قبحُ من القول والفعل، مصدر فحش كالبأساء والضراء واللأوَاء\n قال ابن عباس: الفحشاءُ: ما فيه حد، والسوء: ما لا حَدَّ فيه، وقال مقاتل: كل مافي القرآن من ذكر الفشحاء فإنه الزنا، إلا قوله:\n\nفإنه البخل[البَقَرَة: 268]\n قال البيضاوي: السوء والفحشاء: ما أنكره العقل واستقبحه الشرع، والعطف لاختلاف الوصفين، فإنه سوءٌ لاغتمام العاقل، به، وفحشاء باستقباحه إياه، وقيل: السوء يعمُ القبائح، والفحشاء ما تجاوَز الحدَّ في القبح\n هـ\n يقول الحقّ جلّ جلاله: { يا أيها الناس كلوا } من جميع ما خلقنا لكم في الأرض من نباتها مما يُستطاب أكله، وحيواناتها إلا ما حرمناه عليكم، حالة كون ذلك { حلالاً } قد انحلَّت عنه التبِعَات، وزالت عنه الشبهات، { طيباً } مُستلَذاً يستلِذُّه الطبع، ويستحسنه الشرع، { ولا تتبعوا } طرق { الشيطان } فتُحَرِّموا برأيكم ما أحلَّ الله لكم، كالبَحِيرة والسائبة والوَصِيلة والحام، وبعض الحرث الذي جعلتموه للأصنام، فإن ذلك من تزيين الشيطان، وهو { لكم عدو مبين }",
      "translations": []
    }
  ]
}