{
  "chapter": "البقرة",
  "text": "الا الذين تابوا۟ واصلحوا۟ وبينوا۟ فاو۟لئك اتوب عليهم وانا التواب الرحيم",
  "translations": [
    {
      "translation": "But those who repent and reform and proclaim (the truth), are forgiven, for I am forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I, however, will forgive those of them who repent of it, mend their ways and make own what they were concealing: for I am very generous in accepting repentance and showing mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, I shall accept the repentance of those of them who repent for their sins, reform their manners, and preach the truth; I am All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and do reform and disclose (the truth) – so I will accept their repentance; and I only am the Most Acceptor of Repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and do righteous deeds, and openly declare (the truth which they concealed). These, I will accept their repentance. And I am the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and amend and make manifest (the truth), these it is to whom I turn (mercifully); and I am the Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save such as repent and make amends, and show clearly -- towards them I shall turn; I turn, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and amend and make manifest (the truth). These it is toward whom I relent. I am the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But from those who repent and mend their ways and make known the truth, I will certainly accept their repentance: I am the Ever Relenting, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those that repent and amend, and make manifest the truth I these it is toward whom I relent. And I am the Relenting, the Merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except such as repent, make amends, and clarify—those I shall pardon, and I am the All-clement, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and make amends and openly declare (the Truth): To them I turn; for I am Oft-returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and do righteous deeds, and openly declare (the truth which they concealed). These, I will accept their repentance. And I am the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who repent, and mend (their deeds) and clarify. Those I shall accept them. I am the Receiver of repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent, and reform, and proclaim. Those—I will accept their repentance. I am the Acceptor of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent and correct themselves and make evident [what they concealed]. Those - I will accept their repentance, and I am the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:160] Except those that repent, turning back from such [deeds], and make amends, in their actions, and show clearly, what they were concealing — them I shall turn [relenting], accepting their repentance; I am the Relenting, the Merciful, to believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Except such of them as repent) from Judaism (and amend) worship Allah alone without ascribing to Him any partners (and make manifest) the traits and description of Muhammad. (These it is towards whom I relent) overlook their past transgressions. (I am the Relenting) towards those who repent, (the Merciful) towards him who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلَّذِينَ تَابُواْ } رجعوا منهم عن الكتمان، وأظهروا ما ظهر لهم في كتابهم { وَأَصْلَحُواْ } بإظهار ما أفسدوا بالكتمان { وَبَيَّنُواْ } ما بينه الله في كتابه من وصف نبيه المبعوث المرسل إلى كافة الأمم { فَأُوْلَـئِكَ } التائبون منهم، المصلحون المبينون ما ظهر لهم في كتابهم { أَتُوبُ عَلَيْهِمْ } قبل توبتهم واتجاوز عن سيئاتهم { وَأَنَا التَّوَّابُ } الرجاع لهم عما جرى عليهم من العصيان والكفر { الرَّحِيمُ } [البقرة: 160] لهم بعدما رجعوا إلي مخصلين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا الذين تابوا } من الكتمان، وكل ما يجب أن يتاب منه، { وأصلحوا } ما أفسدوا من الدين بالتدارك، { وبينوا } ما كتموا { فأولئك أتوب عليهم } وأرحمهم { وأنا التّواب الرحيم } أي: المبالغ في قبول التوبة وإفاضة الرحمة، وأما من مات على الكفر ولم يتب فأولئك { عليهم لعنة الله } ، ومن يُعْتَدّ بلعنته من { الملائكة والناس أجمعين } خالدين في اللعنة أو في النار { لا يخفف عنهم العذاب } ساعة، ولا هم يمهلون عنه، أو لا ينتظرون للاعتذار أو الفداء\n الإشارة: ما قيل في أحبار اليهود يقال مثله في علماء السوء من هذه الأمة، الذين ملكتهم جيفة الدنيا، وأسرهم الهوى، الذين يقبضون الرّشَا على الأحكام، فيكتمون المشهور الواضح، ويحكمون بشهوة أنفسهم، فأولئك يلعنهم اللاعنون، وفي ذلك يقول ابن المبارك - رحمه الله -:\n",
      "translations": []
    }
  ]
}