{
  "chapter": "البقرة",
  "text": "انما يامركم بالسوء والفحشاء وان تقولوا۟ على الله ما لا تعلمون",
  "translations": [
    {
      "translation": "He will ask you to indulge in evil, indecency, and to speak lies of God you cannot even conceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He enjoins you to commit vice and indecency and induces you to attribute to Allah's name things you do not know to be from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He tries to make you do evil and shameful things and speak against God without knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he will only instruct you towards the evil and the shameful, and that you fabricate matters concerning Allah, what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Satan) commands you only what is evil and Fahsha' (sinful), and that you should say about Allah what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only enjoins you evil and indecency, and that you may speak against Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only commands you to evil and indecency, and that you should speak against God such things as you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He enjoineth upon you only the evil and the foul, and that ye should tell concerning Allah that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He bids you only to do evil and to commit deeds of abomination and to attribute to God something of which you have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only commandeth you to evil and indecency, and that ye should say against Allah that which ye know not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only prompts you to [commit] evil and indecent acts, and that you attribute to Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For he commands you what is evil and shameful, and that ye should say of Allah that of which ye have no knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Shaitan (Satan)] commands you only what is evil and Fahsha (sinful), and that you should say against Allah what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he orders you to commit evil and indecency and to assert about Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He commands you to do evil and vice, and to say about God what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only orders you to evil and immorality and to say about Allah what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:169] he only commands you to evil, sin, and indecency, what is abhorred by the Law, and that you should speak against God what you do not know, such as forbidding what He has not forbidden and otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He) the devil (enjoineth upon you only the evil) evil works (and the foul) transgressions, (and that ye should tell) lies (concerning Allah that which ye know not).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما يأمُركم بالسوء } الإضرار والأذى الذي هو إفراط القوة الغضبية { والفَحْشاء } أي: القبائح التي هي إفراط القوّة الشهوانية { وأن تقولوا على الله ما لا تعلمون } الذي هو إفراط القوّة النطقية لشوب العقل بالوهم الذي هو الشيطان المسخر له { وإذا قيل لهم اتبِعوا ما أَنْزَل الله } من مراعاة حدّ الاعتدال والعدالة في كلّ شيء على الوجه المأمور به في الشرع { قالوا بل نتّبع ما وَجَدْنا عليه آباءنا } من الإسرافات المذمومة في الجاهلية تقليداً لهم أتتبعونهم { ولو كان آباؤهم لا يَعْقلون شيئاً } من الدين والعِلم { ولا يَهْتَدون } إلى الصواب في العمل لجهلهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا يَأْمُرُكُمْ } ويغرركم { بِٱلسُّوۤءِ } الخصلة الذميمة { وَٱلْفَحْشَآءِ } الظاهر القباحة؛ ليخرجكم عن حدود الله الموضوعة فيكم لتهذيب ظاهركم { وَأَن تَقُولُواْ } بعدما خرجتم عن حدود الشرع { عَلَى ٱللَّهِ } المتوحد المتفرد المنزه في ذاته { مَا لاَ تَعْلَمُونَ } [البقرة: 169] لياقته في حقه في حصره في الأنداد والأشباه، وإثبات الولد له والمكان والجهة والجسم، تعالى عما يوقل الظالمون علواً كبيراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ومن شأن العدو الخِدَاع والغرور، فإنما يأمركم بما يَسُوء وجوهَكم من الذنوب، وما يُرديكم من قبائح المعاصي والعيوب، { وأن تقولوا على الله } ما لا علم لكم به من تحلِيل الحرام، أو تحريم الحلال، أو ادعاء الولد أو الصاحبة في جانب الكبير المتعال\n الإشارة: اعلم أن الحق تعالى جعل للبشرية قُوتاً ونعيماً تتنعم به، وجعل للروح قوتاً ونعيماً تتلذذ به، فقُوت البشرية الطعام والشراب، ونعيمُها: الملابس والمَناكح والمَراكب\n وقوت الروح: اليقين والعلوم والأنوار، ونعيمها: الشهود والاستصبار والترقي في المعارف والأسرار، فكما أن النفس تأكُل مما في الأرض حلالاً طيباً، كذلك الروح تأكل مما في الأرض حلالاً طيباً، إلا أن أكل النفس حِسّي، وأكل الروح معنوي، وهو التفكر والاعتبار، أو الشهود والاستبصار، وفي ذلك يقول المجذوب رضي الله عنه:\n\nوقال الششتري رضي الله عنه:\n\nوكان شيخُ شيوخنا سيدي علي رضي الله عنه يقول: مَن أراد أن يذوق فليذهب إلى السوق\n\n\nوذلك لأنه مظنة الزحام، وفيه عند الأقوياء الربح التام، فيقال لهم: يا أيها الناس الكاملون في الإنسانية كلوا مما في الأرض بأرواحكم وأسراركم، شهوداً واعتباراً، حلالاً طيّباً، ولا تتبعوا خطوات الشيطان، فتقفوا مع ظواهر الأكوان، فتُحجبوا عن الشهود والعيان، فإنه لكم في صورة العدو المبين، لكنه في الحقيقة يحشوكم إلى الرسوخ والتمكين، لأنه كلما حرككم بنزغه فزعتم إلى ربكم في دفعه، حتى يمكنكم من حضرته، فإنما يأمركم بما يسوء وجوهكم ويغُم قلوبكم، من مفارقة شهود الأحباب، والوقوف مِنْ وراء الباب، وأن تقولوا على الله ما ليس بحق ولا صواب، كثبوت السَّوي، أو الالتفات إلى الهوى\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}