{
  "chapter": "البقرة",
  "text": "والهكم اله وحد لا اله الا هو الرحمن الرحيم",
  "translations": [
    {
      "translation": "Your God is one God; there is no god other than He, the compassionate, ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Deity is Allah alone: there is no deity save the All-Beneficent and All-Merciful Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord is the only Lord. There is no God but He, the Beneficent and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God; there is no God except Him – the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Ilah (God) is One Ilah (God ـ Allah), La ilaha illa Huwa (there is none who has the right to be worshipped but He), the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your God is one God! there is no god but He; He is the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God; there is no god but He, the All-merciful, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Allah is One Allah; there is no Allah save Him, the Beneficent, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is one God. There is no deity save Him. He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the God of you all is one God; there is no God but he, the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your god is the One God; there is no god except Him, the All-beneficent, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Allah is One Allah: There is no god but He, Most Gracious, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Ilah (God) is One Ilah (God - Allah), La ilaha illa Huwa (there is none who has the right to be worshipped but He), the Most Beneficent, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is One God. There is no god except He. He is the Merciful, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your God is one God. There is no god but He, the Benevolent, the Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your god is one God. There is no deity [worthy of worship] except Him, the Entirely Merciful, the Especially Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:163] When they asked him [Muhammad (s)] to describe his Lord, the following was revealed: Your God, the One deserving of your worship, is One God, without any equal in either essence or attribute; there is no god except Him, He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then declares His Oneness because the unbelievers denied this divine Oneness, saying: (Your God is one God) without son or partner; (there is no God save Him, the Beneficent) the Tender, (the Merciful) the Compassionate.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِلَـٰهُكُمْ } المظهر لكم أيها المؤمنون وإله الكافرين الكاتمين { إِلَـٰهٌ وَاحِدٌ } لا تعدد فيه ولا اثنينية بل { لاَّ إِلَـٰهَ } أي: لا موجود حقيقي { إِلاَّ هُوَ } الموجود الحقيقي الحق؛ إذ لا كثرة في الوجود، بل هو واحد في الذات، فرد في الصفات، ليس كمثله شيء { ٱلرَّحْمَـٰنُ } المبدئ لكم ولهم عامة بإشراق تجلياته ومد أظلاله على العدم في النشأة الأولى { ٱلرَّحِيمُ } [البقرة: 163] المعيد لكم خاصة إلى مبدئكم الأصلي ومقصدكم الحقيقي في النشأة الأخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}