{
  "chapter": "البقرة",
  "text": "وقال الذين اتبعوا۟ لو ان لنا كرة فنتبرا منهم كما تبرءوا۟ منا كذلك يريهم الله اعملهم حسرت عليهم وما هم بخرجين من النار",
  "translations": [
    {
      "translation": "And the followers will say: \"Could we live but once again we would leave them as they have abandoned us now.\" God will show them thus their deeds, and fill them with remorse; but never shall they find release from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those who followed them will say, \"Would that we were given another chance to return to the world: then we will disown them just as they have disowned us today.\" Thus will Allah bring before them the deeds they did in the world in such a manner as to make them wring their hands in regret but they shall be unable to come out of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The followers will say, \"Had we had the chance we also would have denounced our leaders.\" That is how God will show them their regrettable deeds. They will not be able to escape from hell fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the followers will say, “If we were to return (to earth), we would break off from them like they have broken off from us”; this is how Allah will show them their deeds as despair for them; and they will never come out from the fire (hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who followed will say: \"If only we had one more chance to return (to the worldly life), we would disown (declare ourselves as innocent from) them as they have disowned (declared themselves as innocent from) us. \" Thus Allah will show them their deeds as regrets for them. And they will never get out of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who followed shall say: Had there been for us a return, then we would renounce them as they have renounced us. Thus will Allah show them their deeds to be intense regret to them, and they shall not come forth from the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those that followed say, 'O if only we might return again and disown them, as they have disowned us!' Even so God shall show them their works. O bitter regrets for them! Never shall they issue from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who were but followers will say: If a return were possible for us, we would disown them even as they have disowned us. Thus will Allah show them their own deeds as anguish for them, and they will not emerge from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who followed will say, \"If we could only return to the world, we would disown them as they have disowned us.\" God will thus show them their actions as a cause of bitter regret and remorse. They shall never emerge from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who had followed shall say would that for us were a return, then would we quit ourselves of them as they have quitted themselves of us. In this wise Allah will show them their works as vain regrets; and they shall not be coming forth from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when the followers will say, ‘Had there been another turn for us, we would disown them as they disown us [now]!’ Thus shall Allah show them their deeds as regrets for themselves, and they shall not leave the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who followed would say: \"If only We had one more chance, We would clear ourselves of them, as they have cleared themselves of us.\" Thus will Allah show them (The fruits of) their deeds as (nothing but) regrets. Nor will there be a way for them out of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who followed will say: \"If only we had one more chance to return (to the worldly life), we would disown (declare ourselves as innocent from) them as they have disowned (declared themselves as innocent from) us.\" Thus Allah will show them their deeds as regrets for them. And they will never get out of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who followed them will say: 'If only that we might return once, and disown them as they have disowned us' As such Allah will show them their own works to be regrets for them, and they shall never emerge from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who followed will say, “If only we can have another chance, we will disown them, as they disowned us.” Thus God will show them their deeds, as regrets to them, and they will not come out of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who followed will say, \"If only we had another turn [at worldly life] so we could disassociate ourselves from them as they have disassociated themselves from us.\" Thus will Allah show them their deeds as regrets upon them. And they are never to emerge from the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:167] And those who followed say, ‘O, if only we might return again, to the world, and disown them, the ones who had been followed, as they have disowned us!’, on this day (the particle law, ‘if only’, is an optative, and its response is natabarra’a, ‘we disown’). So, just as He showed them the severity of His chastisement and their disowning of one another, so too, God shall show them their, evil, works, as, anguish (hasarāt is a circumstantial qualifier), regrets, for them! Never shall they exit from the Fire, once they have entered it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who were but followers) i.e. the lowly (will say: If a return) to this world (were possible for us, we would disown them) disown the leaders in this world (even as they have disowned us) in the Hereafter. (Thus will Allah show them their own deeds as anguish) as regrets (for them) in the Hereafter, (and they) the leaders and those who followed them (will not emerge from the Fire).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { كَذَلِكَ يُرِيهِمُ ٱللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ } وواحدُهَا حَسرةٌ\n وهي أشد النَدَامَةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالواو في { ورأوا العذاب } واو الحال، أي: تبرّؤوا عنهم في حال رؤيتهم العذاب وتقطع الوصل بينهم، يعني: حال ظهور شرّ المقارنة وتبعتها، ونفاد خيرها وفائدتها، كحال سفاح الكلاب مثلاً { وقال الذين اتبعوا لو أنّ لنا كرّة } أي: ليت لنا كرّة { كذلك يُرِيهم الله أعمالهم حَسَرات عليهم } أي: تنقلب محباتهم وما يبنى عليها من الأعمال حسرات عليهم، وكذا يكون حال القوى الروحانية المصادقة للقوى النفسانية التابعة لها، المسخّرة إياها في تحصيل لذاتها\n { يا أيها الناس كُلُوا مما في الأرض } أي: تناولوا من اللذّات والتمتعات التي في الجهة السفلية من عالم النفس والبدن على وجه يحلّ ويطيب، أي: على قانون العدالة بإذن الشرع واستصواب العقل بقدر الاحتياج والضرورة، ولا تخطوا حدّ الاعتدال الذي به تطيب وتنفع إلى حدود الإسراف، فإنها خطوات الشيطان\n ولهذا قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آيسوا من الانتقام { قَالَ ٱلَّذِينَ ٱتَّبَعُواْ } نادمين متحسرين متمنين: { لَوْ أَنَّ لَنَا كَرَّةً } مكررة في النشأة الأولى { فَنَتَبَرَّأَ مِنْهُمْ } فيها تلافياً وتداركاً لما مضى من اتخاذنا إياهم آلهة { كَمَا تَبَرَّءُواْ مِنَّا } في هذه النشأة، ولا تنفعهم هذه الندامة ولا التمني، بل ما يزيدهم إلا غراماً فوق غرام { كَذَلِكَ } أي: مثل عذاب اتخاذهم { يُرِيهِمُ ٱللَّهُ } أي: يحضرهم { أَعْمَالَهُمْ } الفاسدة السابقة كلها، ويعذبهم عليها فرداً فرداً، وما يقولون فيه وما لهم في تلك الحالة إلا { حَسَرَاتٍ } نازلةٍ { عَلَيْهِمْ } من تذكر سوء عملهم وقبح صنيعهم، وهذا من أسوأ العذاب وأشد العقاب، أعاذنا الله من ذلك { وَ } بالجملة: { مَا هُم } لا تابعون ولا متبوعون { بِخَارِجِينَ } أبداً { مِنَ ٱلنَّارِ } [البقرة: 167] أي: نار البعد والإمكان المورث للحسرة والخذلان\n\n\n\n\nأجرنا من النار يا مجير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nو { حسَرات }: حال، إن كانت بصرية، على مذهب أهل السنّة، أو مفعول ثالث إن كانت عِلمية على مذهب المعتزلة القائلين بعدم تشخص الأعمال\n يقول الحقّ جلّ جلاله: { ولو ترى } يا محمد، أو كل من يتأتى منه الرؤية، حالَ { الذين ظلموا } باتخاذهم الأنداد والأوثان، بعد وضوح الأدلة وسُطوع البرهان، حيث { يرون العذاب } محيطاً بهم، والزبانيةُ تَغْلِبُهم، والنار تلتقطهم، لرأيت أمراً فظيعاً، وخطباً جسيماً، ولعلمت { أن القوة لله جميعاً } ، أو لو يرى الذين ظلموا العذاب الذي أُعِد لهم سبب شركهم، لرأوا أمراً عظيماً، وليتقنوا { أن القوة لله جميعاً وأن الله شديد العذاب }\n وذلك حين يتبرأ المتبعون - وهم الرؤساء -، من الأتباع - وهم القلّة الضعفاء - والحالة أنهم { رأوا العذاب } الفظيع، { وتقطعت بهم الأسباب } أي: أسباب المودة والوُصْلات التي كانت بينهم في الدنيا، وصارت مودتهم عداوة، { وقال } حينئذٍ الضعفاء { الذين اتبعوا } شياطينهم في الكفر والضلال: { لو أن لنا كَرَّة } أي: رجعة للدنيا { فنتبرأ منهم } أي: من كبرائهم { كما تبرءوا منا } اليوم\n { كذلك } أي: مثل ذلك الإبراء الفظيع { يريهم الله أعمالهم حسرات } ونَدَمات { عليهم } فيدخلون النار على سبيل الخلود، { وما هم بخارجين من النار }\n الإشارة: يا من أقبل على مولاه، وجعل محبة سيده بُغْيته ومُناه، فلم يُشرك في محبة حبيبه سواه، لو رأيت من ظلم نفسه باتباع هواه، وأشرك مع الله في محبته سواه، باتباع حظوظ دنياه، وذلك حين يرون ما هم فيه من الانحطاط والبعاد، وما أعد الله لأهل المحبة والوداد من الفوز بالقرب من الحبيب، ومشاهدة جمال القريب، لرأيت أمراً عظيماً وخطباً جسيماً، ولعلمت أن القوة كلها لله، قَرّبَ مَنْ شاء بفضله الأصاغر، ويقع التفريق بين الأصحاب والعشائر، إلا من اجتمعوا على محبة الحبيب، وتعاونوا على طاعة القريب المجيب،\n\n[الزّخرُف: 67]\n لا تصحب من لا يُنْهِضُك حالهُ، ولا يدلك على الله مقاله - فكل من صحب أهل الغفلة أو رَكَنَ إلى أهل الدنيا فلا بد أن يرى ذلك حسرات يوم القيامة، يوم لا ينفع الندم وقد زلّ القدم\n ولله دَرُّ صاحب العَيْنية رضي الله عنه حيث يقول:\n\nولما حذَّر الحقّ تعالى من الشرك الجلي والخفي، حذَّر من متابعة المشركين في التحريم والتحليل بلا حكم شرعي\n\n",
      "translations": []
    }
  ]
}