{
  "chapter": "البقرة",
  "text": "ان فى خلق السموت والارض واختلف اليل والنهار والفلك التى تجرى فى البحر بما ينفع الناس وما انزل الله من السماء من ماء فاحيا به الارض بعد موتها وبث فيها من كل دابة وتصريف الريح والسحاب المسخر بين السماء والارض لءايت لقوم يعقلون",
  "translations": [
    {
      "translation": "Creation of the heavens and the earth, alternation of night and day, and sailing of ships across the ocean with what is useful to man, and the rain that God sends from the sky enlivening the earth that was dead, and the scattering of beasts of all kinds upon it, and the changing of the winds, and the clouds which remain obedient between earth and sky, are surely signs for the wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If they want a sign for the perception of this Reality) surety there are countless signs for those who use their common sense; they can see alternation of the night and day, in the ships that sail the ocean laden with cargoes beneficial to mankind, and in the rain-water which Allah sends down from the sky and thereby gives life to the earth after its death and spreads over it all kinds of animate creatures, in the blowing of the winds and in the clouds which obediently wait for orders between the sky and the earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The creation of the heavens and the earth, the alternation of nights and days, the ships that sail in the sea for the benefit of the people, the water that God sends from the sky to revive the dead earth where He has scattered all kinds of animals, the winds of all directions, and the clouds rendered for service between the sky and the earth are all evidence (of His existence) for those who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in the creation of the heavens and the earth, and in the continuous alternation of night and day, and the ships which sail the seas carrying what is of use to men, and the water which Allah sends down from the sky thereby reviving the dead earth and dispersing all kinds of beasts in it, and the movement of the winds, and the obedient clouds between heaven and earth – certainly in all these are signs for the intelligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, in the creation of the heavens and the earth, and in the alternation of night and day, and the ships which sail through the sea with that which is of use to mankind, and the water (rain) which Allah sends down from the sky and makes the earth alive therewith after its death, and the moving (living) creatures of all kinds that He has scattered therein, and in the veering of winds and clouds which are held between the sky and the earth, are indeed Ayat (proofs, evidences, signs, etc.) for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely in the creation of the heavens and the earth and the alternation of the night and the day, and the ships that run in the sea with that which profits men, and the water that Allah sends down from the cloud, then gives life with it to the earth after its death and spreads in it all (kinds of) animals, and the changing of the winds and the clouds made subservient between the heaven and the earth, there are signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": ".. Surely in the creation of the heavens and the earth and the alternation of night and day and the ship that runs in the sea with profit to men, and the water God sends down from heaven therewith reviving the earth after it is dead and His scattering abroad in it all manner of crawling thing, and the turning about of the winds and the clouds compelled between heaven and earth -- surely there are signs for a people having understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! In the creation of the heavens and the earth, and the difference of night and day, and the ships which run upon the sea with that which is of use to men, and the water which Allah sendeth down from the sky, thereby reviving the earth after its death, and dispersing all kinds of beasts therein, and (in) the ordinance of the winds, and the clouds obedient between heaven and earth: are signs (of Allah's Sovereignty) for people who have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the creation of the heavens and the earth; in the alternation of night and day; in the ships that sail the ocean bearing cargoes beneficial to man; in the water which God sends down from the sky and with which He revives the earth after its death, scattering over it all kinds of animals; in the courses of the winds, and in the clouds pressed into service between earth and sky, there are indeed signs for people who use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in the creation of the heavens and the earth, and the alternation of night and day, and the ships that course upon the sea laden with that which profiteth mankind, and that which Allah sendeth down of water from the heaven and quickenoth the earth thereby after the death thereof; and scattereth therein of all kinds of moving creatures, and in the veering of the winds and the cloud subjected for service betwixt heaven and earth. are signs unto a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in the creation of the heavens and the earth, and the alternation of night and day, and the ships that sail at sea with profit to men, and the water that Allah sends down from the sky—with which He revives the earth after its death, and scatters therein every kind of animal—and the changing of the winds, and the clouds disposed between the sky and the earth, there are surely signs for a people who exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! in the creation of the heavens and the earth; in the alternation of the night and the day; in the sailing of the ships through the ocean for the profit of mankind; in the rain which Allah Sends down from the skies, and the life which He gives therewith to an earth that is dead; in the beasts of all kinds that He scatters through the earth; in the change of the winds, and the clouds which they Trail like their slaves between the sky and the earth;- (Here) indeed are Signs for a people that are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! In the creation of the heavens and the earth, and in the alternation of night and day, and the ships which sail through the sea with that which is of use to mankind, and the water (rain) which Allah sends down from the sky and makes the earth alive therewith after its death, and the moving (living) creatures of all kinds that He has scattered therein, and in the veering of winds and clouds which are held between the sky and the earth, are indeed Ayat (proofs, evidences, signs, etc.) for people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the creation of the heavens and the earth; in the alternation of night and day; in the ships that sail upon the sea with what is beneficial to the people; in the water which Allah sends down from the sky and with which He revives the earth after its death, and He spread in it from each moving (creation); in the movement of the winds, and in the clouds that are compelled between heaven and earth surely, these are signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the creation of the heavens and the earth; in the alternation of night and day; in the ships that sail the oceans for the benefit of mankind; in the water that God sends down from the sky, and revives the earth with it after it had died, and scatters in it all kinds of creatures; in the changing of the winds, and the clouds disposed between the sky and the earth; are signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, in the creation of the heavens and earth, and the alternation of the night and the day, and the [great] ships which sail through the sea with that which benefits people, and what Allah has sent down from the heavens of rain, giving life thereby to the earth after its lifelessness and dispersing therein every [kind of] moving creature, and [His] directing of the winds and the clouds controlled between the heaven and the earth are signs for a people who use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:164] They then asked for a sign to prove this, and the following was revealed: Surely in the creation of the heavens and the earth, and the marvels contained in them, and the alternation of the night and day, passing and returning, increasing and diminishing, and the ships that run in the sea, and do not become cracked and sink, with what profits men, of trade and merchandise, and the water, the rain, God sends down from the heaven with which He revives the earth, with vegetation, after it is dead, after it has dried out, and He scatters abroad in it all manner of crawling thing, by dividing them and spreading them throughout on account of the vegetation, for they thrive on the fertile pastures it produces; and the disposition of the winds, changing it from south to north, from cold to warm, and the clouds compelled, subjugated by God’s command, moving to wherever God wishes, between heaven and the earth, without being attached [to either of the two] — surely there are signs, indicating His Oneness, exalted be He, for a people who comprehend, [a people] who contemplate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He mentioned the sign of His divine Oneness, saying: (Lo! In the creation of the heavens and the earth) i.e. in their making; or as it is said: in the making of what is in them, (and the difference of night and day) in the alternation of night and day, and in the increase and decrease of their duration, (and the ships which run upon the sea with that which is of use to men) in their livelihoods, (and the water) rain (which Allah sendeth down from the sky, thereby reviving) through rain (the earth after its death) after suffering by drought and being dried up, (and dispersing) creating (all kinds of beasts) male and female (therein, and the ordinance of the winds) in changing the direction of the wind towards the right and towards the left, coming sometimes from the East and sometimes from the West, sometimes carrying torment and sometimes mercy: (and the clouds obedient) subservient (between heaven and earth) He says: in all these (are signs) indications of the Lord's divine Oneness (for people who have sense) who believe that they are from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱلْفُلْكِ ٱلَّتِي تَجْرِي فِي ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ } فالفُلكُ: السَّفينةُ\n وهو واحدٌ\n\n\n\n\nوقولهُ تعالى: { وَبَثَّ فِيهَا } معناهُ فَرَّقَ فيها وَبَسَطَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما كان لوحدته سبحانه آيات ودلائل واضحات لمن تأمل في عجائب مصنوعاته، وبدائع مبدعاته ومخترعاته، المترتبة إلى أسمائه وصفاته المستندة إلى وحدة ذاته، أشار سبحانه إلى نبذتها إرشاداً وتنبيهاً فقال: { إِنَّ فِي خَلْقِ ٱلسَّمَٰوَٰتِ } أي: إظهار العلويات التي هي الأسماء والصفات المؤثرة الفاعلة { وَٱلأَرْضِ } أي: السفلية التي هي طبيعة العدم القابلة المتأثرة من العلويات { وَٱخْتِلاَفِ ٱللَّيْلِ } أي: ظلمة العدم والجهل والعمى { وَٱلنَّهَارِ } نور الوجود والعلم والعين { وَٱلْفُلْكِ } أي: الأجساد الحاصلة من تأثير الأسماء وتأثير الطبيعة منها { ٱلَّتِي تَجْرِي فِي ٱلْبَحْرِ } أي: بحر الوجود الذلا لا ساحل له ولا قعر { بِمَا يَنفَعُ ٱلنَّاسَ } من جواهر المعارف، ودرر الحقائق المستخرجة منه { وَمَآ أَنزَلَ ٱللَّهُ } من كرمه وجوده بلا عوض ولا غرض { مِنَ ٱلسَّمَآءِ } المعدة للإفاضة { مِن مَّآءٍ } علمٍ وعينٍ وكشفٍ { فَأَحْيَا بِهِ ٱلأَرْضَ } أي: الطبيعة { بَعْدَ مَوْتِهَا } بالجهل الجبلي { وَ } بعدما ما أصابها { بَثَّ } بسط ونشر { فِيهَا مِن كُلِّ دَآبَّةٍ } من القوى المدركة والمحركة المتشعبتين بالشعبة الكثيرة على صنعة الحياة المتفرعة على التجلي الحي { وَتَصْرِيفِ ٱلرِّيَاحِ } المروحة للنفوس، المتوجهة الناشئة المنشئة من النفس الرحمانية نحو الطبيعة المكدرة بالكدورات الجسمانية { وَٱلسَّحَابِ } أي: حجاب العبودية وقيود الغيرية الناشئة من مقتضيات الأسماء والصفات { ٱلْمُسَخَّرِ } الممدود { بَيْنَ ٱلسَّمَآءِ وَٱلأَرْضِ } أي: سماء الأسماء الإلهية وأرض الطبيعة الكونية { لآيَاتٍ } دلائل وبراهين يقينيةٍ دالةٍ على أن مظهر الكل واحد { لِّقَوْمٍ يَعْقِلُونَ } [البقرة: 164] يعلمون الأشياء بالدلائل العقلية اليقينة المنتجة لعلم اليقين إلى العين والحق لو كوشفوا\n\n\n\n\nربنا اكشف علينا ما أودعت فينا بفضلك وتوفيقك، إنك أنت الجواد الكريم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلهكم إله واحد } مبتدأ وخبر، وجملة { لا إله إلا هو }: تقرير لها وتأكيد، و { الرحمان الرحيم }: خبران آخران، أو عن مبتدأ مضمر، وأنث { الفلك } لأنه بمعنى السفينة، و { من السماء } ابتدائية، و { من ماء } بيانية، و { بث }: عطف على { أنزل } أو { أحيا } لأن الحيوانات تنمو بنزول المطر والخصب، والبث: النشر والتفريق و { تصريف الريح }: هبوبها من الجهات المختلفة\n يقول الحقّ جلّ جلاله: { وإلهكم } يا معشر العباد الذي يستحق أن يعبد { إله واحد } لا شريك له، ولا نظير، ولا ضد له ولا ند، { لا إله إلا هو } ، إذ لا يستحق العبادة غيره، إذ هو { الرحمن } بنعمة الإيجاد { الرحيم } بنعمة الإمداد، فكل ما سواء مُكونٌ مخلوق، إما مُنْعَم عليه أو نعمة، فلم يستحق العبادة غيره\n ثم برهن على وجوده، وثبوت وحدانيته بثمانية أمور، فقال: { إن في خلق السماوات } طباقاً متفاصلة مرفوعة بغير عمد، وما اشتملت عليه من الكواكب والبروج والمنازل، وفي { الأرض } وما اشتملت عليه من الجبال والبحار والأنهار والأشجار وأنواع الثمار، وفي { اختلاف الليل والنهار } بالطول القصَر، أو تعاقبها بالذهاب والمجيء، { و } في { الفلك التي تجري في البحر } بقدرته مع إمكان رسوبها إلى الأسفل، متلبسة { بما ينفع الناس } من التجارة وغيرها\n وقال البيضاوي: القصد بالاستدلال بالبحر وأحواله، وتخصيص الفلك بالذكر لأنه سبب الخوض فيه والاطلاع على عجائبه ولذلك قَدَّمه على ذكر المطر والسحاب، لأن منشأهما منه في الغالب\n هـ\n { و } في { ما أنزل الله من السماء من ماء } من غير ظهور مادة سابقة، بل تُبرزه القدرة من عالم الغيب قريب عهد بالله، ولذلك كان عليه الصلاة والسلام يَتَمَطَّر أي: يَنْصُبُ وجهه للمطر إذا نزل تبركاً به، { فأحيا } الحقّ تعالى بذلك المطر { الأرض بعد موتها } ويُبْسِها، بالنبات والأزهار وأصناف النّوار والثمار، وفيما نشر { فيها من كل دابة } من النملة إلى الفيلة، { و } في { تصريف الرياح } وهبوبها من جهات مختلفة، وهي الجهات الأربع وما بينها بصفات مختلفة، مُلَقِّحَةٍ للشجر وعقيم وصرِ، وللنصر والهلاك { و } في { السحاب المسخر } أي: المذلَّل { بين السماء والأرض } لا يسقط ولا يرتفع، مع أن الطبع يقتضي أحدهما، أو مسخر للرياح تُقَلِّبه في جو السماء بمشيئة الله { لآيات لقوم يعقلون }\n أي: تلك المخلوقات آيات دالّة على وحدانيته تعالى وباهرٍ قدرته، و\n\n[الأنبياء: 22]\n وفي الآية حَضٍّ على التفكر، ولذلك قال عليه الصلاة والسلام:\n\n \" ويلٌ لِمَنْ قَرأَ هَذهِ الآيةِ فَمَجَّ بِها \" \n\n، أي: لم يتفكر فيها دلالة على شرف علم التوحيد العام والخاص\n والله تعالى أعلم\n الإشارة: قال الجنيد: التوحيد معنى تضْمَحِل فيه الرسوم وتندرج فيه العلوم، ويكونُ الله كما لم يزل\n\n\nقلت: وهذا هو التوحيد الخاص، أعني توحيد أهل الشهود والعيان: ثم قال: وأصولُه خمسة أشياء: رفعُ الحدَث، وإثبات القدم، وهُجْران الإخُوان، ومفارقةُ الأوطان، ونسيان ما عَلِم وجَهِل\n هـ\n قلت: قوله: وهجران الإخوان، يعني: غيرَ مَنْ يستعين بهم على السير، وأما من يستعين بهم فلا يستغني عنهم\n واعلم أن توحيد خلق الله تعالى على ثلاثة درجات: الأولى: توحيد العامة: وهو الذي يعصِمُ النفس والمال، وينجو به من الخلود في النار، وهو نَفْيُ الشركاء والأنداد، والصاحبةِ والأولاد، والأشباه والأضداد\n الثانية: توحيد الخاصة، وهو أنْ يَرى الأفعال كلها صادرة من الله وحده، ويشاهد ذلك بطريق الكشف لا بطريق الاستدلال، فإنَّ ذلك حاصل لكل مؤمن، وإنما مَقامُ الخاصة يقينٌ في القلب بعلم ضروري لا يحتاج إلى دليل، وثمرة هذا العلم الانقطاعُ إلى الله، والتوكل عليه وحده، فلا يرجوا الله، ولا يخاف أحداً سواه، إذ ليس يَرى فاعلاً إلا الله، فيَطْرَحُ الأسباب، وينبذ الأرباب\n الدرجة الثالثة: ألا يرى في الوجود إلا الله، ولا يشهد معه سواه، فيغيبَ عن النظر إلى الأكوان في شهود المُكَوَّن، وهذا مقام الفناء، فإن رُدّ إلى شهود الأثر بالله سُمي مقام البقاء\n هـ\n قال بعضَه ابنُ جُزَيّ باختصار\n قلت: وفي التحقيق أنهما أنهما مقامان مقام أهل الدليل والبرهان، وهو المذكور في الآية، لأنه هو الذي يطيقه جميع العباد، ومقام أهل الشهود والعيان، وهو خاص بالأفراد الذين بذلوا مهجهم في طلب الله، باعوا أنفسهم وأموالهم في سبيل الله، فعوّضهم الله في الدنيا جنة المعارف، وزادهم في الآخرة جنة الزخارف\n أهل الدليل والبرهان عمومٌ عند أهل الشهود والعيان لأن أهل الشهود والعيان قدسوا الحقّ تعالى عن أن يحتاج إلى دليل، فكيف يعرف بالمعارف من به عرفت المعارف؟ كيف يستدل عليه بما هو في وجوده مفتقر إليه؟ أيكون لغيره من الظهور ما ليس له؟ - متى غاب حتى يحتاج إلى دليل عليه؟ ومتى بَعُد حتى تكون الآثار هي التي توصل إليه؟ - ولله در القائل:\n\nوقال آخر:\n\nولما كانت المحبة تزيد وتنقص باعتبار شهود الوحدانية، فكلما قَويَ التوحيدُ في القلب قويت المحبة لانحصارها في واحد، ذكرها بأثر التوحيد\n\n",
      "translations": []
    }
  ]
}