{
  "chapter": "البقرة",
  "text": "اذ تبرا الذين اتبعوا۟ من الذين اتبعوا۟ وراوا۟ العذاب وتقطعت بهم الاسباب",
  "translations": [
    {
      "translation": "When those who were followed will disclaim those who followed them, and see the torment all ties between them shall be severed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When He will inflict punishment, those very leaders and guides whom they followed in the world will disown them. But punishment they shall get and all their bonds shall be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the leaders see the torment and lose all their resources, they will denounce their followers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The day) when the leaders will be disgusted with their followers – and they shall see their punishment, and all their links will be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed disown (declare themselves innocent of) those who followed (them), and they see the torment, then all their relations will be cut off from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed shall renounce those who followed (them), and they see the chastisement and their ties are cut asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when those that were followed disown their followers, and they see the chastisement, and their cords are cut asunder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the day) when those who were followed disown those who followed (them), and they behold the doom, and all their aims collapse with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they face their punishment, those who have been followed will disown their followers, and all their ties shall be cut asunder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed shall quit themselves of those who followed, and they all shall behold the torment, and sundered between them shall be the Cords.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed will disown the followers, and they will sight the punishment while all their means of recourse will be cut off,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then would those who are followed clear themselves of those who follow (them): They would see the penalty, and all relations between them would be cut off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who were followed, disown (declare themselves innocent of) those who followed (them), and they see the torment, then all their relations will be cut off from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when those who were followed disown those who followed, and they see the punishment and relationships are broken off,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were followed will then disown those who followed them, and they will see the retribution, and ties between them will be severed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And they should consider that] when those who have been followed disassociate themselves from those who followed [them], and they [all] see the punishment, and cut off from them are the ties [of relationship],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:166] When (idh here substitutes for the previous idh) those who were followed, that is, the leaders, disown their followers, that is to say, [when] they have denied misleading them [the latter], and they have seen the chastisement, and the cords, the bonds of affection and kinship that were between them on earth, are cut away before them, from them (taqatta‘at, ‘cut away’, is a supplement to tabarra’a, ‘disown’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When those who were followed) the leaders (disown those who followed (them)) the lowly among people, (and they behold) both the leaders and the lowly (the doom) in the Hereafter, (and all their aims) the pledges and congeniality that were between them in this world (collapse with them). 27\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَتَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ } معناهُ الأَوْصالُ التي كانتْ بينهم في الدنيا\n وواحدُهَا سَببٌ\n والسَّببُ أَيضاً الحَبْلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذ تبرأ } بدل من: إذ يرون العذاب، أي: وقت رؤيتهم العذاب هو وقت تبرّئ المتبوعين من التابعين مع لزوم كلّ منهم الآخر بمقتضى المحبة التي كانت بينهم لتعذب كلّ منهم بالآخر وتقيده واحتجابه به عن كمالاته ولذاته وانقطاع الأسباب والوصل الموجبة للفوائد والتمتعات التي كانت بينهم في الدنيا من القرابة، والرحم، والإلفة، والعهد، وسائر المواصلات الدنيوية الجالبة للنفع واللذة، فإنها تنقطع كلها بانقطاع لوازمها وموجباتها دون المواصلات الخيرية والمحبّات الإلهية المبنية على المناسبة الروحية والتعارف الأزليّ، فإنها تبقى ببقاء الروح أبداً وتزيد في الآخرة بعد رفع الحجب البدنية لاقتضائها محبة الله المفيدة في الآخرة، كما قال تعالى:\n\n \" وجبت محبتي للمتحابين فيّ \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل وقت { إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ } من الأنداد والأمثال { مِنَ ٱلَّذِينَ ٱتَّبَعُواْ } من المتخذين { وَ } ذلك حين { رَأَوُاْ } المتبوعين { ٱلْعَذَابَ } النازل على تابعيهم باتخاذهم آلهة، كذبوهم وأظهروا البراءة عنهم براءة نفوسهم { وَ } التابعون أيضاً يرونهم ويفهمون براءتهم ويقصدون انتقامهم ولا يستطيعون؛ إذ { تَقَطَّعَتْ بِهِمُ ٱلأَسْبَابُ } [البقرة: 166] أي: أسباب الانتقام بانقطاع النشأة الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}