{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ كتب عليكم القصاص فى القتلى الحر بالحر والعبد بالعبد والانثى بالانثى فمن عفى له من اخيه شىء فاتباعۢ بالمعروف واداء اليه باحسن ذلك تخفيف من ربكم ورحمة فمن اعتدى بعد ذلك فله عذاب اليم",
  "translations": [
    {
      "translation": "O believers, ordained for you is retribution for the murdered, (whether) a free man (is guilty) of (the murder of) a free man, or a slave of a slave, or a woman of a woman. But he who is pardoned some of it by his brother should be dealt with equity, and recompense (for blood) paid with a grace. This is a concession from your Lord and a kindness. He who transgresses in spite of it shall suffer painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, the lawn of retribution has been prescribed for you in cases of murder; if a free man commits a murder, the free man shall he punished for it and a slave for a slave: likewise if a woman is guilty of murder the same shall he accountable for it. But in case the injured brother is willing to show leniency to the murderer, the blood money should he decided in accordance with the common law and the murderer should pay it in a genuine way. This is an allowance and mercy from your Lord. Now there shall be a painful torment for anyone who transgresses the limits after this. O men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, in case of murder, the death penalty is the sanctioned retaliation: a free man for a free man, a slave for a slave, and a female for a female. However, if the convicted person receives pardon from the aggrieved party, the prescribed rules of compensation must be followed accordingly. This is a merciful alteration from your Lord. Whoever transgresses against it will face a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Retribution is made obligatory for you in the matter of those killed unjustly; a freeman for a freeman, and a slave for a slave, and a female for a female; and for him who is partly forgiven by his brother, seek compensation with courtesy and make payment in proper manner; this is a relief and a mercy upon you, from your Lord; so after this, a painful punishment is for whoever exceeds the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Al-Qisas (the Law of equality) is prescribed for you in case of murder: the free for the free, the slave for the slave, and the female for the female. But if the killer is forgiven by the brother (or the relatives) of the killed (against blood money), then it should be sought in a good manner, and paid to him respectfully. This is an alleviation and a mercy from your Lord. So after this, whoever transgresses the limits (i.e. kills the killer after taking the blood money), he shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! retaliation is prescribed for you in the matter of the slain, the free for the free, and the slave for the slave, and the female for the female, but if any remission is made to any one by his (aggrieved) brother, then prosecution (for the bloodwit) should be made according to usage, and payment should be made to him in a good manner; this is an alleviation from your Lord and a mercy; so whoever exceeds the limit after this he shall have a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, prescribed for you is retaliation, touching the slain; freeman for freeman, slave for slave, female for female. But if aught is pardoned a man by his brother, let the pursuing be honourable, and let the payment be with kindliness. That is a lightening granted you by your Lord, and a mercy; and for him who commits aggression after that -- for him there awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Retaliation is prescribed for you in the matter of the murdered; the freeman for the freeman, and the slave for the slave, and the female for the female. And for him who is forgiven somewhat by his (injured) brother, prosecution according to usage and payment unto him in kindness. This is an alleviation and a mercy from your Lord. He who transgresseth after this will have a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, retribution is prescribed for you in cases of murder: the free man for the free man, the slave for the slave, the female for the female. If the offender is granted some remission by the heir of the slain person, the agreed penalty should be equitably exacted and should be discharged in a handsome manner. This is an alleviation from your Lord and an act of grace. He who transgresses after this shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! prescribed unto you is retaliation for the slain; the free for the free, and a bondsman for a bondsman, and a woman for a woman; yet unto whomsoever is pardoned aught by his brother, then a serving with lenity and payments with kindness. That is an alleviation from your Lord and a mercy so whosoever shall transgress thereafter, for him there shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Retribution is prescribed for you regarding the slain: freeman for freeman, slave for slave, and female for female. But if one is granted any extenuation by his brother, let the follow up [for the blood-money] be honourable, and let the payment to him be with kindness. That is a remission from your Lord and a mercy; and should anyone transgress after that, there shall be a painful punishment for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! the law of equality is prescribed to you in cases of murder: the free for the free, the slave for the slave, the woman for the woman. But if any remission is made by the brother of the slain, then grant any reasonable demand, and compensate him with handsome gratitude, this is a concession and a Mercy from your Lord. After this whoever exceeds the limits shall be in grave penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Al-Qisas (the Law of Equality in punishment) is prescribed for you in case of murder: the free for the free, the slave for the slave, and the female for the female. But if the killer is forgiven by the brother (or the relatives, etc.) of the killed against blood money, then adhering to it with fairness and payment of the blood money, to the heir should be made in fairness. This is an alleviation and a mercy from your Lord. So after this whoever transgresses the limits (i.e. kills the killer after taking the blood money), he shall have a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, retaliation is decreed for you concerning the killed. A free (man) for a free (man), a slave for a slave, and a female for a female. He who is pardoned by his brother, let the ensuing be with kindness, and let the payment be with generosity. This is an alleviation from your Lord and mercy. He who transgresses thereafter shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Retaliation for the murdered is ordained upon you: the free for the free, the slave for the slave, the female for the female. But if he is forgiven by his kin, then grant any reasonable demand, and pay with good will. This is a concession from your Lord, and a mercy. But whoever commits aggression after that, a painful torment awaits him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, prescribed for you is legal retribution for those murdered - the free for the free, the slave for the slave, and the female for the female. But whoever overlooks from his brother anything, then there should be a suitable follow-up and payment to him with good conduct. This is an alleviation from your Lord and a mercy. But whoever transgresses after that will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:178] O you who believe, prescribed, made obligatory, for you is retaliation, on equal terms, regarding the slain, both in the attributes [of the one slain] and in the action involved; a free man, is killed, for a free man, and not for a slave; and a slave for a slave, and a female for a female. The Sunna makes it clear that a male may be killed [in retaliation] for a female, and that religious affiliation should be taken into account also, so that a Muslim cannot be killed in return for an disbeliever, even if the former be a slave and the latter a free man. But if anything, of the blood, is pardoned any one, of those who have slain, in relation to his brother, the one slain, so that the retaliation is waived (the use of the indefinite shay’un, ‘anything’, here implies the waiving of retaliation through a partial pardon by the inheritors [of the slain]; the mention of akhīh [‘his brother’] is intended as a conciliatory entreaty to pardon and a declaration that killing should not sever the bonds of religious brotherhood; the particle man, ‘any one’, is the subject of a conditional or a relative clause, of which the predicate is [the following, fa’ittibā‘un]) let the pursuing, that is, the action of the one who has pardoned in pursuing the killer, be honourable, demanding the blood money without force. The fact that the ‘pursuing’ results from the ‘pardoning’ implies that one of the two [actions] is a duty, which is one of al-Shāfi‘ī’s two opinions here. The other [opinion] is that retaliation is the duty, whereas the blood money is merely compensation [for non-retaliation], so that if one were to pardon but not name his blood money, then nothing [happens]; and this [latter] is the preferred [opinion]. And let the payment, of the blood money by the slayer, to him, the pardoner, that is, the one inheriting [from the slain], be with kindliness, without procrastination or fraud; that, stipulation mentioned here about the possibility of retaliation and the forgoing of this in return for blood money, is an alleviation, a facilitation, given, to you, by your Lord, and a mercy, for you, for He has given you latitude in this matter and has not categorically demanded that one [of the said options] be followed through, in the way that He made it obligatory for Jews to retaliate and for Christians to [pardon and] accept blood money; and for him who commits aggression, by being unjust towards the killer and slaying him, after that, that is, [after] pardoning — his is a painful chastisement, of   the Fire in the Hereafter, or of being killed in this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "29 (0 ye who believe! Retaliation is prescribed for you in the matter of the murdered ones; the freeman for the freeman) a freeman who premeditatedly kills another freeman, (and the slave for the slave) a slave who premeditatedly kills another, (and the female for the female) a female who premeditatedly kills another. This verse was revealed regarding two Arab clans but is abrogated by the verse: (... a life for a life) [5:45]. (And for him who is forgiven somewhat by his brother) whoever forgives the killing and takes instead blood money, (prosecution according to usage) Allah commands the person who asks for blood money to claim this money according to practised usage: three years if it is a full blood money, two years if it is half of the blood money, or one year if it is a third (and payment unto him) the person who is required to pay blood money is commanded to give the custodians of the murdered person what is due to them (in kindness) without the need to go to court or making it difficult for them. (This) this pardon (is an alleviation) appeasement (and a mercy from your Lord) towards the killer such that he is not killed. (He who transgresseth after this) after taking the blood money and kills the murderer (will have a painful doom) he shall be killed and will not be forgiven or allowed to pay blood money.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَمَنْ عُفِيَ لَهُ } معناهُ مَنْ تُركَ لَهُ\n ويقالُ العَفو أَخْذُ الدِّيةِ\n وقال ابن عباس: كانَ القِصَاصُ فِي بني إِسرائيل، ولمْ يكنْ لَهُمْ دِيةٌ\n فقالَ الله تعالى لِهَذِهِ الأُمةِ: { كُتِبَ عَلَيْكُمُ ٱلْقِصَاصُ فِي ٱلْقَتْلَى ٱلْحُرُّ بِالْحُرِّ وَٱلْعَبْدُ بِٱلْعَبْدِ وَٱلأُنثَىٰ بِٱلأُنْثَىٰ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ } فالعَفو: أَنْ يَقْبلَ الدِيةَ فِي العَمدِ اتّباعاً بالمَعْروفِ\n قالَ زيدُ بن علي عليهما السلامُ فيتَّّبعُ الطَالبُ بالمَعروفِ ويُؤدي المطْلوبُ إِليهِ بإِحْسَانٍ { ذٰلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ } مما كُتِبَ على مَنْ كَانَ قَبْلَكُمْ\n\n\n\n\nوقولهُ تعالى: { فَمَنِ ٱعْتَدَىٰ بَعْدَ ذٰلِكَ } معناهُ مَنْ قَتَلَ بَعدَ أَخْذِ الدّية؛ فإنه يقتل، ولا تقبل منه الدّية\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nالقصاص قانون من قوانين العدالة، فُرِض لإزالة عدوان القوّة السبعية، وهو ظلّ من ظلال عدله تعالى فإنه إذا تصرّف في عبده بإفنائه فيه عوّضه عن حرّ روحه روحاً موهوماً خيراً منه، وعن عبد قلبه قلباً موهوباً، وعن أنثى نفسه نفساً موهوبة كاملة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ناداهم سبحانه إصلاحاً لهم فيما يقع بينهم من الوقائع الهائلة، والفتن العظيمة الحادثة من ثوران القوة الغضبية، وطغيان الحمية الجاهلية، المؤدية إلى قتل البعض بعضاً ظلماً وعدواناً فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم وتوحيدكم المحافظة بزجر النفس الأمارة بالسوء عن مقتضياتها المنشعبة من القوى البشرية، وإن وقع فيكم أحياناً فاعلموا أنه { كُتِبَ } فُرض { عَلَيْكُمُ } في دينكم { ٱلْقِصَاصُ } بالمثل { فِي ٱلْقَتْلَى } المقتولين عمداً فيُقتل { ٱلْحُرُّ } القاتل { بِالْحُرِّ } المقتول { وَ }  كذا { ٱلْعَبْدُ } القاتل { بِٱلْعَبْدِ } المقتول، وبالحر وبالطريق الأولى { وَ } كذا يُقتل { ٱلأُنثَىٰ } القاتلة حرة كانت أو أمة { بِٱلأُنْثَىٰ } المقتولة أيضاً، كذلك لنظيرتها قياساً على الحر ةالعبد، والأمة بالحرة بالطريق الأولى، وكذا بالذكرين مهما وافى قتل الحر، والحرة بالعبد والأمة، فقد خولف فيه، الظاهر أنه لم يقتل\n\n\n{ فَمَنْ عُفِيَ لَهُ } أي: للجاني والقاتل من المحقوق والسهام المشتركة بين الغرماء الطالبين منه قصاص أخيه المسلم المقتول بيده ظلماً { مِنْ أَخِيهِ شَيْءٌ } قليل من الحقوق المذكورة { فَٱتِّبَاعٌ بِٱلْمَعْرُوفِ } أي: فالحكم لازم عليكم في دينكم أيها الغرماء متابعة المعروف المستحسن عند الله وعند المؤمنين والرجوع إلى الدية وعدم القصاص { وَ } عليك أيها الجاني { أَدَآءٌ } أي: أ داء الدية التي هي فدية حياتك { إِلَيْهِ } أي: إلى و لي المقتول { بِإِحْسَانٍ } معتذراً نادماً متذللاً على وجه الانكسار بلا مطل وكسل { ذٰلِكَ } أي: سقوط القصاص بعد عفو البعض ولزوم الدية يدله { تَخْفِيفٌ } لكم أيها المؤمنون وإصلاح لحالكم { مِّن } قبل { رَّبِّكُمْ } أمَّا التخفيف بالنسبة إلى الغرماء فبتسكين القوة الغضبية، وتليين الحمية العصبية بالمال المسرة لنفوسهم بعد وقوع ما وقع، وأمَّا بالنسبة إلى الجاني فظاهر لإبقاء الحياة بالمال { وَرَحْمَةٌ } نازلة لكم من ربكم لتصفية كدورتكم الواقعة بينكم بواسطة القتل { فَمَنِ ٱعْتَدَىٰ } منكم وتجاوز عن الحمم { بَعْدَ ذٰلِكَ } المذكور بأن قتل الغرماءُ الجاني بعد عفو البعض وأخذ الدية، أو امتنع الجاني عن أداء الدية على الغرماء { فَلَهُ } أي: لكل من المعتدين { عَذَابٌ أَلِيمٌ } [البقرة: 178] يؤاخذون في الدنيا بما صدر عنهم، ويعاقبون عليها في الآخرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { عفا } لازمٌ يتعدى بالحرف: بعَنْ إلى الجناية، وباللام إلى الجاني، فيقال: عفوت لفلان عن جنايته و { ابتاعٌ } خبر عن مضمَر، أي: فالأمر اتباع، و { حياة } مبتدأ و { في القصاص } خبره، و { لكم } خبر ثان، أو صلة له، أو حال من الضمير المستكِنْ فيه\n وفيه من البلاغة والفصاحة ما لا يخفى، جعل الشيء مجيء ضده، وعرّف القصاص ونكْر الحياة ليدل على التعظيم والتعميم، أي: ولكم نوع من الحياة عظيم، وذلك لأن العلم به يَرْدَع القاتل عن القتل، فيكون سببَ حياةِ نَفْسَيْن، ولأنهم كانوا يقتلون غير القاتل، والجماعة بالواحد، فتثور الفتنة بينهم، فإذا اقتُصّ من القاتل سَلِم الباقون، ويصيرُ ذلك سبباً لحياتهم\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: يا أيها المؤمنون { كتب عليكم القصاص في } شأن { القتلى } في العَمْد، فاستسلِموا للقصاص، فالحُر يُقتل { بالحر } ، ولا يقتل بالعبد\n بل يغرم قيمته لسيده، ودليله قوله - عليه الصلاة والسلام-:\n\n \" لا يُقتل مسلمٌ بكافرٍ ولا حرٌ بعبدٍ \" \n\nوالعبد يقتل بالعبد، إن أراد سيد المقتول قتله، فإن استحياه خُيِّر سيدُه بين إسلامه وفدائه بقيمة العبد\n وكذلك إن قُتل الحر خُيّر أولياؤُه بين قتله أو استرقاقه، فإن استحيَوْه خُيِّر سيدُه بين إسلامه وفدائه بِدِيَةِ الحر العَمْد، والأنثى تُقتل بالأنثى والذكر، والذكر يقتل بالأنثى\n وتخصيصُ الآية بالمُساوي، قال مالك: أحسنُ ما سمعتُ في هذه الآية: أنه يُراد بها الجنسُ - أي: جنس الحر - والذكر والأنثى فيه سواء\n وأعيدَ ذِكْرُ الأنثى تأكيداً وتهمُّمَا بإذهاب أمر الجاهلية\n هـ\n يعني أن أل في الحر: للجنس، تشمل الذكر والأنثى\n وأعاد ذكر الأنثى اهتماماً بردِّ ما كان يفعله الجاهلية من عدم القَودَ فيها\n ثم قال الحقّ جلّ جلاله: { فمن عُفي له من } دم أخيه { شيء } ولو قَلَّ، فقد سقط القتل، فالواجب اتباعٌ للقاتل بالدية { بالمعروف } من غير تعنيف ولا تعنيت، و { أداء } من القاتل { بإحسان } من غير مطل ولا بَخس\n { ذلك } - الذي شرعْتُ لكم من أمر العفو والديّة - { تخفيف من ربكم ورحمة } بكم، وقد كُتب على اليهود القصاص وحده، وعلى النصارى مطلقاً\n وخيَّركم أيها الأمة المحمدية بين أخذ الديّة والقصاص\n { فمن اعتدى } بعد أخذ الديّة وقَتَل { فله عذاب أليم } في الدنيا والآخرة، في الدنيا: بأن يُقتل لا محالة لقوله - عليه الصلاة والسلام -:\n\n \" لا أُعَافِي أحَداً قَتَلَ بَعْدَ أَخْذِ الدِّيَة \"\n \n",
      "translations": []
    }
  ]
}