{
  "chapter": "البقرة",
  "text": "او۟لئك الذين اشتروا۟ الضللة بالهدى والعذاب بالمغفرة فما اصبرهم على النار",
  "translations": [
    {
      "translation": "They are those who bartered away good guidance for error, and pardon for punishment: How great is their striving for the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the people who have bartered away Guidance for error and Allah's pardon for His punishment. How audacious they are: they are ready even to endure the fire of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have exchanged guidance for error and forgiveness for torment. What makes them seek the fire so earnestly (for they are doomed to be punished)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the people who purchased error in exchange of guidance, and torment in exchange of pardon; so how much can they bear the fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have purchased error at the price of guidance, and torment at the price of forgiveness. So how bold they are (for evil deeds which will push them) to the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who buy error for the right direction and chastisement for forgiveness; how bold they are to encounter fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that have bought error at the price of guidance, and chastisement at the price of pardon; how patiently they shall endure the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who purchase error at the price of guidance, and torment at the price of pardon. How constant are they in their strife to reach the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who have taken error in exchange for guidance and punishment for forgiveness. How little do they seem to fear the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they who have purchased error for guidance, and torment for forgiveness, How enduring must they be of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who bought error for guidance, and punishment for pardon: how patient of them to face the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who buy Error in place of Guidance and Torment in place of Forgiveness. Ah! what boldness (They show) for the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who have purchased error at the price of Guidance, and torment at the price of Forgiveness. So how bold they are (for evil deeds which will push them) to the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are those who buy error for guidance, and punishment for pardon. How patiently they will be in the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who exchange guidance for error, and forgiveness for punishment. But why do they insist on the Fire?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones who have exchanged guidance for error and forgiveness for punishment. How patient they are in pursuit of the Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:175]   Those are they that have bought error at the price of guidance, taking the former in place of the latter in this world, and chastisement at the price of pardon, [the pardon] that would have been prepared for them in the Hereafter, had they not concealed this matter; what makes them so patient for the Fire?, that is, how great is the extent of their patience? This [statement] is intended to provoke amazement in the believers at the way in which they [the disbelievers] commit sins that necessitate their punishment in the Fire with complete indifference. In reality they would have no patience whatever [to endure the Fire].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they who purchase error at the price of guidance) they purchased disbelief for the price of faith, (and torment at the price of pardon) Judaism for the price of Islam; it is also said that this means: they chose that which leads to the Fire instead of that which leads to Paradise. (How constant are they in their strife to reach the Fire) how bold are they to delve into the Fire? It is also said that this means: what made them so bold as to enter the Fire? And it is also said: how they indulging indeed in the works of the people of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَمَآ أَصْبَرَهُمْ عَلَى ٱلنَّارِ } معناهُ مَا أَجْرَأَهُم عليها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } الظالون الخاسرون هم { ٱلَّذِينَ ٱشْتَرَوُاْ ٱلضَّلاَلَةَ } المستتبعة لهذا النكال { بِٱلْهُدَىٰ } الموصل إلى النعيم الدائم في النشأة الأولى { وَٱلْعَذَابَ بِٱلْمَغْفِرَةِ } الملذة المستمرة في النشأة الأخرى { فَمَآ } أعجب حالهم ما { أَصْبَرَهُمْ عَلَى ٱلنَّارِ } [البقرة: 175] بارتكاب تلك الموجبات المؤدية إليها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك الذين } استبدلوا { الضلالة بالهدى } أي: باعوا الهدى واشتروا به الضلالة، واستبدلوا { العذاب بالمغفرة } التي كانت لهم لو آمنوا وبيّنوا، فما أجرأهم على اقتحام النار باقتحام أسبابها، أو فما أبقاهم في النار، أو ما الذي أصبرهم على النار حتى تركوا الحق ومالوا إلى الباطل؟! استفهام توبيخي",
      "translations": []
    }
  ]
}