{
  "chapter": "البقرة",
  "text": "ذلك بان الله نزل الكتب بالحق وان الذين اختلفوا۟ فى الكتب لفى شقاقۭ بعيد",
  "translations": [
    {
      "translation": "That is because God has revealed the Book containing the truth; but those who are at variance about it have gone astray in their contrariness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was inspite of the fact that Allah had sent down the Book with the Truth but the people who sought differences in the Book swerved far away from the Truth in their disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has revealed the Book in all Truth and those who dispute it are filled with malice which has taken them far away from the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah has sent down the Book with the truth; and indeed those who caused disagreement in the Book are, surely, disputants in the extreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book (the Qur'an) in truth. And verily, those who disputed as regards the Book are far away in opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because Allah has revealed the Book with the truth; and surely those who go against the Book are in a great opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because God has sent down the Book with the truth; and those that are at variance regarding the Book are in wide schism.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah hath revealed the Scripture with the truth. Lo! those who find (a cause of) disagreement in the Scripture are in open schism.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God has sent down the Book with the truth. And those who pursue differences in the Scriptures go much too far in dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This shall be because Allah hath verily sent down the Book with truth: and verily those who differ respecting the Book. are surely in cleavage wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is so because Allah has sent down the Book with the truth, and those who differ about the Book are surely in extreme defiance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their doom is) because Allah sent down the Book in truth but those who seek causes of dispute in the Book are in a schism Far (from the purpose).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book (the Quran) in truth. And verily, those who disputed as regards the Book are far away in opposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because Allah has sent down the Book with the truth; those who disagree about it are in extreme dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because God has revealed the Book in truth; and those who differ about the Book are in deep discord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is [deserved by them] because Allah has sent down the Book in truth. And indeed, those who differ over the Book are in extreme dissension.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:176] That, which has been mentioned of their eating of the Fire and what follows it, is because God has revealed the Book with the truth, but they are at variance regarding it, believing in parts of it while disbelieving in others, and concealing them; and those that are at variance regarding the Book, concerning this matter, namely, the Jews — although it is said that these are the idolaters some of whom said, with regard to the Qur’ān, that it was poetry, others, that it was sorcery, and others still, that it was divination — are in schism, disagreement, far removed, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That is) the torment (because Allah hath revealed the Scripture) He sent down Gabriel with the Qur'an and the Torah (with the Truth) with an exposition of the Truth and falsehood, but they disbelieved. (Lo! Those who find disagreement in the Scripture) those who contravene that which is in the Book regarding the description and traits of Muhammad (pbuh) and further conceal the latter (are in open schism) are too much in disagreement with guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } النكال والعذاب { بِأَنَّ ٱللَّهَ } المرشد لهم إلى التوحيد { نَزَّلَ ٱلْكِتَابَ } أي: القرآن المبين لهم طريقه ملتبساً { بِٱلْحَقِّ } الصريح الثابت في الواقع { وَإِنَّ ٱلَّذِينَ ٱخْتَلَفُواْ فِي } حقيقة { ٱلْكِتَابِ لَفِي شِقَاقٍ } خلافٍ { بَعِيدٍ } [البقرة: 176] بمراحل عن الحق\n\n\n\n\nحققنا بفضلك حقية ما أنزلت علينا من جودك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } العذاب الذي استحقوه وتجرءوا عليه بسبب أن { الله } تعالى { نزل الكتاب } القرآن ملتبساً { بالحق } ، فاختلفوا فيه فآمنوا ببعض وكفروا ببعض، { وإن الذين اختلفوا في الكتاب لفي شقاق بعيد } أي: لفي خلاف وضلال بعيد\n الإشارة: كل من كتم علمه، ولم ينشرْه إلا في مقابلة حظ دنيوي، صَدَق عليه قولُه تعالى: { ويشترون به ثمناً قليلاً أولئك ما يأكلون في بطونهم إلا النار }\n رُوِيَ أن بعض الصحابة كان يُقرئ أهل الصُّفّة، فأَهْدَى له أحدُهم قوساً، فأتى به النبيَّ صلى الله عليه وسلم، فقال: يا رسول الله: كنت أُعلِّمُ أهلَ الصفة فأهدى لي فلان قوساً، وقال: هو لله، فقال له - عليه الصلاة والسلام -:\n\n \" لقدْ تقلدتَ قَوسْاً مِنْ نَارِ جَهنم \" \n\nأو كما قال صلى الله عليه وسلم، وأمره بردِّه\n ولعل هذا من باب الورع، فأراد عليه السلام أن يرفع همة ذلك الصحابي، وإلا فقد ورد في الحديث:\n\n \" أَحَقُّ ما أَخَذْتُمْ علَيْهِ الأجرَ كتَابُ اللّهِ \"\n \n\nفمن ملَكَتْه نفسه، وأسره الهوى، فقد اشترى الضلالة بالهدى، اشترى الضلالة عن طريق أولياء الله، بالهدى الذي كان له ملَكَ نفسه وهواه، وعذابَ القطيعة والحجاب، بالمغفرة والدخول مع الأحباب، فما أصبرهم على غم الحجاب وسوء الحساب، سبب ذلك اختلاف قلبه، وتفريق همه ولُبَّه، وقد قال - عليه الصلاة والسلام -:\n\n\n\n \" اقْرَءوا القُرْآنَ ما ائْتَلَفَتْ عَلَيْهِ قُلُبُكمْ، فَإِذَا اخْتَلَفْتُمْ فَقُومُوا \" \n\nأو كما قال: وسببت تفرق القلب وعدم حضوره، حبُّ الدنيا فقد قال عليه الصلاة والسلام:\n\n \" مَنْ كَانَت الدُّنيا هَمَّهُ فَرَّقَ اللّهُ عَلَيْه أمْرَه، وَجَعَلَ فَقْرَهُ بَيْنَ عَيْنَيْهِ، ولَمْ يَأتِهِ مِنَ الدُّنْيا إلا من قُسِمَ لَهُ، ومن كَانَتِ الآخرةُ نيته، جَمَعَ اللّهُ عليه أمْرَهُ، وَجَعَلَ غِنَاهُ في قَلْبه، وأتتْهُ الدُنيَا وَهِيَ رَاِغِمةً \"\n \n\nوالقلب الذي اختلَف في فهم الكتاب وتشتَّت عنه في شقاق بعيد عن الحضرة لأن عُنْوان صحة القلب: جمعُه على كلام الله وتدبر خطابه والتلذذ بسماعه، وقد تقدم في أول السورة درجات القراءة: فانظره إن شئت\n وبالله التوفيق\n\n",
      "translations": []
    }
  ]
}