{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ كلوا۟ من طيبت ما رزقنكم واشكروا۟ لله ان كنتم اياه تعبدون",
  "translations": [
    {
      "translation": "O believers, eat what is good of the food We have given you, and be grateful to God, if indeed you are obedient to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, if you are true worshippers of Allah alone, eat without hesitation of the good and clean things wherewith We have provided you and be grateful to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, eat from the good things that We have given you and give thanks to God if you worship only Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Eat of the good things We have provided you, and be grateful to Allah if it is only Him you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe (in the Oneness of Allah ـ Islamic Monotheism)! Eat of the lawful things that We have provided you with, and be grateful to Allah, if it is indeed He Whom you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! eat of the good things that We have provided you with, and give thanks to Allah if Him it is that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, eat of the good things wherewith We have provided you, and give thanks to God, if it be Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Eat of the good things wherewith We have provided you, and render thanks to Allah if it is (indeed) He Whom ye worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, eat the wholesome things which We have provided for you and give thanks to God, if it is Him you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! eat of the clean things wherewith We have provided you, and return thanks unto Allah, if Him indeed ye are wont to worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Eat of the good things We have provided you, and thank Allah, if it is Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Eat of the good things that We have provided for you, and be grateful to Allah, if it is Him ye worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe (in the Oneness of Allah - Islamic Monotheism)! Eat of the lawful things that We have provided you with, and be grateful to Allah, if it is indeed He Whom you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, eat of the good with which We have provided you and give thanks to Allah, if you really worship Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Eat of the good things We have provided for you, and give thanks to God, if it is Him that you serve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, eat from the good things which We have provided for you and be grateful to Allah if it is [indeed] Him that you worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:172] O you who believe, eat of the good things, that are lawful, wherewith We have provided you, and give thanks to God, for what He has made lawful for you, if it be Him that you worship.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentions the lawfulness of eating what is cultivated on the land and the meat of cattle, saying: (0 ye who believe! Eat of the good things wherewith We have provided you) of the lawful things We have given you, (and render thanks to Allah) for it (if it is (indeed) He whom ye worship) it is also said that this means: if you really intend to worship Allah by declaring these to be unlawful, then do not declare them unlawful, for to worship Allah entails that you declare them to be lawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ناداهم سبحانه، وأوصاهم بما يتعلق بأمور معاشهم أيضاً بقوله: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ كُلُواْ مِن طَيِّبَاتِ } مزكيات ما أحل لكم من الحيوانات من { مَا رَزَقْنَاكُمْ } سقنا نحوكم تفضلاً؛ لتقوية مزاجكم وتعديله { وَ } بعد تقويتنا وتعديلنا إياكم { ٱشْكُرُواْ للَّهِ } المنعم المفضل، المربي لكم بلا التفات إلى الوسائق والوسائق { إِن كُنْتُمْ إِيَّاهُ } لا إلى غيره من الآليهة { تَعْبُدُونَ } [البقرة: 172] تقصرون العبادة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أصل اضْطُرَّ: اضتُرِرَ، على ومن افتعل، من الضرر، أُبدلت التاء طاءً لقرب مخرج التاء من الطاء، قال في الألفية:\n",
      "translations": []
    }
  ]
}