{
  "chapter": "البقرة",
  "text": "ولكم فى القصاص حيوة ياو۟لى الالبب لعلكم تتقون",
  "translations": [
    {
      "translation": "In retribution there is life (and preservation). O men of sense, you may haply take heed for yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is security of life for you in the law of retribution. It is expected that you will refrain from breaking this law.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of understanding, the law of the death penalty as retaliation grants you life so that perhaps you will have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in retribution, O men of understanding, so that you may avoid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is (a saving of) life for you in Al-Qisas (the Law of equality in punishment), O men of understanding, that you may acquire Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in (the law of) retaliation, O men of understanding, that you may guard yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In retaliation there is life for you, men possessed of minds; haply you will be godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is life for you in retaliation, O men of understanding, that ye may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In [this law of] retribution there is life for you, O people of understanding, so that perhaps you will be mindful of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for you in retaliation is life men of insight! that haply ye may fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is life for you in retribution, O you who possess intellects! Maybe you will be Godwary!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the Law of Equality there is (saving of) Life to you, o ye men of understanding; that ye may restrain yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is (a saving of) life for you in Al-Qisas (the Law of Equality in punishment), O men of understanding, that you may become Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O owners of minds, for you in retaliation is life, in order that you be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is life for you in retaliation, O people of understanding, so that you may refrain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is for you in legal retribution [saving of] life, O you [people] of understanding, that you may become righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:179] In retaliation there is life for you, that is great longevity, O people of pith, possessors of intellect, because if the would-be killer knew that he would be killed [in retaliation], he would refrain [from such action] and would have thereby given life to himself and to the one whom he had intended to kill; and so it [retaliation] was stipulated by the Law, so that you might fear killing, fearing retaliation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And there is a life for you in retaliation) a continuation of existence and a lesson, (0 men of understanding) those who possess sound minds among people, (that ye may ward off (evil)) that you may ward off killing one another for fear of retaliation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَكُمْ فِي ٱلْقِصَاصِ حَيَٰوةٌ } معناه بقاءٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولكم } في مقاصّة الله إياكم بما ذكر { حياة } عظيمة، أي: حياة لا يوصف كنهها { يا أولي الألباب } أي: العقول الخالصة عن قشر الأوهام وغواشي العينيات والأجرام\n فكذا في هذا القصاص - لكي تتقوا تركه وتحافظوا عليه - الوصية والمحافظة عليها قانون آخر فُرِضَ لإزالة نقصان القوّة الملكية، أي: القوّة النطقية وقصورها عما يقتضي الحكمة من التصرّف في الأموال، والسلطنة على القوّتين الأخريين بنور الحق وحكم الشرع، ومنعها عن عدوانها أيضاً بتبديل الوصية الذي هو نوع من الجريمة والخيانة، وتحريضها على التحقيق والتدقيق في باب الحكمة التي هي كمالها بالإصلاح بين الموصى لهم على مقتضى الحكمة، إذا توقع وعلم من الموصي إضراراً بالسهو والعمد - الصيام قانون آخر مما فُرِضَ لإزالة عدوان القوّة البهيمية وتسلطها - واعلم أنّ قصاص أهل الحقيقة ما ذكر، ووصيتهم هي بالمحافظة على عهد الأزل بترك ما سوى الحق، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَكُمْ } أيها الموحدون المكاشفون بسرائر الشرائع والنواميس الإلهية الموضوعة بين المؤمنين في هذه النشأة خصوصاً { فِي ٱلْقِصَاصِ } المسقط للجرائم الصادرة من جوارحكم البادية عليها { حَيَٰوةٌ } عظيمة حقيقية لكم في النشأة الأخرى؛ إذ لا يؤاخذون عليه بعد مؤاخذتكم في النشأة الأولى { يٰأُولِي ٱلأَلْبَابِ } الناظرين بنور الحق في لب الأمور المعرضين عن قشوره { لَعَلَّكُمْ تَتَّقُونَ } [البقرة: 179] رجاء أن تتحفظوا عن مقتضى القوى البهمية، المنافية لطريق التوحيد المبني على الاعتدال والوفاق، المؤدية إلى أمثال هذه الخبائث\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولكم } يا معشر المسلمين { في } تشريع { القصاص حياة } عظيمة في الدنيا، لانزجار القاتل إذا علَم أنه يُقتص منه، وقد كانوا يَقتُلون الجماعةَ في الواحد، فسلِموا من القتل بشروع القصاص، أو في الآخرة، فإن القاتل إذا اقتُصَّ منه في الدنيا لم يؤخذْ به في الآخرة، فاعتُبِروا { يا أولي الألباب } أي: العقول الكاملة، ما في حكمة القصاص من استبقاء الأرواح وحفظ النفوس، { لعلكم تتقون } الله في المحافظة على القصاص، والحكم به والإذعان له، أو تَكُفُّون عن القتل خوفاً من الله\n\n\nالإشارة: كما جعل الله القصاص في الجناية الحسيّة، جعل القصاصَ في الجناية المعنوية، وهي الجنايةُ على النفس بسوء الأدب مع الله، فكل من صدر منه هفوةٌ أو زَلَّة، اقْتصَ الحقّ تعالى منه في دار الدنيا، إن كانت له من الله عناية، الكبيرة بالكبيرة والصغيرة بالصغيرة: وتأمَّلْ قضية الرجل الذي كان يطوف بالكعبة، فنظر إلى امرأة، فلطَمْته كَفٍّ من الهوى، وذهبت عينه، فقال: آه، فقيل له: لطمة بنظرة، وإن زدت زدنا\n هـ\n وقضية أبي تراب النخشبي: قال رضي الله عنه: ما تمنت نفسي شهوةً من الشهوات إلا مرة واحدة، تمنيت خبزاً وبيضاً وأنا في سفر، فعدلت إلى قرية، فقام واحد، وتعلّق بي، وقال: هذا رأيته مع اللصوص، فضربوني سبعين درة، ثم عرفني رجلٌ منهم، وحملني إلى منزله، وقدَّم لي خبزاً وبيضاً، فقلت في نفسي: كُلْ بعد سبعين درة\n\n",
      "translations": []
    }
  ]
}