{
  "chapter": "البقرة",
  "text": "ومثل الذين كفروا۟ كمثل الذى ينعق بما لا يسمع الا دعاء ونداء صمۢ بكم عمى فهم لا يعقلون",
  "translations": [
    {
      "translation": "The semblance of the infidels is that of a man who shouts to one that cannot hear more than a call and a cry. They are deaf, dumb and blind, and they fail to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mental condition of those who rejected the way of Allah may be likened to that of the cattle whom the shepherd calls but they hear nothing except the sound of shouts and cries. They are deaf, they are dumb, they are blind; therefore they do not understand anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Preaching to unbelievers is like talking to someone who cannot hear anything except yells and shouts. They are deaf, dumb, and blind; they have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the example of the disbelievers is similar to one who calls upon one that hears nothing except screaming and yelling; deaf, dumb, blind – so they do not have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the example of those who disbelieve is as that of him who shouts to those (flock of sheep) that hear nothing but calls and cries. (They are) deaf, dumb and blind. So they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the parable of those who disbelieve is as the parable of one who calls out to that which hears no more than a call and a cry; deaf, dumb (and) blind, so they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve is as the likeness of one who shouts to that which hears nothing, save a call and a cry; deaf, dumb, blind -- they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve (in relation to the messenger) is as the likeness of one who calleth unto that which heareth naught except a shout and cry. Deaf, dumb, blind, therefore they have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny the truth are like animals which hear nothing in your call but the sound of a voice, without understanding its meaning. They are deaf, dumb and blind. They understand nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the likeness of those who disbelieve is as the likeness of one who shouteth unto that which heareth naught except a call and a cry; deaf, dumb; blind, wherefore they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of the faithless is that of someone who shouts after that which does not hear [anything] except a call and cry: deaf, dumb, and blind, they do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who reject Faith is as if one were to shout Like a goat-herd, to things that listen to nothing but calls and cries: Deaf, dumb, and blind, they are void of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the example of those who disbelieve, is as that of him who shouts to the (flock of sheep) that hears nothing but calls and cries. (They are) deaf, dumb and blind. So they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who disbelieve is as the likeness of he who calls to that which does not hear, except a shout and a voice. Deaf, dumb, and blind, they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who disbelieve is that of someone who calls upon someone who hears nothing except screaming and yelling. Deaf, dumb, and blind—they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who disbelieve is like that of one who shouts at what hears nothing but calls and cries cattle or sheep - deaf, dumb and blind, so they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:171] The likeness, the attribute, of those who disbelieve, and the one who calls them to guidance, is as the likeness of one who shouts to that which hears nothing, save a call and a cry, only a sound, not understanding its meaning: when they listen to an admonition they are like cattle that hear the cry of their shepherd but do not understand what he is saying; they are deaf, dumb, blind — they do not comprehend, any admonition.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then gave a similitude regarding the unbelievers vis-a-vis Muhammad (pbuh) saying: (The likeness of those who disbelieve) vis-a-vis Muhammad (pbuh) (is as the likeness of one who calleth unto that which heareth nothing) just like camels and sheep with their shepherd: his speech is unintelligible to them when he says to them, for example, eat or drink (except a shout and a cry. Deaf) concerning the Truth, (dumb) regarding the Truth, (blind) to guidance; i.e. they pretend to be deaf, dumb and blind when it comes to the Truth and guidance, (therefore they have no sense) they do not understand Allah's command and the call of the Prophet (pbuh) just as camels and cattle do not comprehend the words of their shepherd.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { كَمَثَلِ ٱلَّذِي يَنْعِقُ } معناهُ يُصوِّتُ\n\n\n\n\nوقولهُ تعالى: { صُمٌّ بُكْمٌ } فالأَبكَمُ: الأَخْرَسُ\n وواحدُهَا أَبْكَمُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومثل الذين كَفَروا } أي: مثل داعي الكفار المردودين { كمثل } الناعق بالبهائم فإنها لا تسمع إلا صوتاً ولا تفهم ما معناه فكذا حالهم { يا أيها الذين آمنوا } إن كنتم موحدين تخصون العبادة بالله فلا تتناولوا إلا من طيبات ما رزقناكم، أي: ما ينبغي في العدالة أن يستعمل من المرزوقات { واشكروا لله } باستعمالها فيما يجب أن تستعمل على الوجه الذي ينبغي أن تستعمل بالقدر الذي ينبغي، فإنّ التوحيد يقتضي مراعاة الاعتدال والعدالة في كل شيء اقتضاء الذات ظلها ولازمها\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن شئت يا أكمل الرسل زيادة تفضيحهم اذكر للمؤمنين قولنا: { مَثَلُ ٱلَّذِينَ كَفَرُواْ } تقليداً لآبائهم مع قابليتهم واستعدادهم للإيمان { كَمَثَلِ } الشخص { ٱلَّذِي يَنْعِقُ } يخاطب ويصوت من سفاهته { بِمَا } أي: بجمادٍ { لاَ يَسْمَعُ } منه شيئاً في مقابلته { إِلاَّ دُعَآءً وَنِدَآءً } منعكسين من دعائه، شبه حالهم في السفاهة والحماقة بحال من يصوت نحو الجبل فيسمع منه صوته منعكسة، فيتخيل من سفاهته أنه يتكلم معه، والحال أن آباءهم أيضاً أمثالهم { صُمٌّ } لا يسمعون دعوة الحق من ألسنة الرسل { بُكْمٌ } أيضاً لا يتكلمون بما ظهر لهم من الحق الصريح نقلاً وعقلاً { عُمْيٌ } أيضاً، لا يبصرون آثار الصفات وأنوار تجليات الذات الظاهرة على الآفاق { فَهُمْ } وآباؤهم من غاية انهماكهم في الغفلة والنسيان كأنهم { لاَ يَعْقِلُونَ } [البقرة: 171] أي: لا يخلقون من زمرة العقلاء\n\n\n\n\nنبهنا بفظلك عن سنة الغفلة ونوم النسيان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ومثل } الخ، يحتمل أن يكون على حذف مضاف، أي: مثَلُ واعظِ الذين كفروا، أو لا يحتاج إلى تقدير\n وسأتي بيانه، ونَعَقَ، كضرب، ينعق نعقاً ونعيقاً، إذا صاح وزجر\n يقول الحقّ جلّ جلاله: { ومثل } واعظ { الذين كفروا } وداعيهم إلى الله { كمثل } الراعي الذي يرعَى البهائم، وينعق عليها ليزجرها، أو يدعوها فإذا سمعَت النداء رفعَتْ رؤوسها ولم تعقِلْه، ثم عادت إلى مراعيها، فلا تسمع من الراعي يزجرها { إلاَّ دعاء ونداء } ، ولا تفقه ما يقول لها، كذلك الكفار المنهمكون في الكفر، إذا دعاهم أحد إلى التوحيد لا يلتفتون إليه، ولا يفقهون ما يقول لهم، كالبهائم أو أضل\n أو { مثل الذين كفروا } في انهماكهم في التقليد والجهل، مع مَنْ يدعوهم إلى الله { كمثل } بهائم الذي ينعق ويصيح عليها صاحبها فلا تسمع { إلاَّ دعاء ونداء } ولا تفقه ما يقول لها، أو { مثل الذين كفروا } في دعائهم الأصنام التي لا تسمع ولا تعقل، كمثل الناعق بغنمه، فلا ينتفع من نعيقه بشيء، غير أنه في عناء وتعب من دعائه وندائه، ثم وصفهم بالصمم والبكم والعمى مجازاً، أي: هم { صُم } عن سماع الحق فلا يعقلونه، { بُكْم } عن النطق به، { عُمْي } عن النظر إلى أسبابه، أو عن الهدي فلا يبصرونه، { فهم لا يعقلون } شيئاً ولا يتدبرون\n الإشارة: إذا تمكن الهوى من القلوب عَزَّ دواؤه وشقّ علاجه، وعظم على الأطباء عناؤه، فالمنهمكون في الغفلة لا ينفَع فيهم التذكير، ولا ينجح فيهم التخويف والتحذير، فالواعظ لهم كالناعق بالبهائم التي لا تسمع إلا دعاء ونداء، قد أعماهم الهوى، وأصمهم عن سماع أسباب الهدي:\n\nفلا يُقلع الهوى من قلوبهم إلا بسابق العناية، أو هبوب ريح الهداية، فتثير في قلوبهم خوفاً مُزْعِجاً، أو شوقاً مُقْلِقًا، أو نُوراً خارقاً\n",
      "translations": []
    }
  ]
}