{
  "chapter": "البقرة",
  "text": "واذا قيل لهم اتبعوا۟ ما انزل الله قالوا۟ بل نتبع ما الفينا عليه ءاباءنا اولو كان ءاباؤهم لا يعقلون شيـا ولا يهتدون",
  "translations": [
    {
      "translation": "When it is said to them: \"Follow what God has revealed,\" they reply: \"No, we shall follow only what our fathers had practiced,\" -- even though their fathers had no wisdom or guidance!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Follow the Commands that Allah has sent down,\" they reply, \"We will follow only what we found our forefathers practising., Well, will they go on following their forefathers even though they did not use common sense and did not find the right way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some people are asked to follow the revelations of God, they say, \"We would rather follow what our fathers have followed,\" even though their fathers had no understanding and could not find the true guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Follow what Allah has sent down”, they say, “On the contrary, we shall follow what we found our forefathers upon”; What! Even if their forefathers had no intelligence, or guidance?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Follow what Allah has sent down.\" They say: \"Nay! We shall follow what we found our fathers following.\" (Would they do that!) even though their fathers did not understand anything nor were they guided\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, Follow what Allah has revealed, they say: Nay! we follow what we found our fathers upon. What! and though their fathers had no sense at all, nor did they follow the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Follow what God has sent down,' they say, 'No; but we will follow such things as we found our fathers doing.' What? And if their fathers had no understanding of anything, and if they were not guided?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Follow that which Allah hath revealed, they say: We follow that wherein we found our fathers. What! Even though their fathers were wholly unintelligent and had no guidance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they are told, \"Follow what God has sent down,\" they answer, \"We will follow the ways of our fathers,\" even though their fathers did not use their reason, and were devoid of all guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them: follow that which Allah hath sent down, they say: nay, we shall follow that way whereon we found our fathers - even though their fathers understood not aught, nor were they guided aright?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Follow what Allah has sent down,’ they say, ‘No, We will follow what we have found our fathers following.’ What, even if their fathers neither exercised their reason nor were guided?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Follow what Allah hath revealed:\" They say: \"Nay! we shall follow the ways of our fathers.\" What! even though their fathers Were void of wisdom and guidance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Follow what Allah has sent down.\" They say: \"Nay! We shall follow what we found our fathers following.\" (Would they do that!) Even though their fathers did not understand anything nor were they guided?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Follow what Allah has sent down' they reply: 'We will follow that which we found our fathers upon' even though their fathers did not understand anything and they were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Follow what God has revealed,” they say, “We will follow what we found our ancestors following.” Even if their ancestors understood nothing, and were not guided?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Follow what Allah has revealed,\" they say, \"Rather, we will follow that which we found our fathers doing.\" Even though their fathers understood nothing, nor were they guided?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:170] And when it is said to them, the disbelievers, ‘Follow what God has revealed’, pertaining to affirmation of God’s Oneness and the good things that He has made lawful, they say, ‘No; but we follow what we found our fathers doing’, in the way of idol-worship, deeming unlawful the camel let loose, and [practising] the slitting of the camel’s ear (sc. bahīra). God says: What? (the hamza [of a-wa-law] is for repudiation), do they follow them, Even if their fathers do not understand anything, concerning religion, and they were not guided?, to the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto them) to the Arab idolaters: (Follow that which Allah hath revealed) follow the lawfulness exposited by Allah concerning what is cultivated and the cattle raised, (they say: We follow that wherein we found our fathers) regarding their unlawfulness. (What! Even though their fathers were wholly unintelligent) with regard to Religion (and had no guidance) to the practice of any prophet, so how could you follow them? It is also said that this means: if their fathers did not understand about things in this world and did not follow the practice of any prophet, then how could you follow them? It is also said that this means: even though their fathers did not understand anything of Religion and were not guided to the practice of any prophet, how could they follow them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَلْفَيْنَا عَلَيْهِ آبَآءَنَآ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ وَجَدْنَاهُم عليهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا قِيلَ لَهُمُ } أي: لمن يتبع خطوات الشيطان إمحاضاً للنصح وتحريكاً لحمية الفطرة الأصلية: { ٱتَّبِعُوا مَآ أَنزَلَ ٱللَّهُ } على نبيه من البينات والهدى لتهتدوا إلى توحيد الله { قَالُواْ } في الجواب بإلقاء شياطينهم: لا نتبع ما ألقيتم علينا من المزخرفات { بَلْ نَتَّبِعُ مَآ أَلْفَيْنَا } وجدنا { عَلَيْهِ آبَآءَنَآ } وهم أعقل منا، قل لهم يا أكمل الرسل نيابة عنا توبيخاً وتقريعاً لهم: { أَوَلَوْ كَانَ آبَاؤُهُمْ } ضالون جاهلون { لاَ يَعْقِلُونَ شَيْئاً } من أمر الدين { وَلاَ يَهْتَدُونَ } [البقرة: 170] أصلاً إلى مرتبة اليقين، بل كانوا كذلك، بل أسوأ حالاً من ذلك، فكيف تتبعهم؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في { لهم } يعود على { من يتخذ من دونه الله أنداداً } ، أو على { الناس } ، من قوله: { يا أيها الناس } ، أو على { اليهود } المتقدمين قبلُ، وألفى: بمعنى وجد، يتعدّى إلى مفعولين، وهما هنا: { آباءنا } والجار والمجرور، أي: نتبع في الدين ما وجدنا آباءنا كائنين عليه\n يقول الحقّ جلّ جلاله: { وإذا قيل } لهؤلاء المشركين من كفار العرب: { اتبعوا ما أنزل الله } على سوله من التوحيد، وترك الأنداد له والأمثال، وتحريم الحرام وتحليل الحلال، { قالوا بل نتبع } ما وجدنا { عليه آباءنا } من عبادة الأصنام، وارتكاب المعاصي والآثام، قال الحق جلّ جلاله: أيتبعونهم تقليداً وعَمى، ولو كان آباؤهم جهلة { لا يعقلون شيئاً } من الدين، ولا يتفكرون في سبيل المهتدين؟! وقال ابن عباس - رضي الله عنهما -: دعا النبيّ صلى الله عليه وسلم اليهودَ إلى الإسلام، ورغبهم فيه، فقال له رافع بن خارجة ومالك بن عوف: بل نتبع ما وجدنا عليه آباءنا، فهم كانوا خيراً وأعلم منا، فأنزل الله تعالى هذه الآية\n هـ\n الإشارة: وإذا قيل لمن أكَبَّ على دنياه، واتخذ إلهه هواه، فأشرك في محبة الله سواه: أقلعْ عن حظوظك وهواك، وأفرد الوجهه إلى مولاك، واتبع ما أنزل الله من وجوب مخالفة الهوى ومحبة المولى، قال: بل أتبع ما وجدتُ عليه الآباء والأجداد، وأكبَّ عليه جلُّ العباد، فيقال له: أتتبعهم في متابعة الهوى، ولو كانوا لا يعقلون شياً من طرق الهدى؟ وقد قال - عليه الصلاة والسلام -:\n\n \" لا يُؤْمِنُ أحَدُكُمْ حتى يَكُونَ هَواهُ تَبعاً لِمَا جِئتُ به \" \n",
      "translations": []
    }
  ]
}