{
  "chapter": "البقرة",
  "text": "مثلهم كمثل الذى استوقد نارا فلما اضاءت ما حوله ذهب الله بنورهم وتركهم فى ظلمت لا يبصرون",
  "translations": [
    {
      "translation": "They are like a man who kindles a fire, and when its glow has illumined the air God takes away their light leaving them in the dark where they will not be able to see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their condition may be described in a parable: a man kindled a fire and when it illuminated all around him, Allah took away the light from their eyes and left them in utter darkness, where they could not see anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their case) is like that of one who kindles a fire and when it grows bright God takes away its light leaving him in darkness (wherein) he cannot see (anything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their example is like that of one who kindled a fire; and when it lit up all that was around it, Allah took away their light and left them in darkness, unable to see anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their likeness is as the likeness of one who kindled a fire; then, when it illuminated all around him, Allah removed their light and left them in darkness. (So) they could not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their parable is like the parable of one who kindled a fire, but when it had illumined all around him, Allah took away their light, and left them in utter darkness-- they do not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of them is as the likeness of a man who kindled a fire, and when it lit all about him God took away their light, and left them in darkness unseeing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their likeness is as the likeness of one who kindleth fire, and when it sheddeth its light around him Allah taketh away their light and leaveth them in darkness, where they cannot see,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like those who kindled a fire, and when it lighted up all around them, God took away their sight and left them in utter darkness, unable to see --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their likeness is as the likeness of him who kindleth a fire, then when it hath lit up that which is around him, Allah taketh away their light and leaveth them in darknesses where they see not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their parable is that of one who lighted a torch, and when it had lit up all around him, Allah took away their light, and left them sightless in a manifold darkness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their similitude is that of a man who kindled a fire; when it lighted all around him, Allah took away their light and left them in utter darkness. So they could not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their likeness is as the likeness of one who kindled a fire; then, when it lighted all around him, Allah took away their light and left them in darkness. (So) they could not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their example is like one who kindled a fire, and when it lit all around him, Allah took away their light and left them in darkness. They could not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their likeness is that of a person who kindled a fire; when it illuminated all around him, God took away their light, and left them in darkness, unable to see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their example is that of one who kindled a fire, but when it illuminated what was around him, Allah took away their light and left them in darkness [so] they could not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:17]   Their likeness, the way they are in their hypocrisy, is as the likeness of one who kindled, that is, [one who] lit a fire in darkness, and when it illumined all about him, so that he is able to see, and to feel warm and secure from those he feared, God took away their light, extinguishing it (the plural pronoun [in nūrihim] takes into account the [plural] import of alladhī); and left them in darkness, unable to see, what is around them, confused as to the way, in fear; likewise are those who have found [temporary] security by professing faith, but who will meet with terror and punishment upon death; these [last] are:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Their likeness), the likeness of the hypocrites vis-a-vis Muhammad (pbuh) (is as the likeness of one who kindleth fire), lights a fire in the darkness in order to provide safety for his family, property and person, (and when it sheddeth its light around him), when it sheds its light and he sees what is around him and feels secure, at that very moment the Fire is put out. Likewise, the hypocrites believed openly in Muhammad (pbuh) as well as in the Qur'an and by doing so they felt their persons, families and properties were safe, avoiding in the process imprisonment or death. But when they die (Allah taketh away their light), the benefit of their [outward] faith, (and leaveth them in darkness) facing the hardships of the grave, (where they cannot see) any comfort. It is also said this simile refers to the Jews. In this respect, the likeness of the Jews vis-a-vis Muhammad (pbuh) is like a man who raises a flag in a lost battle and by doing so attracts other defeated fighters. But when they gather they put their flag down and, consequently, their benefit and safety immediately vanish. Similarly, the Jews used to say that Muhammad (pbuh) and the Qur'an, prior to its revelation, would support them. When it was revealed however they denied it and Allah took away their light, i.e. their desire to believe and the benefit of such belief. This is because although they wanted to believe in Muhammad (pbuh) they did not do so, and consequently they were left them in the error of Judaism, unable to see guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ مَثَلُهُم } أي: صفتهم في النفاق كصفة المستوقد للإضاءة الذي إذا أضاءت ما حوله من الأشياء القريبة منه خمدت ناره وبقي متحيّراً، لأن نور استعدادهم بمنزلة النار الموقدة، وإضاءتها لما حولهم هي اهتداؤهم إلى مصالح معاشهم القريبة منهم دون مصالح المعاد البعيدة بالنسبة إليهم وصحبة المؤمنين وموافقتهم في الظاهر وخمودها سريعاً انطفاء نورهم الاستعداديّ وسرعة زوال ما تمتّعوا به من دنياهم ووشك انقضائه\n { ذهب الله بنُورِهم } الاستعداديّ بإمدادهم في الطغيان، وخلاهم محجوبين عن التوفيق في ظلمات صفات النفس { لا يبصرون } ببصر القلب، ووجه المخرج ولا ما ينفعهم من المعارف كمن تنطفئ ناره وهو في تيه بين أشغال وأسباب\n { صمٌّ بكمٌ عُميٌ } بالحقيقة لاحتجاب قلوبهم عن نور العقل الذي به تسمع الحق وتنطق به، وتراه في الظاهر لعدم فوائدها، لانسداد الطرق من تلك المشاعر إلى القلب لمكان الحجاب، فلم يصل إليها نور القلب ليحتفظوا بفوائدها ولم ترد مدركاتها على القلب ليفهموا ويعتبروا",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { مَثَلُهُمْ } أي: شأنهم وحالهم بهذا الاستبدال، والاختيار في يوم الجزاء { كَمَثَلِ } كحال الشخص { ٱلَّذِي } طلب شيئاً في الظلمة وترقبه، ولم يهتد إليه و { ٱسْتَوْقَدَ نَاراً } ليستضيء بها، وفاز بمبتغاه { فَلَمَّآ } استوقده { أَضَآءَتْ } النار { مَا حَوْلَهُ } أي: حول المستوقد، وترقب وجدان مطلوبه { ذَهَبَ } ضوؤها، وسكن لهبها فضلَّ عن مطلوبه، وخسر خسراناً عظيماً، كما ذهب { ٱللَّهُ بِنُورِهِمْ } أطفأ الله نيران المنافقين وسرجهم التي هي كفرهم ونفاقهم على زعمهم، وأفسد إظاءتهم في يوم الجزاء حين ترقبهم بوجدان مطالبهم ولم يهتدوا بها، بل عذبهم الله بسببها { وَتَرَكَهُمْ } لأجلها { فِي ظُلُمَٰتٍ } ظلمة الضلالة المتقررة الراسخة في نفوسهم بتقليد آبائهم، المنتجة للكفر والنفاق، وظلمة فقدان المطلوب المترتب عليها في زعهمم مع ترقبهم، والظلمة العارضة لهم بعد استضاءتهم، وبسبب هذه الظلمات { لاَّ يُبْصِرُونَ } [البقرة: 17] ولا يرجى نجاتهم عن عذاب الله بل يبقون فيه أبداً وهم:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { استوقد } يحتمل أن تكون للطلب، أو زائدة بمعنى أوقد، و { لما } شرطية، و { ذهب } جواب، وإذا كان لفظ الموصول مفرداً واقعاً على جماعة، يصح في الضمير مراعاة لفظه فيفرد، ومعناه فيجمع، فأفرد في الآية أولاً، وجمع ثانياً، ويقال: أضاء يضيء إضاءة، وضَاء يضُوء ضَوْءاً\n يقول الحقّ جلّ جلاله: مثل هؤلاء المنافقين من اليهود { كَمَثَلِ } رجل في ظلمة، تائه في الطريق، فاستوقد ناراً ليبصر طريق، فاستوقد ناراً ليبصر طريق القصد { فَلَمَّا } اشتغلت و { أَضَاءَتْ مَا حَوْلَهُ } فأبصر الطريق، وظهرت له معالم التحقيق، أطفأ الله تلك النار وأذهب نورها، ولم يبق إلا جمرها وحرّها",
      "translations": []
    }
  ]
}