{
  "chapter": "البقرة",
  "text": "انما حرم عليكم الميتة والدم ولحم الخنزير وما اهل به لغير الله فمن اضطر غير باغ ولا عاد فلا اثم عليه ان الله غفور رحيم",
  "translations": [
    {
      "translation": "Forbidden to you are carrion and blood, and the flesh of the swine, and that which has been consecrated (or killed) in the name of any other than God. If one is obliged by necessity to eat it without intending to transgress, or reverting to it, he is not guilty of sin; for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has only forbidden you to eat what dies of itself, and blood and swine flesh and what has been consecrated to any other name than of Allah. But one will incur no sin if, forced by absolute necessity, he eats of any of these forbidden things, provided he has no intention of transgressing the law and does not take more than what is absolutely indispensable: for Allah is very Forgiving and very Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has forbidden you to eat that which has not been properly slaughtered, blood, pork, and the flesh of any animal which has not been consecrated with a mention of the Name of God. However, in an emergency, without the intention of transgression or repeating transgression, one will not be considered to have committed a sin. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden for you only the carrion, and blood, and flesh of swine, and the animal that has been slaughtered while proclaiming the name of anyone other than Allah; so there is no sin on him who is compelled and does not eat out of desire, nor eats more than what is necessary; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only the Maitah (dead animals), and blood, and the flesh of swine, and that which is slaughtered as a sacrifice for other than Allah. But if one is forced by necessity without willful disobedience nor transgressing due limits, then there is no sin on him. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden you what dies of itself, and blood, and flesh of swine, and that over which any other (name) than (that of) Allah has been invoked; but whoever is driven to necessity, not desiring, nor exceeding the limit, no sin shall be upon him; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These things only has He forbidden you: carrion, blood, the flesh of swine, what has been hollowed to other than God. Yet who so is constrained, not desiring nor transgressing, no sin shall be on him; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath forbidden you only carrion, and blood, and swineflesh, and that which hath been immolated to (the name of) any other than Allah. But he who is driven by necessity, neither craving nor transgressing, it is no sin for him. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood, and the flesh of swine; also any flesh that is consecrated other than in the name of God. But for one who is driven by necessity, neither craving nor transgressing, it is no sin. For God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath only forbidden unto you the carcass and blood and the flesh of swine, and that over which is invoked the name of other than Allah. But whosoever is driven by necessity, neither alusting nor transgressing, for him is no sin; verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only carrion, blood, the flesh of the swine, and that which has been offered to other than Allah. But should someone be compelled, without being rebellious or transgressive, there shall be no sin upon him. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath only forbidden you dead meat, and blood, and the flesh of swine, and that on which any other name hath been invoked besides that of Allah. But if one is forced by necessity, without wilful disobedience, nor transgressing due limits,- then is he guiltless. For Allah is Oft-forgiving Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you only the Maytatah (dead animals), and blood, and the flesh of swine, and that which is slaughtered as a scrifice for others than Allah (or has been slaughtered for idols, etc., on which Allah's Name has not been mentioned while slaughtering). But if one is forced by necessity without wilful disobedience nor transgressing due limits, then there is no sin on him. Truly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you the dead, blood, and the flesh of swine, also that which is invoked to other than Allah. But whoever is constrained (to eat) any of these, not intending to sin or transgress, incurs no guilt. Allah is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has forbidden you carrion, and blood, and the flesh of swine, and what was dedicated to other than God. But if anyone is compelled, without desiring or exceeding, he commits no sin. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has only forbidden to you dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], there is no sin upon him. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:173] He has only forbidden you: carrion, that is, the consumption of it, since this is the subject of the general address here, and similarly [the consumption of] what follows, [all of] which is what has not been slaughtered in accordance with [prescriptions of] the Law; to this the Sunna adds [as also constituting carrion] what has been severed from a living creature. A special status is, however, accorded fish and locusts; blood, poured forth, as in [sūrat] al-An‘ām [see Q. 6:145], the flesh of swine, the meat is singled out for mention because that [part] is what people mostly seek, every other [part] being implied thereby; what has been hallowed to other than God, that is to say, what has been slaughtered in other than His Name (al-ihlāl is the raising of one’s voice, which they used to do when sacrificing for their gods). Yet whoever is constrained, forced by dire need to eat of the above-mentioned, not desiring, to rebel against Muslims, nor transgressing, committing aggression against them by waylaying them, no sin shall be on him, for eating it. God is Forgiving, to His friends, Merciful, to those who are obedient to Him, for He has granted them wide berth in this matter. The aggressor and the transgressor are excluded from this [dispensation], and to these two [categories] one should also add every person that sets out on a journey in disobedience, such as the fugitive or the excise collector, for whom it would be unlawful to eat any of the mentioned, unless they repent [of their disobedience]; this is the opinion of al-Shāfi‘ī.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah exposited what He made unlawful for them, saying: (He hath forbidden you only carrion) which He has commanded to immolate, (and blood) and shed blood, (and swineflesh, and that which hath been immolated to any other than Allah) that which is offered as sacrifice purposefully in any other thing than the Name of Allah, i.e. to idols. (But he who is driven by necessity) compelled to eat carrion (neither craving) 28 neither rebelling nor declaring it lawful (nor transgressing) nor committing highway robbery nor purposefully eating it without being driven by necessity, (it is no sin for him) then such a person, who is compelled to eat it without having his fill and without taking anything with him, has not transgressed. (Lo! Allah is Forgiving) that he ate more than he needs to preserve himself, (Merciful) when He gave him legal dispensation to eat carrion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَآ أُهِلَّ بِهِ لِغَيْرِ ٱللَّهِ } معناهُ أُرِيدَ بهِ غَيرُ الله\n والإهْلاَلُ: رفعُ الصوتِ بذكرِ الله، وذِكْرِ غَيرِهِ\n\n\n\n\nوقولهُ تعالى: { غَيْرَ بَاغٍ وَلاَ عَادٍ } والبَاغِـ[ـي] الذي يَأكلُ المِيتَةَ عَنْ غَيْر اضْطِرارٍ إِليها\n والعَاد [ي] الذي يَشْبَعُ مِنهُ\n فالمِيتةُ تُحلُّ لَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما حرّم عَلَيكم المِيتة } لجمود الدم فيها، وبعدها عن الاعتدال بانحراف المزاج { والدم } لاختلاطه بالفضلات النجسة البعيدة عن قبول الحياة والعدالة والنورية وعدم صلاحيته لذلك بعد لقصور النضج { ولحْم الخِنْزير } لغلبة السبعية والشره ومباشرة القاذورات والدياثة على طبعه فيولد في أكله مثل ذلك { وما أُهِلّ به لِغَير الله } أي: رفع الصوت بذبحه لغير الله يعني ما قصد بذبحه وأكله الشرك لمنافاته التوحيد سفيراً عن الشرك\n ويفهم منه ما يقوي آكله به على الكلام ورفع الصوت لغير الله أي: كل ما يؤكل لا على التوحيد فهو محرّم على آكله { فمنِ اضطرّ } أي: من الجماعة { غير بَاغٍ } على مضطرّ آخر باستئثاره { ولا عَادٍ } سدّ الرمق { فلا إثمَ عليه }\n { ما يَأْكُلون في بُطُونهم } أي: ملء بطونهم إلا ما هو وقود نار الحرمان وسبب اشتعال نيران الطبيعة الحاجبة عن نور الحق المعذبة بهيئات السوء المظلمة الموقعة صاحبها في جحيم الهيولى الجسمانية { ولا يكلمهم الله ولا ينظر إليهم } عبارة عن شدّة غضبه عليهم وبعدهم عنه\n { ليس البرّ أن تولوا وجوهكم } مشرق عالم الأرواح ومغرب عالم الأجساد، فإنه تقيد واحتجاب { ولكن البرّ } برّ الموحدين الذين آمنوا بالله والمعاد في مقام الجمع، إذ التوحيد في مقام الجمع يلزمه البقاء الأبديّ الذي هو المعاد الحقيقي\n وشاهدوا الجمع في تفاصيل الكثرة ولم يحتجبوا بالجمع عن التفصيل الذي هو باطن عالم الملائكة وظاهر عالم النبيين\n { والكِتَاب } الذي جمع ببين الظاهر بالأحكام والمعارف، وأفاد علم الاستقامة ثم استقاموا بعد تمام التوحيد جمعاً وتفصيلاً بالأعمال المذكورة، فإن الاستقامة عبارة عن وقوف جميع القوى على حدودها بالأمر الإلهي لتنوّرها بنور الروح عند تحقق صاحبها بالله في مقام البقاء بعد الفناء وذلك مقام العدالة، فتكون هي في ظلّ الحق منخرطة في سلك الوحدة بكليتها\n { على حبه } أي: في حال الاحتياج إليه والشحّ به، كما قال ابن مسعود: أن تؤتيه وأنت صحيح شحيح، تأمل العيش، وتخشى الفقر، ولا تمهل حتى إذا بلغت الحلقوم، قلت لفلان: كذا، ولفلان: كذا\n قال الله تعالى:\n\n[الحشر، الآية: 9] أو على حب الله لئلا يشغل قلبه عنه ولأنه تعالى يرضى بإيتائه أو على حبّ الإيتاء، يعني: بطيب النفس، فإن الكريم هو الفرح وطيب النفس بالإعطاء\n ومن قوله: { وآتى المال } إلى قوله: { وآتى الزكاة } من باب العفة التي هي كمال القوة الشهوانية ووقوفها على حدّها فيما يتعلق بها، وقوله: { والموفون بعَهْدهم إذا عَاهَدوا } من باب العدالة المستلزمة للحكمة التي هي كمال القوّة النطقية فإنها ما لم تعلم تبعة الغدر والخيانة وفائدة الفضيلة المقابلة لهما، لم تف بالعهد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم يا أكمل الرسل نيابة: { إِنَّمَا حَرَّمَ عَلَيْكُمُ } أي: ما حرم ربكم عليكم في دينكم من الحيوانات إلا { ٱلْمَيْتَةَ } حتف نفسه بلا تزيكة وتهليل { وَٱلدَّمَ } السائل من أي وجه كان { وَلَحْمَ ٱلْخِنزِيرِ } المرخص في الأديان الأخر لنجاسة عينه طبعاً وشرعاً { وَمَآ أُهِلَّ } صوت { بِهِ لِغَيْرِ } اسم { ٱللَّهِ } عند ذبحه من أسماء الأصنام، وإنما حرم عليكم هذه الأشياء وقت سعتكم { فَمَنِ ٱضْطُرَّ } منكم حال كونه { غَيْرَ بَاغٍ } للولاة القائمين بحدود الله { وَلاَ عَادٍ } مجاوزاً عن شدة الجوعة إلى وقت السعة { فَلاۤ إِثْمَ عَلَيْهِ } إن تناول منها مقدار سد الرمق { إِنَّ ٱللَّهَ } المرخص لكم في أمثال المضائق والاضطرار { غَفُورٌ } سائر لكم عن أمثال هذه الجراءة { رَّحِيمٌ } [البقرة: 173] علكيم بهذه الرخصة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}