{
  "chapter": "البقرة",
  "text": "ليس البر ان تولوا۟ وجوهكم قبل المشرق والمغرب ولكن البر من ءامن بالله واليوم الءاخر والملئكة والكتب والنبين وءاتى المال على حبه ذوى القربى واليتمى والمسكين وابن السبيل والسائلين وفى الرقاب واقام الصلوة وءاتى الزكوة والموفون بعهدهم اذا عهدوا۟ والصبرين فى الباساء والضراء وحين الباس او۟لئك الذين صدقوا۟ واو۟لئك هم المتقون",
  "translations": [
    {
      "translation": "Piety does not lie in turning your face to East or West: Piety lies in believing in God, the Last Day and the angels, the Scriptures and the prophets, and disbursing your wealth out of love for God among your kin and the orphans, the wayfarers and mendicants, freeing the slaves, observing your devotional obligations, and in paying the zakat and fulfilling a pledge you have given, and being patient in hardship, adversity, and times of peril. These are the men who affirm the truth, and they are those who follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no virtue. That you turn your faces towards the east or the west, but virtue is that one should sincerely believe in Allah and the Last Day and the Angels and the Book and the Prophets and, out of His love, spend of one's choice wealth for relatives and orphans, for the needy and the wayfarer, for beggars and for the ransom of slaves, and establish the Salat and pay the Zakat. And the virtuous are those who keep their pledges when they make them and show fortitude in hardships and adversity and in the struggle between the Truth and falsehood; such are the truthful people and such are the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Righteousness is not determined by facing East or West during prayer. Righteousness consists of the belief in God, the Day of Judgment, the angels, the Books of God, His Prophets; to give money for the love of God to relatives, orphans, the destitute, and those who are on a journey and in urgent need of money, beggars; to set free slaves and to be steadfast in prayer, to pay the religious tax (zakat) to fulfill one's promises, and to exercise patience in poverty, in distress, and in times of war. Such people who do these are truly righteous and pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Basic virtue is not just to turn faces to the East and the West, but true righteousness is that one must believe in Allah and the Last Day and the angels and the Book and the Prophets; and out of love for Allah, to give treasured wealth to relatives and to the orphans and the needy and the traveller, and to those who ask, and to set slaves free; and to keep the prayer established and to pay the charity; and those who fulfil their obligations when they make an agreement; and the patient during times of calamity, in hardships and during holy war; it is they who have proved true to their word; it is they who are the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not Birr that you turn your faces towards east and (or) west; but Birr is the one who believes in Allah, the Last Day, the Angels, the Book, the Prophets and gives his wealth, in spite of love for it, to the kinsfolk, to the orphans, and to Al-Masakin (the poor), and to the wayfarer, and to those who ask, and to set servants free, performs As-Salah (Iqamat-As-Salah), and gives the Zakah, and who fulfill their covenant when they make it, and who are patient in extreme poverty and ailment (disease) and at the time of fighting (during the battles). Such are the people of the truth and they are Al-Muttaqun (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not righteousness that you turn your faces towards the East and the West, but righteousness is this that one should believe in Allah and the last day and the angels and the Book and the prophets, and give away wealth out of love for Him to the near of kin and the orphans and the needy and the wayfarer and the beggars and for (the emancipation of) the captives, and keep up prayer and pay the poor-rate; and the performers of their promise when they make a promise, and the patient in distress and affliction and in time of conflicts-- these are they who are true (to themselves) and these are they who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not piety, that you turn your faces to the East and to the West. True piety is this: to believe in God, and the Last Day, the angels, the Book, and the Prophets, to give of one's substance, however cherished, to kinsmen, and orphans, the needy, the traveller, beggars, and to ransom the slave, to perform the prayer, to pay the alms. And they who fulfil their covenant when they have engaged in a covenant, and endure with fortitude misfortune, hardship and peril, these are they who are true in their faith, these are the truly godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not righteousness that ye turn your faces to the East and the West; but righteous is he who believeth in Allah and the Last Day and the angels and the Scripture and the prophets; and giveth wealth, for love of Him, to kinsfolk and to orphans and the needy and the wayfarer and to those who ask, and to set slaves free; and observeth proper worship and payeth the poor-due. And those who keep their treaty when they make one, and the patient in tribulation and adversity and time of stress. Such are they who are sincere. Such are the Allah-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Virtue does not consist in whether you face towards the East or the West; virtue means believing in God, the Last Day, the angels, the Book and the prophets; the virtuous are those who, despite their love for it, give away their wealth to their relatives and to orphans and the very poor, and to travellers and those who ask [for charity], and to set slaves free, and who attend to their prayers and pay the alms, and who keep their pledges when they make them, and show patience in hardship and adversity, and in times of distress. Such are the true believers; and such are the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Virtue is not in this that ye turn your faces toward the east and west, but virtue is of him who believeth in Allah and the Last Day and the angels and the Book and the prophets: and giveth of his substance, for love of Him unto kindred and orphans and the needy and the wayfarer and the beggars and for redeeming necks, and establisheth prayer and giveth the poor-rate and is of the performers of their covenant when they have covenanted; and is of the patient in adversity and affliction and in time or violence these are they who are proven true, and these they are God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Piety is not to turn your faces to the east or the west; rather, piety is [personified by] those who have faith in Allah and the Last Day, the angels, the Book, and the prophets, and who give their wealth, for the love of Him, to relatives, orphans, the needy, the traveller and the beggar, and for [the freeing of] the slaves, and maintain the prayer and give the zakat, and those who fulfill their covenants, when they pledge themselves, and those who are patient in stress and distress, and in the heat of battle. They are the ones who are true [to their covenant], and it is they who are the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not righteousness that ye turn your faces Towards east or West; but it is righteousness- to believe in Allah and the Last Day, and the Angels, and the Book, and the Messengers; to spend of your substance, out of love for Him, for your kin, for orphans, for the needy, for the wayfarer, for those who ask, and for the ransom of slaves; to be steadfast in prayer, and practice regular charity; to fulfil the contracts which ye have made; and to be firm and patient, in pain (or suffering) and adversity, and throughout all periods of panic. Such are the people of truth, the Allah-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not Al-Birr (piety, righteousness, and each and every act of obedience to Allah, etc.) that you turn your faces towards east and (or) west (in prayers); but Al-Birr is (the quality of) the one who believes in Allah, the Last Day, the Angels, the Book, the Prophets and gives his wealth, in spite of love for it, to the kinsfolk, to the orphans, and to Al-Masakin (the poor), and to the wayfarer, and to those who ask, and to set slaves free, performs As-Salat (Iqamat-as-Salat), and gives the Zakat, and who fulfill their covenant when they make it, and who are As-Sabirin (the patient ones, etc.) in extreme poverty and ailment (disease) and at the time of fighting (during the battles). Such are the people of the truth and they are Al-Muttaqun (pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Righteousness is not whether you face towards the east or the west. But righteousness is to believe in Allah and the Last Day, in the angels and the Book, and the Prophets, and to give wealth however cherished, to kinsmen, to the orphans, to the needy, to the destitute traveler, and to the beggars, and to ransom the slave; who establish their prayers and pay the obligatory charity; who are true to their promise when they have promised. Who are patient in misfortune and hardship and during the time of courage. Such are the truthful; such are the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Righteousness does not consist of turning your faces towards the East and the West. But righteous is he who believes in God, and the Last Day, and the angels, and the Scripture, and the prophets. Who gives money, though dear, to near relatives, and orphans, and the needy, and the homeless, and the beggars, and for the freeing of slaves; those who perform the prayers, and pay the obligatory charity, and fulfill their promise when they promise, and patiently persevere in the face of persecution, hardship, and in the time of conflict. These are the sincere; these are the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Righteousness is not that you turn your faces toward the east or the west, but [true] righteousness is [in] one who believes in Allah, the Last Day, the angels, the Book, and the prophets and gives wealth, in spite of love for it, to relatives, orphans, the needy, the traveler, those who ask [for help], and for freeing slaves; [and who] establishes prayer and gives zakah; [those who] fulfill their promise when they promise; and [those who] are patient in poverty and hardship and during battle. Those are the ones who have been true, and it is those who are the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:177] It is not piety, that you turn your faces, in prayer, to the East and to the West. This was revealed in response to the claim made by the Jews and the Christians to this effect. True piety, that is, the pious person (al-birr, is also read al-barr, in the sense of al-bārr [‘the dutiful person’]) is [that of] the one who believes in God and the Last Day and the angels and the Book, that is, the scriptures, and the prophets, and who gives of his substance, however, despite [it being], cherished, by him, to kinsmen and orphans and the needy and the traveller and beggars, and for, the setting free of, slaves, both the captive and the one to be manumitted by contract; and who observes prayer and pays the alms, that are obligatory, and what was [given] before [alms were made obligatory], in the way of charity; and those who fulfil their covenant when they have engaged in a covenant, with God or with others, those who endure with fortitude (al-sābirīna is the accusative of laudation) misfortune (al-ba’sā’ is abject poverty), hardship, illness, and peril, at the height of a battle in the way of God; these, described in the way mentioned, are the ones who are truthful, in their faith and in their claims to piety, and these are the ones who are fearful, of God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not righteousness) it is not all of righteousness; it is also said that (It is not righteousness) means: it is not faith (that ye merely turn your faces) in prayer (to the East) towards Mecca (and the West) towards Jerusalem; (but righteous is) but faith amounts to agreeing with (he who believeth in Allah) and it is also said: the faithful is he who believes in Allah (and the Last Day) in resurrection after death (and the angels) all the angels (and the Scripture) all the revealed Books (and the prophets) and all the prophets; Allah then mentions the obligated duties after mentioning faith, saying: (and giveth his wealth for love of Him) righteousness after declaring one's faith is that one gives of one's wealth, despite the fact that one loves and desires it and has only a little of it, (to kinsfolk) relatives (and to orphans) orphans of the believers (and the needy) who shy away from asking for assistance (and the wayfarer) the passer-by, the guest (and to those who ask) you to give them from your wealth, (and to set slaves free) those who made a contract to pay for their freedom and those who fight in the way of Allah. After mentioning the obligated duties, Allah mentions the different legal prescriptions, saying: (and observeth proper worship) He says: righteousness, after fulfilling the obligated duties, is to perfect the performance of the five daily prayers (and payeth the poor- due) give the poor what is due to them as well as similar things. (And those who keep their treaty) those who fulfil the pledges that are between them and their Lord or between them and other people (when they make one, and the patient in tribulation) i.e. fear, affliction and hardship (and adversity) illness, pain and hunger (and time of stress) upon engagement in fighting. (Such are they who are sincere) who have fulfilled their pledges. (And such are the God fearing) who refrain from breaking their pledges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱلصَّابِرِينَ فِي ٱلْبَأْسَآءِ وٱلضَّرَّآءِ } معنى البَأْساء: الجوعُ والضَّراء: المَرضُ\n والبأْسُ: القِتالُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اختلف الناس في أمر القبلة واهتموا بشأنها، بأن حصر البر والخير كل فيها، أشار سبحانه إلى تخطئتهم، ونبه على البر الحقيقي والخير الذاتي بقوله: { لَّيْسَ ٱلْبِرَّ } أي: الخصلة السنية والأخلاق المرضية مجرد { أَن تُوَلُّواْ وُجُوهَكُمْ قِبَلَ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ } مثلاً، بل اتصاف بالعزائم، والحكمة المترتبة على تشريع القبلة { وَلَـٰكِنَّ ٱلْبِرَّ } الحقيقي { مَنْ آمَنَ } صدق منكم { بِٱللَّهِ } المنشئ لكم من كتم العدم بعد أن لم تكونوا شيئاً مذكوراً { وَٱلْيَوْمِ ٱلآخِرِ } المعد لجزاء الأعمال { وَٱلْمَلاۤئِكَةِ } المهيمنين الوالهين في مطالعة جمال الله، المستغفرين لمن آمن وعمل صالحاً من عباده { وَٱلْكِتَابِ } المبين لكم طريق الهداية { وَٱلنَّبِيِّينَ } المبعوثين إليكم به؛ ليرشدكم إلى مقاصده\n\n\n\n\n{ وَ } بعدم ما آمن بما ذكر { آتَى ٱلْمَالَ } المانع من التوجه الحقيقي، وأنفقه { عَلَىٰ حُبِّهِ } سبحانه طالباً لرضاه، وأنقه على المحتاجين أولاً هم { ذَوِي ٱلْقُرْبَىٰ } المنتمين إليه من قبل أبويه { وَٱلْيَتَامَىٰ } الذين لا متعهد لهم من الوالدين وذوي القربى { وَٱلْمَسَاكِينَ } الذين أسكنهم الفقر العارض لهم من عدم مساعدة آلات الكسب والحوادث الأُخر { وَٱبْنَ ٱلسَّبِيلِ } الغرباء الذين لا يمكنهم التصرف في أموالهم لوقوع البون والمبين { وَٱلسَّآئِلِينَ } الذين ألجأهم الاحتياج مطلقاً إلى السؤال من أي وجهٍ كان { وَفِي ٱلرِّقَابِ } من الأسرى الموثقين في يد العدو، والمكاتبين الذين لا يقدرون على فك رقابهم من مواليهم وغير ذلك من المضطرين { وَأَقَامَ ٱلصَّلاةَ } أي: دوام الميل والتوجه بجميع الأعضاء والجوارح نحوه تعالى في جميع الأوقات، خصوصاص في الأوقات التي تفرض فيها التوجه { وَآتَى ٱلزَّكَاةَ } المفروضة المقدرة في كتاب الله\n\n\n\n\n{ وَٱلْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُواْ } كلهم من خيار الأبرار { وَ } بشر من بينهم يا أكمل الرسل { ٱلصَّابِرِينَ فِي ٱلْبَأْسَآءِ } أي: الفقر المكسر للظهر { وٱلضَّرَّآءِ } المرض المسقم للجسم { وَ } خصوصاً الغزاة الذين صبروا { حِينَ ٱلْبَأْسِ } من اقتحام العدو بالإنعامات العلية والكرامات السنية { أُولَـٰئِكَ } الأبار الأحرار الصابرون في البلوى، المرجون لرضا المولى على أنفسهم هم { ٱلَّذِينَ صَدَقُواْ } في أقوالهم وأصلحوا في أفعالهم، وأخلصوا في نياتهم { وَأُولَـٰئِكَ هُمُ ٱلْمُتَّقُونَ } [البقرة: 177] المحفوظون عن جميع ما ضيق عليهم في أمور الدين، الوصلون إلى مرتبة الحقيق واليقين\n\n\n\n\nرب اجعلنا منهم بلطفك وكرمك يا أرحم الراحمين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لمّا ذكر الحقّ تعالى التوحيد وبراهينه الذي هو رأس الدين، وحذَّرَ من الشرك وفروعه، ذكر هنا بقية أركان الدين، وهي الإيمان والإسلام، ذكر في هذه الآية قواعد الإيمان وبعض قواعدِ الإسلام وهي الصلاة والزكاة، ثم ذكر بعد ذلك الصيام وأحكامه، ثم ذكر الحج وأركانه، ثم ذكر الجهاد والنكاح والطلاق والعِدَّة، ثم ذكر البيوع، وما يتعلق بها من الربا، ثم الشهادات والرهَان، وبها ختم السورة\n لكن الحديث ذو شُجون، والكلام يَجُرُّ بعضُه بعضاً، فقوله: { ليس البر أن تولوا }: اسم ليس وخبرها، وكلاهما مُعَرَّفَتان، الأول بأل والثاني بالإضافة، إذا التقدير: توليةُ وجوهكم، فمن رجَّح تعريف الألف واللام\n جعل { البر } اسمها، و { أن تولوا } خبرها، وبه قرأ الأكثر، ومن رجح الإضافة جعل { البر } خبرها مقدماً، والمصدر اسمها مؤخراً، وبه قرأ حمزة وحفص\n وقوله: { ولكن البر } مَنْ خَفَّفَ جعلها عاطفة الجملة، و { البر } مبتدأ، و { من آمن } خبر على حذف مضاف، أَيْ: بِرُّ من آمن إذ لا يُخْبَرُ بالذات عن المعنى، أو قصد المبالغة، ومن شدَّد نصب بها، لوقوعها بين جملتين، وهي استدراكية، و { على حبه } حال من المال، و { الصابرين } نصب على المدح، ولم يعطفه بالرفع لفضل الصبر وشرفه\n يقول الحقّ جلّ جلاله: في الرد على أهل الكتاب: { ليس البر } محصوراً في شأن القبلة، { ولكن البر } الذي ينبغي أن يُعتنى بشأنه هو الإيمان بالله، وما يجب له من الكمالات، وباليوم الآخرة وما بعده، وبالملائكة وما يجب أن يعتقد في شأنهم، والكتاب المنزل من السماء كالقرآن وغيره، { والنبيين } وما يجب لهم وما يستحيل في حقهم\n فالبر هو بر من اعتقد في قلبه هذه الأشياء، وأظهر على جوارحه ما يصدق صحة اعتقادها، وذلك كالاتصاف بالسخاء والكرم، فأعطى المال على محبته له، أي: مع حبه، فقد سئل - عليه الصلاة والسلام -:\n\n \" أَيُّ الصَّدَقَةِ أَفْضَلُ؟ فقال: أن تَتَصَدَّقَ وأَنْتَ صَحِيحٌ شَحِيحٌ، تأمُلُ الْغِنَى وتَخشَى الفَقْر \" \n\nو { آتى المال } على حب الله، لا جزاء ولا شكوراً، فأعطى ذلك المال ذوي قرابته المحَاويج، وقدَّمهم لقوله - عليه الصلاة والسلام -:\n\n \" صَدَقَتُك على المَساكينِ صَدَقَةٌ، وعَلَى ذَوِي القُربى اثنتان صَدَقَةٌ وصِلَةٌ \" \n\nوأعطى { اليتامى } لإهمالهم، وأعطى { المساكين } الذين أسكنهم الفقر في بيوتهم، { وابن السبيل } وهو المسافر الغريب، كأن الطريق وَلَدْته، أو الضيف { والسائلين } ألجأتهم الحاجة إلى السؤال\n وفي الحديث:\n\n \" أَعْطِ السائِلَ ولو على فَرَسِه \" \n\nوقال أيضاً صلى الله عليه وسلم:\n\n \" هَدِيَّةُ اللّهِ إلى المؤمن السائلُ على بَابِه \" \n\nوأعطى في فَكّ { الرقاب } من الرق أو الأسر\n { وأقام الصلاة } المفروضة، { وآتى الزكاة } المعلومة\n ومن أهل البر أيضاً: { المُوفُون بعهدهم } فيما بينهم وبين الله، وفيما بينهم وبين الناس { إذا عاهدوا } الله أو عبادة، فإذا وعدوا أنجزوا، وإذا حلفوا أو نذروا أوفوا، وإذا قالوا صدقوا، وإذا ائتمنوا أدَّوْا، وأخُصُّ من أهل البر { الصابرينَ في البأساء } كالفقر والذل وإذاية الخلق، و { الضراء } كالمرض والزَّمَانة، أو { البأساء }: الأهوال، و { الضراء } في الأنفس، والصابرين { حين البأس } أي: الحرب والجهاد، { أولئك الذين صدقوا } في طلب الحق، { وأولئك هم المتقون } لكل ما يقطع عن الحق، أو يشغل عنه\n\n\nفقد اشتملت هذه الآية على كمالات الإنسان بأسرها لاشتمالها على ما يَزِين البواطنَ من الاعتقادات وما يزين الظواهر من المعاملات، وما يُزَكِّي النفوس من الرذائل ويُحَلِّيها بالمحاسن والكمالات\n ولذلك وُصف المتصف بها بالصدق والتقى، اللذين هما أساسُ الطريقة ومبنَى أسرار التحقيق، وبالله التوفيق، وهو الهادي إلى سواء الطريق\n الإشارة: ليس المطلوب من العبد أن يَتَوجَّه إلى الحق بجِهَةٍ مخصوصة، كما إذا توجه إليه بالظاهر وأهملَ الباطن، أو توجه بالباطن وأهمل الظاهر، ولكن المطلوب منه أن يُزين باطنه بأنوار الإيمان واليقين، ويزين ظاهره بسائر وظائف الدين، ويزكي نفسه من الرذائل كالشح والبخل والغش والخيانة والكذب والخَوْف والجزَع، ويحليها بأنواع الفضائل كالسخاء والكرم والوفاء بالعهد والأمانة، والصبر والشجاعة، والعفة والقناعة، وسائر أنواع الفضائل، فإذا تخلّى عن الرذائل وتحلّى بأضدادها من الفضائل استحق الدخول مع الأبرار، وكان من العارفين الكبار، أولئك الذين ظفروا بصدق الطلب فنالوا الغاية من كل مطلب، وأولئك هم المتقون حق التقاة، فنالُوه أعلى الدرجات، منحنا الله من ذلك الحظ الوافر بمنِّه وكرمه\n\n",
      "translations": []
    }
  ]
}