{
  "chapter": "البقرة",
  "text": "كتب عليكم اذا حضر احدكم الموت ان ترك خيرا الوصية للولدين والاقربين بالمعروف حقا على المتقين",
  "translations": [
    {
      "translation": "It is ordained that when any one of you nears death, and he owns goods and chattels, he should bequeath them equitably to his parents and next of kin. This is binding on those who are upright and fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been prescribed for you that when death approaches one of you and he is leaving some property behind him, he should bequeath it equitably for his parents and relatives: it is an obligation on those who fear AIIah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If one of you facing death can leave a legacy, he should bequeath it to his parents and relatives, according to the law. This is the duty of the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is ordained for you that when death approaches one of you, and he leaves behind wealth, he must bequeath it to parents and near relatives in accordance with tradition; this is a duty upon the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is prescribed for you, when death approaches any of you, if he leaves wealth, that he makes a bequest to parents and next of kin, according to reasonable manners. (This is) a duty upon Al-Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bequest is prescribed for you when death approaches one of you, if he leaves behind wealth for parents and near relatives, according to usage, a duty (incumbent) upon those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed for you, when any of you is visited by death, and he leaves behind some goods, is to make testament in favour of his parents and kinsmen honourably -- an obligation on the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is prescribed for you, when death approacheth one of you, if he leave wealth, that he bequeath unto parents and near relatives in kindness. (This is) a duty for all those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is prescribed that when death approaches any of you and he is leaving behind wealth, he shall make a will in favour of his parents and relatives equitably. This is a duty for all who fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed unto you, when death is nigh unto one of you, if he leaveth any property, is the making of a bequest for parents and kindred equitably - a duty on the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed for you, when death approaches any of you and he leaves behind any property, is that he make a bequest for his parents and relatives, in an honourable manner—an obligation on the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is prescribed, when death approaches any of you, if he leave any goods that he make a bequest to parents and next of kin, according to reasonable usage; this is due from the Allah-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is prescribed for you, when death approaches any of you, if he leaves wealth, that he make a bequest to parents and next of kin, according to reasonable manners. (This is) a duty upon Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Written for any of you when death arrives, if he leaves behind goods, is the will for his parents and relatives with kindness. This is a duty incumbent on the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is decreed for you: when death approaches one of you, and he leaves wealth, to make a testament in favor of the parents and the relatives, fairly and correctly—a duty upon the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed for you when death approaches [any] one of you if he leaves wealth [is that he should make] a bequest for the parents and near relatives according to what is acceptable - a duty upon the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:180] Prescribed, made obligatory, for you, when any of you is approached by death, that is, [by] its causes, and leaves behind some good, material possessions, is to make testament (al-wasiyyatu is in the nominative because of kutiba, and is semantically connected to the particle idhā, ‘when’, if the latter is adverbial; but if this latter is conditional, then it [al-wasiyyatu] indicates the response; the response to the [conditional] particle in, ‘if’, is, in other words, [implied to be] fa’l-yūsi, ‘let him make testament’); in favour of his parents and kinsmen honourably, that is justly, not giving more than the allotted share of a third, nor preferring the richer person — an obligation (haqqan here emphasises the import of what has preceded) on those that fear, God (this verse has been abrogated by the ‘inheritance’ verse [āyat al-mīrāth, see Q. 4:11] and by the hadīth: ‘Do not make testament for one [already] inheriting’, as reported by al-Tirmidhī).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is prescribed for you, when death approacheth one of you, if he leave wealth, that he bequeath unto parents and near relatives) kinsfolk (in kindness) more so and even better to the parents. (A duty for all those who ward off (evil)) those who ascribe no partners to Allah; but this verse is abrogated by that on inheritance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { كُتِبَ عَلَيْكُمْ } أيضاً في دينكم أيها المؤمنون { إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ } أي: أسبابه وأماراته { إِن تَرَكَ خَيْراً } مالاً كثيراً يقبل التجزئة والانقسام المعتد بها بلا تحريم الورثة { ٱلْوَصِيَّةُ } أي: الحصة المستخرجة منها لرضاء الله، للفقراء المستحقين لها، وأفضل الوصية وأولاها الوصية { لِلْوَالِدَيْنِ وَٱلأَقْرَبِينَ } إن كانوا مستحقين لها، وأيضاً أفضلها الاستخراج { بِٱلْمَعْرُوفِ } المعتدل المستحسن بين الناس، بحيث لا يتجاوز عن ثلث المال؛ لئلا يؤدي إلى تحريم الورثة، وما فرض في الوصية في دينكم إلا { حَقّاً } لازماً { عَلَى ٱلْمُتَّقِينَ } [البقرة: 180] الذين يحفظون إيمانهم وتوحيدهم بمحبة الفقراء ومودة ذوي القربى عما يضاده ويخالفه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذا حضر } ظرف، العامل فيه: { كتب } ، أي: توجَّهَ إيجابُ الوصية عليكم إذا حضر الموت\n أو مصدر محذوف يفهم من الوصية، أي: كتب عليكم الإيصاء إذا حضر الموت، و { الوصية } نائب فاعل { كتب } ، ولا يصح أن تعمل في { إذا } لتقدمه عليها لأن المصدر لا يعمل في ما قبله، إلا على مذهب الأخفش\n اللهم إلا أن يُتوسع في الظروف، وجواب الشرطين محذوف، أي: إذا حضر الموت، إن ترك خيراً، فقد كُتبت عليه الوصية\n والجنَف: الميل عن الصواب، فإن كان خطأ فهو جَنَفٌ بلا إثم، وإن كان عمداً فهو جنَف إثم\n يقول الحقّ جلّ جلاله: كتب الله { عليكم } أن تُوصوا للوالدين والأقربين { إذا حضر أحَدكم الموتُ إن ترك } المستحضر { خيراً } أي: مالاً: قال سيّدنا عليّ - كرّم الله وجهه -: ألف درهم فصاعداً، فلا وصية في أقل\n وقال النخعي: خمسمائة درهم لا أقل\n وقال الزُّهْرِي: تجب فيما قلّ وكَثُر، وعن عائشة - رضي الله عنها -: أن رجلاً أراد أن يوصي، فسألته: كم مالُك؟ فقال: ثلاثة آلاف\n فقالت: كم عِيالك؟ فقال: أربعة، فقالت: لا، إنما قال الله تعالى { إن ترك خيراً } وإن هذا لَشيء يسير، فاتركْه لعيالك\n وتكون تلك الوصية { بالمعروف } ، أي: بالعدل، فلا يُفضل الذكور، ولا يتجاوز الثلث",
      "translations": []
    }
  ]
}