{
  "chapter": "البقرة",
  "text": "صمۢ بكم عمى فهم لا يرجعون",
  "translations": [
    {
      "translation": "They are deaf, dumb and blind, and shall never return;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are deaf; they are dumb; they are blind so they will not return (to the right way).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are deaf, blind, and dumb and cannot regain their senses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb and blind; and they are not to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are deaf, dumb, and blind, so they return not (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb (and) blind, so they will not turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "deaf, dumb, blind -- so they shall not return;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb and blind; and they return not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "deaf, dumb, and blind: they will never return [to the right path].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb, blind; wherefore they will not return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb, and blind, they will not come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb, and blind, they will not return (to the path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are deaf, dumb, and blind, so they return not (to the Right Path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb, and blind, they shall never return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb, blind. They will not return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Deaf, dumb and blind - so they will not return [to the right path].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:18] deaf, to the truth, so that they cannot hear it and accept it; dumb, mute as regards goodness, unable to speak of it; and, blind, to the path of guidance, so that they cannot perceive it; they shall not return, from error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Deaf) pretending to be deaf, (dumb) pretending to be dumb, (and blind) pretending to be blind; (so they return not) from their disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فهم لا يرجعون } إلى الله لوجود السّدين المضروبين على قلوبهم المذكورين في قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ صُمٌّ } لعدم إصغائهم لقول الحق عن ألسنة الرسل صلوات الله عليهم { بُكْمٌ } لعدم قولهم بالإيمان المقارن بالتصديق { عُمْيٌ } لعدم التفاتهم إلى الدلائل الظاهرة والمعجزات الباهرة، وبالجملة: { فَهُمْ } في هذه الحالة { لاَ يَرْجِعُونَ } [البقرة: 18] ولا يطمعون الرجوع إلى الهداية لتذكيرهم الإفراط والتفريط الذي صدر عنهم في النشأة الأولى المستتبع لهذا العذاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n كذلك اليهود كانوا في ظلمة الكفر والمعاصي ينتظرون ظهور نور النبيّ صلى الله عليه وسلم ويطلبونه، فلما قدم عليهم، وأشرقت أنواره بين أيديهم كفروا به، فأذهب الله عنهم نوره، { وَتَرَكَهُمْ فِي ظُلُمَاتٍ } الكفر والشك والنفاق، { لاَّ يُبْصِرُونَ } ولا يهتدون، { صُمٌّ } عن سماع الحق، { بُكْمٌ } عن النطق به { عُمْي } عن رؤية نوره، { فَهُمْ لا يَرْجِعُونَ } عن غيّهم، ولا يقصرون عن ضلالتهم\n الإشارة: مَثَلُ مَنْ كان في ظلمات الحجاب قد أحاطت به الشكوك والارتياب، وهو يطلب من يأخذ بيده ويهديه إلى طريق رشده، فلما ظهرت أنوار العارفين، وأحدقت به أسرار المقربين، حتى أشرقت من نورهم أقطارُ البلاد، وحَيِيَ بهم جلّ العباد، أنكرهم وبعد منهم، فتصامم عن سماع وعظهم، وتباكَمَ عن تصديقهم، وعَمِيَ عن شهود خصوصيتهم، فلا رجوع له عن حظوظه وهواه، ولا انزجار له عن العكوف على متابعة دنياه، مثله كمن كان في ظلمات الليل ضالاً عن الطريق، فاستوقد ناراً لتظهر له الطريق، فلما اشتعلت وأضاءت ما حوله أذهب الله نورها، وبقي جمرها وحرّها، وهذه سنة ماضية: لا ينتفع بالولي إلا مَن كان بعيداً منه\n وفي الحديث:\n\n \" أزْهَدُ النَّاسِ في العَالِم جيرانُه \" \n",
      "translations": []
    }
  ]
}