{
  "chapter": "البقرة",
  "text": "فمن خاف من موص جنفا او اثما فاصلح بينهم فلا اثم عليه ان الله غفور رحيم",
  "translations": [
    {
      "translation": "He who suspects wrong or partiality on the part of the testator and brings about a settlement, does not incure any guilt, for God is verily forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If, however. one apprehends genuinely that the testator had intentionally or unintentionally done some injustice, and then alters the will to set things right between the parties concerned, in that case he does not incur any sin. Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who is afraid of the testator's deviations and sin and settles the matter among the parties involved, he has not committed a sin. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if one fears that the will maker (the deceased) has done injustice or sin, and he makes a reconciliation between the parties, there shall be no sin upon him; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who fears from a testator some unjust act or wrongdoing, and thereupon he makes peace between the parties concerned, there shall be no sin on him. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who fears an inclination to a wrong course or an act of disobedience on the part of the testator, and effects an agreement between the parties, there is no blame on him. Surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if any man fears injustice or sin from one making testament, and so makes things right between them, then sin shall not rest upon him; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who feareth from a testator some unjust or sinful clause, and maketh peace between the parties, (it shall be) no sin for him. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if anyone apprehends partiality or an injustice on the part of a testator, it shall be no sin for him to bring about a settlement between the parties. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How beit whosoever apprehendeth from the testator a mistake or a sin and thereupon he maketh up the matter between them, on him there shall be no sin; verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But should someone, fearing deviance or sin on the testator’s behalf, set things right between them, there is no sin upon him. Indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if anyone fears partiality or wrong-doing on the part of the testator, and makes peace between (The parties concerned), there is no wrong in him: For Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who fears from a testator some unjust act or wrong-doing, and thereupon he makes peace between the parties concerned, there shall be no sin on him. Certainly, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who fears injustice or sin on the part of a testator and brings about a settlement among the parties incurs no guilt. Allah is the Forgiver and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should someone suspect bias or injustice on the part of a testator, and then reconciles between them, he commits no sin. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if one fears from the bequeather [some] error or sin and corrects that which is between them, there is no sin upon him. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:182] But if any one fears injustice, an error, in straying from what is right, or sin, because he has purposely increased the share of a third or specified a rich individual, from one making testament (read mūsī or muwassī), and so makes things right between them, the testator and the trustee, by commanding that justice be done, then no sin shall be upon him, with regard to this matter; surely God is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "until, that is, the following verse was revealed: (But he who feareth from a testator) knows that the testator has committed (some unjust or sinful clause) purposefully committed a mistake or transgression (and maketh peace between the parties) between the inheritors and the testator, i.e. he corrects what is in the will by reducing any bequest to a maximum of a third of the wealth, (no sin for him) he bears no sin in doing so. (Lo! Allah is Forgiving) He forgives the deceased if he transgresses or makes a mistake, (Merciful) in relation to the deed of the testator; it is also said that this means: He forgives the testator, and He is also merciful because He gave dispensation to reduce bequests to a third and thus commanded that one adhere to fairness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَمَنْ خَافَ مِن مُّوصٍ جَنَفاً أَوْ إِثْماً } فالجَنفُ: الجَورُ والخَطأ\n والإِثمُ: العمدُ، والإِثمُ: الذنبُ أيضاً في غير هذا المكان\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَنْ خَافَ } من الأوصياء والوكلاء { مِن مُّوصٍ } حين الوصية { جَنَفاً أَوْ إِثْماً فَأَصْلَحَ بَيْنَهُمْ } ميلاً بعض المستحقين، سألهم على مقتضى علمه بأحوالهم { فَلاَ إِثْمَ عَلَيْهِ } أي: على الوصي في هذا التبديل والتغيير، بل يرجى من الله بإصلاحه الثواب له ولمن أوصى إليه { إِنَّ ٱللَّهَ } المطلع بحالمها { غَفُورٌ رَّحِيمٌ } [البقرة: 182] لكل منهما\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقد حَقَّ الله ذلك { حقّاً } واجباً { على المتقين } ، فمَن غيَّره من الأوصياء أو الشهود { بعدما سمعه } وعلمه، { فإنما إثمه على الذين يبدلونه } من الأوصياء أو الشهود، لأنه هو الذي خالف الشرع وغيَّر دون الميت، { إن الله سميع عليم } فلا يخفى عليه مَنْ بدَّل أو غيَّر، فهو حسيبُه ومُعاقبه، { فمن خاف } أي: علِم { من مُوص جنفّا } أي: ميلاً بالخطأ في الوصية، { أو إثماً } تعمداً للجنف، { فأصلح } بين المُوصَى لهم وبين الورثة، بأن أجراهم على منهاج الشرع، أو نقص للموصَى لهم، أو زاد لمصلحة رآها { فلا إثم عليه } لأنه تبديل لمصلحة\n والتبديل الذي فيه الإثم إنما هو تبديل الهوى، { إن الله غفور رحيم } فيغفر للمبدِّل لمصلحةٍ ويرحمه\n وهذه الآية منسوخة في وصية الوالدين: مُحْكَمة في الأقربين غير الوارثين، بقوله - عليه الصلاة والسلام - في الحيدث المشهور:\n\n \" إنَّ اللّهَ أعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ\n فلا وَصِيَّةَ لِوَارثٍ \" \n\nفإذا كان الوالدان غيرَ وارثيْن كالكافرَيْن أو العبدَيْن فهي مُحْكَمة، والله تعالى أعلم\n الإشارة: اعلم أن المريد إذا منع نفسه من الشهوات، وحفظ قلبه من الخطَرَات، وصان سرّه من الغَفَلات - وأعظمُ الشهوات حبُّ الرئاسة والجاه، فإذا قتل نفسه ونزل بها إلى السُّفْليات حتى حَضرها الموت، وانقطع عنها الخواطر والخيالات - فإنها تفيض بالعلوم والواردات، فالواجب من طريق الجزم أن يُفيد تلك العلوم، أو يوصي مَنْ يقيدها لينتفع بها الوالدن وهما الأشياخ، والأقربن وهم الإخوان\n\n\nفإن الحكمة تَرِدُ في حال التجلّي كالجبَل، فإن لم يقيدها وأهملها، رجعت كالجمل، فإن أهملها رجعت كالكبش، فإن أهملها رجعت كالطير، ثم ترجع كالبَيْضة ثم تذهب\n هكذا كان يقول شيخ شيوخنا سيدي على الجمل رضي الله عنه، وكان شيخه سيدي العربي بن عبد الله يقول له: إنْ وَرَدَ عليكم واردٌ فقَيِّدْه وأعطني منه نسخة\n وهكذا كان أشياخنا يأمروننا بتقييد الواردات، فَمنْ قَيَّدَ وارداً أو سمعه من غيره، فلا يُغيرْه بمجرد رأيه وهواه\n فإن تحقق منه نقصاً أو ميلاً عن منهاج الطريقة والحقيقة، فأصلحه، فلا إثم عليه، { إن الله غفور رحيم }  ولما ذكر في الآية المتقدمة قاعدتين من قواعد الإسلام في قوله: { وأقام الصلاة وآتى الزكاة } ، بعد أن ذكر قواعد الإيمان، ذكر القاعدة الثالثة، وهي الصيام\n",
      "translations": []
    }
  ]
}