{
  "chapter": "البقرة",
  "text": "احل لكم ليلة الصيام الرفث الى نسائكم هن لباس لكم وانتم لباس لهن علم الله انكم كنتم تختانون انفسكم فتاب عليكم وعفا عنكم فالـن بشروهن وابتغوا۟ ما كتب الله لكم وكلوا۟ واشربوا۟ حتى يتبين لكم الخيط الابيض من الخيط الاسود من الفجر ثم اتموا۟ الصيام الى اليل ولا تبشروهن وانتم عكفون فى المسجد تلك حدود الله فلا تقربوها كذلك يبين الله ءايته للناس لعلهم يتقون",
  "translations": [
    {
      "translation": "You are allowed to sleep with your wives on the nights of the fast: They are your dress as you are theirs. God is aware you were cheating yourselves, so He turned to you and pardoned you. So now you may have intercourse with them, and seek what God has ordained for you. Eat and drink until the white thread of dawn appears clear from the dark line, then fast until the night falls; and abstain from your wives (when you have decided) to stay in the mosques for assiduous devotion. These are the bounds fixed by God, so keep well within them. So does God make His signs clear to men that they may take heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been made lawful for you to go to your wives during the nights of the fast days. They are as a garment to you and you are as a garment to them. Though Allah knew that you were secretly dishonest to yourselves, He has pardoned your guilt and forgiven you. NOW you are permitted to have intercourse with your wives and enjoy what Allah has made lawful for you. You are also pemitted to eat and drink during the nights of the Fast months. until you can discern the white streak of dawn from the blackness of night. \" Then (abstain from all these things and) complete your fast till night-fall. But you should not have intercourse with your wives while you confine yourselves to mosques. These are the bounds set by Allah; so do nut go near them. In this way Allah makes His Commands clear to mankind. It is expected that they will guard themselves against wrong ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is made lawful for you, during the nights of fasting, to have carnal relations with your wives. They are your garments and you are their garments. God knew that you were deceiving yourselves. He relented towards you and forgave you. Now it is lawful for you to have carnal relations with your wives and follow what God has commanded. Eat and drink until the white streak of dawn becomes distinguishable from darkness. Complete your fast, starting from dawn to dusk. It is not lawful to have carnal relations with your wives during i'tikaf in the mosque. Such are the limits of the laws of God. Do not come close to transgressing them. Thus has God explained His evidence to men so that perhaps they will have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Going to your wives during the nights of the fast is made lawful for you; they are coverings for you and you are coverings for them; Allah knows that you were deceiving yourselves (in this respect), so He accepted your penance and forgave you; so cohabit with them and seek what Allah has destined for you – and eat and drink until the white thread becomes distinct to you from the black thread at dawn – then complete the fast till nightfall; and do not touch women while staying in seclusion for worship in the mosques; these are the limits imposed by Allah, so do not go near them; this is how Allah explains His verses to mankind so that they may attain piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is made lawful for you to have sexual relations with your wives on the night of As-Siyam (fasting). They are Libas [i.e., body-cover, or screen] for you and you are Libas for them. Allah knows that you used to deceive yourselves, so He turned to you (accepted your repentance) and forgave you. So now have sexual relations with them and seek that which Allah has ordained for you (offspring), and eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night), then complete your fast till the nightfall. And do not have sexual relations with them (your wives) while you are in I`tikaf in the Masjids. These are the limits (set) by Allah, so approach them not. Thus does Allah make clear His Ayat to mankind that they may acquire Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is made lawful to you to go into your wives on the night of the fast; they are an apparel for you and you are an apparel for them; Allah knew that you acted unfaithfully to yourselves, so He has turned to you (mercifully) and removed from you (this burden); so now be in contact with them and seek what Allah has ordained for you, and eat and drink until the whiteness of the day becomes distinct from the blackness of the night at dawn, then complete the fast till night, and have not contact with them while you keep to the mosques; these are the limits of Allah, so do not go near them. Thus does Allah make clear His communications for men that they may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted to you, upon the night of the Fast, is to go in to your wives; -- they are a vestment for you, and you are a vestment for them. God knows that you have been betraying yourselves, and has turned to you and pardoned you. So now lie with them, and seek what God has prescribed for you. And eat and drink, until the white thread shows clearly to you from the black thread at the dawn; then complete the Fast unto the night, and do not lie with them while you cleave to the mosques. Those are God's bounds; keep well within them. So God makes clear His signs to men; haply they will be godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is made lawful for you to go in unto your wives on the night of the fast. They are raiment for you and ye are raiment for them. Allah is Aware that ye were deceiving yourselves in this respect and He hath turned in mercy toward you and relieved you. So hold intercourse with them and seek that which Allah hath ordained for you, and eat and drink until the white thread becometh distinct to you from the black thread of the dawn. Then strictly observe the fast till nightfall and touch them not, but be at your devotions in the mosques. These are the limits imposed by Allah, so approach them not. Thus Allah expoundeth His revelation to mankind that they may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been made lawful for you to go to your wives on the night of the fast: they are like a garment for you, and you are like a garment for them. God is aware that you were deceiving yourselves and He has turned in mercy towards you and pardoned you. So you may now consort with them and seek what God has ordained for you. Eat and drink until the white thread of dawn becomes distinct from the black. Then resume the fast until nightfall, and do not approach them during the nights of your devotional retreat in the mosques. These are the limits set by God, so do not approach them. Thus He makes clear His commandments to mankind, so that they may guard themselves [against evil].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allowed unto you, on the night of fasts, is consorting with your women. they are a garment unto you, and ye are a garment unto them. Allah knoweth that ye have been defrauding yourselves, so He hath relented toward you and pardoned you. Wherefore now copulate with them, and seek that which Allah hath prescribed for you, and eat and drink, Until the white thread becometh manifest unto you from the black thread of the dawn; thereafter complete the fast till night fall. And copulate not with them While ye are retreating in the mosques. These are the bounds of Allah, wherefore approach them not. Thus Allah expoundeth all His signs unto mankind that haply they may fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are permitted on the night of the fast to go into your wives: they are a garment for you, and you are a garment for them. Allah knew that you would betray yourselves, so He pardoned you and excused you. So now consort with them and seek what Allah has ordained for you, and eat and drink until the white streak becomes manifest to you from the dark streak at the crack of dawn. Then complete the fast until nightfall, and do not consort with them while you dwell in confinement in the mosques. These are Allah’s bounds, so do not approach them. Thus does Allah clarify His signs for mankind so that they may be Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted to you, on the night of the fasts, is the approach to your wives. They are your garments and ye are their garments. Allah knoweth what ye used to do secretly among yourselves; but He turned to you and forgave you; so now associate with them, and seek what Allah Hath ordained for you, and eat and drink, until the white thread of dawn appear to you distinct from its black thread; then complete your fast Till the night appears; but do not associate with your wives while ye are in retreat in the mosques. Those are Limits (set by) Allah: Approach not nigh thereto. Thus doth Allah make clear His Signs to men: that they may learn self-restraint.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is made lawful for you to have sexual relations with your wives on the night of As-Saum (the fasts). They are Libas [i.e. body cover, or screen, or Sakan, (i.e. you enjoy the pleasure of living with her - as in Verse 7:189) Tafsir At-Tabari], for you and you are the same for them. Allah knows that you used to deceive yourselves, so He turned to you (accepted your repentance) and forgave you. So now have sexual relations with them and seek that which Allah has ordained for you (offspring), and eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night), then complete your Saum (fast) till the nightfall. And do not have sexual relations with them (your wives) while you are in I'tikaf (i.e. confining oneself in a mosque for prayers and invocations leaving the worldly activities) in the mosques. These are the limits (set) by Allah, so approach them not. Thus does Allah make clear His Ayat (proofs, evidences, lessons, signs, revelations, verses, laws, legal and illegal things, Allah's set limits, orders, etc.) to mankind that they may become Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted to you, on the night of the Fast, is the approach to your wives; they are raiments for you, as you are raiments for them. Allah knows that you have been deceiving yourselves. He has accepted and pardoned you. Therefore, you may now touch them and seek what Allah has ordained for you. Eat and drink until the white thread becomes clear to you from a black thread at the dawn. Then resume the fast till nightfall and do not touch them while you cleave to the mosques. These are the Bounds of Allah, do not come near them. As such He makes known His verses to people so that they will be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted for you is intercourse with your wives on the night of the fast. They are a garment for you, and you are a garment for them. God knows that you used to betray yourselves, but He turned to you and pardoned you. So approach them now, and seek what God has ordained for you, and eat and drink until the white streak of dawn can be distinguished from the black streak. Then complete the fast until nightfall. But do not approach them while you are in retreat at the mosques. These are the limits of God, so do not come near them. God thus clarifies His revelations to the people, that they may attain piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been made permissible for you the night preceding fasting to go to your wives [for sexual relations]. They are clothing for you and you are clothing for them. Allah knows that you used to deceive yourselves, so He accepted your repentance and forgave you. So now, have relations with them and seek that which Allah has decreed for you. And eat and drink until the white thread of dawn becomes distinct to you from the black thread [of night]. Then complete the fast until the sunset. And do not have relations with them as long as you are staying for worship in the mosques. These are the limits [set by] Allah, so do not approach them. Thus does Allah make clear His ordinances to the people that they may become righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:187] Permitted to you, upon the night of the Fast, is to go in to your wives, in sexual intercourse: this was revealed as an abrogation of its unlawfulness during the earliest phase of Islam, as well as [an abrogation of] the unlawfulness of eating and drinking after the night prayer; they are a vestment for you, and you are a vestment for them (a metaphor for their embraces or their need for one another); God knows that you have been betraying yourselves, by having sexual intercourse on the eve of the fast: this happened with ‘Umar [b. al-Khattāb] and others, and they apologised to the Prophet (s), and so He has turned to you [relenting], before you even turned in repentance, and He has pardoned you. So now, when it is permitted to you, lie with them, in sexual intercourse, and seek what God has prescribed for you, of sexual intercourse or what it produces of offspring; and eat and drink, [at any time] during the night, until the white thread is distinct, to you, from the black thread at daybreak, that is, the true [moment of daybreak], which explains the white thread, while the explanation of the black thread, namely, the night, has been left out. The whiteness and the darkness of the dawn [twilight] are likened to two black and white threads in the way they stretch out; then complete the fast, from daybreak, to the night, that is, until it arrives, after the setting of the sun; and do not lie with them, your women, while you cleave to the mosques in devotion [to God], while you are residing [therein] with the intention of [performing] i‘tikāf (‘spiritual retreat’). This was a prohibition pertaining to one who used to leave [the mosque], whilst in a state of i‘tikāf, have sexual intercourse with his wife, and then return. Those, rulings mentioned, are God’s bounds, delimited by God for His servants so that they do not overstep them; do not approach them (lā taqrabūhā, is more intense than lā ta‘taddūhā, ‘Do not overstep’, used in verses elsewhere). So, just as He makes clear to you what has been mentioned, God makes clear His signs to people so that they might fear [disobeying] His prohibitions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is made lawful for you to go unto your wives on the night of the fast) for sexual intercourse. (They are raiment for you) a repose for you (and you are raiment for them) a repose for them. (Allah is aware that ye were deceiving yourselves in this respect) by having sexual intercourse with them at night (and He hath turned in mercy towards you) He forgave you (and relieved you) from your deception and did not punish you. (So) now that it is made lawful, (hold intercourse with them and seek that which Allah hath ordained for you) to have a righteous child; this verse was revealed about 'Umar Ibn al-Khattab, (and eat and drink) from the time the night falls (until the white thread becometh distinct to you from the black thread of the dawn) i.e. until the light of day becomes distinct to you from the darkness of night. (Then strictly observe the fast till nightfall) the beginning of nightfall; this verse was revealed about Sirmah Ibn Malik Ibn 'Adiyy (and touch them not) do not have sexual intercourse with them, (while you are at your devotions) in pious retreat (in the mosques) whether this is during the day or the night. (These are the limits imposed by Allah) such sexual intercourse is a transgression against Allah, (so approach them not) abstain from having sexual intercourse with your wives, during the day and at night, while you are in such retreats. (Thus Allah expoundeth His revelations) His commands and prohibitions (to mankind) as He has exposited this matter (that they may ward off (evil)) they may ward off transgressing against Him. This verse was revealed about 31 a group of Companions of Allah's Messenger (pbuh) among whom were 'Ali Ibn Abi Talib and 'Ammar Ibn Yasir, who were in retreat in the mosque and used to go to their wives whenever they needed them, and then take a ritual bath and return to the mosque. Henceforth but they were forbidden to do so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أُحِلَّ لَكُمْ لَيْلَةَ ٱلصِّيَامِ ٱلرَّفَثُ إِلَىٰ نِسَآئِكُمْ } قَالَ زيدُ بن علي عليهما السلامُ: الرَّفَثُ: الجماعُ، والرَّفَثُ: التَعْرِيضُ بِذِكرِ الجماعِ وَهو الإِعْرَابُ\n ومثلُ قَولهِ تعالى:\n\n[البقرة: 197] والفُسُوقُ: المَعاصي\n والجِدَالُ: المِراءُ: أَنْ تُماري صَاحِبَكَ حتَّى تَغِيظَهُ\n\n\n\n\nوقولهُ تعالى: { هُنَّ لِبَاسٌ لَّكُمْ } ويقالُ لامْرأةِ الرَّجلِ: هي لِباسٌ، وفِراشٌ وإِزارهُ، [وأمُ] أَولادِهِ، ومَحلُ إِزَارِهِ\n\n\n\n\nوقولهُ تعالى: { ٱبْتَغُواْ مَا كَتَبَ ٱللَّهُ لَكُمْ } معناه اطْلِبُوا الوَلَدَ\n وقالَ: بَعْضُهُمْ: لَيْلَةُ القَدْرِ\n ويقالُ: الرّخصةُ التي كَتَبَ الله لَكُمْ\n\n\n\n\nوقولهُ تعالى: { حَتَّىٰ يَتَبَيَّنَ لَكُمُ ٱلْخَيْطُ ٱلأَبْيَضُ مِنَ ٱلْخَيْطِ ٱلأَسْوَدِ مِنَ ٱلْفَجْرِ } قالَ زيدُ بن علي عليهما السَّلامُ: فالخَيْطُ: اللّونُ\n والأَبيضُ مِنهُ\n والأَسوَدُ مِنْهُ: هو سَوادُ اللّيلِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى بيان أحكام الصوم مما يتعلق بالحل والحرمة فيه فقال: { أُحِلَّ لَكُمْ } أيها الصائمون { لَيْلَةَ ٱلصِّيَامِ } دون نهاره؛ إذ الإمساك عن الجماع في يوم الصوم مأخوذ في تعريفه شرعاً { ٱلرَّفَثُ } الوقاع والجماع { إِلَىٰ نِسَآئِكُمْ } أي: مع نسائكم اللاتي { هُنَّ لِبَاسٌ لَّكُمْ } لا تصبرون عنهن لإفضاء طبعكم، وميل نفوسكم إليهن { وَأَنْتُمْ لِبَاسٌ لَّهُنَّ } أيضاً، لا يصبرن عنكم لاشتداد شهوتهن إلى الوقاع بأضعاف ما أنتم عليه، وإنما رخص لكم الوقاع في لياليه؛ إذ { عَلِمَ ٱللَّهُ } المحيط بسرائركم وضمائركم { أَنَّكُمْ كُنتُمْ } لو كلفتم بها { تَخْتانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ } أي: توقعونها بأيديكم إلى الخبائث فتعاقبون عليها، وتحرمون جزاء الصوم المتكفل لها الحق بذاته، كما قال صلى الله عليه وسلم حكاية عنه سبحانه:\n\n \" الصوم لي وأنا أجزي به \"\n \n\n \n\n{ وَ } إذا علم سبحانه منكم ما علم { عَفَا } محا { عَنْكُمْ } ما يوقعكم إلى الفتنة والعذاب، وهو تحريم الرفث في الليلة أيضاً، وإذا رخص لكم الوقاع فيها { فَٱلآنَ بَٰشِرُوهُنَّ } أي: ألصقوا بشرتهن لبشرتكم في ليلة الصام المرخصة فيها الجماع، ولا تخافوا من عقوبة الله عليها بعد ما أذن { وَٱبْتَغُواْ } اطلبوا سرائر { مَا كَتَبَ } قدر { ٱللَّهُ لَكُمْ } من الولد الصالح المتفرع على اجتماعكم من نسائكم؛ إذ سر الجماع والنزوع المستلزم له إبقاء نوع الإنسان المصور بصورة الرحمن؛ ليترقى في العبودية والعرفان إلى أن يستخلف وينوب عنه سبحانه { وَكُلُواْ } في ليلة { وَٱشْرَبُواْ } فيها { حَتَّىٰ يَتَبَيَّنَ } أي: إلى أن يظهر { لَكُمُ } بلا خفاية { ٱلْخَيْطُ ٱلأَبْيَضُ } أي: البياض الممتد الذي يقال له في العرف: الصبح الصادق { مِنَ ٱلْخَيْطِ ٱلأَسْوَدِ } البياض المتوهم قبل الصبح الصادق المعبر عنها بالصبح الكاذب، وكلاهما { مِنَ ٱلْفَجْرِ } الشامل لهما، وهو آخر الليل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الرفَث: مُحَرِّك الجِماع، والفُحْش كالرفوث، وكلام النساء في الجماع، قاله في القاموس، وقال الأزهري اللغوي: الرفَث: كلمة جامعة لكل ما يريد الرجل من امرأته، وضمَّنه هنا الإفضاء، فعدَّاه بإلى\n يقول الحقّ جلّ جلاله: في نسخ ما كان في أول الإسلام من تحريم الجِماع في رمضان بعد العشاء أو النوم، ثم إن عمر رضي الله عنه باشر امرأته بعد العشاء، فندم وأتى رسول الله صلى الله عليه وسلم يعتذر إليه، فقام رجال فاعترفوا بما صنعوا بعد العشاء فنزل قوله: { أحل لكم ليلةَ الصيام } قبل الفجر، الإفضاءُ { إلى نسائكم } بالجماع\n وعبَّر بالرفث تقبيحاً لما ارتكبوه\n ثم علَّل التحليل بقوله: { هن لباس لكم وأنتم لباس لهن } ، أي: وإنما أبحتُ لكم الجماع لقلّة صبركم عليهن، حتى تعانقوهن ويعانقنكم، فيشتمل بعضُكم على بعض، كاشتمال اللباس على صاحبه، كما قال الشاعر:\n\nوهذه الحالة يقلُّ فيها الصبرُ عن الوقَاع، { علم الله أنكم كنتم تختانون أنفسكم } أي تَخُونُونها فَتُعرِّضُونها للعقاب، وتَحْرمُونها من الثواب، { فتاب عليكم } لَمّا تُبْتُم واعترفتم بما اقْتَرَفْتُم، وعفا عنكم فمحا ذنوبكم، { فالآن باشروهن }\n والمباشرة: إلصاق البَشْرة بالبشرة، كنايةً عن الجماع، { وابتغوا ما كتب الله لكم } من النسل، فلا تباشروهن لمجرد قضاء الشهوة، بل اطلبوا ما قدَّر الله لكم، وأثْبتَه في اللوح المحفوظ من الولد، لأنه هو المقصود من تشريع النكاح، وخلق الشهوة، لا مجرد قضاء الوطر\n وفي الحديث:\n\n \" إذَا مَاتَ العبدُ انْقَطَع عَمَلُه إلا مِنْ ثلاثٍ: صَدَقَةٍ جَاريَةٍ، وعِلْمٍ بثَّه في صُدور الرجال، وولدٍ صالحٍ يَدْعُو لَهُ \"\n \n\nوفي حديث طويل عن عائشة - رضي الله عنهما - في قصة الحَوْلاء - امرأة من الأنصار -، قال لها رسول الله صلى الله عليه وسلم:\n\n \" ما من امرأة حمَلَت من زوجها حين تَحْمِل، إلا لها من الأجْر مثل القائم ليلَه الصائم نهارَه، والغازي في سبيل الله، وما من امرأة يأتيها الطَلْقُ، إلا كان لها بكل طَلْقةٍ عِتْق نسمةٍ، وبكل رَضْعة عتق رقبة، فإذا فَطَمت ولَدها ناداها مُنادِ من السماء: قد كُفيتِ العملَ فيما مضى، فاستأنفي العمل فيما بقي \" \n\nقالت عائشة - رضي الله عنها -: قد أُعْطِي النساءُ خيراً كثيراً، فما لكم يا معشر الرجال؟ فضحك النبيّ صلى الله عليه وسلم ثم قال:\n\n \" ما من رجل مؤمن أخذ بيد امرأتِه يُرَاوِدُها، إلا كتب الله له حسنة، وإنْ عانقها فعشْر حسنات، وإن ضاجعها فعشرون حسنةٌ، وإن أتاها كان خيراً من الدنيا وما فيها، فإذا قام ليغتسل لم يمر الماء على شعرة من جسده إلا مُحِيَ عنه سيئة، ويُعطى له درجة، وما يعطى بغُسْله خيراٌ من الدنيا وما فيها، وإن الله تعالى يباهي الملائكة فيقول: انظروا إلى عبدي قام في ليلة قَرَّة يغتسل من الجنابة، يتيقن بأني ربه، اشهدوا أني غفرت له \" \n\n \n\nهـ\n من الثعلبي\n ثم أباح الحق تعالى الأكلَ والشرب، ليلة الصيام إلى الفجر، فقال: { وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود } شبَّه أول ما يبدوا من الفجر المعترِض في الأفق، بالخيط الأبيض، وما يمتد معه من غَبَشِ الليل، بالخيط الأسود ولم ينزل قوله تعالى: { من الفجر } إلا بعد مدة، فحمله بعض الصحابة على ظاهره، فعمد إلى خيطٍ أبيض وخيط أسود فجعلهما تحت وِسادته، فجعل يأكل وينظر إليهما، فلم يتبيَّنا، ومنهم عَديُّ بنُ حاتم، قال: فغدوتُ إلى رسول الله صلى الله عليه وسلم فأخبرته فضحِك، وقال:\n\n \" إِنك لَعَرِيضُ القَفا، إِنَّمَا ذلِكَ بَيَاضُ النَّهَارِ وسَوَادُ اللَّيْلِ \" \n\n، والحديث ثابت في البخاري وغيرِه\n واعترضه الزمخشري بأن فيه تأخيرَ البيان عن وقت الحاجة، وذلك لا يجوز، لما فيه من التكليف بما لا يطاق\n وأُجيب بأنه ليس فيه تأخير البيان عن وقت الحاجة، وإنما فيه تأخير البيان لوقت الحاجة، وهو جائز\n وبيان ذلك أنه لمّا نزل قوله تعالى: { حتى يتبين لكم الخيط الأبيض من الخيط الأسود } فهم رسول الله صلى الله عليه وسلم والمؤمنون مُرادَ الله منهما، واستمر عملهم على ذلك، فكانت الآية مُبينة في حقهم لا مُجْمَلة\n وأما عَدِيّ بن حاتم فكان بَدَوِيّاً مُشتغلاً بالصيد، ولم يكن فيه حُنْكَة أهل الحاضرة، فحمل الآية على ظاهرها ولذلك قال له رسول الله صلى الله عليه وسلم:\n\n \" إنك لَعِرَيضُ القَفا \" \n\nفنزلت الآية تُبين لعدي مُرادَ الله عند الحاجة إلى البيان\n مع أن السيوطي ذكر في التوشيح خلاف هذا ونصه: قال بعضهم: كأنَّ عديّاً لم يسمع هذه اللفظة من الآية لأنها نزلت قبل إسلامه بمدة، وذلك أن إسلامه كان في السنة التاسعة أو العاشرة، بعد نزول الآية بمدة، قال: علَّمنِي رسولُ الله صلى الله عليه وسلم الصلاة والصيام، فقال:\n\n \" صلّ كذا، وصم كذا، فإن غابت الشمس فَكُلْ حتى يتبين لك الخيط الأبيض من الخيط الأسود، فأخذ الخيطين\n\n\n \" \n\nالحديث\n قال له - عليه الصلاة والسلام:\n\n \" ألم أقل لك من الفجر؟ \" \n\nفتبين أن قوله في الحديث:\n\n \" فأنزل الله مِنْ الفجر \" \n\nمن تصرُّف الرواة\n هـ\n مختصراً، فهذا صريح في أن الآية نزلت بتمامها مبينة فلم يكن فيها تأخير، والله تعالى أعلم\n ثم بيَّن تعالى غاية الصوم، فقال: { ثم أتموا الصيام إلى الليل } فمن أفطر مع الشك في الغروب، فعليه الكفارة، بخلاف الشك في الفجر للاستصحاب\n ولما كان الاعتكاف من لوازم الصوم ذكر بعض أحكامه بإثره فقال: { ولا تباشروهن } أي: النساء { وأنتم عاكفون في المساجد } ، فالمباشرة للمعتكف حرام، وتُفسد الاعتكاف\n\n\nكانت المباشرة في المسجد أو خارجَه، وكان الرجل يكون معتكفاً فيخرج فيصيب زوجَه ثم يرجع، فنزلت الآية - { تلك حدود الله } قد حدها لكم، { فلا تقربوها } فضلاً عن أن تعتدوها، { كذلك } أي: مثل هذا البيان التام، { يبين الله آياته للناس لعلهم يتقون } محارمه\n الإشارة: قد تقدم أن صوم الخواص، وخواص الخواص، هو الإمساك عن الفُضول، وعن كل ما يقطع عن الوصول\n أو الإمساك عن شهود الأغيار، وعن كل ما يوجب الأكدار\n فإن عزَمَت النفس على هذا الصوم وعقَدَت النيّة عليه، حلَّ لها أن تُباشر أَبْكارَ العلوم اللدنية الوهبية، والحقائق العرفانية، وتفضي إلى ثَيبات العلوم الرَّسْمية الكسبية\n العلومُ اللدنية والوهبية شِعارُها، والعلومُ الرسمية دِثارها\n العلوم اللدنية لباس باطنها، والعلوم الرسمية لباس ظاهرها\n قال أبو سليمان الداراني: إذا اعتادت النفوس على ترك الآثام جالت في الملكوت، ثم عادت إلى صاحبها بطرائف العلوم، من غير أن يُؤدّي إليها عالمٌ عِلْماً\n هـ\n قال الحقّ تعالى: { علم الله أنكم كنتم تختانون أنفسكم } بدنس الهفوات، فمنعكم من مباشرة تلك العلوم الوهبيات، فلما عقدْتُم التوبة، وعزمتم على تركها، تاب عليكم وعفا عنكم، فالآن باشروها، وابتغوا ما كتب الله لكم، من الوصول إلى معرفته، والعكوف في حضرة قُدسه، وكلوا من ثمرات تلك العلوم، واشربوا من خمرة الحيّ القيّوم، حتى يَطْلُعَ عليكم فجرُ الكشف والبيان، وتُشرق على قلوبكم شمسُ نهار العرفان، فحينئذٍ تَضْمَحِلُّ تلك العلوم، وتمحي تلك المعالم والرسوم\n ولم يبقَ إلا الاستغراق في مشاهدة الحيّ القيّوم، فلا تباشروها وأنتم عاكفون في تلك المساجد\n فمشاهدةُ وجهِ الحبيب تُغنْي عن مطالعة المعالم والمشاهد\n تلك حدود الله فلا تقربوها، أي: لا تقفوا مع تلك العلوم وحلاوة تلك الرسوم فإنها تمنعكم من مشاهدة الحيّ القيّوم: كذلك يبن الله آياته الموضَّحة لطريق وصوله للناس، لعلهم يتقون مشاهد ما سواه\n والله تعالى أعلم\n ولما أراد الحقّ أن يتكلم على الحج قدَّم الكلام على الأموال لأنها سببٌ في وجوبه، والوصول إليه في الغالب\n\n",
      "translations": []
    }
  ]
}