{
  "chapter": "البقرة",
  "text": "شهر رمضان الذى انزل فيه القرءان هدى للناس وبينت من الهدى والفرقان فمن شهد منكم الشهر فليصمه ومن كان مريضا او على سفر فعدة من ايام اخر يريد الله بكم اليسر ولا يريد بكم العسر ولتكملوا۟ العدة ولتكبروا۟ الله على ما هدىكم ولعلكم تشكرون",
  "translations": [
    {
      "translation": "Ramadan is the month in which the Qur'an was revealed as guidance to man and clear proof of the guidance, and criterion (of falsehood and truth). So when you see the new moon you should fast the whole month; but a person who is ill or travelling (and fails to do so) should fast on other days, as God wishes ease and not hardship for you, so that you complete the (fixed) number (of fasts), and give glory to God for the guidance, and be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadan is the month in which the Qur'an was sent down: this Book is a perfect guidance for mankind and consists of clear teachings which show the right way and are a criterion of Truth and falsehood. Therefore from now on whoever witnesses it, it is obligatory on hire to fast the whole month, but if one be ill or on a journey, he should make up for the same number by fasting on other days. Allah desires to show leniency to you and does not desire to show any hardship. \"therefore this method is being shown to you so that you may complete the number of Fast days and glorify Allah for the Guidance He has shown to you and be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month in which the Quran was revealed; a guide for the people, the most authoritative of all guidance and a criteria to discern right from wrong. Anyone of you who knows that the month of Ramadan has begun, he must start to fast. Those who are sick or on a journey have to fast the same number of days at another time. God does not impose any hardship upon you. He wants you to have comfort so that you may complete the fast, glorify God for His having given you guidance, and that, perhaps, you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was sent down the Qur’an – the guidance for mankind, the direction and the clear criteria (to judge between right and wrong); so whoever among you witnesses this month, must fast for the (whole) month; and whoever is sick or on a journey, may fast the same number in other days; Allah desires ease for you and does not desire hardship for you – so that you complete the count (of fasts), and glorify Allah’s greatness for having guided you, and so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Qur'an, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights (the crescent on the first night of) the month (of Ramadan, i.e., is present at his home), he must observe Sawm (fasting) that month, and whoever is ill or on a journey, the same number [of days which one did not observe Sawm (fasting) must be made up] from other days. Allah intends for you ease, and He does not want to make things difficult for you. (He wants that you) must complete the same number (of days), and that you must magnify Allah [i.e., to say Takbir (Allahu Akbar: Allah is the Most Great)] for having guided you so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramazan is that in which the Quran was revealed, a guidance to men and clear proofs of the guidance and the distinction; therefore whoever of you is present in the month, he shall fast therein, and whoever is sick or upon a journey, then (he shall fast) a (like) number of other days; Allah desires ease for you, and He does not desire for you difficulty, and (He desires) that you should complete the number and that you should exalt the greatness of Allah for His having guided you and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the month of Ramadan, wherein the Koran was sent down to be a guidance to the people, and as clear signs of the Guidance and the Salvation. So let those of you, who are present at the month, fast it; and if any of you be sick, or if he be on a journey, then a number of other days; God desires ease for you, and desires not hardship for you; and that you fulfil the number, and magnify God that He has guided you, and haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Qur'an, a guidance for mankind, and clear proofs of the guidance, and the Criterion (of right and wrong). And whosoever of you is present, let him fast the month, and whosoever of you is sick or on a journey, (let him fast the same) number of other days. Allah desireth for you ease; He desireth not hardship for you; and (He desireth) that ye should complete the period, and that ye should magnify Allah for having guided you, and that peradventure ye may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month when the Quran was sent down as guidance for mankind with clear proofs of guidance and the criterion by which to distinguish right from wrong. Therefore, whoever of you is present in that month, let him fast; but he who is ill or on a journey shall fast a similar number of days later on. God desires ease for you, not hardship. He desires you to fast the whole month, so that you may glorify Him for His having guided you and so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadhan: therein was sent down the Qur'an: is a guidance unto mankind, and with evidences: one of the Books of guidance and the distinction. So whosoever of you witnesseth the month, he shall fast it, and whosoever sick or journeying, for him the like number of other days. Allah intendeth for you ease, and intendeth not for you hardship; so ye shall fulfil the number and shall magnify Allah for His having guided you, and haply ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Rama¤¡n is one in which the Quran was sent down as guidance to mankind, with manifest proofs of guidance and the Criterion. So let those of you who witness it fast [in] it, and as for someone who is sick or on a journey, let it be a [similar] number of other days. Allah desires ease for you, and He does not desire hardship for you, and so that you may complete the number and magnify Allah for guiding you, and that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadhan is the (month) in which was sent down the Qur'an, as a guide to mankind, also clear (Signs) for guidance and judgment (Between right and wrong). So every one of you who is present (at his home) during that month should spend it in fasting, but if any one is ill, or on a journey, the prescribed period (Should be made up) by days later. Allah intends every facility for you; He does not want to put to difficulties. (He wants you) to complete the prescribed period, and to glorify Him in that He has guided you; and perchance ye shall be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan in which was revealed the Quran, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights (the crescent on the first night of) the month (of Ramadan i.e. is present at his home), he must observe Saum (fasts) that month, and whoever is ill or on a journey, the same number [of days which one did not observe Saum (fasts) must be made up] from other days. Allah intends for you ease, and He does not want to make things difficult for you. (He wants that you) must complete the same number (of days), and that you must magnify Allah [i.e. to say Takbir (Allahu-Akbar; Allah is the Most Great) on seeing the crescent of the months of Ramadan and Shawwal] for having guided you so that you may be grateful to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadan is the month in which the Koran was sent down, a guidance for people, and clear verses of guidance and the criterion. Therefore, whoever of you witnesses the month, let him fast. But he who is ill, or on a journey shall (fast) a similar number (of days) later on. Allah wants ease for you and does not want hardship for you. And that you fulfill the number of days and exalt Allah who has guided you in order that you be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ramadan is the month in which the Quran was revealed. Guidance for humanity, and clear portents of guidance, and the Criterion. Whoever of you witnesses the month, shall fast it. But whoever is sick, or on a journey, then a number of other days. God desires ease for you, and does not desire hardship for you, that you may complete the number, and celebrate God for having guided you, so that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The month of Ramadhan [is that] in which was revealed the Qur'an, a guidance for the people and clear proofs of guidance and criterion. So whoever sights [the new moon of] the month, let him fast it; and whoever is ill or on a journey - then an equal number of other days. Allah intends for you ease and does not intend for you hardship and [wants] for you to complete the period and to glorify Allah for that [to] which He has guided you; and perhaps you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:185] These days of, the month of Ramadān, wherein the Qur’ān was revealed, from the Preserved Tablet to the earthly heaven on the Night of Ordainment [laylat al-qadr] from Him, a guidance (hudan, ‘a guidance’, is a circumstantial qualifier), guiding away from error, for the people, and as clear proofs, lucid verses, of the Guidance, the rulings that guide to truth, and, of, the Criterion, that discriminates between truth and falsehood; So let those of you, who are present at the month, fast it and if any of you be sick, or if he be on a journey, then a number of other days (this [concession] has already been mentioned, but it is repeated here to avoid the mistaken impression that it has been abrogated by the comprehensive implication of man shahida, ‘who are present’). God desires ease for you, and desires not hardship for you, and for this reason He has permitted you the breaking of the fast during illness or travel, [this ease being] the very reason He has commanded you to fast; He supplements [the previous statement with]: and that you fulfil (read tukmilū or tukammilū) the number, of the fasting days of Ramadān, and magnify God, when you have completed them, for having guided you, for having directed you to the principal rites of His religion, and that you might be thankful, to God for this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The month of Ramadan is) the month in (which was revealed the Qur'an) whereupon Gabriel brought down the entire Qur'an to the first heaven, dictated it to the scribes among the angels (al-safarah) and then took it down to Muhammad (pbuh) day after day, sometimes revealing to him just one, two or three verses and sometimes an entire surah, (a guidance for mankind) the Qur'an elucidates error to people, (and clear proofs of the guidance) in the matter of Religion, (and the Criterion (of right and wrong)) the lawful and the unlawful, the legal rulings, legal punishments and the steering away from doubtful matters. (And whoever of you is present) in settled areas and not travelling, (let him fast the month. And whoever of you is sick) during the month of Ramadan (or on a journey, (let him fast the same) number of days) at another time. (Allah desireth for your ease) He desires for you the dispensation of breaking the fast while on a journey; it is also said that this means: Allah wants you to break the fast when travelling; (He desireth not hardship for you) He does not desire for you the hardship of fasting while travelling; (and (He desireth) that ye should complete the period) that you should fast when you are back in your settlement the same number of days of fast you broke during your travel, (and that ye should magnify Allah for having guided you) as He guided you to His religion and legal dispensation, (and that peradventure ye may be thankful) so that you be thankful for His giving you this dispensation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلموا أيها المؤمنون أن أفضل الشهور عند الله وأرفعها قدراً ومرتبة: { شَهْرُ رَمَضَانَ ٱلَّذِيۤ أُنْزِلَ فِيهِ ٱلْقُرْآنُ } أي: ابتداء نزوله أو نزل كله فيه، بل الك تب الأربعة كلها تنزل فيه على ما نقل في الحديث وكيف لا يكون أفضل الشهور، والحال أن القرآن النزل فيه { هُدًى لِّلنَّاسِ } المؤمنين بتوحيد الله المتوجهين نحو جنابه يهديهم إلى مرتبة اليقين { وَبَيِّنَاتٍ } شواهد وآيات واضحات { مِّنَ ٱلْهُدَىٰ } الموصل للمستكشفين عن سرائر التوحيد إلى مرتبة عين اليقين { وَٱلْفُرْقَانِ } الفارق لهم بين الحق الذي هو الوجود الإلهي، والباطل الذي هو الوجودات الكونية يوصلهم إلى مرتبة حق اليقين { فَمَن شَهِدَ } أدرك { مِنكُمُ ٱلشَّهْرَ } المذكور مقيماً مطيقاً بلا عذر { فَلْيَصُمْهُ } ثلاثين يوماً حتى بلا إفطار وإفداء؛ لأن هذه الآية ناسخة للآية السابقة\n\n\n\n\n{ وَمَن كَانَ مَرِيضاً } لا يطيق على صومه خوفاً من شدة مرضه { أَوْ عَلَىٰ } متن { سَفَرٍ } فأفطر دفعاً للحرج { فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ } أي: لزم عليه صيام أيام أخر قضاء لأيام الفطر إنما { يُرِيدُ ٱللَّهُ بِكُمُ } أيها المؤمنون { ٱلْيُسْرَ } لئلا يتحرجوا { وَلاَ يُرِيدُ بِكُمُ ٱلْعُسْرَ } لئلا تضطروا وتضطربوا وإنما رخص لكم الإفطار في المرض والسفر { وَ } ألزم عليكم القضاء بعد { لِتُكْمِلُواْ ٱلْعِدَّةَ } المفروضة لكم في كل سنة؛ لئلا تحرموا عن منافع الصوم { وَلِتُكَبِّرُواْ ٱللَّهَ } وتعظموه { عَلَىٰ مَا هَدَاكُمْ } إلى الرخص عند الاضطرار { وَلَعَلَّكُمْ تَشْكُرُونَ } [البقرة: 185] تتنبهون بشكر نعمه الفائضة عليكم في أمثال هذه المضائق إلى ذاته، أو يشكر نعمه تتقربون إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { شهر رمضان } إما خبر عن مضمر، أو مبتدأ، والخبر: الألف واللام والوصف: و { شهر رمضان } إما خبر عن مضمر، أو مبتدأ، والخبر: { فمن شهد } ، أو بدل من { الصيام } ، على حذف مضاف، أي: صيام شهر رمضان\n و { رمضان } مصدر رمَض إذا احترق، وأضيف إليه الشهر، وجُعل عَلَما، ومُنع من الصرف للعلَمية والألف والنون\n وسَمَّوْه بذلك إما لارتماض القلب فيه من حرَّ الجوع والعطش، أو لارتماض القلب فيه من حَرَّ الجوع والعطش، أو لارتماض الذنوب فيه، أو وافق الحرَّ حين نقلوا الشهور عن اللغة القديمة\n و { الشهر } ظرف، لقوله: { شهد } أي: حضر، وقوله: { ولتكلموا\n\n\n } الآية، هذه ثلاثُ عِللَ لثلاثة أحكام على سبيل الفِّ والنَّشْرِ المعكوس، أي: ولتكملوا العدة أمرتُكم بقضاء عدة أيام أخر، ولتكبروا الله عند تمام الشهر أمرتُكم بصيام الشهر كله، ولعلكم تشكرون أردتُ بكم اليسر دون العسر\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } فُرض عليكم { الصيام } كما فرض { على الذين من قبلكم } من الأنبياء وأَمَمِهم من لدن آدم، فلكم فيهم أسوة، فلا يشق عليكم { لعلكم تتقون } المعاصي، فإن الصوم يكسر الشهوة\n ولذلك قال - عليه الصلاة والسلام-:\n\n \" مَنْ اسْتَطَاعَ منْكُمُ البَاءَةَ فَلْيَتَزَوَّجْ، ومَنْ لَمْ يَسْتَطِعْ فَعَليْه بالصَّوْمِ، فَإِنَّه لَهُ وِجَاء \"\n \n\nوذلك الصيام إنما هو في أيام قلائل { معدودات } فلا يهولكم أمره، { فمن كان منكم مريضاً } يشق عليه الصيام، { أو على سفر } فأفطر فعليه صيام عدة ما أفطر { من أيام أُخر } بعد تمام الشهر، { وعلى الذين يطيقونه } بلا مشقة، إن أرادوا أن يفطروا { فديةُ } وهي: { طعام مساكين }: مُدٍّ لكل يوم\n وفي قراءة { فديةٌ طعامُ مسكين } أي: وهي طعام مسكين لكل يوم\n وقيل: نصف صاع\n { فمن تطوع } بزيادة المُد، أو أطعم مسكينَينْ عن يوم، { فهو خير له } وأعظم أجراً، { وإن تصوموا } أيها المطيقون للصيام، { خير لكم إن كنتم تعلمون } ما في الصيام من الأسرار، والخير المدرار، ثم نسخ بقوله: { فمن شهد منكم الشهر فليصمه }\n وذلك الصيام الذي أُمرتم به هو { شهر رمضان } المبارك { الذي أنزل فيه القرآن } أي: ابتداء نزوله فيه\n أو إلى سماء الدنيا، حالة كونه { هدى للناس } أي: هادياً لهم إلى طريق الوصول، وآيات واضحات { من الهدى والفرقان } الذي يفرق بين الحق والباطل\n وإن شئتَ قلتَ: فيه هدى للناس إلى مقام الإسلام، { وبينات } ، أي: حججاً واضحة تهدي إلى تحقق الإيمان، وإلى تحقق الفرق بين الحق والباطل، وهو ما سوى الله، فيتحقق مقام الإحسان\n\n\n{ فمن } حضر منكم في { الشهر } ولم يكن مسافراً { فليصمه } وجوباً، وكان في أول الإسلام على سبيل التخيير لأنه شق عليهم حيث لم يألفُوه، فلما ألفوه واستمروا معه، حتّمه عليهم في الحضور والصحة\n { ومَن كان مريضاً } يشق عليه الصيام، { أو على } جَناح { سفر } بحيث شرَع فيه قبل الفجر فأفطر فيه، فعليه { عدة من أيام أُخر }  { يريد الله بكم اليسر } والتخفيف، حيث خفّف عنكم، وأباح الفطر في المرض والسفر، { ولا يريد بكم العسر } إذ لم يجعل عليكم في الدّين من حرج، وإنما أمركم بالقضاء { لتكلموا العدّة } التي أمركم بها، وهي تمام الشهر، { ولتكبروا الله على ما هداكم } ، أمركم بصيامه فتكبروا عند تمامه\n ووقت التكبير عند مالك: من حين يخرج إلى المُصَلَّى، بعد الطلوع، إلى مجيء الإمام إلى الصلاة، ولفظُه المختار: الله أكبر، الله أكبر، لا إله إلا الله، الله أكبر ولله الحمد على ما هدانا، اللهم اجعلنا من الشاكرين لجمعه بين التهليل والتكبير والشكر امتثالاً لقوله: { ولعلكم تشكرون } على ما أوليناكم من سابغ الإنعام، وسهَّلنا عليكم في شأن الصيام\n الإشارة: كُتب عليكم الصيام عن الحظوظ والشهوات، كما كتب على مَن سلك الطريق قبلكم من العارفين الثقات، في أيام المجاهدة والرياضات، حتى تنزلوا بساحة حضرة المشاهدات، لعلكم تتقون شهود الكائنات، ويكشف لكم عن أسرار الذات، فمن كان فيما سلف من أيام عمره مريضاً بحب الهوى، أو على سفر في طلب الدنيا، فليبادِرْ إلى تلافِي ما ضاع في أيام أُخر، وعلى الأقوياء الذين يُطيقون هذا الصيام، إطعام الضعفاء من قُوت اليقين ومعرفة رب العالمين\n فمَنْ تطوع خيراً بإرشاد العباد إلى ما يُقوِّي يقينهم، ويرفع فهو خير له\n وأَنْ تَدُوموا أيها الأقوياء على صومكم عن شهود السَّوَى، وعن مخالطة الحس بعد التمكين، فهو خير لكم وأسلم، إن كنتم تعلمون ما في مخالطة الحس من تفريق القلب وتوهين الهمم، إذ في وقت هذا الصيام يتحقق وحي الفهم والإلهام، وتترادف الأنوار وسواطعُ العرفان\n فمن شهد هذا فَلْيَدُمْ على صيامه، ومن لم يَقْدِر عليه فَلْيَبْكِ على نفسه في تضييع أيامه\n واعلم أن الصيام على ثلاث درجات: صوم العوام، وصوم الخواص، وصوم خواص الخواص\n أما صوم العوام: فهو الإمساك عن شهوتَي البطن والفَرْج، وما يقوم مقامَهما من الفجر إلى الغروب، مع إرسال الجوارح في الزلاَّت، وإهمال القلب في الغفلات\n وصاحبُ هذا الصوم ليس له من صومه إلا الجوع، لقوله صلى الله عليه وسلم:\n\n \" مَنْ لم يَدَعْ قولَ الزُور والعملَ به فليس لله حاجةٌ في أنْ يدع طعامَه وشرابَه \" \n\nوأما صوم الخواص: فهو إمساك الجوارح كلَّها عن الفَضول، وهو كل ما يشغل العبد عن الوصول، وحاصلُه: حفظ الجوارح الظاهرة والباطنة عن الاشتغال بما لا يَعْنِي\n وأما صوم خواص الخواص: فهو حفظ القلب عن الالتفات لغير الرب، وحفظ السر عن الوقوف مع الغير، وحاصله: الإمساك عن شهود السَّوى، وعكوفُ القلب في حضرة المولَى، وصاحب هذا صائم أبداً سرمداً\n فأهل الحضرة على الدوام صائمون، وفي صلاتهم دائمون، نفعنا الله بهم وحشرنا معهم\n آمين\n\n",
      "translations": []
    }
  ]
}