{
  "chapter": "البقرة",
  "text": "واذا سالك عبادى عنى فانى قريب اجيب دعوة الداع اذا دعان فليستجيبوا۟ لى وليؤمنوا۟ بى لعلهم يرشدون",
  "translations": [
    {
      "translation": "When My devotees enquire of you about Me, I am near, and answer the call of every supplicant when he calls. It behoves them to hearken to Me and believe in Me that they may follow the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if My servants ask you, O Prophet. concerning Me, tell them that I am quite near to them. I hear and answer the prayer of the suppliant, when he calls to Me. So let them respond to My call and believe in Me. Convey this to them, O Prophet; perhaps they may be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if any of My servants ask you about Me, tell them that the Lord says, \"I am near; I accept the prayers of those who pray.\" Let My servants answer My call and believe in Me so that perhaps they may know the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him), when My bondmen question you concerning Me, then surely I am close; I answer the prayer of the supplicant when he calls on Me, so they must obey Me and believe in Me, so that they may attain guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants ask you (O Muhammad concerning Me, then answer them), I am indeed near (to them by My knowledge). I respond to the invocations of the supplicant when he calls on Me (without any mediator or intercessor). So let them obey Me and believe in Me, so that they may be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants ask you concerning Me, then surely I am very near; I answer the prayer of the suppliant when he calls on Me, so they should answer My call and believe in Me that they may walk in the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants question thee concerning Me -- I am near to answer the call of the caller, when he calls to Me; so let them respond to Me, and let them believe in Me; haply so they will go aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants question thee concerning Me, then surely I am nigh. I answer the prayer of the suppliant when he crieth unto Me. So let them hear My call and let them trust in Me, in order that they may be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When My servants ask you about Me, say that I am near. I respond to the call of one who calls, whenever he calls to Me: let them, then, respond to Me, and believe in Me, so that they may be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My bondsmen ask thee regarding Me, then verily I am Nigh; I answer the call of the caller when he calleth unto Me,; so let them answer Me and believe in Me, haply they may be rightly directed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When My servants ask you about Me, [tell them that] I am indeed nearmost. I answer the supplicant’s call when he calls Me. So let them respond to Me, and let them have faith in Me, so that they may fare rightly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When My servants ask thee concerning Me, I am indeed close (to them): I listen to the prayer of every suppliant when he calleth on Me: Let them also, with a will, Listen to My call, and believe in Me: That they may walk in the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My slaves ask you (O Muhammad SAW) concerning Me, then (answer them), I am indeed near (to them by My Knowledge). I respond to the invocations of the supplicant when he calls on Me (without any mediator or intercessor). So let them obey Me and believe in Me, so that they may be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When My worshipers ask you about Me, I am near. I answer the supplication of the suppliant when he calls to Me; therefore, let them respond to Me and let them believe in Me, in order that they will be righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants ask you about Me, I Am near; I answer the call of the caller when he calls on Me. So let them answer Me, and have faith in Me, that they may be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when My servants ask you, [O Muhammad], concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:186] A group of followers of the Prophet (s) asked him, ‘Is our Lord nearby so that we should talk to Him secretly, or is He far away, so that we should call out to him?’, and the following was revealed: And when My servants question you concerning Me — I am near, to them in My knowledge, and he informed them of this; I answer the call of the caller, by granting him his request, when he calls to Me; so let them respond to Me, My call to them to be obedient, and let them believe, [let them] persevere in faith, in Me that they might go aright, [that] they [might] become guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when My servants) the people of the Book (question thee concerning Me) whether I am near or far, (then surely I am nigh) then inform them, Muhammad, that I am close when it comes to answering. (I answer the prayer of the supplicant when he crieth unto Me. So let them respond to Me) let them obey My Messenger (and believe in Me) and in My Messenger before asking, (in order that they may be led rightfully) so that they may be guided and have their prayers answered.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَلْيَسْتَجِيبُواْ لِي } معناه فليجيبوني\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لذلك أخبر سبحانه نبيه صلى الله عليه وسلم إرشاداً لعباده الشاكرين لنعمه عن تقربه إليهم بقولهم: { إِذَا سَأَلَكَ } أيها الداعي للخلق إلى لاحق { عِبَادِي } الشاكرين لنعمه { عَنِّي } بقولهم: أقريب إلينا ربنا فنناجيه مناجاتنا نفوسنا، أم بعيد منا فنناديه نداء الأباعد؟ قل لهم يا أكمل الرسل في جوابهم نيابة عني: { فَإِنِّي قَرِيبٌ } لهم من نفوسهم بحيث { أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ } استقبله سريعاً لإجابة دعائه كما أشار إليه في الحديث القدسي حكاية عنه سبحانه { فَلْيَسْتَجِيبُواْ لِي } في جميع مهماتهم وحاجاتهم { وَلْيُؤْمِنُواْ بِي } معتقدين بي إيصالهم إلى غاية متمناهم؛ إذ لا مرجع لهم غيري ولا ملجأ لهم في الوجود سواي، وإنما أُخبروا وأمروا بما أُمروا { لَعَلَّهُمْ يَرْشُدُونَ } [البقرة: 186] رجاء أن يتهدوا إلى مرتبة التوحيد راشدين مطمئنين\n,\n\n\n\nاهدنا بلطفك إلى مقر عزك يا هادي المضلين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: في جواب رجل سأل: هل قريب ربنا فنناجيَه، أو بعيد فنناديه؟ فنزل: { وإذا سألك عبادي عني }\n فقل لهم: { إني قريب } إليهم من أرواحهم لأشباحهم، ومن وَسْواس قلوبهم لقلوبهم، عِلْماً وقدرة وإحاطة، أجيب دعوة الداعي إذا دَعَانِ، سرّاً أو جهراً، ليلاً أو نهاراً، على ما يليق بحاله في الوقت الذي نريد، لا في الوقت الذي يريد، { فليستجيبوا لي } إذا دعوتُهم للإيمان والطاعة، أَسْلُك بهم طريق المعرفة، { وليؤمنوا بي } إني قريب منهم فَيَسْتَحْيُوا مني، حياءَ مَنْ يرى أني معه حيث كان، { لعلهم يرشدون } إلى سلوك طريقتي ودوام محبتي\n قال البيضاوي: اعلم أنه، تعالى، لما أمرهم بصوم الشهر، ومراعاة العدة على القيام بوظائف التكبير والشكر، عقَّبه بهذه الآية الدالّة على أنه خبير بأحوالهم، سميع لأقوالهم مجيب لدعائهم، مجازيهم على أعمالهم، تأكيداً وحثّاً عليه\n هـ\n الإشارة: قُرْب الحقّ تعالى من عباده هو قرب المعاني من المحسوسات، أو قرب الصفات من الذات، أو الذات من الصفات، فإذا تحقق المحو والاضمحلال، وزال البَيْن، وثبت الوصال، لم يبقَ قرب ولا بعد ولا بَينٌ ولا انفصال\n قال الشيخ القطبُ العارف الكبير سيدي عبد السلام بن مَشِيش رضي الله عنه لأبي الحسن رضي الله عنه: حدِّدْ بصرَ الإيمان تَجد الله في كل شيء وعند كل شيء، ومع كل شيء، وقبل كل شيء، وبعد كل شيء، وقريباً من كل شيء، ومحيطاً بكل شيء، بقرب هو وصَفْهُ، وبحيطةً هي نعتُه، وَعَدّ عن الظرفية والحدود، وعن الأماكن والجهات، وعن الصحبة، والقرب في المسافات، وعن الدَّوْر بالمخلوقات، وامْحَق الكلَّ بوصفه الأول والآخر والظاهر والباطن، \" كان الله ولا شيء معه، وهو الآن على ما كان عليه كان \"\n وقال بعض العارفين: الحق تعالى منزَّه عن الأيْنِ والجِهة والكَيْف والمادة والصورة\n ومع ذلك لا يخلو منه أيْنٌ ولا مكان، ولا كم ولا كيف، ولا جسم، ولا جوهر ولا عرض، لأنه لِلُطْفه سَارٍ في كل شيء، ولنُوريته ظاهر في كل شيء، ولإطلاقه وإحاطته متكيّف بكل كيف، غيرُ متقيِّد بذلك، فمَنْ لم يعرف هذا ولم يُذقْه ولم يشهدْه فهو أعمى البصيرة، محرومٌ من مشاهدة الحق تعالى\n هـ\n وهذه الإشارات لا يفهمها إلا أهل الذَّوْق من أهل المعاني، فاصحب الرجال أهلَ المعاني تِذُقْ أسرارهم، وتفهم إشاراتهم\n وإلا فحسبُك أن تعتقد كمال التنزيه، وبطلان التشبيه، وتَمَسَّكْ بقوله تعالى:\n\n[الشّورى: 11]، وسلَّمْ للرجال في كل حال\n\n",
      "translations": []
    }
  ]
}