{
  "chapter": "البقرة",
  "text": "اياما معدودت فمن كان منكم مريضا او على سفر فعدة من ايام اخر وعلى الذين يطيقونه فدية طعام مسكين فمن تطوع خيرا فهو خير له وان تصوموا۟ خير لكم ان كنتم تعلمون",
  "translations": [
    {
      "translation": "Fast a (fixed) number of days, but if someone is ill or is travelling (he should complete) the number of days (he had missed); and those who find it hard to fast should expiate by feeding a poor person. For the good they do with a little hardship is better for men. And if you fast it is good for you, if you knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Fast is to be observed for a fixed number of days. If, however, anyone of you be sick or on a journey, he should fast the same number of other days. As for those who can fast (but do not), the expiation of this shall be the feeding of one needy person for one fast day, and whoso does more than this with a willing heart does it for his own good. But if you understand the thing, it is better for you to observe the Fast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fasting is only for a certain number of days. One who is sick or on a journey has to fast the same number of days at another time. Those who can afford a redemption should feed a poor person. Good deeds performed on one's own initiative will be rewarded. However, fasting is better and will be rewarded. Would that you knew this!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For a certain number of days only; so whoever is sick among you, or on a journey, the same number in other days; and those who do not have the strength for it must give a redemption by feeding a needy person; so whoever increases the good of his own accord, it is better for him; and fasting is better for you, if only you realise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fast for a fixed number of days, but if any of you is ill or on a journey, the same number (should be made up) from other days. And as for those who can fast with difficulty, (e.g., an old man), they have (a choice either to fast or) to feed a Miskin (poor person) (for every day). But whoever does good of his own accord, it is better for him. And that you fast is better for you if only you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For a certain number of days; but whoever among you is sick or on a journey, then (he shall fast) a (like) number of other days; and those who are not able to do it may effect a redemption by feeding a poor man; so whoever does good spontaneously it is better for him; and that you fast is better for you if you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for days numbered; and if any of you be sick, or if he be on a journey, then a number of other days; and for those who are able to fast, a redemption by feeding a poor man. Yet better it is for him who volunteers good, and that you should fast is better for you, if you but know;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Fast) a certain number of days; and (for) him who is sick among you, or on a journey, (the same) number of other days; and for those who can afford it there is a ransom: the feeding of a man in need - but whoso doeth good of his own accord, it is better for him: and that ye fast is better for you if ye did but know -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fast for a specified number of days, but if any one among you is ill or on a journey, let him fast the same number of days later. For those who can fast only with extreme difficulty, there is a way to compensate -- the feeding of a needy person. But he who does good of his own accord shall be well rewarded; but to fast is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Days numbered and few; then whosoever among you is sick or journeying, for him the like number of other days. And for those who can keep it with hardship the ransom is the feeding of a and whosoever voluntarily poor man doth good, it will be better for him; and that ye fast Will be better for you, if ye only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That for known days. But should any of you be sick or on a journey, let it be a [similar] number of other days. Those who find it straining shall be liable to atonement by feeding a needy person. Should anyone do good of his own accord, that is better for him, and to fast is better for you, should you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Fasting) for a fixed number of days; but if any of you is ill, or on a journey, the prescribed number (Should be made up) from days later. For those who can do it (With hardship), is a ransom, the feeding of one that is indigent. But he that will give more, of his own free will,- it is better for him. And it is better for you that ye fast, if ye only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Observing Saum (fasts)] for a fixed number of days, but if any of you is ill or on a journey, the same number (should be made up) from other days. And as for those who can fast with difficulty, (e.g. an old man, etc.), they have (a choice either to fast or) to feed a Miskin (poor person) (for every day). But whoever does good of his own accord, it is better for him. And that you fast, it is better for you if only you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Fast) a certain number of days, but if any one of you is ill or on a journey let him (fast) a similar number of days later on; and for those who are unable (tofast), there is a ransom the feeding of a needy person. Whosoever volunteers good, it is good for him; but to fast is better for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For a specified number of days. But whoever among you is sick, or on a journey, then a number of other days. For those who are able: a ransom of feeding a needy person. But whoever volunteers goodness, it is better for him. But to fast is best for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Fasting for] a limited number of days. So whoever among you is ill or on a journey [during them] - then an equal number of days [are to be made up]. And upon those who are able [to fast, but with hardship] - a ransom [as substitute] of feeding a poor person [each day]. And whoever volunteers excess - it is better for him. But to fast is best for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:184] For days (ayyāman, ‘days’, is in the accusative as the object of al-siyām, ‘the fast’, or of an implied yasūmū, ‘he fasts’) numbered, few or specific in number, that is, those of Ramadān, as will be mentioned below; God has specified a small number as a way of facilitating matters for those under the obligation; and if any of you, during the month, be sick, or be on a journey, in which prayers are shortened, or if one is strained by the fast in both cases and breaks it, then a number of other days, equal to the ones during which he broke his fast — let him fast them instead; and for those who are, not, able to do it, [to fast] on account of old age or chronic illness, a redemption: which is, the feeding of a poor man, with about the same amount one consumes in a given day, that is, one mudd measure of the principal food of that town each day (a variant reading has [genitive] fidyatin as an explicative clause. It is also said that the [lā] negation of the verb [yutīqūnahu] is not actually implied, because at the very beginning of Islam, they could choose between fasting or offering the redemption; but later on this was abrogated by fixing the Fast [as an obligation], where God says, So let those of you, who are present at the month, fast it [Q. 2:185]: Ibn ‘Abbās said [by way of qualification] ‘Except for the pregnant one and the one breastfeeding, if they break their fast out of   concern for the child; in the case of these two, the verse remains valid and has not been abrogated’). For him who volunteers good, by offering more than the minimum amount mentioned for the redemption; that, volunteering, is good for him; but that you should fast (wa-an tasūmū is the subject) is better for you (khayrun lakum is its predicate), than breaking the fast and paying the redemption, if you but knew, that this is better for you, then do it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Fast) a certain number of days) 30 days; (and (for) him who is sick among you, or on a journey, (the same) number of other days) let him fast the same number of days he missed; (and for those who can afford it) afford to fast (there is a ransom: the feeding of a man in need-) let him feed a person in need, instead of every day of the fast that he missed, half a measure of wheat. But this is abrogated by Allah's saying: (And whoever of you is present, let him fast the month). It is also said that this means: those who can afford a ransom and are not able to fast, old men and women who are unable to fast, they should feed a needy person, for every missed day of fast in Ramadan, half a measure of wheat. (But whoso doeth good of his own accord) gives more than two pounds, (it is better for him) in terms of reward: (and that ye fast is better for you) than giving ransom (if ye did but know-)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذ فرض عليكم صوموا { أَيَّاماً } قلائل { مَّعْدُودَاتٍ } هي شهر رمضان { فَمَن كَانَ مِنكُم } حين ورود شهر رمضان الذي فرض فيه الصيام { مَّرِيضاً } مرضاً يضره الصوم أو يعسر عليه { أَوْ } حين وروده { عَلَىٰ } جناح { سَفَرٍ } مقدار مسافة مقدرة عند الفقهاء فأنظر { فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ } مساوية للأيام المفطرة، يجب على المفطر بلا كفارة { وَعَلَى ٱلَّذِينَ يُطِيقُونَهُ } أي: الصوم، فيفطرونه مع أنهم ليسوا مرضى ولا مسافرين { فِدْيَةٌ } هي { طَعَامُ مِسْكِينٍ } أي: فدية كل يومٍ من الأيام المفطرة من رضمان طعامُ واحدٍ من المساكين { فَمَن تَطَوَّعَ } زاد في الفدية { خَيْراً } تبرعاً زائداً مما كتب له { فَهُوَ } أي: ما زاد عليها { خَيْرٌ لَّهُ } عند ربه يجزيه عليه زيادة جزاءٍ { وَأَن تَصُومُواْ } أيها المؤمنون { خَيْرٌ لَّكُمْ } من الفدية، وزيادة عليها متبرعاً { إِن كُنْتُمْ تَعْلَمُونَ } [البقرة: 184] سرائر الإمساك والفوائد والعائدة منها إلى نفوسكم، من كسر الشهوة والتلقي على الطاعة والتوجه مع الفراعنة، هذا في بدء الإسلام، ثم نسخ بالآية ستذكر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أياماً } منصوب على الظرفية، واختُلِف في العامل فيه، والأحسنُ أنه الصيام، ولا يضره الفصل لأن الظرف يُتوسع فيه ما لا يتوسع في غيره، و { معدودات } نعت له، و { عدة } مبتدأ أي: فَعَليْهِ عِدَّةٌ\n و { أُخر } ممنوع من الصرف للعدل عن الألف واللام والوصف",
      "translations": []
    }
  ]
}