{
  "chapter": "البقرة",
  "text": "فمنۢ بدله بعدما سمعه فانما اثمه على الذين يبدلونه ان الله سميع عليم",
  "translations": [
    {
      "translation": "And any one who changes the will, having heard it, shall be guilty and accountable; for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if those, who heard the will, change it, they themselves shall bear the sin of this. Allah hears everything and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever intentionally changes the will of a deceased person, he has committed a sin. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So whoever changes the will after he has heard it – its sin is only upon those who change it; indeed Allah is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever changes it after hearing it, the sin shall be on those who make the change. Truly, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever then alters it after he has heard it, the sin of it then is only upon those who alter it; surely Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if any man changes it after hearing it, the sin shall rest upon those who change it; surely God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso changeth (the will) after he hath heard it - the sin thereof is only upon those who change it. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone who alters it once he has heard it shall be accountable for his crime. Surely, God is all hearing and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whosoever altereth it after he hath heard it, the sin thereof shall be only on those who shall alter it: verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should anyone alter it after hearing it, its sin shall indeed lie on those who alter it. Indeed Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone changes the bequest after hearing it, the guilt shall be on those who make the change. For Allah hears and knows (All things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever changes the bequest after hearing it, the sin shall be on those who make the change. Truly, Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, if anyone changes it after hearing it, the sin shall rest upon those who change it. Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever changes it after he has heard it, the guilt is upon those who change it. God is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whoever alters the bequest after he has heard it - the sin is only upon those who have altered it. Indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:181] Then if anyone, whether a witness or a trustee, changes it, that is, the testament, after hearing it, and knowing it, the sin, resulting from the changed testament, shall rest upon those who change it (here the explicit subject stands in place of the implicit one); surely God is Hearing, of the testator’s words, Knowing, of the deeds of the trustee, requiting [each] accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso changeth) the will of the deceased person (after he hath heard it-the sin thereof) the onus thereof (is only upon those who change it) and the deceased bears no responsibility. (For Allah is Hearer) of the will and words of the deceased, (Knower) if he transgresses or changes it; it is also said that this means: He knows the deed of the testator. Thus, out of fear of sin, people used to execute the will of a deceased person as it was even when the latter transgressed in that will,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَمَن بَدَّلَهُ } غيره من الأوصياء والحضار الشاهدين عليها { بَعْدَ مَا سَمِعَهُ } من الموضي صريحاً { فَإِنَّمَا إِثْمُهُ } أي: إثم التبديل والتغيير { عَلَى } المبدلين المغيرين { ٱلَّذِينَ يُبَدِّلُونَهُ } ظلماً وزوراً { إِنَّ ٱللَّهَ سَمِيعٌ } بأقولهم الموصي { عَلِيمٌ } [البقرة: 181] بما صدر من المبدلين المغيرين، فيجازي كلاً منهم على مقتضى علمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}