{
  "chapter": "البقرة",
  "text": "ولا تاكلوا۟ امولكم بينكم بالبطل وتدلوا۟ بها الى الحكام لتاكلوا۟ فريقا من امول الناس بالاثم وانتم تعلمون",
  "translations": [
    {
      "translation": "And do not consume each other's wealth in vain, nor offer it to men in authority with intent of usurping unlawfully and knowingly a part of the wealth of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not usurp one another's property by unjust means nor offer it to the judges so that you may devour knowingly and unjustly a portion of the goods of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not use your property among yourselves in illegal ways and then deliberately bribe the rulers with your property so that you may wrongly acquire the property of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not unjustly devour the property of each other, nor take their cases to judges in order that you may wrongfully devour a portion of other peoples’ property on purpose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat up not one another's property unjustly (in any illegal way, e.g., stealing, robbing, deceiving), nor give bribery to the rulers (judges before presenting your cases) that you may knowingly eat up a part of the property of others sinfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not swallow up your property among yourselves by false means, neither seek to gain access thereby to the judges, so that you may swallow up a part of the property of men wrongfully while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consume not your goods between you in vanity; neither proffer it to the judges, that you may sinfully consume a portion of other men's goods, and that wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat not up your property among yourselves in vanity, nor seek by it to gain the hearing of the judges that ye may knowingly devour a portion of the property of others wrongfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consume one another's property by unjust means, nor offer it as a bribe to the authorities, so that you may deliberately and wrongfully devour a part of other people's wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And devour not your riches among yourselves in vanity, nor convey them unto the judges that ye may devour thereby a portion of other people's riches sinfully while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat up your wealth among yourselves wrongfully, nor proffer it to the judges in order to eat up a part of the people’s wealth sinfully, while you know [that it is immoral to do so].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not eat up your property among yourselves for vanities, nor use it as bait for the judges, with intent that ye may eat up wrongfully and knowingly a little of (other) people's property.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat up not one another's property unjustly (in any illegal way e.g. stealing, robbing, deceiving, etc.), nor give bribery to the rulers (judges before presenting your cases) that you may knowingly eat up a part of the property of others sinfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not consume your wealth between you in falsehood; neither propose it to judges, in order that you sinfully consume a portion of the people's wealth, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not consume one another’s wealth by unjust means, nor offer it as bribes to the officials in order to consume part of other people’s wealth illicitly, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not consume one another's wealth unjustly or send it [in bribery] to the rulers in order that [they might aid] you [to] consume a portion of the wealth of the people in sin, while you know [it is unlawful].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:188]   Consume not your goods between you, that is to say, do not let one consume the goods of the other, in deception, that which is illicit according to the Law, such as theft and extortion; and, do not, proffer them, the regulation of these [goods] or any bribes, to the judges, that you may consume, as a result of any arbitration, a portion of other people’s goods, embroiled, in sin while you are aware, that you are in error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following was revealed about 'Abdan Ibn Ashwa' [al-Hadrami] and Imra' al-Qays [Ibn 'Abis]: (And eat not up your property among yourselves in vanity) through oppression, theft, usurpation, perjury, and other forbidden means, (nor seek by it to gain the hearing of the judges that you may knowingly devour a portion of the property of others wrongfully) through perjury; Imra' al-Qays admitted taking the money when this verse was revealed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لِتَأْكُلُواْ فَرِيقاً مِّنْ أَمْوَالِ ٱلنَّاسِ } معناهُ طَائفةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأحكام الموضوعة فيكم لإصلاح حالكم أن { لاَ تَأْكُلُوۤاْ أَمْوَالَكُمْ بَيْنَكُمْ } أي: لا يأكل كل منكم مال الآخر { بِٱلْبَاطِلِ } أي: بالسبب الباطل الغير المبيح له أكل مال الغير، من السرقة والغصب والربا والرشوة، والحيل المنسوبة إلى الشرع افتراء، وغير ذلك مما ابتدعه الفقهاء في الوقائع من الحيل والشبه، ونسبوها إلى السمحة الحنيفية البيضاء المحمدية، المنبئة عن الحكمة الإلهية، المنزهة عن أمثال تلك المزخرفات الباطلة { وَ } أيضاً من جملة الأحكام الموضوعة ألاَّ { تُدْلُواْ بِهَا } أي: لا يحاول بعضكم مال بعض { إِلَى ٱلْحُكَّامِ } المسلطين عليكم؛ أي: لا يفتري بعضكم بعضاً افتراءً يوقع بينكم العداوة والحكومة والبغضاء المفضية إلى المصادرة المستلزمة لأخذ المال من الجانبين، ومن أحد الجانبين { لِتَأْكُلُواْ } أي: الحكام { فَرِيقاً } بعضاً أو كلاً { مِّنْ أَمْوَالِ ٱلنَّاسِ } المظلومين { بِٱلإِثْمِ } الصادر عن المدلي والمغري { وَأَنْتُمْ } أيها المدلون { تَعْلَمُونَ } البقرة: 188] أنكم آثمون مفترون\n\n\n\n\nبك نعتصم عن أمثاله يا ذا القوة المتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أصل الإدلاء: إرسالُ الدَّلْو في الماء ليتوصل به إلى أخذ الماء من البئر، ثم أُطلق في كل ما يتوسل به إلى شيء، يقال: أدلَى بمالِه إلى الحكام، أي: دفعه رِشْوة، ليتوصل بذلك إلى أخذ أكثر منه، وهو المراد هنا، وفي القاموس: أدلى برَحمِه: توسَّل، وبحُجَّتِه: أحضرَها، وإليه بمالهِ: دفَعه\n ومنه: { وتُدْلوا بها إلى الحكام }\n هـ\n و { تدلوا } معطوف على { تأكلوا } ، مَنْهِي عنهما معاً\n يقوله الحقّ جلّ جلاله: { ولا تأكلوا } يا معشر المسلمين { أموالكم } أي: أموال بعضكم بعضاً، { بالباطل } أي: بغير حقّ شرعي إما بغير حق أصلاً كالغضْب والسرقة والخيانة والخَدْع والتطفيف والغش وغير ذلك\n أو بحق باطل كما يؤخذ في السحر والكهانة والفأل والقِمار والجاه، وهَدِية المِدْيان، وهدية القرض، والضمان، والرشوة، والربا، وغير ذلك مما نهى الشارعُ عنه\n ولا يدخل في ذلك التمائم والعزائم إذا كان بالقرآن أو السنّة وغلَب الشفاء، وكذلك لا يدخل أيضاً الغَبْن، إذا كان البائعُ عالماً بالمَبِيع\n أو { ولا تأكلوا أموالكم بينكم بالباطل } بأن تُنفقوها في المَلاهي والزنا والشرب واللواط، وغير ذلك من المحرمات، ولا { تدلوا } أي: تتوسلوا بها، أي: بدفعها { إلى الحكام } رشوة { لتأكلوا فريقاً من أموال الناس } بأن يحكم لكم بها القاضي، تأخذونها متلبسين { بالإثم } أي: بالمعصية { وأنتم تعلمون } أنها لغيركم فإنَّ حُكْمَ الحاكِم لا يُحِلُّ حراماً\n وفي الحديث عنه صلى الله عليه وسلم قال:\n\n \" إنَّما أنا بَشرٌ مثلُكُم، ولعلَّ بعضَكُمْ أن يكون الْحَنَ بحُجَّتِهِ مِنْ بَعضٍ فأقضي لهُ، فمن قَضَيتُ له بشيء من مال أخِيهِ فإنَّما لهُ قِطعةٌ من النارِ \"\n \n",
      "translations": []
    }
  ]
}