{
  "chapter": "البقرة",
  "text": "الحج اشهر معلومت فمن فرض فيهن الحج فلا رفث ولا فسوق ولا جدال فى الحج وما تفعلوا۟ من خير يعلمه الله وتزودوا۟ فان خير الزاد التقوى واتقون ياو۟لى الالبب",
  "translations": [
    {
      "translation": "Known are the months of pilgrimage. If one resolves to perform the pilgrimage in these months, let him not indulge in concupiscence, sin or quarrel. And the good you do shall be known to God. Provide for the journey, and the best of provisions is piety. O men of understanding, obey Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The months for Hajj are well known to all; whoever makes up his mind to perform Hajj during these fixed months, let him totally abstain from all sorts of sexual indulgence, wickedness and wrangling during the Hajj and remember that Allah knows whatever good you do. Take necessary provisions for Hajj, and piety is the best of all provisions: so refrain from disobeying Me, O men of understanding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The months of the hajj (pilgrimage) season are well known. Whoever undertakes to complete the hajj rituals, must know that, after commencing the acts of Hajj, he is not allowed to have carnal relations or to lie or to swear by the Name of God. God knows all your good deeds. Supply yourselves for the journey. The best supply is piety. People of understanding have fear of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hajj is during the well-known months; and for one who intends to perform the Hajj in it – neither is there to be mention of cohabitation in the presence of women, nor any sin, nor a fight with anyone till the completion of Hajj; and whatever good you do, Allah knows it; and take provision along with you for the best provision is piety; and keep fearing Me, O men of understanding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hajj (pilgrimage) is (in) the well-known months. So whosoever intends to perform Hajj therein (by assuming Ihram), then he should not have sexual relations (with his wife), nor commit sin, nor dispute unjustly during the Hajj. And whatever good you do, Allah knows it. And take provisions for the journey, but the best provision is At-Taqwa (piety, righteousness). So fear Me, O men of understanding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pilgrimage is (performed in) the well-known months; so whoever determines the performance of the pilgrimage therein, there shall be no intercourse nor fornication nor quarrelling amongst one another; and whatever good you do, Allah knows it; and make provision, for surely the provision is the guarding of oneself, and be careful (of your duty) to Me, O men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Pilgrimage is in months well-known; whoso undertakes the duty of Pilgrimage in them shall not go in to his womenfolk nor indulge in ungodliness and disputing in the Pilgrimage. Whatever good you do, God knows it. And take provision; but the best provision is godfearing, so fear you Me, men possessed of minds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pilgrimage is (in) the well-known months, and whoever is minded to perform the pilgrimage therein (let him remember that) there is (to be) no lewdness nor abuse nor angry conversation on the pilgrimage. And whatsoever good ye do Allah knoweth it. So make provision for yourselves (Hereafter); for the best provision is to ward off evil. Therefore keep your duty unto Me, O men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pilgrimage is in the appointed months. Whoever intends to perform it during them must abstain from indecent speech, from all wicked conduct, and from quarrelling while on the pilgrimage. Whatever good you may do, God is aware of it. Make provision for yourselves -- but surely, the best of all provision is God-consciousness. Always be mindful of Me, you that are endowed with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The season of Pilgrimage is the months known; wherefore whosoever ordaineth unto himself the pilgrimage therein, there is no lewdness nor wickedness nor wrangling during the pilgrimage, and whatsoever of good ye do, Allah shall know it. And take provision for the journey, for verily the best provision is abstainment; and fear Me, O men of understanding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hajj [season] is in months well-known; so whoever decides on hajj [pilgrimage] therein, [should know that] there is to be no sexual contact, vicious talk, or disputing during the hajj. And whatever good you do, Allah knows it. And take provision, for indeed the best provision is Godwariness. So be wary of Me, O you who possess intellects!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Hajj are the months well known. If any one undertakes that duty therein, Let there be no obscenity, nor wickedness, nor wrangling in the Hajj. And whatever good ye do, (be sure) Allah knoweth it. And take a provision (With you) for the journey, but the best of provisions is right conduct. So fear Me, o ye that are wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hajj (pilgrimage) is (in) the well-known (lunar year) months (i.e. the 10th month, the 11th month and the first ten days of the 12th month of the Islamic calendar, i.e. two months and ten days). So whosoever intends to perform Hajj therein by assuming Ihram), then he should not have sexual relations (with his wife), nor commit sin, nor dispute unjustly during the Hajj. And whatever good you do, (be sure) Allah knows it. And take a provision (with you) for the journey, but the best provision is At-Taqwa (piety, righteousness, etc.). So fear Me, O men of understanding!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pilgrimage is in the appointed months. (For) whosoever undertakes the pilgrimage there is no approaching (women), neither transgression nor disputing in the pilgrimage. Allah is Aware of whatever good you do. Provide well for yourselves, the best provision is piety. Fear Me, O owners of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hajj is during specific months. Whoever decides to perform the Hajj—there shall be no sexual relations, nor misconduct, nor quarrelling during the Hajj. And whatever good you do, God knows it. And take provisions, but the best provision is righteousness. And be mindful of Me, O people of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hajj is [during] well-known months, so whoever has made Hajj obligatory upon himself therein [by entering the state of ihram], there is [to be for him] no sexual relations and no disobedience and no disputing during Hajj. And whatever good you do - Allah knows it. And take provisions, but indeed, the best provision is fear of Allah. And fear Me, O you of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:197]   The Pilgrimage, the time for it, is in months well-known: Shawwāl, Dhū’l-Qa’da and ten nights, some say all, of Dhū’l Hijja; whoever undertakes, upon himself, the duty of Pilgrimage during them, by entering into the state of pilgrimage inviolability, then no lewdness, [no] sexual intercourse for them, nor wickedness, [nor] acts of disobedience, or disputing, [or] quarrelling, in the Pilgrimage (a variant reading [for fa-lā rafathun wa-lā fusūqun wa-lā jidāla] has the accusative for all three nouns [sc. fa-lā rafatha wa-lā fusūqa wa-lā jidāla]; prohibition is meant in all three cases). Whatever good you do, by way of voluntary almsgiving, God knows it, and will reward you for it. And take provision, to suffice you your journey: this was revealed regarding the people of Yemen, who use to make the Pilgrimage and not take any provisions with them, thus, becoming a burden for others. But the best provision is piety [taqwā, ‘piety’, literally ‘guarding’] with which you are able to guard against asking others [for things]; and fear you Me, O people of pith!, [O] possessors of intellect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The pilgrimage is (in) the well known months) ritual consecration for the pilgrimage takes place in the well known months of Shawwal, Dhu'l-Qa'da, and the first ten days of Dhu'l-Hijja, (and whoever is minded to 33 perform the pilgrimage therein) whoever enters in a state of ritual consecration in these months (there is (to be) no lewdness) no sexual intercourse once in a state of ritual consecration (nor abuse) no verbal abuse or name calling (nor angry conversation) between one person and another (on the pilgrimage) when in a state of ritual consecration; it is also said that this means: there is to be no heated argument about the obligatoriness of the pilgrimage. (And whatsoever good ye do) whatever you abstain from whether it is lewdness, abuse or angry conversation in the Sacred Precinct (Allah knoweth it) Allah will accept it. (So make provision for yourselves) people of sound minds, from the provision of this world; Allah says here: take from the provisions of this world, people of sound minds, what is enough to spare you from asking others, otherwise just trust in Allah; (for the best provision to ward off evil) for trust in Allah is the best provision in this world. (Therefore keep your duty unto Me) fear Me in the Sacred Precinct, (0 men of understanding). This verse was revealed about some people from the Yemen who used to perform the pilgrimage without taking any provisions with them. As a consequence, they used to wrongfully obtain provisions from the settlements they found on their way and hence Allah now prohibited them from doing so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحج أشهر معلوماتٌ } أي: وقت الحج أزمنة معلومة، وهو من وقت بلوغ الحلم إلى الأربعين، كما قال تعالى في وصف البقرة:\n\n[البقرة، الآية: 68]، { فمن فرض فيهنّ الحج } على نفسه بالعزيمة والتزم { فلا رَفْث } أي: فاحشة ظهور القوة الشهوانية { ولا فُسُوق } أي لأسباب يعني خروج القوّة الغضبية عن طاعة القلب { ولا جدال } أي: تعدّي القوة النطقية بالشيطنة { في الحجّ } أي: في قصد بيت القلب { وما تفعلوا من خير } من فضيلة من أفعال هذه القوى الثلاث بأمر الشرع والعقل دون رذائلها { يعلمه الله } ويثبكم عليه { وتزودوا } من فضائلها التي يلزمها الاجتناب عن رذائلها { فإنّ خيرَ الزادِ التقوى } منها { واتقونِ } في أعمالكم ونياتكم { يا أُولي الألبَاب } فإن قضية اللبّ أي: العقل الخالص من شوب الوهم وقشر المادة اتقائي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لم أمر سبحانه عباده بالحج، بأن يأتوا إلى بيته من كل بلد بعيد وفج عميق، عين له وقتاً معنياً من الأوقات التي لها فضيلة ومنزلة عنده سبحانه، فقال: { ٱلْحَجُّ } أي: أوقات الحج { أَشْهُرٌ مَّعْلُومَاتٌ } متبركات معروفات، وهي: شوال وذو القعدة وذو الحجة بتمامها أو بعضها على ما خولف فيه { فَمَن فَرَضَ } على نفسه { فِيهِنَّ ٱلْحَجَّ } بأن ارتكب بشرائطه وأركانه عادياً له في خلال هذه الأشهر، لزمه إتمامه بلا فسخ العزيمة وقلب النية وحل المحرمات فيه { فَلاَ رَفَثَ } أي: لا جماع ولا وقاع وإن طالت المدة { وَلاَ فُسُوقَ } ولا خروج عن حدود الله بارتكاب المحظورات { وَلاَ جِدَالَ } ولا مجادلة ولا مراءاة مع الخدام والرفقاء { فِي } أيام { ٱلْحَجِّ } إذ الحج كناية عن الموت الإداري المنبئ عن الحياة الحقيقة، وهذه الأمور من أوصاف الأحياء بالحياة الطبيعية، فمن قصد الحج الحقيقي والحياة الحقيقية، فله أن يميت نفسه من لوازم الحياة الطبيعية المستعارة، الغير القارة؛ ليفوز بالحياة الحقيقية الازلية والبقاء الأبدي السرمدي، وذلك لا يتيسر إلا بالخروج عن مقتضيات عقل الجزئي المشوب بالوهم والخيال، بل هو مقلوب منها محكوم لها دائماً\n\n\n\n\nولا يحصل ذلك إلا للسالك الناسك الذي جذبه الحق عن نفسه متدرجاً مرتقياً من عالمٍ إلى عالمٍ من العوالم المنتخبة عنها ذاته إلى أن وصل إلى مقامٍ ومرتبةٍ طويت المراتب كلها عنده، وفنيت العوالم بأسرها فيها، وفني فيها أيضاً، وهي فناؤها أيضاً فيها، ولم ينزل فيها هابطاً أصلاً، بل تقرر وتمكن واطمأن فيها كما نشاهد مثلها متحسرين، متمنين لها من بعض بدلاء الزمان، مد الله ظلاله العالي على مفارق أهل اليقين والعرفان، وإبهام اسمه لإبهام شأنه، هيهات هيهات ما لنا وما لحتى حتى نتكم عنه\n\n\n\n\nجعلنا الله من خُدَّام تُراب أقدامه\n\n\n\n\nوبعدما أمر سبحانه عباده بحج بيته تعظيماً له ولبيته، حثهم على الخيرات، وبذل المال فها وفي طريقها؛ لتقرر في نفوسهم هذه الخصلة الحميدة؛ إذ هو المناع من ميل القلوب إلى المحبوب الحقيقي وهو رأس كل فتنة فقال: { وَمَا تَفْعَلُواْ } لرضاء الله { مِنْ خَيْرٍ } خالصٍ عن ثوب المنة والأذى، عارٍ عن العجب والرياء، سالمٍ عن وسوسة شياطين الأهواء { يَعْلَمْهُ ٱللَّهُ } بالحضور،؛ إذ أمثال هذه الخيرات جارٍ على الصراط المستقيم الذي هو صراط الله الأعظم الأقوم { وَتَزَوَّدُواْ } للعبور على صراط الله بالتقوى عن الدنيا وما فيها { فَإِنَّ خَيْرَ ٱلزَّادِ } للعباد ليوم المعاد هو { ٱلتَّقْوَىٰ } عن جميع الفساد { وَٱتَّقُونِ يٰأُوْلِي ٱلأَلْبَابِ } [البقرة: 197] المتوجهين إلى لب اللباب، والمتمايلين عن القشور العائقة عن الحضور، أدركنا بلفطك يا خفي الألطاف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الحج }: مبتدأ، على حذف مضاف، أي: إحرامُ الحج أو فعلُ الحج، و { أشهر }: خبر، وإذا وقع الزمان خبراً عن اسم معنى فإن كان ذلك المعنى واقعاً في كل ذلك الزمان أو جُلِّه تعيَّن رفعُه عند الكوفيين، وترجح عند البصريين إذا كان الزمان نكرة، نحو: السفر يوم\n إن كان السفر واقعاً في جميع ذلك اليوم أو في جُلِّه لأنه باستغراقه إياه صار كأنه هو، ويصح: السفر يوماً، أو في يوم\n وإن كان ذلك المعنى واقعاً في بعض ذلك الزمان تعيَّن نصبُه أو جرَّه فـ في، نحو: السفر يوم الجمعة، أو في يوم الجمعة وقد يرفع نادراً\n قال في التسهيل: ويُغني - أيْ: ظرف الزمان - عن خبر اسم معنى مطلقاً، فإن وقع في جميعه، أو في أكثره، وكان نكرة، رُفع غالباً، ولا يمتنع نصبه ولا جره بفي خلافاً للكوفيين\n وربما رُفع خبرُ الزمان المُوقَع في بعضه\n هـ\n ومن ذلك: { الحج أشهر معلومات } فإن جُلّضها تصلح للإحرام\n يقول الحقّ جلّ جلاله: وقتُ إحرام الحج { أشهر معلومات }: شوال وذو القعدة وذو الحجة، فمن أحرم قبلها كره عند مالك، وبطل عند الشافعي، { فمن فرض } على نفسه { فيهن الحج } فيلزم الأدب والوقار، ويجانبْ شهوة النساء، { فلا } يقع منه { رفث } أي: جماع أو كلام فُحْش، { ولا فسوق } أي: ذنوب، { ولا جدال في } زمان { الحج } ولو مع المكاري أو الخُدّام، ولا غيره من أنواع الخصام فإنه في حضرة الملك العلام\n { وما تفعلوا من خير } كحِلْم وصبر وحُسن خلق { يعلمه الله } فاستبقوا الخيرات، وتزودوا قبل هجوم الممات، واتقوا الله حق تقاته { فإن خير الزاد التقوى }\n أو تزودوا لسفر الحج، ولا تسافروا كَلاً على الناس { فإن خير الزاد التقوى } عن الطمع في الخلق، { واتقون يا أولي الألباب } ، وأفرِدُوني في سركم حتى أفتح لكم الباب، وأدخلَكم مع الأحباب\n الإشارة: معاملة الأبدان مؤقتة بالأمكان والأزمان، ومعاملة القلوب أو الأرواح غير مؤقتة بزمان مخصوص، ولا مكان مخصوص، فحجَ القلوب، الأزمنةُ كلها له ميقات، والأماكن كلها عرفات، حج القلوب هو العلوب هو العكوف في حضرة علام الغيوب، وهي مُسَرْمَدَةٌ على الداوم على مَرِّ الليالي والأيام، فكل وقت عندهم ليلة القدر، وكل مكان عندهم عرفةُ المشرَّفةُ القدر، وأنشدوا:\n\nوقال آخر:\n\nفمَنْ فَرض على قلبه حجَّ الحضرة فيلتزم الأدب والنظرة، والسكوتَ والفكرة، قال تعالى:\n",
      "translations": []
    }
  ]
}