{
  "chapter": "البقرة",
  "text": "الشهر الحرام بالشهر الحرام والحرمت قصاص فمن اعتدى عليكم فاعتدوا۟ عليه بمثل ما اعتدى عليكم واتقوا۟ الله واعلموا۟ ان الله مع المتقين",
  "translations": [
    {
      "translation": "(Fighting during) the holy month (if the sanctity) of the holy month (is violated) is (just) retribution. So if you are oppressed, oppress those who oppress you to the same degree, and fear God, and know that God is with those who are pious and follow the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A prohibited month is to be respected, if the same is respected (by the enemy), and likewise there is the law of just retribution for the violation of all prohibited things. Therefore, if anyone transgresses a prohibition by attacking you, you may do likewise, but always fear AIIah and bear in mind that Allah is with those who desist from breaking Allah's bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is because of their disrespect of a sacred month that you are also allowed to retaliate against them in a sacred month. If any one transgresses against you, you also may retaliate against them to an equal extent. Have fear of God and know that He supports the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacred month for the sacred month, and respect in lieu of respect; harm the one who harms you, to the extent as he did – and keep fearing Allah, and know well that Allah is with the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacred month is for the sacred month, and for the prohibited things, there is the Law of equality (Qisas). Then whoever transgresses against you, you transgress likewise against him. And fear Allah, and know that Allah is with Al-Muttaqin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sacred month for the sacred month and all sacred things are (under the law of) retaliation; whoever then acts aggressively against you, inflict injury on him according to the injury he has inflicted on you and be careful (of your duty) to Allah and know that Allah is with those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The holy month for the holy month; holy things demand retaliation. Whoso commits aggression against you, do you commit aggression against him like as he has committed against you, and fear you God, and know that God is with the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The forbidden month for the forbidden month, and forbidden things in retaliation. And one who attacketh you, attack him in like manner as he attacked you. Observe your duty to Allah, and know that Allah is with those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sacred month for a sacred month: violation of sanctity calls for fair retribution. Thus you may exact retribution from whoever transgresses against you, in proportion to his transgression. Fear God and know that God is with those who are mindful of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sacred month is for a sacred month; these sacrednesses are in retaliation. Whosoever then offereth violence unto you, Offer violence unto him the like of his violence unto you, and fear Allah, and know that Allah is with the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sacred month for a sacred month, and all sanctities require retribution. So should anyone aggress against you, assail him in the manner he assailed you, and be wary of Allah, and know that Allah is with the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The prohibited month for the prohibited month,- and so for all things prohibited,- there is the law of equality. If then any one transgresses the prohibition against you, Transgress ye likewise against him. But fear Allah, and know that Allah is with those who restrain themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacred month is for the sacred month, and for the prohibited things, there is the Law of Equality (Qisas). Then whoever transgresses the prohibition against you, you transgress likewise against him. And fear Allah, and know that Allah is with Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacred month for the sacred month, prohibitions are (subject to) retaliation. If any one aggresses against you, so aggress against him with the likeness of that which he has aggressed against you. Fear Allah, and know that Allah is with the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sacred month for the sacred month; and sacrilege calls for retaliation. Whoever commits aggression against you, retaliate against him in the same measure as he has committed against you. And be conscious of God, and know that God is with the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Fighting in] the sacred month is for [aggression committed in] the sacred month, and for [all] violations is legal retribution. So whoever has assaulted you, then assault him in the same way that he has assaulted you. And fear Allah and know that Allah is with those who fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:194] The sacred month, in return, for the sacred month, therefore, just as they fight you during it, kill them   during it: a response to the Muslims’ consideration of the momentous nature of this matter; holy things (hurumāt, plural of hurma, is what must be treated as sacrosanct) demand retaliation, in kind if these [holy things] are violated; whoever commits aggression against you, through fighting in the Sacred Enclosure, or during a state of ritual purity or in the sacred months, then commit aggression against him in the manner that he committed against you, the [Muslim] response is also referred to as ‘aggression’, because that is what it resembles formally; and fear God, when avenging yourselves and [by] renouncing aggression, and know that God is with the God-fearing, helping and assisting [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The forbidden month) in which you entered to perform the lesser pilgrimage ('umrah) (is for the forbidden month) which they prevented you from performing, (and forbidden things in retaliation) one in retaliation for another. (And one who attacketh you) first, in the Sacred Precinct (attack him in like manner as he attacked you) by killing them. (And observe your duty to Allah) and fear Allah to begin with, (and know that Allah is with those who ward off (evil)) He assists the pious by giving them victory.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلشَّهْرُ ٱلْحَرَامُ بِٱلشَّهْرِ ٱلْحَرَامِ وَٱلْحُرُمَاتُ قِصَاصٌ } قالَ: زيدُ بن علي عليهما السَّلامُ: كَانَ هذا في سَفرِ الحُديبيةِ، صَدَّ المشرِكُونَ رَسُولَ الله صَلى الله عليهِ وآلهِ وسلم عَنْ البيتِ فِي الشَّهرِ الحرامِ\n أَنْ يَعْتَمرُوا فِي السَّنةِ المستقبليةِ في هَذا الشَّهرِ الذي صَدّوهم فِيهِ\n فلذلكَ قَالَ والحُرماتُ قِصَاصٌ\n\n\n\n\nوقولهُ تعالى: { فَمَنِ ٱعْتَدَىٰ عَلَيْكُمْ فَٱعْتَدُواْ عَلَيْهِ بِمِثْلِ مَا ٱعْتَدَىٰ عَلَيْكُمْ } قالَ زيدُ بن علي عليهما السَّلامُ: فالاْعتِدَاءُ الأَولُ: هو ظُلْمٌ، والثانِي: هو جَزاءٌ وَليسَ بِظُلمٍ\n وقَدْ اتَفَقَ اللفظَانِ\n ومِثْلُ قَولِهِ عَزَّ وجلَّ:\n\n، [الشورى: 40] فالسّيئةُ الأَولى: ظُلْمُ، والثانيةُ: جَزاءٌ، ولَيستْ بظُلْمٍ وَلاَ عدوانٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعا ما قاتل المشركون مع المؤمنين عام الحديبية في ذي القعدة الحرام، عزم المؤمنون الخروج إلى مكة لعمرة القضاء أيضاً فيها في السنة الثانية وهم يكرهون القتال؛ لئلا يهتكوا حرمة شهرهم هذا كما هتكوا، أنزل الله عليهم هذه الآية فقال: { ٱلشَّهْرُ ٱلْحَرَامُ بِٱلشَّهْرِ ٱلْحَرَامِ } أي: لا ينالوا ولا يمتنعوا عن القتال فيه؛ إذ هتككم حرمة شهركم في هذه السنة بسبب هتكهم حرمته في السنة السابقة، فيؤول كلا الهتكين إليهم { وَٱلْحُرُمَاتُ قِصَاصٌ } أي: و اعلموا أن الحرمات التي يجب محافظتها وعدم هتكها يجري فيها القصاص بالمثل، فلما هتكوا حرمة هذا الشهر في السنة السابقة، فافعلوا معهم في هذه السنة بمثله ولا تجاوزوا عنه { فَمَنِ ٱعْتَدَىٰ عَلَيْكُمْ فَٱعْتَدُواْ عَلَيْهِ بِمِثْلِ مَا ٱعْتَدَىٰ عَلَيْكُمْ } وهذا أيضاً من الحدود الموضوعة بينكم لإصلاح حالكم وتهذيب أخلاقكم { وَٱتَّقُواْ ٱللَّهَ } أن تتخلفوا عن حدوده بالإقدام على ما نهيتم عنه، والإعراض عما أمرتم به { وَٱعْلَمُواْ } أيها المؤمنون { أَنَّ ٱللَّهَ } المدبر لكم المصالح لأحوالكم { مَعَ ٱلْمُتَّقِينَ } [البقرة: 194] منكم، وهم الذين يحفظون نفوسهم عن محارم الله ومنهياته، ويرغبونها نحو أوامر الله ومرضياته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n القتال الصدر منكم لهم في { الشهر الحرام } في مقابلة الصد الذي صدر منهم لكم في الشهر الحرام، { والحرمات قصاص } يقتص بعضها من بعض، فكما انتهكوا حرمة الشهر الحرام، بمنعكم من اليبت، فانتهكوا حرمتهم بالقتل فيه\n { فمن اعتدى عليكم } بالقتال في الأشهر الحُرُم، أو في الحرَم { فاعتدوا عليه بمثل ما اعتدى عليكم، واتقوا الله } فلا تنتصروا لنفوسكم، { واعلموا أن الله مع المتقين } بالحفظ والتأييد",
      "translations": []
    }
  ]
}