{
  "chapter": "البقرة",
  "text": "واتموا۟ الحج والعمرة لله فان احصرتم فما استيسر من الهدى ولا تحلقوا۟ رءوسكم حتى يبلغ الهدى محله فمن كان منكم مريضا او به اذى من راسه ففدية من صيام او صدقة او نسك فاذا امنتم فمن تمتع بالعمرة الى الحج فما استيسر من الهدى فمن لم يجد فصيام ثلثة ايام فى الحج وسبعة اذا رجعتم تلك عشرة كاملة ذلك لمن لم يكن اهله حاضرى المسجد الحرام واتقوا۟ الله واعلموا۟ ان الله شديد العقاب",
  "translations": [
    {
      "translation": "Perform the pilgrimage and holy visit ('Umra, to Makkah) in the service of God. But if you are prevented, send an offering which you can afford as sacrifice, and do not shave your heads until the offering has reached the place of sacrifice. But if you are sick or have ailment of the scalp (preventing the shaving of hair), then offer expiation by fasting or else giving alms or a sacrificial offering. When you have security, then those of you who wish to perform the holy visit along with the pilgrimage, should make a sacrifice according to their means. But he who has nothing, should fast for three days during the pilgrimage and seven on return, completing ten. This applies to him whose family does not live near the Holy Mosque. Have fear of God, and remember that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you make up your mind to perform Hajj and `Umrah, accomplish these to please Allah. But if you are hemmed in somewhere, then offer to Allah whatever sacrifice you can afford. And do not shave your heads until the sacrifice reaches its place. But whoever among you is sick or has an ailment of the head and has his head shaved shall atone for this either by fasting or by alms-giving or by offering a sacrifice However, when you are secure (and you reach Makkah before the Hajj season begins), whoever takes advantage of this opportunity to perform `Umrah shall offer the sacrifice that he can afford. But if he cannot afford a sacrifice, he shall fast three days during the Hajj season and seven days after reaching home, that is, ten days in all. This concession is only for those whose homes are not near the Masjid Haram, refrain from transgressing these Commandments of Allah and know it well that Allah is very severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Complete the hajj and umrah (two parts of the rituals of pilgrimage to Makka) in obedience to God. If you are prevented from completing the duty of hajj, offer whatever sacrifice is possible and do not shave your heads before the sacrificial animal is delivered to the prescribed place. If one of you is ill or is suffering because of some ailment in your head, you must redeem the shaving of the head by fasting, or paying money, or offering a sheep as a sacrifice. When all is well with you and you want to complete the umrah in the hajj season, offer whatever sacrifice is possible. If you do not find an animal, you have to fast for three days during the days of the pilgrimage rituals and seven days at home to complete the required ten fasting days. This rule is for those who live beyond (a distance of twelve miles from) the Sacred Mosque in Mecca. Have fear of God and know that He is stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform Hajj (greater pilgrimage) and Umrah (lesser pilgrimage) for Allah; and if you are prevented, send sacrifice whatever is available; and do not shave your heads until the sacrifice reaches its destination; so whoever among you is sick or has an ailment in the head, must pay a compensation by fasting or charity or sacrifice; then when you are in peace – and whoever takes the advantage of combining the Hajj and Umrah, it is compulsory for him to sacrifice whatever is available; and whoever cannot afford it, must fast for three days while on the pilgrimage, and seven when you have returned to your homes; these are ten in all; this decree is for him who is not a resident of Mecca; and keep fearing Allah and know well that Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And complete Hajj and `Umrah for Allah. But if you are prevented, then sacrifice a Hady that you can afford, and do not shave your heads until the Hady reaches the place of sacrifice. And whosoever of you is ill or has an ailment on his scalp (necessitating shaving), he must pay a Fidyah (ransom) of either fasting or giving Sadaqah or a sacrifice. Then if you are in safety and whosoever performs the `Umrah (in the months of Hajj), before (performing) the Hajj, he must slaughter a Hady such as he can afford, but if he cannot (afford it), he should fast for three days during Hajj and seven days after his return, making ten days in all. This is for him whose family is not present at Al-Masjid Al-Haram (i.e., non-resident of Makkah). And fear Allah much and know that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And accomplish the pilgrimage and the visit for Allah, but if, you are prevented, (send) whatever offering is easy to obtain, and do not shave your heads until the offering reaches its destination; but whoever among you is sick or has an ailment of the head, he (should effect) a compensation by fasting or alms or sacrificing, then when you are secure, whoever profits by combining the visit with the pilgrimage (should take) what offering is easy to obtain; but he who cannot find (any offering) should fast for three days during the pilgrimage and for seven days when you return; these (make) ten (days) complete; this is for him whose family is not present in the Sacred Mosque, and be careful (of your duty) to Allah, and know that Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfil the Pilgrimage and the Visitation unto God; but if you are prevented, then such offering as may be feasible. And shave not your heads, till the offering reaches its place of sacrifice. If any of you is sick, or injured in his head, then redemption by fast, or freewill offering, or ritual sacrifice. When you are secure, then whosoever enjoys the Visitation until the Pilgrimage, let his offering be such as may be feasible; or if he finds none, then a fast of three days in the Pilgrimage, and of seven when you return, that is ten completely; that is for him whose family are not present at the Holy Mosque. And fear God, and know that God is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the pilgrimage and the visit (to Makka) for Allah. And if ye are prevented, then send such gifts as can be obtained with ease, and shave not your heads until the gifts have reached their destination. And whoever among you is sick or hath an ailment of the head must pay a ransom of fasting or almsgiving or offering. And if ye are in safety, then whosoever contenteth himself with the visit for the pilgrimage (shall give) such gifts as can be had with ease. And whosoever cannot find (such gifts), then a fast of three days while on the pilgrimage, and of seven when ye have returned; that is, ten in all. That is for him whoso folk are not present at the Inviolable Place of Worship. Observe your duty to Allah, and know that Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perform the Hajj and the minor pilgrimage [umrah] for the sake of God. If you are prevented from doing so, then make whatever offering you can afford and do not shave your heads until the offering has reached the place of sacrifice. But if any of you is ill, or has an ailment of the head, he should compensate by fasting or almsgiving or sacrifice. In times of peace, if any of you combines the minor pilgrimage with the Hajj, he should make whatever offering he can afford, but if he lacks the means, then let him fast three days during the pilgrimage and for seven days after his return; that is, ten days in all. That is incumbent upon anyone whose family does not live near the Sacred Mosque. Fear God and know that God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fulfil the pilgrimage and 'Umra for Allah. And if ye be besieged, offer whatsoever offering be easy, and shave not Your heads, until the offering reacheth its destination. Then whosoever of you sick or hath hurt in his head, for him is a ransom by fasting or alms or a rite. Then when ye are secure, whosoever combinoth 'Umra with the pilgrimage, for him is whatsoever offering be easy. And whosoever cannot afford then for him is a fast of three days during the pilgrimage and of seven when ye return these are ten days complete. That is for him whose family dwell not near the Sacred Mosque. And fear Allah, and know that verily Allah is severe in chastising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Complete the hajj and the ‘umrah for Allah’s sake, and if you are prevented, then [make] such [sacrificial] offering as is feasible. And do not shave your heads until the offering reaches its [assigned] place. But should any of you be sick, or have a hurt in his head, let the atonement be by fasting, or charity, or sacrifice. And when you have security—for those who enjoy [release from the restrictions] by virtue of their ‘umrah until the hajj—let the offering be such as is feasible. As for someone who cannot afford [the offering], let him fast three days during the hajj and seven when you return; that is [a period of] ten complete [days]. That is for someone whose family does not dwell by the Holy Mosque. And be wary of Allah, and know that Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And complete the Hajj or 'umra in the service of Allah. But if ye are prevented (From completing it), send an offering for sacrifice, such as ye may find, and do not shave your heads until the offering reaches the place of sacrifice. And if any of you is ill, or has an ailment in his scalp, (Necessitating shaving), (He should) in compensation either fast, or feed the poor, or offer sacrifice; and when ye are in peaceful conditions (again), if any one wishes to continue the 'umra on to the hajj, He must make an offering, such as he can afford, but if he cannot afford it, He should fast three days during the hajj and seven days on his return, Making ten days in all. This is for those whose household is not in (the precincts of) the Sacred Mosque. And fear Allah, and know that Allah Is strict in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform properly (i.e. all the ceremonies according to the ways of Prophet Muhammad SAW), the Hajj and 'Umrah (i.e. the pilgrimage to Makkah) for Allah. But if you are prevented (from completing them), sacrifice a Hady (animal, i.e. a sheep, a cow, or a camel, etc.) such as you can afford, and do not shave your heads until the Hady reaches the place of sacrifice. And whosoever of you is ill or has an ailment in his scalp (necessitating shaving), he must pay a Fidyah (ransom) of either observing Saum (fasts) (three days) or giving Sadaqah (charity - feeding six poor persons) or offering sacrifice (one sheep). Then if you are in safety and whosoever performs the 'Umrah in the months of Hajj, before (performing) the Hajj, (i.e. Hajj-at-Tamattu' and Al-Qiran), he must slaughter a Hady such as he can afford, but if he cannot afford it, he should observe Saum (fasts) three days during the Hajj and seven days after his return (to his home), making ten days in all. This is for him whose family is not present at Al-Masjid-al-Haram (i.e. non-resident of Makkah). And fear Allah much and know that Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fulfill the pilgrimage and make the visitation for Allah. If you are prevented, then whatever offering that may be easy. And do not shave your heads until the offerings have reached their destination. But if any of you is ill or suffers from an ailment of the head (scalp), he must pay a ransom either by fasting or by the giving of charity, or by offering a sacrifice. When you are safe, then whosoever enjoys the visitation until the pilgrimage, let his offering be that which may be easy, but if he lacks the means, let him fast three days during the pilgrimage and seven when he has returned, that is, ten days in all. That is for him whose family is not present at the Holy Mosque. And fear Allah and know that He is firm in inflicting punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And carry out the Hajj and the Umrah for God. But if you are prevented, then whatever is feasible of offerings. And do not shave your heads until the offering has reached its destination. Whoever of you is sick, or has an injury of the head, then redemption of fasting, or charity, or worship. When you are secure: whoever continues the Umrah until the Hajj, then whatever is feasible of offering. But if he lacks the means, then fasting for three days during the Hajj and seven when you have returned, making ten in all. This is for he whose household is not present at the Sacred Mosque. And remain conscious of God, and know that God is stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And complete the Hajj and 'umrah for Allah. But if you are prevented, then [offer] what can be obtained with ease of sacrificial animals. And do not shave your heads until the sacrificial animal has reached its place of slaughter. And whoever among you is ill or has an ailment of the head [making shaving necessary must offer] a ransom of fasting [three days] or charity or sacrifice. And when you are secure, then whoever performs 'umrah [during the Hajj months] followed by Hajj [offers] what can be obtained with ease of sacrificial animals. And whoever cannot find [or afford such an animal] - then a fast of three days during Hajj and of seven when you have returned [home]. Those are ten complete [days]. This is for those whose family is not in the area of al-Masjid al-Haram. And fear Allah and know that Allah is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:196] Fulfil the Pilgrimage and the Visitation to God, by completing them according to their due; but if you are prevented, from fulfilling them by an enemy, then [give] such offering as may be feasible, for you — a sheep — and do not shave your heads, that is, do not release yourselves from the state of pilgrimage inviolability, until the offering, mentioned, reaches its place, its place of sacrifice, that is, within the enclosure, according to al-Shāfi‘ī; the sacrifice is then made with the intention of releasing oneself from the state of pilgrimage inviolability, and is divided among the needy, after which the head is shaved and the release is effected. If any of you is sick, or has an ailment of the head, such as lice or severe pains, and has thus shaved his head while in a state of pilgrimage inviolability, then, incumbent upon him is, a redemption by fast, for three days, or a voluntary almsgiving, consisting of three cubic measures of the principal food of the town for six needy persons, or a ritual sacrifice, that is, the slaughter of a sheep (aw, ‘or’, denotes freedom of choice). To this [last] has been added the [case of the] one who shaves his head without excuse because the requirement of redemption is most obvious in his case; but also [it is required in the case of] one that enjoys, without shaving, such things as scents, attire, or oils, be it with an excuse or without. When you are secure, knowing that the enemy has gone or is not present, then whoever enjoys the Visitation, having completed it and observed its ritual prohibitions, until the Pilgrimage, until he enters its ritual inviolability in the relevant months; let his offering be such as is feasible, for him, such as a sheep that he sacrifices after entering into the state of pilgrimage inviolability, ideally, on the Day of Sacrifice; or if he finds none, because there are none available, or because he does not have sufficient funds, then, incumbent upon him is, a fast of three days in the Pilgrimage, that is to say, in a state of pilgrimage inviolability. In such a case, he should enter into the state of pilgrimage inviolability before the seventh of Dhū’l-Hijja, but ideally before the sixth, because one is discouraged from fasting on the Day of ‘Arafa. Moreover, he should not fast during these the days of tashrīq, according to the sounder of two opinions attributed to al-Shāfi‘ī. And of seven when you return, to your domicile, [be it] Mecca or any other; or when you have completed the rites of the Pilgrimage’ (there is a shift from the third [to the second] person); that is a full ten (this sentence reaffirms what has just been said); that, mentioned stipulation regarding the incumbency of the offering or the fast upon the person that has enjoyed [the Visitation], is for him whose family are not present at the Sacred Mosque, so that they are not within 50 miles of the Sacred Enclosure, according to al-Shāfi‘ī. If they are [present however], then no blood [sacrifice] or fast is obligatory in his case, even if he has enjoyed [the Visitation]. The mention of ‘family’ is intended as a notification of the proviso in the case of being ‘domiciled’ [in the vicinity of the Sacred Mosque]. If one were to take up [temporary] residence, but not be domiciled, before the months of the Pilgrimage and enjoy the Visitation, then that [fast or sacrifice] will be incumbent upon him; this is one of two opinions of al-Shāfi‘ī, the other being that it is not [incumbent]. The term ahl, ‘family’, is said to denote ‘oneself’. In the Sunna, in addition to the one that enjoys the Visitation, as mentioned, there is also the one that enters into the state of pilgrimage inviolability for both the Visitation and the Pilgrimage together [sc. qārin, ‘one who combines’] or in the case where the Pilgrimage encroaches upon [a Visitation], but before circumambulation [has been performed]. And fear God, in what He commands you and prohibits you; and know that God is severe in retribution, against whoever opposes Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Perform the pilgrimage and the visit for Allah) so that He may accept them, and this by making them sincere unto Him and also by performing the pilgrimage to its final completion and by performing the lesser pilgrimage to the Sacred House. (And if ye are prevented) from performing the pilgrimage or the lesser pilgrimage because of enemies or ill-health, (then send such gifts as can be obtained with ease) then you should offer whatever gifts you can obtain: a sheep, cow or camel in order to leave the Sacred Precinct, (and shave not your heads) if you are prevented (until the gifts) that you have sent (have reached their destination) where it is going to be immolated. (And whoever among you is sick) and cannot remain in the place where he is, then he can return home before his gift reaches its destination (or hath an ailment of the head) or if his head is infested with lice, he should shave it. This verse was revealed about Ka'b Ibn 'Ujrah who shaved his hair when still in a state of ritual consecration because it was infested with lice, (must pay ransom of fasting) the ransom is to fast three days (or almsgiving) to six needy people from the inhabitants of Mecca (or offering) a sheep to be sent to the place of immolation. (And if ye are in safety) from the enemy and you have recovered from your sickness, then you should make up that which Allah has made obligatory upon you in the following year, whether it is a question of the pilgrimage or the lesser pilgrimage, (then whoever contenteth himself with) perfume and clothes after (the visit) the lesser pilgrimage and until he engages in ritual consecration (for the Pilgrimage (shall give) such gifts) then he should offer a sacrifice for making 'Umrah before Hajj (dam al-tamattu') and a sacrifice for doing Hajj and 'Umrah simultaneously (dam al-qaran wa'l-mut'a), whether it is a sheep, cow or camel (as can be had with ease. And whoever cannot find (such gifts)) either a sheep, cow or camel, (then a fast of three days) a fast of three consecutive days (while on the pilgrimage) in the ten days of the pilgrimage, the last of which being the Day of 'Arafah, (and of seven when ye have returned) on your way to your families or after you have returned to your families; (that is, ten in all) in exchange for the gifts. (That) i.e. offering a sacrifice for making 'Umrah before Hajj (is for him whose folk are not present at the Inviolable Place of Worship) whose family and home is not in the Sacred Precinct because the inhabitants of the Sacred Precinct are not obligated to give the offering for making 'Umrah before Hajj. (Observe your duty to Allah) fear Allah if you leave what you have been commanded to do, (and know that Allah is severe in punishment) towards anyone who leaves what he has been commanded to do, whether it is the offering of gifts or fasting.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَأَتِمُّواْ ٱلْحَجَّ وَٱلْعُمْرَةَ للَّهِ } فالحَجُّ والعُمْرَةُ جميعاً: الزيارَةُ\n والحَجُّ فَرِيضَةٌ، وهو الحَجُّ الأَكْبرُ، والعُمْرَةُ تَطوعٌ، وهي الحَجُّ الأَصْغَرُ\n\n\n\n\nوقولهُ تعالى: { فَإِنْ أُحْصِرْتُمْ } معناه مُنِعتُمْ لِحَربٍ أَوْ مَرضٍ أَوْ غَيرِ ذَلكَ { فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْيِ } معناه بَدنةٌ أَوْ بَقرةٌ أَو شَاةٌ أَوْ شرْكٌ فِي دَمٍ يَشتَركُ سَبعَةُ أَنفسٍ فِي بَدَنَةٍ أَوْ بَقَرةٍ كلهم يريدُ بِهِ النُّسُكَ\n\n\n\n\nوقولهُ تعالى: { فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ } قالَ زيدُ بن علي عليهما السلامُ: الصِّيامُ: ثَلاثةُ أَيامٍ، والصَّدقَةُ: ثَلاَثةُ أَصْوع بين ستةِ مساكين والنُّسكُ: شَاةٌ تُذبحُ بِمكةَ\n والنَّسيكةُ: الذَبيحةُ\n والجمعُ النَّسائكُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وأتمُوا } حجّ توحيد الذات وعمرة توحيد الصفات بإتمام جميع المقامات والأحوال، بالسلوك إلى الله وفي الله، { فإن أحصرتم } بمنع كفار النفس الأمّارة إياكم عنهما { فما استيسرَ من الهدي } فجاهدوا في الله بسوق هدي النفس وذبحها بفناء كعبة القلب أو عرصة ما تمنى منها القلب من المقام\n وما استيسر إشارة إلى أنّ النفوس مختلفة في استعداداتها وصفاتها، فبعضها موصوف بصفات حيوان ضعيف، وبعضها بصفات حيوان قوي\n ولكلّ ما تيسر أو بعضها بصفات حيوان ذلول سهل الانقياد، وبعضها بصفات حيوان صعب عسر الانقياد، وربما كان لبعضها صفة لم يتيسر قمعها وإن تيسر قمع سائر صفاتها\n ومثل هذا الحاج محصر أبداً\n { ولا تحلقوا رؤوسكم } ولا تزيلوا آثار الطبيعة وتخاروا طيب القلب وفراغ الخاطر من الهموم والتعلقات كلها، والعادات والعبادات وتقتصروا على صفاء الوقت كما هو مذهب القلندرية { حتى يبلغ } هدي النفس { محله } أي: مكانه، وهو مذبحه أو منحره الذي يقتضي أن تكون أفعالها التي كانت محرّمة عند حياتها بهواها تصير حلاً عند قتلها لكونها بالقلب فتأمنوا من بقاياها، وإلا لتشوّش وقتكم وتكدّر صفاؤكم بظهورها ونشاطها بالدعوى عند بسط القلب كما هو حال أكثر القلندرية اليوم\n { فمن كان منكم مريضاً } أي: ضعيف الاستعداد مملوء القلب بعوارض لازمة في جبلتها أو مكتسبة من العادات { أو به أذى من رأسه } أو ممنوعاً مبتلى بهموم وتعلّقات ورذائل وهيئات، ولم يتيسر له السلوك والمجاهدة على ما ينبغي وأراد أن يقتصر على طيب القلب وصفاء الوقت ليبقى على الفطرة ولا ينتكس وينحط عن درجته وإن لم يترق\n فعليه فدية من إمساك عن بعض لذاته وشواغله النفسانية\n أو فعل برّ أو رياضة ومجاهدة تقمع بعض القوى المزاحمة، فليحفظ وقته وليراع صفاءه بزهد ما أو عبادة أو مخالفة نفس { فإذا أمنتم } من العدوّ المحصر { فمن تمتع } بذوق تجلي الصفات متوسلاً به إلى حج تجلي الذات { فما استيسر من الهدي } بحسب حاله { فمن لم يجد } لضعف نفسه وخمودها وانقهارها { فصيام ثلاثة أيام } فعليه الإمساك عن أفعال القوى التي هي الأصول القوية في وقت التجلي والاستغراق في الجمع والفناء في الوحدة فإنها لا بدّ من أن تحجب وتجرّ إلى حضيض النفس والصدر، وهي العقل والوهم والمتخيلة { وسبعة إذا رجعتم } إلى مقام التفصيل والكثرة وهي الحواس الخمس الظاهرة والغضب والشهوة ليكون عند الاستقامة في الأشياء بالله { تلك عشرة كاملة } فذلكة، أي: تلك الإمساكات المذكورة عن أفعال هذه القوى والمشاعر جميع التفاصيل الكاملة الموجبة لأفاعيل قوى وجوده الموهوب بالحق عند حصول الكمال، كما قال:\n\n \" كنت سمعه الذي يسمع به، وبصره الذي يبصر به \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من الأركان المفروضة في دينكم أيها المحمديون { أَتِمُّواْ ٱلْحَجَّ } أي: الخصائل والسنك المحفوظة المفروضة فيه، وإن أدى إلى المقاتلة والمشاجرة { وَٱلْعُمْرَةَ } الأمور المسنونة فيه { للَّهِ } قاصدين التقرب إليه والتوجه إلى بابه؛ إذ الحج الحقيقي هو الوصول إلى الكعبة الحقيقية التي هي الذات الأحدية { فَإِنْ أُحْصِرْتُمْ } مُنعتم وحبستم بعدما أحرمتم للحج والعمرة من الوصول إلى المقيات، وتتميم الواجبات { فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْيِ } أي: فعليكم إذا أردتم التحلل والخروج من الإحرام، ذبح ما تيسر لكم حصوله من الهدي المحلل، مثل البقرة والبدنة والشاة وغيرها بحسب طاقتكم وقدرتكم، بأن تبعثوها إلى الحرم أو تذبوحها حيث أحصتم { وَلاَ تَحْلِقُواْ رُؤُوسَكُمْ } أيها المحصورون المريدون التحلل { حَتَّىٰ يَبْلُغَ ٱلْهَدْيُ مَحِلَّهُ } المبعوث إليه، أو تذبحونه في المكان المحصور فيه، والحاصل ألاَّ تحلقوا رءوسكم قبل ذبح الهدي أو قبل وصولها إلى الحرم\n\n\n\n\n{ فَمَن كَانَ مِنكُم مَّرِيضاً } أزداد بشعر الرأس { أَوْ بِهِ أَذًى } ناشئاً { مِّن } شعر { رَّأْسِهِ } من تزاحم قمل أو صداع مفرطٍ أو جرب مشوش وحلق لأجله { فَفِدْيَةٌ } أي فاللازم عليه الفدية سواء كان { مِّن صِيَامٍ } مقدر بثلاثة أيام للفقراء العاجزين عن غيره { أَوْ صَدَقَةٍ } مقدرة بثلاثة آصع من الطعام للمتوسطين { أَوْ نُسُكٍ } من بدنة أو بقرة أو شاة للأغنياء على اختلاف طبقاتهم { فَإِذَآ أَمِنتُمْ } أي: إذا أحرمتم للحج حال كونكم آمنين من الموانع من إحصار العدو والمرض العارض ونزول الحادثة وغير ذلك من العوائق، فعليكم إتمام نسكه على الوجه الذي أمرتم به بلا إهمال شيء من آدابه المحفوظة فيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَأَتِمُّواْ ٱلْحَجَّ وَٱلْعُمْرَةَ للَّهِ فَإِنْ أُحْصِرْتُمْ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْيِ وَلاَ تَحْلِقُواْ رُؤُوسَكُمْ حَتَّىٰ يَبْلُغَ ٱلْهَدْيُ مَحِلَّهُ فَمَن كَانَ مِنكُم مَّرِيضاً أَوْ بِهِ أَذًى مِّن رَّأْسِهِ فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ\n\n\n }  قلت: المشهور في اللغة أن أحصر الرباعي: بالمرض، وحصر الثلاثي: بالعدو، وقيل: بالعكس، وقيل: هما سواء\n و { ما استيسر }: خبر أو مبتدأ، أي: فالواجب ما استيسر، أو: فعليه ما استيسر\n يقول الحقّ جلّ جلاله: { وأتموا الحج } الذي دخلتم فيه، { والعمرة } وجوباً كالصلاة والصوم، ويكون ذلك { لله } لا رياء ولا سمعة، وإنما خصّ الحج والعمرة بالحض على الإخلاص، لما يسرع إليهما من الخلل أكثر من غيرهما، فمن أفسدهما وجب عليه قضاؤهما، { فإن أحصرتم } ومنعتم من إتمامهما فتحللوا منهما، وعليكم { ما استيسر من الهدي } ، وذلك شاة { ولا تحلقوا رؤوسكم } أي: لا تتحللوا { حتى يبلغ الهدي محله } ، أي: حيث يحل ذبحه، وهو محل الإحصار عند الشافعي، فيذبح فيه بنية التحلل ويُفرق، ومِنَى أو مكة عند مالك، فيُرسله فإذا تحقق أنه وصل وذُبح حل وحلق\n ويحرم على المُحْرِم إزالة الشعث، ولبس المخيط بالعضو، فمن كان { مريضاً أو به أذى } صُداع أو نحوه، فحلق رأسه، أو لبس ثيابه، فعليه فديه { من صيام } ثلاثة أيام، { أو صدقة } على ستة مساكين، مُدَّان لكل مسكين، { أو نسك } بشاة فأعلى، فهو مخير بين الثلاثة\n والله تعالى أعلم\n الإشارة: إذا عقد المريد مع ربه عُقْدةً، فالواجب عليه إتمامها حتى يَجْني ثمرتَها، فإذا عقد عقدة المجاهدة فليجاهد نفسه حتى يجني ثمرتها، وهي المشاهدة، وإذا عقد مع الشيخ عقدة الصحبة، فليلزم خدمته حتى يدخله إلى بيت الحضرة، ويشهد له بالترشيد\n وهكذا كل من عقد مع الله عقدة يجب عليه إتمامها، فإن أُحصر ومُنع من إتمامها فليفعل\n ما استيسر من ذبح نفسه وحط رأسه، و\n\n[الطّلاَق: 7]، ولا ينبغي أن يستعجل الفتح قبل إِبَّانِه، فلعلَّه يُعاقَب بحرمانه، فكم من مريد طلب شيخه أَنْ يُطلعه على سر الربوبية قبل بلوغ محله، فكان ذلك سببب عطبه، فيقال له: ولا تحلق رأسك من شهود السوى حتى يبلغ هَديُ نفسك محلة فيذبح، فإذا ذُبِحت النفس وأُجهِز عليها حلق رأسه حينئذٍ من شهود السِّوى، وفي ذلك يقول الششتري رضي الله عنه\n\n\nفمن كان مريضاً بضعف عزمه، أو به أذى بعدم نهوض حاله، بحيث لم تُسعفْه المقادير في مجاهدة نفسه، فليشتغل بالنسك الظاهر من صيام أو صدقة أو قراءة أو غير ذلك، حتى يَمنَّ عليه العليمُ الحكيمُ\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n\n\nولمّا ذكر الحقّ تعالى هدى الإحصار وفديَة الأذى، ذكر هدى التمتع، فقال: {\n\n\n فَإِذَآ أَمِنتُمْ فَمَن تَمَتَّعَ بِٱلْعُمْرَةِ إِلَى ٱلْحَجِّ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْيِ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيَّامٍ فِي ٱلْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كَامِلَةٌ ذٰلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُ حَاضِرِي ٱلْمَسْجِدِ ٱلْحَرَامِ وَٱتَّقُواْ ٱللَّهَ وَٱعْلَمُواْ أَنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ }  يقول الحقّ جلّ جلاله: فإذا حصل لكم الأمن من المرض أو العدو، أوردتم الحج { فمن تمتع } منكم { بالعمرة إلى الحج } بأن قدَّم العمرة في أشهر الحج، ثم حجّ من عامه، فالواجب عليه { ما استيسر من الهدي } شاة فأعلى لكونه تمتَّعَ بإسقاط أحد السَّفَرَيْن ولم يُفرِد لكل عبادة سفراً مخصوصاً\n { فمن لم يجد } الهدي، ولم يقدِر على شرائه، فعليه { صيام ثلاثة أيام } في زمن { الحج } ، وهو زمنُ إحرامه إلى وقوفه بعرفة، فإن لم يصم في ذلك الزمان صام أيام التشويق\n ثم يصوم سبعة أيام إذا رجَع إلى مكة أو إلى بلده\n فتلك { عشرة } أيام { كاملة } ، ولا تتوهموا أن السبعة بدل من الثلاثة، فلذلك صرّح الحقّ تعالى بفَذْلَكة الحساب\n وهذا الهَدْي أو الصيام إنما يجب على المتمتع إذا لم يكن ساكناً بأهله في مكة أو ذي طَوى، وأما مَن كان { أهلُه حاضري المسجد الحرام } فلا هَدى عليه لأنه يُحرم بالحج من مكة فلم يسقط أحد السفرين، { واتقوا الله } في امتثال أوامره، وخصوصاً مناسك الحج لكثرتها وتشعب فروعها، ولذلك أُفردت بالتأليف، { واعلموا أن الله شديد العقاب } لمن ترك أوامرَه وارتكب نواهيه، وبالله التوفيق\n الإشارة: يقول الحقّ جلّ جلاله على طريق الإشارة للمتوجهين إليه: فإذا أمنتُمْ من أعدائكم الذين يقطعونكم عن الوصول إلى حضرتنا، أو أمِنْتُم من الرجوع بعد الوصال، أو من السلب بعد العطاء، وذلك بعد التمكين من شهود أسرار الذات، وأنوار الصفات، إذ الكريم إذا أعطى لا يرجع، فإذا حصل لكم الأَمْن، فمن تمتع بأنوار الشريعة إلى أسرار الحقيقة فعليه ما استطاع من الهدي والسمت الحسَن والخلُق الحَسن لأنه إذ ذاك قد اتصف بصفة الكمال وتصدَّر لتربية الرجال، فمن لم يجد ذلك فلرجع إلى ما تيسر من المجاهدة حتى يتمكن من ذلك الهَدْي الحسن والخلق الحسن، هذا لمن لم يتمكن في الحضرة الأزلية، وأما مَن كان مقيماً بها، عاكفاً في شهود أنوارها، فلا كلام عليه، لأنه قد تولاّه مولاه، وغيَّبَه عن شهود نفسه وهواه، فَأمْرُه كله بالله وإلى الله\n جعلنا الله فيهم بمنِّه وكرمه، لكن لا يغفُل عن التقوى لقوله - عليه الصلاة والسلام:\n\n \" أنا أعرفُكُم بالله، وأنا أتقاكم له \" \n\nوقالوا: \" من علامة النهايات الرجوعُ إلى البدايات \"\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}