{
  "chapter": "البقرة",
  "text": "واقتلوهم حيث ثقفتموهم واخرجوهم من حيث اخرجوكم والفتنة اشد من القتل ولا تقتلوهم عند المسجد الحرام حتى يقتلوكم فيه فان قتلوكم فاقتلوهم كذلك جزاء الكفرين",
  "translations": [
    {
      "translation": "And fight those (who fight you) wheresoever you find them, and expel them from the place they had turned you out from. Oppression is worse than killing. Do not fight them by the Holy Mosque unless they fight you there. If they do, then slay them: Such is the requital for unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight against them wherever they confront you in combat and drive them out from where they drove you out. Though killing is bad. persecution is worse than killing Do not fight against them near the Masjid Haram unless they attack you there.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay them wherever you may catch them and expel them from the place from which they expelled you. The sin of disbelief in God is greater than committing murder. Do not fight them in the vicinity of the Sacred Mosque in Mecca unless they start to fight. Then slay them for it is the recompense that the disbelievers deserve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay the disbelievers wherever you find them, and drive them out from where they drove you out, and the turmoil they cause is worse than slaying; and do not fight them near the Sacred Mosque until they fight you there; so if they fight you, slay them; this is the punishment of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah is worse than killing. And fight not with them at Al-Masjid Al-Haram (the sanctuary at Makkah), unless they (first) fight you there. But if they attack you, then kill them. Such is the recompense of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you find them, and drive them out from whence they drove you out, and persecution is severer than slaughter, and do not fight with them at the Sacred Mosque until they fight with you in it, but if they do fight you, then slay them; such is the recompense of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay them wherever you come upon them, and expel them from where they expelled you; persecution is more grievous than slaying. But fight them not by the Holy Mosque until they should fight you there; then, if they fight you, slay them -- such is the recompense of unbelievers --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay them wherever ye find them, and drive them out of the places whence they drove you out, for persecution is worse than slaughter. And fight not with them at the Inviolable Place of Worship until they first attack you there, but if they attack you (there) then slay them. Such is the reward of disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Slay them wherever you find them [those who fight against you]; drive them out of the places from which they drove you, for [religious] persecution is worse than killing. Do not fight them at the Sacred Mosque unless they fight you there. If they do fight you, slay them, such is the reward for those who deny the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay them wheresoever ye come upon them, and drive them out whence they drove you out; and temptation is more grievous than slaughter. And fight them not near the Sacred Mosque until they fight you therein, but if they get ready to fight you there, then slay them. That is the meed of the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you confront them, and expel them from where they expelled you, for persecution is graver than killing. But do not fight them near the Holy Mosque unless they fight you therein; but if they fight you, kill them; such is the requital of the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slay them wherever ye catch them, and turn them out from where they have Turned you out; for tumult and oppression are worse than slaughter; but fight them not at the Sacred Mosque, unless they (first) fight you there; but if they fight you, slay them. Such is the reward of those who suppress faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah is worse than killing. And fight not with them at Al-Masjid-al-Haram (the sanctuary at Makkah), unless they (first) fight you there. But if they attack you, then kill them. Such is the recompense of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kill them wherever you find them. Drive them out of the places from which they drove you. Dissension is greater than killing. But do not fight them by the Holy Mosque unless they attack you there; if they fight you, kill them. Like this is the recompense of the unbelievers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you overtake them, and expel them from where they had expelled you. Oppression is more serious than murder. But do not fight them at the Sacred Mosque, unless they fight you there. If they fight you, then kill them. Such is the retribution of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And kill them wherever you overtake them and expel them from wherever they have expelled you, and fitnah is worse than killing. And do not fight them at al-Masjid al- Haram until they fight you there. But if they fight you, then kill them. Such is the recompense of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:191] And slay them wherever you come upon them, and expel them from where they expelled you, that is, from Mecca, and this was done after the Conquest of Mecca; sedition, their idolatry, is more grievous, more serious, than slaying, them in the Sacred Enclosure or while in a state of pilgrimage inviolability, the thing that you greatly feared. But fight them not by the Sacred Mosque, that is, in the Sacred Enclosure, until they should fight you there; then if they fight you, there, slay them, there (a variant reading drops the alif in the three verbs [sc. wa-lā taqtilūhum, hattā yaqtulūkum, fa-in qatalūkum, so that the sense is ‘slaying’ in all three, and not just ‘fighting’]) — such, killing and expulsion, is the requital of disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And slay them) if they start the fight against you (wherever ye find them) whether in the Sacred Precinct or in other places, (and drive them) out of Mecca (out of the places whence they drove you out) as they drove you out of it, (for persecution) associating partners with Allah and worshipping idols (is worse) more evil (than slaughter) in the Sacred Precinct. (And fight not with them) do not initiate a fight with them (at the Inviolable Place of Worship) in the Sacred Precinct (until they attack you there) until they initiate a fight with you in the Sacred Precinct, (but if they attack you (there)) first (then slay them. Such is the reward of disbelievers) i.e. death is their reward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُم } معناهُ حَيثُ لَقَيْتُمُوهُمْ\n\n\n\n\nوقوله تعالى: { وَٱلْفِتْنَةُ أَشَدُّ مِنَ ٱلْقَتْلِ } فالفِتْنَةُ ها هنا: الكفرُ، ويقالُ للكافِرِ هذا رجلٌ مَفْتُونٌ فِي دِينِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن اجتمعوا لقتالكم وتوجهوا نحوكم { ٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُم } أي: في أي مكان وجدتموهم { وَأَخْرِجُوهُمْ } إن ظفرتم عليهم { مِّنْ حَيْثُ أَخْرَجُوكُمْ } أي: مكة { وَ } ألقوا بينهم الفتن والاضطراب وأوقعوهم في حيص بيص؛ إذ { ٱلْفِتْنَةُ أَشَدُّ } أثراً { مِنَ ٱلْقَتْلِ } لأن أثر القتل منقطع به وأثر الفتنة مستمر دائم غير منقطع { وَ } عليكم المحافظة للعهود خصوصاً { لاَ تُقَاتِلُوهُمْ } وأنتم بادون للقتل { عِنْدَ ٱلْمَسْجِدِ ٱلْحَرَامِ } الذي حرم فيه إزالة الحياة مطلقاً { حَتَّىٰ يُقَاتِلُوكُمْ فِيهِ } وهم بادون معتدون عن حدود الله { فَإِن قَاتَلُوكُمْ فَٱقْتُلُوهُمْ } بعد فيه أيضاً قائلين: { كَذَلِكَ جَزَآءُ ٱلْكَافِرِينَ } [الكافرين: 191] الهاتكين حرمة بيت الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واقتلوهم حيث ثقفتموهم } أي: وجدتموهم، ولا تتحرجوا من قتالهم في الحرم، فإنهم هم الذين صدوكم وبدأوكم بالإذاية، { وأخرجوهم } من مكة { حيث أخرجوكم } منها، { والفتنة } أي: الكفر الذي هم فيه، { أشد من القتل } لهم في الحرم، { ولا تقاتلوهم عند المسجد الحرام } ابتداءً { حتى يقاتلوكم فيه، فإن قاتلوكم } فيه { فاقتلوهم } فيه، وفي غيره، { كذلك جزاء الكافرين } يفعل بهم ما فعلوا بغيرهم، { فإن انتهوا } عن الشرك وأسلموا { فإن الله غفور } لهم { رحيم } بهم",
      "translations": []
    }
  ]
}