{
  "chapter": "البقرة",
  "text": "او كصيب من السماء فيه ظلمت ورعد وبرق يجعلون اصبعهم فى ءاذانهم من الصوعق حذر الموت والله محيطۢ بالكفرين",
  "translations": [
    {
      "translation": "Or like rain pouring from the sky which hides within it darkness, thunder and lightning. They thrust their fingers into their ears for safety against noise and death. But God surrounds those who believe not from all sides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (still another parable may be cited to depict their condition): heavy rain is falling from the sky, accompanied by pitch darkness, thunder and lightning. When they hear the thunderclap, they thrust their fingers into their ears for fear of death, but Allah is encircling the disbelievers on all sides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or it is like that of a rain storm with darkness, thunder, and lightning approaching. They cover their ears for fear of thunder and death. God encompasses those who deny His words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like a rainstorm from the sky, in which are darkness, thunder and lightning; they thrust their fingers in their ears due to the thunderclaps, fearing death; and Allah has the disbelievers encompassed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like a rainstorm in the sky, bringing darkness, thunder, and lightning. They thrust their fingers in their ears to keep out the stunning thunderclap for fear of death. But Allah ever encompasses the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like abundant rain from the cloud in which is utter darkness and thunder and lightning; they put their fingers into their ears because of the thunder peal, for fear of death, and Allah encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or as a cloudburst out of heaven in which is darkness, and thunder, and lightning -- they put their fingers in their ears against the thunderclaps, fearful of death; and God encompasses the unbelievers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like a rainstorm from the sky, wherein is darkness, thunder and the flash of lightning. They thrust their fingers in their ears by reason of the thunder-claps, for fear of death, Allah encompasseth the disbelievers (in His guidance, His omniscience and His omnipotence).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or their case is like that of heavy rain pouring down from the clouds, accompanied by darkness, thunder and lightning; they thrust their fingers in their ears at the sound of thunderclaps for fear of death. God thus encompasses those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "like unto a rain--laden cloud from heaven, wherein are darknesses and thunder and lightening. They so put their fingers in their ears because of the thunder-claps, guarding against death, and Allah is Encompasser of the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or that of a rainstorm from the sky, wherein is darkness, thunder and lightning: they put their fingers in their ears due to the thunderclaps, apprehensive of death; and Allah besieges the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (another similitude) is that of a rain-laden cloud from the sky: In it are zones of darkness, and thunder and lightning: They press their fingers in their ears to keep out the stunning thunder-clap, the while they are in terror of death. But Allah is ever round the rejecters of Faith!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like a rainstorm from the sky, wherein is darkness, thunder, and lightning. They thrust their fingers in their ears to keep out the stunning thunderclap for fear of death. But Allah ever encompasses the disbelievers (i.e. Allah will gather them all together).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, like (those who, under) a cloudburst from the sky with darkness, thunder and lightning, they thrust their fingers in their ears at the sound of every thunderclap for fear of death, and Allah encompasses the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like a cloudburst from the sky, in which is darkness, and thunder, and lightning. They press their fingers into their ears from the thunderbolts, in fear of death. But God surrounds the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [it is] like a rainstorm from the sky within which is darkness, thunder and lightning. They put their fingers in their ears against the thunderclaps in dread of death. But Allah is encompassing of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:19] Or, the likeness of them is as a cloudburst, that is, [the likeness of them is] as people are during rain (kasayyib: the term is originally sayyūb, from [the verb] sāba, yasūbu, meaning ‘it came down’); out of the heaven, out of the clouds, in which clouds is darkness, layer upon layer, and thunder, the angel in charge of them [sc. the clouds]; it is also said that this [thunder] is actually the sound of his voice; and lightning, the flash caused by his voice which he uses to drive them — they, the people under the rain, put their fingers, that is, their fingertips, in their ears against, because of, the thunderclaps, the violent sound of thunder, in order not to hear it, cautious of, fearful of, death, if they were to hear it. Similar is the case with these: when the Qur’ān is revealed, in which there is mention of the unbelief that is like darkness, the threat of punishment that is like the sound of thunder, and the clear arguments that are like the clear lightning, they shut their ears in order not to hear it and thereby incline towards [true] faith and abandon their religion, which for them would be death; and God encompasses the disbelievers in both knowledge and power, so they cannot escape Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or like a rainstorm from the sky). This is another simile, whereby the likeness of the hypocrites and Jews vis-a-vis the Qur'an is like rain that has poured down from heaven at night onto the wilderness, (wherein is darkness, thunder and the flash of lightening). Such is the Qur'an. For it has come down from Allah; it contains darkness as embodied in the exposition of seditions, thunderings of rebuke whereby fear is instilled, lightening of exposition, instruction and promise. (They thrust their fingers in their ears by reason of the thunder-claps) due to the sound of the thunder (for fear of death), for fear of misfortune and death. Similarly, the Jews and hypocrites used to put their fingers in their ears when they heard the Qur'an recited, delivering promises and threats like thunder-claps, and this they did for fear of death, i.e. for fear of being drawn to it. (And Allah encompasseth the disbelievers) and hypocrites, i.e. He knows them and will gather them in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَوْ كَصَيِّبٍ مِّنَ ٱلسَّمَآءِ } فالصَّيِّبُ: المطرُ\n وجمعُهُ صَيَائِبُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوالظلمات هي الصفات النفسانية، والشكوك الخيالية والوهمية، والوساوس الشيطانية مما تحيرهم وتوحشهم\n والرعد هو التهديد الإلهيّ والوعيد القهريّ الوارد في القرآن والآيات والآثار المسموعة والمشاهدة مما يخوّفهم فيفيد أدنى انكسار لقلوبهم الطاغية وانهزام لنفوسهم الآبية\n والبرق هو اللوامع النورية والتنبهات الروحية عند سماع الوعد وتذكير الآلاء والنعماء مما يطمعهم ويرجيهم، فيفيدهم أدنى شوق وميل إلى الإجابة\n ومعنى { يجعلون أصابعهم في آذانهم من الصواعق حَذَر الموت } يتشاغلون عن الفهم بالملاهي والملاعب عن سماع آيات الوعيد، ولكي لا ينجع فيهم فيقطعهم عن اللذات الطبيعية بهمّ الآخرة، إذ الانقطاع عن اللذات الحسيّة هو موتهم، والله قادر عليهم، قاطع إياهم عن تلك اللذات المألوفة بالموت الطبيعي، قدرة المحيط بالشيء الذي لا يفوته منه، فلا فائدة لحذرهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ } مثلهم في هذا الاستبدال والاتجار { كَصَيِّبٍ } نازل { مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٌ } متوالية متتالية، بعضها فوق بعض شدة وضعفاً بحسب تخلخل السحب وتكاثفها { وَرَعْدٌ وَبَرْقٌ } بسبب الأدخنة والأبخرة المحتسبة فيه، متى أبصرها الناس وسمعوا أصوات بروقه ورعوده { يَجْعَلُونَ أَصَٰبِعَهُمْ } أنامل أصابعهم { فِيۤ آذَانِهِم } خوفاً { مِّنَ ٱلصَّوَٰعِقِ } النازلة منها، المهلكة غالباً لمن أُصيب بها، وإنما يفعلون ذلك { حَذَرَ ٱلْمَوْتِ } أي: حذر أن يموتوا في إصابتها؛ يعني: إنهم لما شبهوا في نفوسهم دين الإسلام بالصيب المذكور في ظهوره من غير ترقب، واشتمال في زعمهم على ظلمات التكاليف المتفاوتة المتنوعة، ورعود الوعيدات الهائلة وبروق الأحكام الخاطفة، وجب عليهم الاحتراز عن غوائله فمالوا عنه وأعرضوا، وجعلوا أصابع عقولهم في آذان قبولهم؛ خوفاً من الصواعق النازلة المصفية المفنية ذواتهم في ذات الله حذر الموت الإداري، وهم بسبب هذا الميل والإعراض يعتقدون أنهم خلصوا عن الفناء في ذاته { وَ } لم يعلموا أنهم مستهلكون فيها إذ { ٱللَّهُ } المتجلي في ذاته لذاته { مُحِيطٌ بِٱلْكَٰفِرِينَ } [البقرة: 19] الساترين بذواتهم في زعمهم الفاسد ذات الله، غافلين عن تجلياته، وكيف يغفلون عنها؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أو } للتنويع، أو بمعنى الواو، و { الصيب }: المطر، فَيْعِلٌ، من صاب المطر إذا نزل، وهو على حذف مضاف، أي: أو كذي صيب، وأصله: صيوب، كسيد، قلبت الواو ياء وأدغمت، ولا يوجد هذا إلا في المعتل كميت وهين وضيق وطيب",
      "translations": []
    }
  ]
}