{
  "chapter": "البقرة",
  "text": "ثم افيضوا۟ من حيث افاض الناس واستغفروا۟ الله ان الله غفور رحيم",
  "translations": [
    {
      "translation": "Then move with the crowd impetuously, and pray God to forgive you your sins. God is surely forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then return from where others return and ask Allah's forgiveness. Most surely He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then leave Mash'ar as the rest of the people do and ask forgiveness from God; He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, O people of Quraish, you too must return from the place where the people return from, and ask forgiveness from Allah; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place whence all the people depart and ask Allah for His forgiveness. Truly, Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hasten on from the Place from which the people hasten on and ask the forgiveness of Allah; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then press on from where the people press on, and pray for God's forgiveness; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hasten onward from the place whence the multitude hasteneth onward, and ask forgiveness of Allah. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then press on from where the pilgrims stream forth and ask God's forgiveness. God is ever forgiving and most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then hurry from the place whence the other people have hurried, and ask forgiveness of Allah, verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then stream out from where the people stream out, and plead to Allah for forgiveness; indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then pass on at a quick pace from the place whence it is usual for the multitude so to do, and ask for Allah's forgiveness. For Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place whence all the people depart and ask Allah for His Forgiveness. Truly, Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surge on from where the people surge and ask Allah for forgiveness. He is Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then disperse from where the people disperse, and ask God for forgiveness. God is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then depart from the place from where [all] the people depart and ask forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:199] Then (thumma denotes the sequence intended) press on, O Quraysh, from where the people press on, that is, from ‘Arafa, by standing there together with them (for, they used to stand at Muzdalifa, disdaining to stand with other people); and seek God’s forgiveness, for your sins; God is Forgiving, Merciful, to the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then hasten onward from the place whence the multitude hasteneth onward) He says: return from whence the people of Yemen have returned, (and ask forgiveness of Allah) for your sins. (Lo! Allah is Forgiving) of those who repent, (Merciful) towards those who die in a state of repentance. This was revealed about a group of people called the \"Hamsiyyun\" who did not want to press on from the Inviolable Place of Worship to 'Arafat during their pilgrimage. Allah warned them against this, commanding them to go to 'Arafat and then return from there.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ثم أفيضُوا من حيث أفاضَ الناس } ثم أفيضوا إلى ظواهر العبادات والطاعات وسائر وظائف الشرعيات والمعاملات من حيث، أي: من مقام إفاضة سائر الناس فيها، وكونوا كأحدهم\n قيل لجنيد رحمة الله عليه: ما النهاية؟ قال: الرجوع إلى البداية\n { واسْتَغفروا الله } من ظهور النفس وتبرمها بالحال وطغيانها\n قال النبي صلى الله عليه وسلم:\n\n \" إنه ليغان على قلبي، وإني لأستغفر الله في اليوم سبعين مرة \" \n\nوقال صلى الله عليه وسلم:\n\n \" اللهم ثبتني على دينك \" \n\n، فقيل له في ذلك فقال صلى الله عليه وسلم:\n\n \" أو ما يؤمنني، إنّ مثل القلب كمثل ريشة في فلاة، تقلّبها الرياح كيف شاءت \"\n \n\n\n\n \" ولما تورّمت قدماه فقالت له عائشة رضي الله عنها: أما غفر لك الله ما تقدم من ذنبك وما تأخر؟ قال صلى الله عليه وسلم: \" أفلا أكون عبداً شكوراً \" \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما تم توجهكم ووقوفكم بعرفة الذات وتحققكم بها { أَفِيضُواْ } منها { مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ } إلى المرابت المترتبة إلى الصفات { وَٱسْتَغْفِرُواْ ٱللَّهَ } المحيط بكم فيها { إِنَّ ٱللَّهَ غَفُورٌ } ساتر لرتبكم وتعيناتكم { رَّحِيمٌ } [البقرة: 199] لكم بإيصالكم إلى مبدئكم الأصلي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكانت قريش لا تقف مع الناس ترفعاً عليهم، بل تقف بالمزدلفة، فأمرهم الحق جلّ جلاله بالوقوف مع الناس، فقال لهم: { ثم أفيضوا } يا معشر قريش { من حيث أفاض الناس } بأن تَقْضُوا معهم، وتفيضوا من حيث أفاضوا، { واستغفروا الله } في تغييركم مناسك إبراهيم وإسماعيل - عليهما السلامَ - { إن الله غفور } لكم، { رحيم } بكم إن تبتم ورجعتم واتبعتم رسولكم",
      "translations": []
    }
  ]
}