{
  "chapter": "البقرة",
  "text": "ليس عليكم جناح ان تبتغوا۟ فضلا من ربكم فاذا افضتم من عرفت فاذكروا۟ الله عند المشعر الحرام واذكروه كما هدىكم وان كنتم من قبله لمن الضالين",
  "translations": [
    {
      "translation": "It is no sin to seek the favours of your Lord (by trading). When you start from 'Arafat in a concourse, remember God at the monument that is sacred (al-Mash'ar al-haram), and remember Him as He has shown you the way, for in the olden days you we're a people astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is nothing wrong if you also seek the bounty of your Lord during the pilgrimage. Moreover, when you return from 'Arafat, stay at Mash'aril-Haram (Muzdalifah) and remember Allah. And remember Him just as He has enjoined you, for you had gone astray before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not a sin if you try to make a profit out of the bounty of your Lord (by trading during hajj). When you leave Arafah, commemorate the name of your Lord in Mash'ar, the sacred reminder of God. Commemorate His name as He has given you guidance while prior to that you had been in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin for you that you seek the bounty of your Lord; so when you return from Arafat, remember Allah near the Sacred Symbol (Mash’ar al Haram) – and remember Him in the manner He has guided you; and indeed, before this, you were of the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you if you seek the bounty of your Lord (during pilgrimage by trading). Then when you leave `Arafat, remember Allah (by glorifying His praises, i.e., prayers and invocations) at the Mash`ar-il-Haram. And remember Him (by invoking Allah for all good) as He has guided you, and verily you were before, of those who were astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you in seeking bounty from your Lord, so when you hasten on from \"Arafat\", then remember Allah near the Holy Monument, and remember Him as He has guided you, though before that you were certainly of the erring ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no fault in you, that you should seek bounty from your Lord; but when you press on from Arafat, then remember God at the Holy Waymark, and remember Him as He has guided you, though formerly you were gone astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no sin for you that ye seek the bounty of your Lord (by trading). But, when ye press on in the multitude from 'Arafat, remember Allah by the sacred monument. Remember Him as He hath guided you, although before ye were of those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will be committing no sin if [during the pilgrimage] you seek to obtain any bounty from your Lord. When you return from Arafat, remember God at the sacred place, and remember Him as He has guided you. Before this you were surely astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No fault it is in you if ye seek grace from your Lord. Then when ye hurry from Arafat, remember Allah near the sacred monument. Remember Him as He hath guided you, and ye were afore of the erring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin upon you in seeking your Lord’s bounty [during the hajj season]. Then when you stream out of ‘Arafat remember Allah at the Holy Mash‘ar, and remember Him as He has guided you, and earlier you were indeed among the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no crime in you if ye seek of the bounty of your Lord (during pilgrimage). Then when ye pour down from (Mount) Arafat, celebrate the praises of Allah at the Sacred Monument, and celebrate His praises as He has directed you, even though, before this, ye went astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin on you if you seek the Bounty of your Lord (during pilgrimage by trading, etc.). Then when you leave 'Arafat, remember Allah (by glorifying His Praises, i.e. prayers and invocations, etc.) at the Mash'ar-il-Haram. And remember Him (by invoking Allah for all good, etc.) as He has guided you, and verily, you were, before, of those who were astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be no offense for you to seek the bounty of your Lord. When you surge on from Arafat, remember Allah as you approach the Holy Mountain of Mash'ar. Remember Him as it is He who guided you though before that you were amongst the astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You commit no error by seeking bounty from your Lord. When you disperse from Arafat, remember God at the Sacred Landmark. And remember Him as He has guided you. Although, before that, you were of those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon you for seeking bounty from your Lord [during Hajj]. But when you depart from 'Arafat, remember Allah at al- Mash'ar al-Haram. And remember Him, as He has guided you, for indeed, you were before that among those astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:198] You would not be at fault if you should seek bounty, sustenance, from your Lord, by engaging in commerce at the Pilgrimage: this was revealed in response to their aversion to such an idea; but when you press on, push on, from ‘Arafāt, having stood [in prayer] upon it, then remember God, after the overnight stay at Muzdalifa, by repeating the talbiya [sc. labbayka Llāhummā labbayk, ‘at thy service, O God, at thy service’], the tahlīl [lā ilāha illā Llāh, ‘no god but God’] and making supplications, at the Sacred Waymark, a mountain at the end of Muzdalifa, called Quzah. In one hadīth, the Prophet (s) stood there remembering God and supplicating until his face began to glow brightly, according to Muslim; and remember Him as He has guided you, to the principal rites of His religion and the rituals of His Pilgrimage (the kāf of ka-mā, ‘as’, is the particle denoting the reason), though previously, before His guidance, you were astray.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is no sin) there is no constraint (for you that ye seek the bounty of your Lord (by trading)) by engaging in trade in the Sacred Precinct. This was revealed about a group of people who were against buying and selling in the Sacred Precinct, and so legal dispensation was given to allow it. (But, when you press on in the multitude from 'Arafat) when you return from 'Arafat to the Sacred monument, (remember Allah) with your heart and tongue (by the Sacred monument. Remember Him as He hath guided you, although before) before Muhammad (pbuh) the Qur'an and Islam (ye were of the astray) among the unbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ } قالَ زيدُ بن علي عليهما السَّلامُ: فالفَضلُ ها هنا: التِجَارَةُ\n\n\n\n\nوقولهُ تعالى: { فَإِذَآ أَفَضْتُم مِّنْ عَرَفَٰتٍ } قالَ زيدُ بن علي عليهما السَّلامُ: الإِفاضةُ: الإِسرَاعُ فِي السَّيرِ، يُريدُ رَجَعتُمْ مِنْ حَيثُ جِئتُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ليس عليكم جناحٌ أن تَبْتغوا فضلاً من ربّكم } أي: لا حرج عليكم عند الرجوع إلى الكثرة في أن تطلبوا رفقاً لأنفسكم وتمتعوها بحظوظها على مقتضى الشرع بإذن الحق، فإنّ حظها حينئذ يقويها على موافقة القلب في مقاصده ولأنها غير طاغية لتنوّرها بنور الحق { فإذا أفضتم } أي: دفعتم أنفسكم من مقام المعرفة التامة الذي هو نهاية مناسك الحج وأمّها كما قال النبي صلى الله عليه وسلم:\n\n \" الحجّ عرفة \" \n\n{ فاذكروا الله عند المشْعر الحرام } أي: شاهدوا جمال الله عند السرّ الروحيّ المسمّى بالخفيّ، فإنّ الذكر في هذا المقام هو المشاهدة، والمشْعر هو محل الشعور بالجمال المحرّم من أن يصل إليه الغير { واذكروه كما هَدَاكم } إلى ذكره في المراتب فإنه تعالى هدى أولاً إلى الذكر باللسان وهو ذكر النفس ثم إلى الذكر بالقلب وهو ذكر الأفعال الذي تصدر نعماء الله وآلاؤه منه\n ثم ذكر السرّ وهو معاينة الأفعال ومكاشفة علوم تجليات الصفات\n ثم ذكر الروح وهو مشاهدة أنوار تجليات الصفات مع ملاحظة نور الذات\n ثم ذكر الخفيّ وهو مشاهدة جمال الذات مع بقاء الإثنينية\n ثم ذكر الذات وهو الشهود الذاتي بارتفاع البقية { وإن كنتم من قَبْله } أي: من قبل الوصول إلى عرفات المعرفة والوقوف بها { لمن الضالِين } عن هذه الأذكار",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ }  قلت: { أن تبتغوا }: على إسقاط حرف الجر، أيْ: في أن تبتغوا، وسبب نزول الآية: أن عُكاظاً ومَجَنّة وذا المجاز - أسماء مواضع - كانت أسواقاً في الجاهلية يعمرونها في مواسم الحج، وكانت معايشهم منها، فلما جاء الإسلام تأثَّمُوا وتحرجوا أن يتجروا فيها، فقال لهم الحقّ جلّ جلاله: { ليس عليكم جناح } أي: إثم أو ميل عن الصواب، في { أن تبتغوا فضلاً من ربكم } أي: عطاء ورزقاً تستفيدونه من التجارة في مواسم حجكم، إذا خلَصَتْ نيتكم، وغلب قصدُ الحج على التجارة\n وها هنا قاعدةٌ ذكرها الغزالي في الإحياء وحاصلها: أن العمل إذا تمحَّض لغير الله فهو سبب المقت والعقاب، وإذا تمحض الله خالصاً فهو سبب القرب والثواب، وإذا امتزج بشوْب من الرياء أو حظوظ النفس فينظر إلى الغالب وقوة الباعث فإن كان باعث الحظ أغلب، سقط، وكان إلى العقوبة أقرب، لكن عقوبته أخف ممن تجرد لغير الله، وإن كان باعث التقرب أغلب، حُط منه بقدر ما فيه من باعث الحظ، وإن تساوي تقاوماً وتساقطاً وصار العمل لا له ولا عليه\n ثم قال: ويشهد لهذا إجماعُ الأمة على أن مَنْ خرج حاجّاً ومعه تجارة صحَّ حجه وأُثيب عليه\n ثم قال: والصواب أنْ يقال: مهما كان الحج هو المحرّك الأصلي، وكان غرضُ التجارة كالتابع، فلا ينفك نفس السفر عن ثواب، ثم طُرِّد هذا الاعتبار في الجهاد باعتبار الغنيمة، يعني: يُنْظر لغالب الباعث وخُلوص القصد، وكذلك الصوم للحِمْية والثواب، ينظر لغالب الباعث\n قلت: وتطَّرد هذه القاعدة في المعاملات كلها، وجميع الحركات والسكنات والحِرَف وسائر الأسباب، فالخالص من الحظوظ مقبول، والمتمحض للحظوظ مردود، والمَشُوب يُنظر للغالب كما تقدم\n وقد ذكر شيه المشايخ سيدي أبو الحسن الشاذلي رضي الله عنه قاعدة أخرى أدقّ من هذه فقال: إذا أكرم الله عبداً في حركاته وسكناته، نصَب له العبودية لله وستر عنه حظوظ نفسه، وجعله يتقلّب في عبوديته، والحظوظ عنه مستورة، مع جَرْي ما قُدِّر له، ولا يلتفت إليها لأنها في معزل عنه، وإذا أهان الله عبداً في حركاته وسكناته، نصب له حظوظ نفسه، وستر عنه عبوديته، فهو يتقلّب في شهواته، وعبودية الله عنه بمعزلِ، وإن كان يجري عليه شيء منها في الظاهر، قال: وهذا باب من الولاية والإهانة\n وأما الصِّدِّيقية العظمى، والولاية الكبرى، فالحظوظ والحقوق كلها سواء عند ذوي البصيرة لأنه بالله فيما يأخذ ويترك\n هـ\n الإشارة: العبد لا يستغني عن طلب الزيادة، ولو بلغ من الكمال غاية النهاية، فالقناعة من الله حرمان، واعتقاد بلوغ النهاية نقصان، فليس عليكم جناح أيها العارفون أن تبتغوا فضلاً من ربكم زيادة في إيقانكم، وترَقِّياً في معانيكم، إذ كمالات الحق لا نهاية لها، وأسرار الذات لا إحاطة بها، قال تعالى:\n\n\n\n[طه: 110]\n والله وليّ التوفيق\n ثم ذكر الحقّ تعالى الوقوف بعرفة، والرجوع إلى المزدلفة والمشعر الحرام، فقال: {\n\n\nفَإِذَآ أَفَضْتُم مِّنْ عَرَفَاتٍ فَٱذْكُرُواْ ٱللَّهَ عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ وَٱذْكُرُوهُ كَمَا هَدَاكُمْ وَإِن كُنْتُمْ مِّن قَبْلِهِ لَمِنَ ٱلضَّآلِّينَ ثُمَّ أَفِيضُواْ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُواْ ٱللَّهَ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ فَإِذَا قَضَيْتُمْ مَّنَاسِكَكُمْ فَٱذْكُرُواْ ٱللَّهَ كَذِكْرِكُمْ آبَآءَكُمْ أَوْ أَشَدَّ ذِكْراً\n\n\n }  قلت: { أفضتُم }: دفعتم، وأصل الإفاضة: الدفع بقوة، من فاض الماء إذا نبَع بقوة، ثم استُعمل في مطلق الاندفاع على سبيل المبالغة\n و { عرفات } فيه الصرف وعدمه، كأذرعات\n وسمى عرفات لقول إبراهيم الخليل عليه السلام لجبريل حين علَّمه المناسك: قد عرفتُ: أو لمعرفة آدم حواءَ فيها\n والكاف في { كما هداكم } تعليلية، و { ما } مصدرية، أي: واذكروه لأجل هدايته لكم\n و { إن كنتم } مخففة، واللام فارقة، وقوله: { أو أشد } نعت لمصدر محذوف، أي: أو ذكراً أشد\n\n\n الخ\n يقول الحقّ جلّ جلاله: فإذا وقفتم بعرفة، وأفضتم منها، فانزلوا المزدلفة وبيِتُوا بها، فإذا صليتم الصبح بغلس فقفوا عند { المشعر الحرام } ، وهو جبل في آخر المزدلفة، واذكروا الله عنده بالتهليل والتكبير والتلبية إلى الإسفار، هكذا فعل الرسول - عليه الصلاة والسلام -، { واذكروه } لأجل ما هداكم إليه من معالم دينه ومناسك حجه، وغير ذلك من شعائر الدين، أو فاذكروه ذكراً حسناً هداكم هداية حسنة، وقد كنتم من قبل هذه الهداية { لمن الضالين }",
      "translations": []
    }
  ]
}