{
  "chapter": "البقرة",
  "text": "وقتلوا۟ فى سبيل الله الذين يقتلونكم ولا تعتدوا۟ ان الله لا يحب المعتدين",
  "translations": [
    {
      "translation": "Fight those in the way of God who fight you, but do not be aggressive: God does not like aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah with those who fight against you but do not commit aggression because AIIah does not like aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight for the cause of God, those who fight you, but do not transgress, for God does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in Allah's cause against those who fight you and do not exceed the limits; and Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah those who fight you, but transgress not the limits. Truly, Allah likes not the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah with those who fight with you, and do not exceed the limits, surely Allah does not love those who exceed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of God with those; who fight with you, but aggress not: God loves not the aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah against those who fight against you, but begin not hostilities. Lo! Allah loveth not aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in God's cause against those who wage war against you, but do not commit aggression -- for surely, God does not love aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah those who fight you, and transgress not; verily Allah loveth not the transgressors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah those who fight you, but do not transgress. Indeed Allah does not like transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the cause of Allah those who fight you, but do not transgress limits; for Allah loveth not transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the Way of Allah those who fight you, but transgress not the limits. Truly, Allah likes not the transgressors. [This Verse is the first one that was revealed in connection with Jihad, but it was supplemented by another (V. 9:36)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah those who fight against you, but do not aggress. Allah does not love the aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the cause of God those who fight you, but do not commit aggression; God does not love the aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah those who fight you but do not transgress. Indeed. Allah does not like transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:190] After the Prophet (s) was prevented from [visiting] the House in the year of the battle of Hudaybiyya, he made a pact with the disbelievers that he would be allowed to return the following year, at which time they would vacate Mecca for three days. Having prepared to depart for the Visitation [‘umra], [he and] the believers were concerned that Quraysh would not keep to the agreement and instigate fighting. The Muslims were averse to becoming engaged in fighting while in a state of pilgrimage inviolability in the Sacred Enclosure [al-haram] and during the sacred months, and so the following was revealed: And fight in the way of God, to elevate His religion, with those who fight against you, the disbelievers, but aggress not, against them by initiating the fighting; God loves not the aggressors, the ones that overstep the bounds which God has set for them: this stipulation was abrogated by the verse of barā’a, ‘immunity’ [Q. 9:1], or by His saying [below]:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Fight in the way of Allah) in obedience of Allah whether in the Sacred Precinct or in other places (against those who fight against you) against those who initiate fight against you, (but begin not hostilities. Lo! Allah loveth not aggressors) He does not love those who initiate fighting whether in the Sacred Precinct or in other locations.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الحدود الموضوعة فيكم: القتال مع أعداء دينكم { قَاتِلُواْ فِي سَبِيلِ ٱللَّهِ } مع المشركين المعرضين عن طريق الحق، المائلين عنه تعنتاً واستكباراً وخصوصاً مع { ٱلَّذِينَ يُقَاتِلُونَكُمْ } ويقصدون استئصالكم بادين للقتال مجترئين عليها { وَلاَ تَعْتَدُوۤاْ } ولا تتجاوزوا أيها المؤمنون عما نهيتم عنه من قتل المعاهد، والفجر والاقتحام فجأة، والمقاتلة في الحرم وفي الشهور المحرمة، والابتداء بالمقاتلة وغير ذلك { إِنَّ ٱللَّهَ لاَ يُحِبُّ ٱلْمُعْتَدِينَ } [البقرة: 190] المتجاوزين عن الحدود والعهود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { التهلكة }: مصدر هلك - بتشديد اللام - قاله ابن عطية\n وضمن { تُلْقُوا } معنى تفضوا، أو تنتهوا، فعدَّاه بإلى، أي: ولا تفضوا بأنفسكم إلى التهلكة\n ولا يحتاج إلى زيادة الباء\n وسبب نزول الآية: أن المشركين صَدُّوا رسول الله صلى الله عليه وسلم عام الحديبية، وصالحوه على أن يرجع في قابل، فيخلوا له البيت ثلاثة أيام، فرجع لعمرة القضاء، وخاف المسلمون ألا يفوا لهم، فيقاتِلُوا في الحرم والشهر الحرام، وكرهوا ذلك، فنزلت الآية\n يقول الحقّ جلّ جلاله: { وقاتلوا في سبيل الله } وإعلاء كلمته { الذين يقاتلونكم } أي: يبدءونكم بالقتال، { ولا تعتدوا } فتقاتلوهم قبل أن يبدءوكم، { إن الله لا يحب المعتدين } لا ينصرهم ولا يؤيدهم\n ثم نسخ هذا بقوله:\n\n[التوبة: 36] الآية",
      "translations": []
    }
  ]
}