{
  "chapter": "البقرة",
  "text": "ذلك الكتب لا ريب فيه هدى للمتقين",
  "translations": [
    {
      "translation": "This is The Book free of doubt and involution, a guidance for those who preserve themselves from evil and follow the straight path,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book of Allah: there is no doubt about it. It is guidance to Godfearing people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt that this book is a guide for the pious;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the exalted Book (the Qur’an), in which there is no place for doubt; a guidance for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Book in which there is no Rayb, guidance for the Muttaqin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book, there is no doubt in it, is a guide to those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Book, wherein is no doubt, a guidance to the godfearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Scripture whereof there is no doubt, a guidance unto those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book; there is no doubt in it. It is a guide for those who are mindful of God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book whereof there is no doubt, is a guidance unto the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book, there is no doubt in it, a guidance to the Godwary,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book; in it is guidance sure, without doubt, to those who fear Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book (the Quran), whereof there is no doubt, a guidance to those who are Al-Muttaqun [the pious and righteous persons who fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the (Holy) Book, where there is no doubt. It is a guidance for the cautious (of evil and Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book in which there is no doubt, a guide for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Book about which there is no doubt, a guidance for those conscious of Allah -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:2] That, meaning, this, Book, which Muhammad (s) recites, in it there is no doubt, no uncertainty, that it is from God (the negation [lĀ rayba fĪhi] is the predicate of dhĀlika; the use of the demonstrative here is intended to glorify [the Book]). A guidance (hudĀ is a second predicate, meaning that it [the Book] ‘guides’), for the God-fearing, namely, those that tend towards piety by adhering to commands and avoiding things prohibited, thereby guarding themselves from the Fire;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is the Scripture), i.e. this is the Book that Muhammad (pbuh) is reciting to you; (whereof there is no doubt). There is no doubt that it has come from Me; if you believe in it, I shall guide you, but if you do not believe in it, I will torment you. It is also said that (This is the Scripture) refers to the Guarded Tablet. It is also said that this means: This is the Book that I promised to reveal to you on the Day of the Covenant (yawm al-mithaq). It is also said (this is the Scripture whereof there is no doubt) means there is no doubt that the description and traits of Muhammad are found in the Torah and Gospel. (A guidance unto those who ward off (evil)), means that the Qur'an is an exposition for those who ward off disbelief, associating partners with Allah and indecencies. It is also said that it means: it is a favour to the believers; or that it means it is a mercy unto those who ward off evil from among the community of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { ذَلِكَ ٱلْكِتَابُ } معناه هذا الكتابُ\n\n\n\n\nوقولهُ تعالى: { لاَ رَيْبَ فِيهِ } معناه لا شَكَّ فِيهِ\n والرَّيبُ أَيضاً: السّوءُ\n\n\n\n\nوقولهُ تعالى: { هُدًى لِّلْمُتَّقِينَ } فالهُدى: البَيانُ\n والمتَّقونَ: المُطيعونَ الخَاشِعونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا ريْبَ فيه } عند التحقيق بأنه الحق، وعلى تقدير القول معناه بالحق الذي هو الكلّ من حيث هو كلّ لأنه مبين لذلك الكتاب الموعود على ألسنة الأنبياء وفي كتبهم بأنه سيأتي كما قال عيسى عليه السلام: \" نحن نأتيكم بالتنزيل، وأما التأويل فسيأتي به المهديّ في آخر الزمان \"\n وحذف جواب القسم لدلالة ذلك الكتاب عليه، كما حذف في غير موضع من القرآن مثل والشمس والنازعات وغير ذلك\n أي إنّا منزلون لذلك الكتاب الموعود في التوراة والإنجيل بأن يكون مع محمد حذف لدلالة قوله: { ذلك الكتاب } عليه أي: ذلك الكتاب المعلوم في العلم السابق، الموعود في التوراة والإنجيل حق بحيث لا مجال للريب فيه\n { هُدًى للمُتقينَ } أي هدى في نفسه للذين يتقون الرذائل والحجب المانعة لقبول الحق فيه\n واعلم أن الناس بحسب العاقبة سبعة أصناف لأنهم: إمّا سعداء، وإمّا أشقياء\n قال الله تعالى:\n\n[هود، الآية: 105]، والأشقياء أصحاب الشمال، والسعداء إمّا أصحاب اليمين، وإمّا السابقون المقرّبون\n قال الله تعالى:\n\n[الواقعة، الآية: 7] الآية\n وأصحاب الشمال إمّا المطرودون الذين حقّ عليهم القول وهم أهل الظلمة والحجاب الكلي المختوم على قلوبهم أزلاً، كما قال تعالى:\n\n[الأعراف، الآية: 179] إلى آخر الآية\n وفي الحديث الربانيّ:\n\n \" هؤلاء خلقتهم للنار ولا أبالي \" \n\nوأما المنافقون الذين كانوا مستعدّين في الأصل، قابلين للتنوّر بحسب الفطرة والنشأة، ولكن احتجبت قلوبهم بالرين المستفاد من اكتساب الرذائل وارتكاب المعاصي، ومباشرة الأعمال البهيمية، والسبعية، ومزاولة المكايد الشيطانية، حتى رسخت الهيئات الفاسقة والملكات المظلمة في نفوسهم، وارتكمت على أفئدتهم فبقوا شاكين حيارى تائهين، قد حبطت أعمالهم، وانتكست رؤوسهم فهم أشدّ عذاباً وأسوأ حالاً من الفريق الأول لمنافاة مسكة استعدادهم لحالهم\n والفريقان هم أهل الدنيا وأصحاب اليمين\n أما أهل الفضل والثواب، الذين آمنوا وعملوا الصالحات للجنة راجين لها، راضين بها، فوجدوا ما عملوا حاضراً على تفاوت درجاتهم، ولكلّ درجات مما عملوا\n ومنهم أهل الرحمة الباقون على سلامة نفوسهم، وصفاء قلوبهم، المتبوئون درجات الجنة على حسب استعداداتهم من فضل ربهم، لا على حسب كمالاتهم من ميراث عملهم\n وأما أهل العفو الذين خلطوا عملاً صالحاً وآخر سيئاً، وهم قسمان: المعفوّ عنهم رأساً لقوة اعتقادهم، وعدم رسوخ سيئاتهم لقلّة مزاولتهم إياها، أو لمكان توبتهم عنها\n فأولئك يبدّل الله سيئاتهم حسنات، والمعذبون حيناً بحسب ما رسخ فيهم من المعاصي حتى خلصوا عن درن ما كسبوا، فنجوا وهم أهل العدل والعقاب، والذين ظلموا من هؤلاء سيصيبهم سيئات ما كسبوا\n لكن الرحمة تتداركهم وثلاثتهم أهل الآخرة\n والسابقون إمّا محبون وإمّا محبوبون، فالمحبون هم الذين جاهدوا في الله حقّ جهاده، وأنابوا إليه حقّ إنابته، فهداهم سبله\n\n\nوالمحبوبون هم أهل العناية الأزلية الذين اجتباهم وهداهم إلى صراط مستقيم\n والصنفان هما أهل الله، فالقرآن ليس هدًى للفريق الأول من الأشقياء لامتناع قبولهم للهداية لعدم استعدادهم، ولا للثاني لزوال استعدادهم ومسخهم وطمسهم بالكلية بفساد اعتقادهم، فهم أهل الخلود في النار إلا ما شاء الله\n فبقي هدى للخمسة الأخيرة الذين يشملهم المتقون، والمحبوب يحتاج إلى هداية الكتاب بعد الجذب والوصول لسلوكه في الله لقوله تعالى لحبيبه:\n\n[الفرقان، الآية: 32]، وقوله:\n\n[هود، الآية: 120]\n والمحبّ يحتاج إليه قبل الوصول والجذب وبعده لسلوكه إلى الله وفي الله\n فعلى هذا، المتقون في هذا الموضع هم المستعدّون الذين بقوا على فطرتهم الأصلية، واجتنبوا رين الشرك والشك لصفاء قلوبهم وزكاء نفوسهم، وبقاء نورهم الفطري، فلم ينقضوا عهد الله\n وهذه التقوى مقدّمة على الإيمان، ولها مراتب أخرى متأخرة عنه كما سيأتي إن شاء الله\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ ٱلْكِتَابُ } الذي لا يأتيه الباطل من بين يديه ولا من خلفه، المتعبد درجة كماله عن إفهام الجامع مراتب الأسماء والصفات في عالم الغيب والشهادة، المنزل على مرتبتك يا أكمل الرسل، الجامعة لجميع مراتب الكائنات من الأزل إلى الأبد بحيث لا يشذ عنها مرتبة أصلاً { لاَ رَيْبَ فِيهِ } بأنه منزل من عندنا لفظاً ومعنى:\n\n\n\nأمَّا لفظاً: فلعجز جماهير البلغاء ومشاهير الفصحاء عن معارضة أقصر آية منه مع وفور دواعيهم\n\n\n\n\nوأمَّا معنى: فلا شتماله على جميع أحواله الحقائق العينية والأسرار الغيبية مما كان وسيكون في النشأتين، ولا يتيسر الاطلاع عليها والإتيان بها على هذا النمط البديع إلا لمن هو علام الغيوب\n\n\n\n\nوإنما أنزلناه إليك أيها اللائق لأمر الرسالة والنيابة، لتهتدي به أنت إلى بحر الحقيقة، وتهدي به أيضاً من تبعك من التائهين في بيداء الضلالة؛ إذ فيه { هُدًى } عظيم { لِّلْمُتَّقِينَ } [البقرة: 2] الذين يحفظون بامتثال أوامره واجتناب نواهيه نفوسهم عن خبائث المعاصي المانعة من الطهارة الحقيقية والوصول إلى المرتبة الإصلية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ذّلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ\n\n\n }  قلت: الريب: تحرُّك القلب واضطرابه بالشكوك والأوهام، وتقابله الطمأنينة بالسكون إلى الحق على الدوام\n يقول الحقّ جلَ جلاله: يا أيها الرسول المصطفى والنبيّ المجتبى { ذَلِكَ الْكِتَابُ } الذي أنزلناه عليه من جبروت قدسنا وملكوت عزِّنا { لا رَيْبَ فِيهِ } أنه من عندنا\n فمن ارتاب فيه، أو نسبه إلى غيرنا، فقد استحق البعد من ساحة رحمتنا، وحلّت عليه شدائد نقمتنا، ومن تحقق به أنه من لدنا، وآمن بمن جاء به من عندنا، فقد استحق دخول حضرة قدسنا حتى يسمع منا ويتكلم بنا، فإذا أحببته كنت له، فبي يسمع، وبي يبصر، وبي يتكلم\n\n\n الحديث\n فيكون من الصديقين المقربين مع النبيين والمرسلين، وكان في ذروة درجات المتقين، الذين يهتدون بهدي القرآن المبين، كما أشار إلى ذلك بقوله: {\n\n\n هُدىً لِّلْمُتَّقِينَ } قلت: { هدى } خبر عن مبتدأ مضمر، أو مبتدأ بتقديم الخبر\n أي: هو هاد للمتقين، أو فيه الهدى لهم\n والهدى: هو الإرشاد والبيان، ومعناه: الدلالة الموصلة إلى الحق\n والمتقي: من جعل بينه وبين مقت الله وقاية، وله ثلاث درجات: * حفظ الجوارح من المخالفات، * وحفظ القلوب من المساوئ والهفوات، * وحفظ السرائر من الوقوف مع المحسوسات، فالأولى لمقام الإسلام، وإليه توجه الخطاب بقوله:\n\n[التّغَابُن: 16]، والثانية لمقام الإيمان، وإليه توجه الخطاب بقوله:\n\n[المَائدة: 100]، والثالثة لمقام الإحسان، وإليه توجه الخطاب بقوله:\n",
      "translations": []
    }
  ]
}