{
  "chapter": "البقرة",
  "text": "ومن الناس من يشرى نفسه ابتغاء مرضات الله والله رءوفۢ بالعباد",
  "translations": [
    {
      "translation": "And there is a man who is willing to sell even his soul to win the favour of God; and God is compassionate to His creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the other side, there is another type of man who devotes his whole life to please Allah, and Allah is gracious to such of His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are those among people who give their lives to seek God's pleasure. God is Affectionate to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is one who sells himself to seek the pleasure of Allah; and Allah is Most Compassionate towards the bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who would sell himself, seeking the pleasure of Allah. And Allah is full of kindness to (His) servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he who sells himself to seek the pleasure of Allah; and Allah is Affectionate to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But other men there are that sell themselves desiring God's good pleasure; and God is gentle with His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who would sell himself, seeking the pleasure of Allah; and Allah hath compassion on (His) bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are others who would dedicate themselves to seeking the pleasure of God. God is compassionate to His servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who selleth his life even, seeking the pleasure of Allah; and Allah is Tender unto His bond men\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people is he who sells his soul seeking the pleasure of Allah, and Allah is most kind to [His] servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is the type of man who gives his life to earn the pleasure of Allah: And Allah is full of kindness to (His) devotees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he who would sell himself, seeking the Pleasure of Allah. And Allah is full of Kindness to (His) slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are among people he who would give away his life desiring the Pleasure of Allah. Allah is Gentle to His worshipers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people is he who sells himself seeking God’s approval. God is kind towards the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he who sells himself, seeking means to the approval of Allah. And Allah is kind to [His] servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:207] But there are other men who sell themselves, expend themselves in obedience to God, desiring God’s pleasure: this was Suhayb [b. Sinān al-Rūmī], who emigrated to Medina when the idolaters began to persecute him, leaving them all his property; and God is Gentle with His servants, for He guides them to what pleases Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of mankind is he who would sell himself) with his wealth, (seeking the pleasure of Allah) in pursuit of Allah's pleasure. This was revealed about Suhayb Ibn Sinan and his companions. He ransomed himself from the Meccans with his money; (and Allah hath compassion on (His) bondmen) those who were killed in Mecca. This was revealed about the parents of 'Ammar Ibn Yasir (Yasir and Sumayyah) and others who were killed by the Meccan idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَمِنَ ٱلنَّاسِ مَن يَشْرِي نَفْسَهُ } معناهُ يَبيعُهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأيضاً من جملة الآداب الموضوعة فيكم بل من أجلها: الرضا والتسليم بما جاء من قضاء الله ومقتضياته، لذلك قال: { وَمِنَ ٱلنَّاسِ } المتشمرين إلى الله بالرضاء والتسليم { مَن يَشْرِي نَفْسَهُ } ويوقعها في المهلكة لا لداعية تنبعث من نفسها، بل { ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ } طالباً لرضائه، راضياً بما قضاه { وَٱللَّهُ } المحيط بجميع الحالات { رَؤُوفٌ } عطوف مشفق { بِٱلْعِبَادِ } [البقرة: 207] الصابرين في البلوى الطائعين إلى المولى، الراضين بما يحب ويرضى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ونزل في مقابله، وهو صهيب، أو كل من بذل نفسه لله: { ونم الناس من يشري نفسه } أي: يبيعُها ويبذلها لله في الجهاد وغيره، { ابتغاء مرضات الله } والوصول إلى حضرته { والله رؤوف بالعباد } الذين يفعلون مثل هذا، فيدرأ عنهم المضَارّ، ويجلبُ لهم المَسَار أينما حَلُّوا من الدارين\n الإشارة: الناس على قسمين: قسم زَيّنُوا ظواهرهم وخرَّبوا بواطنهم، وظاهرهم جميل وباطنُهم قبيح، إذا تكلموا في الدنيا أو في الحس، أعجبَك قولهم، وراقك منظرُهم، وإذا تكلموا في الآخرة، أو في المعنى، أخذتهم الحبْسةُ والدهشة\n وفي بعض الكتب المنزلة: \" إنَّ مِنْ عِبَاد الله قوماً ألْسنَتُهُم أحْلَى منَ العَسَلِ، وَقُلُوبُهُمْ أمرّ مِنْ الصَّبْرِ، يَلْبَسُونَ للنَّاس جُلُودَ الضَّأنِ مِن اللِّينِ، يَجْتَرُّون الدُّنْيَا بالدين، يَقُولُ الله تعالى: أبِي يَغْتَرُّونَ، وعليَّ يَجْترِئُون؟ حَلَفتْ لأُسلطنَّ عليهمْ فتْنةٌ تَدَعُ الْحَليم مِنْهُمْ حَيْرَانَ \"\n\n\nوقوله: { يلبسون\n\n\n } الخ\n كناية عن إظهار اللين والسهول ليخدع ويغر الناس ليتوصل إلى حظ نفسه من الدنيا، ومع ذلك يدعي موافقة ظاهره لباطنه، وهو شديد الخصومة لأهل الله، وإذا تولى عنك اشتغل بالمعاصي والذنوب، ليُفسد في الأرض، ويهلك الحرث والنسل بشؤم معاصيه، وإذا ذُكِّر: أنِفَ واستكبر، وأخذته حمية الجاهلية، فحسبُه البُعد في نار القطيعة\n والقسم الثاني: قوم زَيَّنوا بواطنهم وخربوا ظواهرهم، عمّروا قلوبهم بمحبة الله، وبذلوا أنفسهم في مرضات الله، قلوبهم في أعلى عليين، وأشباحهم في أسفل سافلين، فأولئك المقربون مع النبيين والمرسلين\n قال بعض العارفين: كلما وضعت نفسك أرضاً أرضاً، سما قلبك سماء سماء، وكل ما نقص من حسك زاد في معناك\n وفي الحديث:\n\n \" مَن تواضعَ دُون قَدْره رَفَعهُ الله فوقَ قَدْره \" \n\nوبالله التوفيق\n\n",
      "translations": []
    }
  ]
}