{
  "chapter": "البقرة",
  "text": "ومنهم من يقول ربنا ءاتنا فى الدنيا حسنة وفى الءاخرة حسنة وقنا عذاب النار",
  "translations": [
    {
      "translation": "But some there are who pray: \"Give us of good in the world, O Lord, and give us of good in the life to come, and suffer us not to suffer the torment of Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there are others who say, \"Our Lord, give us what is good in this world and also what is good in the Hereafter and save us from the torment of Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Others pray, \"Lord, give us good things both in this life as well as in the life hereafter and save us from the torment of fire\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some that say, “Our Lord! Give us good in the world and good in the Hereafter, and save us from the punishment of fire!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who say: \"Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some among them who say: Our Lord! grant us good in this world and good in the hereafter, and save us from the chastisement of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others there are who say, 'Our Lord, give to us in this world good, and good in the world to come, and guard us against the chastisement of the fire';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them (also) is he who saith: \"Our Lord! Give unto us in the world that which is good and in the Hereafter that which is good, and guard us from the doom of Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are others who pray, \"Our Lord, grant us good in this world as well as good in the world to come, and protect us from the torment of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who say: our Lord! vouchsafe unto us good in the world and good in the Hereafter, and save us from the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them there are those who say, ‘Our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of the Fire.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are men who say: \"Our Lord! Give us good in this world and good in the Hereafter, and defend us from the torment of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who say: \"Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there are others who say: 'Lord, give us a merit in the world and good in the Everlasting Life, and save us from the punishment of the Fire'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is he who says, “Our Lord, give us goodness in this world, and goodness in the Hereafter, and protect us from the torment of the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But among them is he who says, \"Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:201] And there are others who say, ‘Our Lord, give to us in this world good, a grace, and good, Paradise, in the Hereafter, and guard us against the chastisement of the Fire’, by not making us enter it. This [former statement] depicts the manner of the idolaters, while [the latter] the way of the believers, and is intended to encourage [people] to petition for good in both abodes, for which one is promised a reward, as He says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them (also) is he who saith: \"Our Lord! Give unto us in the world that which is good) of knowledge, worship, preservation from sins, martyrdom and booty (and in the Hereafter that which is good) Paradise and its bliss, (and guard us from the doom of Fire) drive away from us the torment of the grave and the torment of hell\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { رَبَّنَآ آتِنَا فِي ٱلدُّنْيَا حَسَنَةً } معناهُ عبادةٌ { وَفِي ٱلآخِرَةِ حَسَنَةً } معناهُ الجنةُ\n وقالَ فِي الدّنيا صِحةُ الجسمِ، وسِعةٌ فِي المالِ وفي الآخِرةِ خِفَّةُ الحِسابِ، ودِخُولُ الجنَةِ، ويقالُ: عَافِيةٌ فِي الدّنيا وعافِيةٌ في الآخرةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومنهم من يقول ربنا آتِنا } أي: يطلب خير كل من الدارين ويحترز عن الاحتجاب بالظلمة والتعذب بنيران الطبيعة والحرمان عن أنوار الرحمة { أولئكَ لهم نصيبٌ مما كَسبوا } من حظوظ الآخرة وأنوار دار القرار واللذات الباقية بالأعمال الصالحة بعد المحاسبة وحط بعض الحسنات بالسيئات والتعذيب بحسبها أو العفو\n { واذكرُوا الله في أيام معدوداتٍ } أي: مراتب معدودة بعد الفراغ من الحجّ، وهو مرتبة الروح والقلب والنفس، لأن الواصل إذا رجع، رجع إلى هذه المراتب وعليه في المراتب الثلاث أن يكون بالله فذلك ذكره { فمن تعجّل في يومين فلا إثم عليه } أي: فمن تعجّل إلى حظوظه في مرتبة الروح والقلب فلا إثم عليه إذ الروح والقلب وحظوظهما لا يحجبان ولا يضران",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وِمِنْهُمْ مَّن يَقُولُ } جامعاً بين الظاهر والباطن والأولى والأخرى: { رَبَّنَآ آتِنَا فِي ٱلدُّنْيَا حَسَنَةً } ترضى بها عنا فيها { وَفِي ٱلآخِرَةِ حَسَنَةً } توصلنا إلى توحيدك { وَقِنَا } بلطفك { عَذَابَ ٱلنَّارِ } [البقرة: 201] أي: الإمكان المحوج إلى الذات الوهمية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n \" إن الله يرزق العبد على قدر نيته \" { ومنهم } من أراد كرامة الدنيا وشرف الآخرة { يقول ربنا آتنا في الدنيا } حالة { حسنة } كالمعرفة، والعافية، والمال الحلال، والزوجة الحسنة، وجميع أنواع الجمال، { وفي الآخرة حسنة } كالنظرة، والحُور العين، والقصور، جميع أنواع النعيم، { وقنا عذاب النار } بالعفو والمغفر، وقال سيّدنا عليٍّ - كرَّم الله وجهه -: الحسنة في الدنيا: المرأة الصالحة،، وفي الآخرة: الحَوْرَاء\n وعذاب النار في الدنيا: المرأة السوء وقال الحسن: الحسنة في الدنيا: العلم والعبادة، وفي الآخرة: الجنة\n { وقنا عذاب النار }: احفظنا من الشهوات والذنوب المؤدية إلى النار، وهذه كلها أمثلة للحالة الحسنة",
      "translations": []
    }
  ]
}