{
  "chapter": "البقرة",
  "text": "واذا تولى سعى فى الارض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد",
  "translations": [
    {
      "translation": "For when his back is turned he goes about spreading disorder in the land, destroying fields and flocks; but God does not love disorder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he gets power he directs all his efforts towards spreading mischief in the land, destroying harvests and killing the human race whereas Allah (Whom he makes his witness) does not like mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As soon as they leave you, they quickly commit evil in the land, destroying the farms and people. God does not love evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away, he creates turmoil in the earth and destroys crops and lives; and Allah is not pleased with turmoil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away (from you O Muhammad), his effort in the land is to make mischief therein and to destroy the crops and the cattle, and Allah likes not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns back, he runs along in the land that he may cause mischief in it and destroy the tilth and the stock, and Allah does not love mischief-making.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when he turns his back, he hastens about the earth, to do corruption there and to destroy the tillage and the stock; and God loves not corruption;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turneth away (from thee) his effort in the land is to make mischief therein and to destroy the crops and the cattle; and Allah loveth not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he turns away, he sets out to spread corruption in the land, destroying crops and cattle. God does not love corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turnoth away, he speedeth through the land that He may act corruptly therein and destroy the tilth and the stock. And Allah approveth not corruptness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he were to wield authority, he would try to cause corruption in the land and to ruin the crop and the stock, and Allah does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he turns his back, His aim everywhere is to spread mischief through the earth and destroy crops and cattle. But Allah loveth not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he turns away (from you \"O Muhammad SAW \"), his effort in the land is to make mischief therein and to destroy the crops and the cattle, and Allah likes not mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No sooner does he leave than he hastens about the earth to corrupt there and destroy crops and cattle. Allah does not love corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he gains power, he strives to spread corruption on earth, destroying properties and lives. God does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he goes away, he strives throughout the land to cause corruption therein and destroy crops and animals. And Allah does not like corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:205] And when he turns his back, leaving you behind, he hastens, he walks, about the earth to do corruption there and to destroy the tillage and the stock (these [last two actions] are included in such ‘corruption’); and God loves not corruption, that is to say, it does not please Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he turneth away (from thee)) when he is angry (his effort in the land is to make mischief therein) by committing transgressions (and to destroy the crops) and stacks of grain by burning them (and the cattle) by killing them; (and Allah loveth not mischief) or those who commit it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلْحَرْثَ وَٱلنَّسْلَ } فالحَرثُ: الزرعُ، والنَّسْلُ: نَسْلُ كُلِ دَابَةٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا تَوَلَّىٰ } أدبر من عنده { سَعَىٰ فِي ٱلأَرْضِ } الموضوعة للإصلاح والتعمير { لِيُفْسِدَ فِيِهَا } بأنواع الفسادات { وَ } من جملة ذلك أنه { يُهْلِكَ ٱلْحَرْثَ وَٱلنَّسْلَ } بالظلم والفسوق والعصيان المتجاوز للحد مثل: الزنا وقطع الطريق والخروج على الولاة القائمين بحدود الله المقيمن بأحكامه، كالمتمشيخة المبتدعة التي ظهرت في هذه الأمة بإفساد عقائد ضعفاء المسلمين بالشيخوصة، وترغيبهم إلى البدع والأهواء الباطلة المؤدية إلى تحليل المحرمات الشرعية، ورفع التكليفات الدينية والمعتدات اليقينة، شتت الله شملهم وفرق جمعهم { وَٱللَّهُ } الهادي للعباد { لاَ يُحِبُّ ٱلفَسَادَ } [البقرة: 205]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}