{
  "chapter": "البقرة",
  "text": "يكاد البرق يخطف ابصرهم كلما اضاء لهم مشوا۟ فيه واذا اظلم عليهم قاموا۟ ولو شاء الله لذهب بسمعهم وابصرهم ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Verily the lightning could snatch away their eyes. When it flashes forth they walk in its flare. When darkness returns they stand still. And if the Lord wills so He could take away their hearing and sight; surely God is all-powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning terrifies them as if it were going to snatch away their eyesight from them. When they see light, they move on a little further and When it becomes dark for them, they stand still. Had Allah so willed, He could have deprived them totally of their hearing and their sight. Most surely Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost takes away their vision. When the lightning brightens their surroundings, they walk and when it is dark, they stand still. Had God wanted, He could have taken away their hearing and their vision. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It seems the lightning may snatch away their sight from them; whenever it flashes they walk in it, and when it darkens they stand still; if Allah willed, He could take away their hearing and their sight; indeed Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches away their sight, whenever it flashes for them, they walk therein, and when darkness covers them, they stand still. And if Allah willed, He could have taken away their hearing and their sight. Certainly, Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost takes away their sight; whenever it shines on them they walk in it, and when it becomes dark to them they stand still; and if Allah had pleased He would certainly have taken away their hearing and their sight; surely Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the lightning wellnigh snatches away their sight; whensoever it gives them light, they walk in it, and when the darkness is over them, they halt; had God willed, He would have taken away their hearing and their sight. Truly, God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatcheth away their sight from them. As often as it flasheth forth for them they walk therein, and when it darkeneth against them they stand still. If Allah willed, He could destroy their hearing and their sight. Lo! Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost takes away their sight: whenever it flashes upon them, they walk on, but as soon as darkness falls around them, they stand still. Indeed, if God pleased, He could take away their hearing and their sight: God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning well-nigh snatcheth away their sight; whensoever it flasheth on them, they walk therein, and when it becometh dark unto them, they stand still. And had Allah willed He would of a surety have taken away their hearing and their sights; verily Allah is over everything potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches away their sight: whenever it shines for them, they walk in it, and when the darkness falls upon them, they stand. Had Allah willed, He would have taken away their hearing and sight. Indeed Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning all but snatches away their sight; every time the light (Helps) them, they walk therein, and when the darkness grows on them, they stand still. And if Allah willed, He could take away their faculty of hearing and seeing; for Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches away their sight, whenever it flashes for them, they walk therein, and when darkness covers them, they stand still. And if Allah willed, He could have taken away their hearing and their sight. Certainly, Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches away their sight, whenever it flashes upon them they walk on, but as soon as it darkens they stand still. Indeed, if Allah willed, He could take away their sight and hearing. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches their sight away. Whenever it illuminates for them, they walk in it; but when it grows dark over them, they stand still. Had God willed, He could have taken away their hearing and their sight. God is capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lightning almost snatches away their sight. Every time it lights [the way] for them, they walk therein; but when darkness comes over them, they stand [still]. And if Allah had willed, He could have taken away their hearing and their sight. Indeed, Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:20] The lightning well-nigh, almost, snatches away their sight, that is, takes it away swiftly; whensoever it gives them light, they walk in it, in its light; and when the darkness is over them, they stop, that is, they stand still: a simile of the perturbation that the Qur’ānic arguments cause in their hearts, and of their acknowledging the truths of what they love to hear and recoiling from what they detest; had God willed, He would have taken away their hearing and their sight, that is, the exterior faculty, in the same way that He took away their inner one; Truly, God has power over all things, [that] He wills, as for example, His taking away of the above-mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The lightning), i.e. fire, (almost snatcheth away their sight from them), i.e. from the unbelievers. Similarly, the exposition of the Qur'an almost snatched away their error. (As often as it flasheth forth), the lightening, (for them they walk therein) in the brightness of lightening, (and when it darkeneth against them they stand still) they remain in darkness. Likewise, when the hypocrites declared themselves to be believers, they went along with that which the believers went along with because their outward faith was accepted. But when they died, they remained in the darkness of the grave. (And if Allah willed, He could destroy their hearing), take away the thunder, (and their sight) the lightening. Likewise, if Allah willed, He could take away the hearing of the hypocrites and Jews through the rebukes and threats contained in the Qur'an, and He could also take away their sight through the exposition contained therein. (Indeed Allah is able to do all things) in terms of destroying their hearing and sight.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يكادُ البرقُ } أي: اللامع النوريّ { يخطَفُ أبصارَهُم } أي: عقولهم المحجوبة بالنعاس عن نور الهداية والكشف، إذ العقل بصر القلب { كلما أضاء لهم مشوا فيه } أي: ترقوا وقربوا من قبول الحق والهدى، { وإذا أظلم عليهم قاموا } أي: ثبتوا على حيرتهم في ظلمتهم { ولو شاء الله لذهب بسمعهم وأبصارهم } لطمس أفهامهم وعقولهم، ومحا نور استعدادهم، كما للفريق الأول فلم يتأثروا بسماع الوحي أصلاً { إن الله على كلّ شيء قدير } الشيء الموجود الخارجيّ الواجب والممكن، والموجود الذهني الممكن والممتنع إذ اللاشيء هو المعدوم الصرف الذي ليس في الذهن ولا في الخارج، لكن تعلق القدرة به خصصه بالممكن وأخرج عنه الواجب والممتنع بدليل العقل\n هذا آخر الكلام في الأصناف السبعة على سبيل الإجمال، وفصل بين فريقي الأشقياء وأوجز ذكر الفريق الأوّل وأعرض عنهم، إذ الكلام فيهم لا يجدي\n وبالغ في ذكر الفريق الثاني، وذمّهم، وتعييرهم، وتقبيح صورة حالهم، وتهديدهم، وإبعادهم، وتهجين سيرهم، وعاداتهم لإمكان قبولهم للهداية وزوال مرضهم العارض، واشتعال نور قرائحهم بمدد التوفيق الإلهيّ عسى التقريع يكسر أعواد شكائمهم، والتوبيخ يقلع أصول رذائلهم، فتتزكى بواطنهم وتتنوّر قلوبهم بنور الإرادة، فيسلكوا طريق الحق\n ولعل موادعة المؤمنين وملاطفتهم إياهم ومدجالستهم معهم، تستميل طباعهم فتهيج فيهم محبة مّا، وشوقاً تلين به قلوبهم إلى ذكر الله، وتنقاد به نفوسهم لأمر الله، فيتوبوا ويصلحوا كما قال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَكَادُ ٱلْبَرْقُ } أي: برق التجلي اللطفي { يَخْطَفُ } يعمي { أَبْصَٰرَهُمْ } التي يرون بها أنفسهم ذوات موجودات فاضلات به { كُلَّمَا أَضَآءَ } وأشرق { لَهُمْ } التجلي اللطفي { مَّشَوْاْ } ساروا { فِيهِ } باقين ببقائه { وَإِذَآ أَظْلَمَ عَلَيْهِمْ } بالتجلي القهري { قَامُواْ } سكنوا على ما هم عليه من عدم الصرف { وَلَوْ شَآءَ ٱللَّهُ } التجلي عليهم بالقهر دائماً { لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَٰرِهِمْ } أي: بتعيناتهم التي ظنوا أنهم موجودات حقيقية بسببها، وصيرهم فانين معدومين لا وجود لهم أصلاً، كما هم عليه دائماً، قل لهم يا أكمل الرسل بلسان الجمع: { إِنَّ ٱللَّهَ } المتجلي بالتجلي اللطفي { عَلَىٰ } إبقاء { كُلِّ شَيْءٍ قَدِيرٌ } [البقرة: 20] على إفنائه بالتجلي القهري؛ إذ لا يجري في ملكه إلا ما يشاء، ثم نبه تعالى على كيفية رجوعهم إليه وتنبههم على تجلياته، فناداهم إشفاقاً لهم وامتناناً عليهم ليقبلوا إليه فقال:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { الرعد }: الصوت الذي يخرج من السحاب، و { البرق }: النور الذي يخرج منه\n قال ابن عزيز: رُوِيَ عن رسول الله صلى الله عليه وسلم أنه قال:\n\n \" إنَّ الله عزَّ وجلَّ ينشىءُ السَّحَابَ فَتنطِقُ أحْسَنَ النطْق، وتَضْحَكُ أحسَنُ الضحك، فنطقها الرعدُ، وضَحِكُها البَرْقُ \" \n\nوقال ابن عباس: \" الرعدُ مَلَكٌ يسوقُ السَّحابَ، والبرقُ سَوْطٌ مِنْ نُورٍ يَزْجُرُ بهِ السَّحَاب\n هـ\n والصواعق: قطعة من نار تسقط من المخراق الذي بيد سائق السحاب، وقيل: تسقط من نار بين السماء والأرض، والله تعالى أعلم\n يقول الحقّ جلّ جلاله: ومثل المنافقين أيضاً كأصحاب مطر غزير { فِيهِ ظُلُمَاتٌ وَرَعْدٌ } وهدير أصابهم في ليلة مظلمة وقفراء مُدْلهمة\n فيه { بَرْقٌ } يلمع، وصاعقة تقمع، إذا ضرب الرعد وعظم صوته جعلوا { أَصَابِعَهُمْ فِي آذَانِهِم } من الهول والخوف حذراً من موت أنفسهم، وقد ماتت أرواحهم وقلوبهم، وإذا ضرب البرق كاد { أن يخطف أبصارهم } ، فإذا لمع أبصروا الطريق، و { مشوا فيه، وإذا أظلم عيهم قاموا } متحيرين حائدين عن عين التحقيق،\n\n[البُرُوج: 20]\n { وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ } بصوت ذلك الرعد، { وَأَبْصَارِهِمْ } بلمعان ذلك البرق، { إن الله على كل شيء قدير } لا يعجزه شيء\n هذا مثلهم في تحيّرهم واضطرابهم، فيحتمل أن يكون من التشبيه المركب، وهو تشبيه الجملة بالجملة، أو من المفَصَّل، فيكون المطر مثالاً للقرآن، وفيه ذكر الكفر والنفاق المُشَبَّهَيْن بالظلمات، والوعد عليه والزجر المشبّه بالرعد، والحُجج الباهرة التي تكاد أحياناً تبهرهم المشبهة بالبرق، وتخوفهم وروعُهم هو جَعْل أصابعهم في آذانهم، لئلا يسمعون فيميلوا إلى الإيمان، وفَضْحُ نفاقهم وتكاليفُ الشرع التي يكرهونها هي الصواعق\n والله تعالى أعلم\n الإشارة: أهل الخصوصية إذا ظهروا بين العموم بأحوال غريبة وعلوم وَهْبية، وأسرار ربانية وأذكار نورانية، دهشوا منهم وتحيّروا في أمرهم، وخافوا على أنفسهم، فإذا سمعوا منهم علوماً لدنية وأسراراً ربانية فرّوا منها، وجعلوا أصابعهم في آذانهم، خوفاً على نفسهم أن تفارق عوائدها وهواها، وإذا خاصمهم أحد من العموم ألجموه بالحجة، فتكاد تلك الحجة تخطفه إلى الحضرة، كلما لمع له شيء من الحق مشى إلى حضرته، وإذا كرّت عليه الخصوم والخواطر، وأظلم عليه الحال، وقف في الباب حيران، ولو شاء الله لذهب بعقله وسمعه وبصره، فيبصر به إلى حضرته\n من استغرب أن ينقذه الله من شهوته، وأن يخرجه من وجود غفلته، فقد استعجز القدرة الإلهية\n\n[الكهف: 45]\n فالصِّيَّب الذي نزل من السماء كِنَايةٌ عن الواردات والأحوال التي ترد على قلوب العارفين، ويظهر أثرها على جوارحهم، والظلمات التي فيها كناية عن اختفاء بعضها عن أهل الشريعة فينكرونها، والرعد كناية عن اللهج بذكر الله جهراً في المحافل والحلق، والبرق كناية عن العلوم الغريبة التي ينطقون بها والحجج التي يحتجون بها على الخصوم، فإذا سمعها العوام اشمأزت قلوبهم عن قبولها، فإذا وقع منهم إنصاف تحققوا صحتها فمالوا إلى جهتها، ومَشَوْا إلى ناحيتها، فإذا كَرَّت عليهم الخصوم قاموا منكرين، ولو شاء ربك لهدى الناس جميعاً\n\n[هُود: 118]\n ولما ذكر الحق من تخلق بالإيمان ظاهراً وباطناً، ومن تحلّى به كذلك، ومن أخفى الكفر وأظهر الإيمان، دعا الكل إلى توحيده وعبادته\n\n",
      "translations": []
    }
  ]
}