{
  "chapter": "البقرة",
  "text": "واذا قيل له اتق الله اخذته العزة بالاثم فحسبه جهنم ولبئس المهاد",
  "translations": [
    {
      "translation": "Whenever he is told: \"Obey God,\" his arrogance leads him to more sin; and sufficient for him shall be Hell: How evil a place of wide expanse!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, \"Fear Allah,\" vanity seizes him and makes him adhere to the sin. Hell is the proper place for such a person and it is a very bad dwelling indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are asked to have fear of God, sinful pride prevents them from paying heed to such advice. It is enough for them to have hell as a terrible dwelling place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, “Fear Allah”, he becomes more resolute in committing sin – therefore hell is sufficient for such; and that is indeed, a very wretched resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, \"Fear Allah\", he is led by arrogance to (more) crime. So enough for him is Hell, and worst indeed is that place to rest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, guard against (the punishment of) Allah; pride carries him off to sin, therefore hell is sufficient for him; and certainly it is an evil resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when it is said to him, 'Fear God', vainglory seizes him in his sin. So Gehenna shall be enough for him -- how evil a cradling!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto him: Be careful of thy duty to Allah, pride taketh him to sin. Hell will settle his account, an evil resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he is told, \"Have fear of God,\" he is seized by pride which drives him to wrongdoing. Hell shall be enough for him. A dreadful resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto him: fear Allah, arrogance taketh him to sin. Enough for him is Hell: surely an ill resort!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he is told, ‘Be wary of Allah,’ conceit seizes him sinfully; so let hell suffice him, and it is surely an evil resting place!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to him, \"Fear Allah\", He is led by arrogance to (more) crime. Enough for him is Hell;-An evil bed indeed (To lie on)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, \"Fear Allah\", he is led by arrogance to (more) crime. So enough for him is Hell, and worst indeed is that place to rest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to him: 'Fear Allah' egotism takes him in his sin. Gehenna (Hell) shall be enough for him. How evil a cradling!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he is told, “Beware of God,” his pride leads him to more sin. Hell is enough for him—a dreadful abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to him, \"Fear Allah,\" pride in the sin takes hold of him. Sufficient for him is Hellfire, and how wretched is the resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:206] And when it is said to him, ‘Fear God’, in your actions, he is seized by vainglory, pride and rage, in his sin, the one he was commanded to avoid committing. So Hell shall be enough, [it] suffices, for him — how evil a cradling, a resting place it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto him: Be careful of your duty to Allah) regarding what you are doing, (pride taketh him to sin) he takes offence because of his pride. (Hell will settle his account) his destination will be hell, (an evil resting place). This verse was revealed about al-Akhnas Ibn Shurayq who was both eloquent and good looking and the Prophet (pbuh) used to like his speech. This person used to say to him that he loved him and that he was entirely with him in secret and in the open, and used to give his oath to this effect. But he was a hypocrite and it is alleged that he burned someone's crops and killed a donkey belonging to others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَبِئْسَ ٱلْمِهَادُ } معناهُ الفِرَاشُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية عتوه وعناده ونهاية استكباره { إِذَا قِيلَ لَهُ } إمحاضاً للنصح: { ٱتَّقِ ٱللَّهَ } عن أمثال هذه الفضائح واستح منه { أَخَذَتْهُ } هيجته وحركته { ٱلْعِزَّةُ } المرتكزة في نفسه { بِٱلإِثْمِ } الذي منع منه لجاجاً وعناداً { فَحَسْبُهُ } وحسب أمثاله { جَهَنَّمُ } الإمكان الذي يعلبون بنيرانها، كفت مؤنة شرورهم وطغيانهم { وَ } الله { لَبِئْسَ ٱلْمِهَادُ } [البقرة: 206] مهداً لإمكان المستلزم لمهد النيران\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا قيل له اتق الله } وارجع عما أنت عليه من الفساد { أخذته العزة } أي: حملته الحمية والأنفة بسبب الإثم الذي ارتكبه، فلا ينزجر عن غَيِّه\n أو حملَتْه الحمية على الإثم الذي يُؤمَر باتقائه\n { فحسبه جهنم } أي: كَفَته عذاباً وعقاباً، وهي عَلَمٌ لدار العقاب، كالنار، { ولبئس المهاد } هي: أي: بئس الفراش الذي مهَّده لنفسه",
      "translations": []
    }
  ]
}