{
  "chapter": "البقرة",
  "text": "او۟لئك لهم نصيب مما كسبوا۟ والله سريع الحساب",
  "translations": [
    {
      "translation": "They are those who will surely have their share of whatsoever they have earned; for God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people shall have their due share (in both the worlds) according to what they earn. And Allah is swift at settling accounts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have their share of the reward for their deeds. God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For such is a portion from what they have earned; and Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be alloted a share for what they have earned. And Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have (their) portion of what they have earned, and Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those -- they shall have a portion from what they have earned; and God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there is in store a goodly portion out of that which they have earned. Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have a good share from what they have earned. God is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These! for them will be a share for that which they have earned. and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such shall partake of what they have earned, and Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To these will be allotted what they have earned; and Allah is quick in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them there will be alloted a share for what they have earned. And Allah is Swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These shall have a share of what they have earned. Swift is the reckoning of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will have a share of what they have earned. God is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have a share of what they have earned, and Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:202] Those — they shall have a portion, a reward, from, as a result of, what they have earned, the deeds they have performed, such as Pilgrimage and supplication; and God is swift at reckoning, reckoning with the whole of creation in half a day of this world, as one hadīth states.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For these) who are thus (there is in store a goodly portion) a great portion in Paradise (out of that which they have earned) from their pilgrimage. (Allah is swift in reckoning) Allah says: when He takes people to task, His reckoning is swift; it is also said that this means: swift in His protection. It is said that this means: His punishment is severe towards those who show off in their devotional works. 34\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } الموفون الموحدون الجامعون بين مرتبتي الظاهر والباطن { لَهُمْ نَصِيبٌ } حظ كامل { مِّمَّا كَسَبُواْ } في الدنيا التي هي مزرعة الآخرة من المعارف اللدنية والكشوف الإلهية { وَٱللَّهُ } المحيط وبضمائرهم { سَرِيعُ ٱلْحِسَابِ } [البقرة: 202] يحاسبهم ويجازيهم على ما كسبوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك } الذين طلبوا خيرَ الدارَيْن { لهم نصيب } وحظٍّ من الجزاء الوافر من أجلْ ما كسبوا من الأعمال الصالحات، { والله سريع الحساب } يحاسب عباده على كثرتهم، وكثرة أعمالهم، في مقدار لَمْحة\n قيل لعليّ رضي الله عنه: كيف يُحاسب اللّهُ عباده في ساعة واحدة؟ فقال: كما يرزقهم في ساعة واحدة\n هـ\n أو يوشك أن يقيم القيامة ويحاسب عباده، فبادِرُوا إلى إغتنام الطاعات، واكتساب الحسنات، قبل هجوم الممات\n الإشارة: الناس ثلاثة: صاحب همة دَنِيَّة، وذو همة متوسطة، وصاحب همة عالية، أما صاحب الهمة الدنية فهو الذي أنزل همته على الدنيا الدنية، وأكبَّ على جمع حطامها الفانية، فقلبُ هذا خالٍ من حب الحبيب، فما له في الآخرة من نصيب\n وأما صاحب الهمة المتوسطة فهو الذي طلب سلامة الدارين، وصلاح الحالين، قد اشتغل في هذه الدار بما ينفعه في دار القرار، ولم ينسَ نصيبه من الدنيا لِيقْضِي ما له فيها من الأوطار، فهذا له في الدنيا حسنة، وهي الكفاية والغنى، وفي الآخرة حسنة، وهي النعمة والسرور والهنا\n\n\nوأما صاحب الهمة العالية فهو الذي رفع همته عن الكونَيْن، وأغمض طَرْفَه عن الالتفات إلى الدارين، بل علَّق همته بمولاه، ولم يقنع بشيء سواه، قد ولّى عن هذه الدار مُغضياً، وأعرض عنها مُولياً، ولم يشغله عن الله شيء، يقول بلسان المقال إظهاراً لعبودية للكبير المتعال: { ربنا آتنا في الدنيا حسنة } وهي النظرة والشهود، ورضا الملك الودود، { وفي الآخرة حسنة } وهي اللحوق بأهل الرفيق الأعلى، من المقربين والأنبياء، في حضرة الشهود المؤبد { في مقعد صدق عند مليك مقتدر }\n أتحفَنَا الله من ذلك بحظٍّ وافر، بمنِّه وكرمه، نحن وأحباءَنا أجمعين، آمين\n\n",
      "translations": []
    }
  ]
}