{
  "chapter": "البقرة",
  "text": "فاذا قضيتم منسككم فاذكروا۟ الله كذكركم ءاباءكم او اشد ذكرا فمن الناس من يقول ربنا ءاتنا فى الدنيا وما له فى الءاخرة من خلق",
  "translations": [
    {
      "translation": "When you have finished the rites and ceremonies, remember God as you do your fathers, in fact with a greater devotion. There are some who say: \"Give us, O Lord, in the world;\" but they will forego their share in the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have performed your Hajj rites, remember Allah as you had been remembering your own forefathers, or even with greater zeal. (Even those who remember Allah do it in different ways). Some say, \"Our Lord, give us all the good things here in this world. \" Such people shall have no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After you complete the acts of your Hajj, also commemorate God, just as you would remember your father, or even more earnestly. Some people say, \"Lord, give us what we want in this life,\" but in the life hereafter they have no beneficial share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you have completed your Hajj rites, remember Allah as you used to remember your forefathers, in fact more than that; and among the people are some that say, “Our Lord! Give us in this world” – and he does not have a portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you have accomplished your Manasik, remember Allah as you remember your forefathers or with far more remembrance. But of mankind there are some who say: \"Our Lord! Give us (Your bounties) in this world!\" and for such there will be no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you have performed your devotions, then laud Allah as you lauded your fathers, rather a greater lauding. But there are some people who say, Our Lord! give us in the world, and they shall have no resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have performed your holy rites remember God, as you remember your fathers or yet more devoutly. Now some men there are who say, 'Our Lord, give to us in this world'; such men shall have no part in the world to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye have completed your devotions, then remember Allah as ye remember your fathers or with a more lively remembrance. But of mankind is he who saith: \"Our Lord! Give unto us in the world,\" and he hath no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have performed the acts of worship prescribed for you, celebrate the praises of God as you celebrated the praises of your fathers, or even more fervently than that. There are some who say, \"Our Lord, give us abundance in this world.\" These shall have no share in the world to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye have completed Your rites, remember Allah even as ye remember your fathers or with a stronger remembrance. Of mankind there are some who say: our Lord vouchsafe unto us in, the world. And for such there shall be no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you finish your rites, then remember Allah as you would remember your fathers, or with a more ardent remembrance. Among the people there are those who say, ‘Our Lord, give us in this world,’ but for such there is no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when ye have accomplished your holy rites, celebrate the praises of Allah, as ye used to celebrate the praises of your fathers,- yea, with far more Heart and soul. There are men who say: \"Our Lord! Give us (Thy bounties) in this world!\" but they will have no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you have accomplished your Manasik [(i.e. Ihram, Tawaf of the Ka'bah and As-Safa and Al-Marwah), stay at 'Arafat, Muzdalifah and Mina, Ramy of Jamarat, (stoning of the specified pillars in Mina) slaughtering of Hady (animal, etc.)]. Remember Allah as you remember your forefathers or with a far more remembrance. But of mankind there are some who say: \"Our Lord! Give us (Your Bounties) in this world!\" and for such there will be no portion in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have fulfilled your sacred duties remember Allah as you remember your forefathers or with deeper reverence. There are some who say: 'Lord, give us good in this world' He shall have no share in the Everlasting Life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have completed your rites, remember God as you remember your parents, or even more. Among the people is he who says, “Our Lord, give us in this world,” yet he has no share in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have completed your rites, remember Allah like your [previous] remembrance of your fathers or with [much] greater remembrance. And among the people is he who says, \"Our Lord, give us in this world,\" and he will have in the Hereafter no share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:200] And when you have performed, and completed, your holy rites, that is, the devotions pertaining to your pilgrimage, having cast [stones] at the Jamrat al-‘Aqaba, performed the circumambulation and stopped at Minā, remember God, by extolling Him and repeating the takbīr [saying Allāhu akbar, ‘God is Great’], as you remember your fathers, as you used to remember them and boast about them at the end of your pilgrimage, or yet more intensely, than your remembrance of them (ashadda is in the accusative because it is a circumstantial qualifier referring to dhikr ‘remembrance’, which itself is in the accusative as the object of udhkurū, ‘remember’, because had it come after it, it would have functioned as an adjectival phrase). There are some people who say, ‘Our Lord, give to us, our lot, in this world’, and they are given it; such people will have no part, no lot, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye have completed your devotions) upon finishing the rites of your pilgrimage, (then remember Allah) say: Allah! (as ye remember your fathers) as you say: father! It is also said that this means: remember Allah for the blessings He showered on you as you used to remember the kindness of your fathers in the pre-Islamic era (or with a more lively remembrance) remember Him more than you used to remember your fathers. (But of mankind is he who saith) on the standing site: (\"Our Lord! Give unto us in the world,) camels, cows, sheep, male and female slaves and wealth\" (and he hath no portion in the Hereafter) of Paradise by performing the pilgrimage.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فإذا قضيتم مناسككم } وفرغتم من الحجّ { فاذكروا الله كذكركم آباءكم أو أشدّ ذكراً } أي: فلا تكونوا كأهل العادة مشغولين بذكر الأنساب والمفاخرات وسائر أحوال الدنيا، فإنّ ذلك يكدّر وقتكم ويقسي قلوبكم بل كونوا مشتغلين بأنواع الذكر والمذاكرة مع الإخوان مثل ما كنتم تذكرون أحوال الأنساب وسائر أحوال الدنيا قبل السلوك أو كما يذكر الناس هذه الأحوال بالعادة وأبلغ أو أقوى وأكثر ذكراً منها ليبقى صفاؤكم ويهتدي بكم الناس { فمن الناس من يقول ربنا } أي: لا يطلب إلا متاع الدنيا ولا يشتغل إلا بذكرها ولا يعبد الله إلا لأجلها { وما له في الآخرة من خلاق } فإنّ توجهه إلى الأخس يمنعه عن قبول الأشرف لعدم نهوض همّته إليه واكتساب الظلمة المنافية للنور",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِذَا قَضَيْتُمْ مَّنَاسِكَكُمْ } المأمور لكم من الاجتناب عن مقتضيات الحياة الطبيعية والاتصاف بمقتضيات المعين الحقيقية { فَٱذْكُرُواْ ٱللَّهَ } الهادي لكم إلى هذه المرتبة { كَذِكْرِكُمْ آبَآءَكُمْ } بلا ترددٍ وتشكيكٍ { أَوْ أَشَدَّ ذِكْراً } بل ذكر الله أشد في الوضوع من ذكر الآباء؛ إذ يجري فيه التشكيك بخلاف ذكر الله المتفرع على الشهود، المستتبع للفناء فيه، فإنه خال عن وصمة الريب { فَمِنَ ٱلنَّاسِ مَن } يحصر التوجه والرجوع إلى الله والمناجاة معه للنشأة الأولى، و { يَقُولُ رَبَّنَآ آتِنَا فِي ٱلدُّنْيَا } ما نحن محتاجون إليها من أمور المعاش { وَ } هو إن وصل إلى مبتغاه في الدنيا { مَا لَهُ فِي ٱلآخِرَةِ مِنْ خَلاَقٍ } [البقرة: 200] نصيبٍ؛ لصرفه استعداده إلى ما لا يغنيه بل يضره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإذا قضيتم مناسككم } وفرغتم من حجتكم { فاذكروا الله } ذكراً كثيراً { كذكركم آباءكم } أو ذكراً { أشد ذكراً } منهم، حيث كنتم تَذْكُرونهم عند فراغ حجكم بالمفاخَرة، وكانوا إذا فرغوا من حجهم وقَفُوا بِمنى، بين المسجد والجبل، فيذكرون مفاخرة آبائهم، ومحاسن أيامهم، فأُمِرُوا أن يُبدلوا ذلك بذكر الله، وذكر إحسانه إليهم، وشكر ما أسداه إليهم من مفاخر الدنيا والآخرة، إن آمنوا واتبعوا رسوله صلى الله عليه وسلم\n الإشارة: إذا وقَفَت القلوبُ على جَبل عرفة المعارف، وتمكنت من شهود جمال معاني تلك الزخارف، حتى صارت تلك المعاني هي روحَها وسرَّها، وإليها مآلها ومسيرُها، أُمرتْ بالنزول إلى رض العبودية، والقيام بوظائف الربوبية، شكراً لما هداها إليه من معالم التحقيق، وما أبان لها من منار الطريق، وإن كانت من قبله لمن الضالين عن الوصول إلى رب العالمين\n\n\nثم يؤمرون بمخالطة الناس بأشحباحهم، وانفرادهم عنهم بأرواحهم، أشباحُهم مع الخلق تسعى، وأرواحهم في الملكوت ترعى، فإذا وقع منهم ميل أو سكون إلى حِسّ فليستغفروا الله { إن الله غفور رحيم }\n ثم يقال لهم: فإذا قضيتم مناسككم، بأن جمعتم بين مشاهدة الربوبية في باطنكم، والقيام بوظائف العبودية في ظاهركم، فاذكروا الله على كل شيء، وعند كل شيء، وقبل كل شيء، وبعد كل شيء، حتى لا يبقى من الأثر شيء، كما كنتم تذكرون آباءكم وأبناءكم، في حال غفلتكم، بل أشد ذكراً وأعظم وأتم، والله ذو الفضل العظيم\n ثم بيَّن الحقّ تعالى مقاصد الناس، وهممهم في طلبهم وسعيهم، فقال: {\n\n\n فَمِنَ ٱلنَّاسِ مَن يَقُولُ رَبَّنَآ آتِنَا فِي ٱلدُّنْيَا وَمَا لَهُ فِي ٱلآخِرَةِ مِنْ خَلاَقٍ وِمِنْهُمْ مَّن يَقُولُ رَبَّنَآ آتِنَا فِي ٱلدُّنْيَا حَسَنَةً وَفِي ٱلآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ ٱلنَّارِ أُولَـٰئِكَ لَهُمْ نَصِيبٌ مِّمَّا كَسَبُواْ وَٱللَّهُ سَرِيعُ ٱلْحِسَابِ }  يقول الحقّ جلّ جلاله: في بيان مقاصد الناس وهممهم في طلبهم في الحج وغيره: { فمن الناس } من قصرت نيته وانحطت همته، { يقول ربنا آتنا في الدنيا } ما تشتهيه نفوسنا من حظوظها وشهواتها، وليس له { في الآخرة من خلاق } أي: نصيب، لأنه عجَّل نصيبه في الدنيا",
      "translations": []
    }
  ]
}