{
  "chapter": "البقرة",
  "text": "ومن الناس من يعجبك قوله فى الحيوة الدنيا ويشهد الله على ما فى قلبه وهو الد الخصام",
  "translations": [
    {
      "translation": "There is a man who talks well of the world to your pleasing, and makes God witness to what is in his heart, yet he is the most contentious;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a certain type of man who charms you in this worldly life with his glib talk. He calls Allah to witness again and again that he cherishes good intentions in his heart, whereas, in fact, he is the deadliest opponent of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some people whose words about this life may please you. They say that God knows what they have in their hearts. But, in fact, they are the most quarrelsome opponents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is one whose conversation may please you in the life of this world, and he brings Allah as witness to what is in his heart, whereas he is the biggest quarreller!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind there is he whose speech may please you (O Muhammad), in this worldly life, and he calls Allah to witness as to that which is in his heart, yet he is the most quarrelsome of the opponents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among men is he whose speech about the life of this world causes you to wonder, and he calls on Allah to witness as to what is in his heart, yet he is the most violent of adversaries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some men there are whose saying upon the present world pleases thee, and such a one calls on God to witness what is in his heart, yet he is most stubborn in altercation,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind there is he whoso conversation on the life of this world pleaseth thee (Muhammad), and he calleth Allah to witness as to that which is in his heart; yet he is the most rigid of opponents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some men whose views on the affairs of this life may please you. They even call on God to witness whatever is in their heart, yet they are the most contentious of quarrellers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind is he whose discourse for the purpose of this world thou admirest, and he taketh Allah to witness as to that which is in his heart, whereas he is the most contentious of the adversaries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he whose talk about worldly life impresses you, and he holds Allah witness to what is in his heart, though he is the staunchest of enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is the type of man whose speech about this world's life May dazzle thee, and he calls Allah to witness about what is in his heart; yet is he the most contentious of enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind there is he whose speech may please you (O Muhammad SAW), in this worldly life, and he calls Allah to witness as to that which is in his heart, yet he is the most quarrelsome of the opponents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is he whose sayings pleases you in this worldly life and uses Allah as a witness for what is in his heart, but he is most stubborn in adversary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people is he whose speech about the worldly life impresses you, and he calls God to witness what is in his heart, while he is the most hostile of adversaries.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people is he whose speech pleases you in worldly life, and he calls Allah to witness as to what is in his heart, yet he is the fiercest of opponents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:204] And among people there is he whose speech in the life of this world pleases you, but it would not please you in the Hereafter because it contradicts what he actually used to believe; and who calls on God to witness what is in his heart, as being in accordance with what he says; yet he is most stubborn in dispute, with you and your followers on account of his enmity towards you: this was al-Akhnas b. Sharīq, a hypocrite who spoke kindly in the presence of the Prophet (s), swearing that he believed in him and that he loved him, and frequently sitting with him. God then revealed his mendacity in this matter. On one occasion he passed by some crops and livestock that belonged to the Muslims and later that night he set fire to them [the crops] and slaughtered them [the livestock]. God, moreover, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of mankind there is he whose conversation on the life of this world pleaseth thee (Muhammad)) his speech, words and outward appearance pleases you, (and he calleth Allah to witness as to that which is in his heart) he swears by Allah that he loves and follows you; (yet he is the most rigid of opponents) yet he argues about falsehood and is a staunch opponent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَهُوَ أَلَدُّ ٱلْخِصَامِ } فالأَلَدُ: الشّديدُ الخُصومةِ بالبَاطِلِ\n والجمعُ لُدٌّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن الناس من يعجبك } أي: يدّعي المحبة وهو ألدّ الخصام لكونه في مقام النفس زنديقاً، ولهذا قال: { قوله في الحياة الدنيا } إذ ليس له قول في الآخرة بالقلب { وإذا تولى سعى في الأرض } لإباحته وتزندقه كما ترى عليه أكثر مدّعي المحبة والتوحيد { والله لا يحبّ الفساد } أي: هو مفسد ويدّعي محبة الله\n وكيف تتأتى له والمحبّ لا يفعل إلا ما يحبّ محبوبه، والله لا يحبّ ما يفعله فلا يكون صادقاً في دعواه، كما قال الشاعر:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الآدب الموضوعة فيكم بوضع الله المدبر لأموركم المهذب لأخلاقكم: الاجتناب عن الجلساء السوء، لذلك خاطب سبحانه نبيه صلى الله عليه وسلم امتناناً عليه وإرشاداً لكم، فقال: { مِنَ ٱلنَّاسِ } المجبولين على البغض والنفاق، المستمرين عليه دائماً بلا تصفية ووفاق { مَن يُعْجِبُكَ } يوقعك في العجب المحير العارض لنفسك بلا علمك بموجبه وسببه { قَوْلُهُ فِي ٱلْحَيَٰوةِ ٱلدُّنْيَا } أي: مقوله المتعلق بأمور الدنيا وأسباب المعاش، بأن من تسلم أمور الدنيا وترتيبها يُتوصل إلى الآخرة ولذاتها، كما هو المشهور بين أهل الدنيا، ويسمونه عقل المعاش { وَ } مع إغرائه وتغيره { يُشْهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلْبِهِ } من حب الدنيا، ويدعي موافقة كلام الله وحكمه المودعة فيه على ما يدعيه، لا تغفل عنه ولا تسمع قوله { } [البقرة: 204] وأشد العداوة والجدال معك ومع من تبعك من المؤمنين\n\n\n\n\nقيل: نزلت فوَهُوَ أَلَدُّ ٱلْخِصَامِي الأخنس بن شريك الثقفي، وكان من بلغائهم وفصائحهم، له الوجاهةو الحسن والطلاقة، يتردد إلى النبي صلى الله عليه وسلم ويصاحب معه ويظهر المحبة والإخلاص، ويدعي الإيمان والانقياد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: نزلت الآية في الأخنَسْ بن شريق الثقفي وصُهيب بن سنان الرومي، أما الأخنس فكان رجلاً حسن المنظر، حُلُو المنطق، كان يوالي رسول الله صلى الله عليه وسلم ويدَّعي الإسلام، ثم ارتد، ومرَّ على زرع وحُمر للمسلمين فقتلها وأفسد الزرع، قال ابن عطية: ولم يثبت أنه أسلم\n قلت: بل ذكره في القاموس من الصحابة، فانظره، ولعله تاب بعد نزول الآية\n وأما صهيب الرومي فأخذه المشركون وعذبوه ليرتد، فقال لهم: إني شيخ كبير لا أنفعكم إن كنت معكم، ولا أضركم إن كنت عليكم، فخلّوني وما أنا عليه، وخذوا مالي، فقبلوه منه، وأتى المدينة فلما رآه النبي صلى الله عليه وسلم قال له:\n\n \" رَبِحْتَ يا أَبَا يَحْيى \"\n \n\nوقيل: نزلت في المنافقين ومَنْ نحَا نحوهم، وفيمن باع نفسه لله في الجهاد وتغيير المنكر من المسلمين\n و { في الحياة الدنيا } يتعلق بالقول، و { ألد الخصام } شديده، وفي الحديث:\n\n \" أبْغَضُ الرِّجالِ إلى اللّهِ الألدُّ الخَصِم \" \n\nوالخِصام: مصدر، أو جمع خصيم\n يقول الحقّ جلّ جلاله: { ومن الناس } قوم حُلْ اللسان خرَاب الجَنَان، إذا تكلم في شأن الدنيا { يعجبك قوله } فيها لرونقه وفصاحته، { ويُشهد الله } أي: يحلف على أنه موافق لقلبه، وأن ظاهره موافق لباطنه، وهو شديد الخصومة والعدواة للمسلمين، أو أشد الخصوم، { وإذا تولى } أي: أدبر وانصرف عنك، { سعى في الأرض } أي: مشى فيها بنية الإفساد { ليفسد فيها ويهلك الحرث والنسل } كما فعل الأخنَسْ، أو كما فعله أهل الظلم، فيَحْبِسُ الله القَطْر، فَيَهْلِكَ الحرثُ والنسل بشؤم معاصيهم، { والله لا يحب الفساد } أي: لا يرتضيه، فاحذروا غضبه",
      "translations": []
    }
  ]
}