{
  "chapter": "البقرة",
  "text": "يسـلونك ماذا ينفقون قل ما انفقتم من خير فللولدين والاقربين واليتمى والمسكين وابن السبيل وما تفعلوا۟ من خير فان الله به عليم",
  "translations": [
    {
      "translation": "They ask you of what they should give in charity. Tell them: \"What you can spare of your wealth as should benefit the parents, the relatives, the orphans, the needy, the wayfarers, for God is not unaware of the good deeds that you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people ask, \"What should we spend?\" Tell them, \"Whatever you spend, spend for your parents, your relatives, orphans, the needy and the wayfarer; and whatever good you do, Allah has knowledge of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what to spend for the cause of God. (Muhammad) tell them that whatever you spend, give it to your parents, the orphans, the destitute, and those who may be in urgent need of money whilst on a journey. Whatever good you do, God certainly is Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what they should spend; say, “Whatever you spend for good, is for parents and near relatives and orphans and the needy and the traveller”; and whatever good you do, indeed Allah knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad) what they should spend. Say: \"Whatever you spend of good must be for parents and kindred and orphans and Al-Masakin (the poor) and the wayfarer, and whatever you do of good deeds, truly, Allah knows it well.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you as to what they should spend. Say: Whatever wealth you spend, it is for the parents and the near of kin and the orphans and the needy and the wayfarer, and whatever good you do, Allah surely knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning what they should expend. Say: 'Whatsoever good you expend is for parents and kinsmen, orphans, the needy, and the traveller; and whatever good you may do, God has knowledge of it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee, (O Muhammad), what they shall spend. Say: that which ye spend for good (must go) to parents and near kindred and orphans and the needy and the wayfarer. And whatsoever good ye do, lo! Allah is Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask you what they should spend on others. Say, \"Whatever you give should be for parents, close relatives, orphans, the needy, and travellers. God is well aware of whatever good you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee regarding whatsoever they shall expend. Say thou: whatsoever ye expend of wealth, let it be for the parents and kindred and orphans and the needy and the wayfarer and whatever good ye do, verily Allah is the Knower thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you as to what they should spend. Say, ‘Let whatever wealth you spend be for the parents, relatives, orphans, the needy, and the traveller.’ Allah indeed knows whatever good you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee what they should spend (In charity). Say: Whatever ye spend that is good, is for parents and kindred and orphans and those in want and for wayfarers. And whatever ye do that is good, -Allah knoweth it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad SAW) what they should spend. Say: Whatever you spend of good must be for parents and kindred and orphans and Al-Masakin (the poor) and the wayfarers, and whatever you do of good deeds, truly, Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question you about what they should spend (in charity). Say: 'Whatever good you spend is for (your) parents, kinsmen, orphans, the needy, and the destitute traveler. Allah is Aware of whatever good you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what they should give. Say, “Whatever charity you give is for the parents, and the relatives, and the orphans, and the poor, and the wayfarer. Whatever good you do, God is aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], what they should spend. Say, \"Whatever you spend of good is [to be] for parents and relatives and orphans and the needy and the traveler. And whatever you do of good - indeed, Allah is Knowing of it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:215] They will ask you, O Muhammad (s), about what they should expend. This was the question posed by ‘Amr   b. al-Jamūh. He was a wealthy elderly man and went to ask the Prophet (s) what and for whom he should expend; Say, to them: ‘Whatever you expend of good (min khayrin, ‘of good’, is an explication of mā, ‘whatever’, covering small and large amounts, and denotes one half of the question represented by the expender; God responds with regard to the one receiving the expenditure, this pertaining to the other half of the question, in the following) it is for parents and kinsmen, orphans, the needy, and the traveller, that is, they are the most deserving of it; and whatever good you may do, by way of expending or otherwise, God has knowledge of it’, and will requite it accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They ask thee (0 Muhammad)) and this was before the verse of inheritance was revealed (what they shall spend) to whom they should give in charity. (Say: That which ye spend for good) of your wealth ((must go) to parents and near kindred) later, giving charity to parents was abrogated by the verse on inheritance (and orphans) He says: give in charity to the orphans (and the needy) the needy among people (and the wayfarer) the guest who drops by. (And whatsoever good ye do) whatever wealth you spend on these, (lo! Allah is Aware of it) Allah knows it as He knows your intention and He will reward you for it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n(وَ) بالجملة: لا تحوم الفهوم حول سرادقات عز جلله حتى يشقق عن كائناته ومصنوعاته، ليس كمثله شيء ليقاس عليه ولا غيره حتى يسمع منه ويبصر به، وهو السميع البصير العليم، وليس وراء الله مرمى { يَسْأَلُونَكَ }  أيها الهادي للكل عن الإنفاق وعما ينفق به، ويقولون: { مَاذَا يُنْفِقُونَ } أي: أي شيء ينفق المنفق في سبيل الله؟ { قُلْ } لهم يا أكمل الرسل كلاماً ناشئاً عن محض الحكمة: { مَآ أَنْفَقْتُمْ } سواء كانت تمرة أو كسرة أو حبة أو ذرة صادرة { مِّنْ خَيْرٍ } خالص من ثوب المشوب المنة والأذى { فَلِلْوَالِدَيْنِ وَٱلأَقْرَبِينَ } إليكم نسباً أولى إن كانوا مستحقين { وَ } بعد ذلك أولاهم { ٱلْيَتَامَىٰ } الذين لا متعهد لهم { وَ } بعد ذلك { ٱلْمَسَاكِينِ } الذين أسكنهم المذلة والهوان { وَ } بعد ذلك { ٱبْنِ ٱلسَّبِيلِ } الذين تعذر وصولهم إلى مملوكاتهم { وَ } اعلموا أيها المؤمنون أن { مَا تَفْعَلُواْ مِنْ خَيْرٍ } خالصاً لرضائه سبحانه { فَإِنَّ ٱللَّهَ بِهِ عَلِيمٌ } [البقرة: 215] لصدروه عنه وعن جريان حكمه وسنته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ماذا } إما مفعول { يُنفقون } ، أو مبتدأ وخبر بحذف العائد، أي: ما الذي ينفقونه، والسائل هو عمرو بن الجُموح، كان ذا مال فقال: يا رسول الله، ماذا ننفق من أموالنا، وأين نضعها؟ فنزلت الآية\n يقول الحقّ جلّ جلاله: { يسالونك } يا محمد { ماذا ينفقون } من أموالهم؟ { قل } لهم: { ما أنفقتم من خير } أيّ خير كان، ذهباً أو فضة أو طعاماً أو ثياباً أو حيواناً أو غير ذلك، فادفعوه للأهمّ فالأهم كالوالدين والأقربين لأن فيهم الصلة والصدقة، { واليتامى } الذين مات آباؤهم لهضم حالهم، { والمساكين } لضعفهم، { وابن السبيل } لغربته واحتياجه إلى ما يُبلِّغه إلى وطنه، { وما تفعلوا من خير } يجازيكم به الله، فلا يخفى عليه شيء من أحوالكم، وهذه النفقة غير الزكاة، فلا نسخ في الآية\n الله تعالى أعلم\n الإشارة: الإنفاق على قسمين: حسيّ ومعنوي، والإنفاق الحسيّ هو بذل الأموال والفلوس، والإنفاق المعنوي هو بذل الأرواح والنفوس، فمن بذل أمواله لله عوضه الله جنة الزخارف، ومن بذل نفسه لله عوضه الله جنة المعارف، ومن دخل جنة المعارف لا يشتاق إلى جنة الزخارف، وكما أن لنفقة الأموال محلاً تُصرف يه، كما ذكره الحقّ تعالى هنا، كذك لنفقة النفوس محل تصرف فيه وهو خدمة الشيوخ العارفين بالله، والإخوان الذين يستعين بهم على الوصول إلى الله، وكذلك من احتاج إليه من اليتامى الذين لا شيخ لهم، فيرشدهم وينصحهم، والمساكين الضعفاء الذي لا قدرة لهم على مجاهدة نفوسهم، فيقويهم بحاله أو مقاله، والغريب الذي انفرد عن الإخوان، ولم يجد ما يستعين به على سيره فيرشده إلى الصحبة والاجتماع بأهل المحبة، وإلى هذا المنزع أشار الشيخ أبو مدين ري الله عنه:\n\nولمّا ذكر الحقّ جلّ جلاله قواعد الإسلام، وهي الصلاةُ والزكاة والصوم والحج، بعد أن أشار إلى كلمة التوحيد بقوله:\n",
      "translations": []
    }
  ]
}