{
  "chapter": "البقرة",
  "text": "كان الناس امة وحدة فبعث الله النبين مبشرين ومنذرين وانزل معهم الكتب بالحق ليحكم بين الناس فيما اختلفوا۟ فيه وما اختلف فيه الا الذين اوتوه منۢ بعد ما جاءتهم البينت بغيۢا بينهم فهدى الله الذين ءامنوا۟ لما اختلفوا۟ فيه من الحق باذنه والله يهدى من يشاء الى صرط مستقيم",
  "translations": [
    {
      "translation": "Men belonged to a single community, and God sent them messengers to give them happy tidings and warnings, and sent the Book with them containing the truth to judge between them in matters of dispute; but only those who received it differed after receiving clear proofs, on account of waywardness (and jealousies) among them. Then God by His dispensation showed those who believed the way to the truth about which they were differing; for God shows whom He please the path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the beginning all the people followed the same way. (Afterwards there came a change and differences arose). Then Allah sent Prophets to give good tidings to those who followed the Right Way and warnings to those who swerved from it. And He sent down with them the Book based on the Truth so that it should judge between the people concerning their differences. (Differences arose not because people were not given the knowledge of the Truth in the beginning, nay), differences arose between those very people who had been given clear teachings, and (for no other reasons than that) they wanted to tyrannize over one another. So Allah, by His leave, guided those who believed in the Prophets to the Truth about which they had differed; AIIah guides whomever He pleases to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At one time all people were only one nation. God sent Prophets with glad news and warnings. He sent the Book with them for a genuine purpose to provide the people with the ruling about disputed matters among them. No one disputed this matter except those who had already received evidence before. Their dispute was only because of their own hostility. To deal with this dispute, God, through His will, sent guidance to the believers. God guides to the right path whomever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was on one religion; so Allah sent Prophets giving glad tidings and warnings – and with them sent down the true Book to judge between mankind on their differences; and only those to whom it was given created disputes regarding the Book, after clear commands had come to them, due to hostility of one another; so Allah, by His command, made the truth clear to the believers, concerning their disputes; and Allah may guide whomever He wills to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one community and Allah sent Prophets with glad tidings and warnings, and with them He sent down the Scripture in truth to judge between people in matters wherein they differed. And only those to whom (the Scripture) was given differed concerning it, after clear proofs had come unto them, through hatred, one to another. Then Allah by His leave guided those who believed to the truth of that wherein they differed. And Allah guides whom He wills to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(All) people are a single nation; so Allah raised prophets as bearers of good news and as warners, and He revealed with them the Book with truth, that it might judge between people in that in which they differed; and none but the very people who were given it differed about it after clear arguments had come to them, revolting among themselves; so Allah has guided by His will those who believe to the truth about which they differed and Allah guides whom He pleases to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people were one nation; then God sent forth the Prophets, good tidings to bear and warning, and He sent down with them the Book with the truth, that He might decide between the people touching their differences; and only those who had been given it were at variance upon it, after the clear signs had come to them, being insolent one to another; then God guided those who believed to the truth, touching which they were at variance, by His leave; and God guides whomsoever He will to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were one community, and Allah sent (unto them) prophets as bearers of good tidings and as warners, and revealed therewith the Scripture with the truth that it might judge between mankind concerning that wherein they differed. And only those unto whom (the Scripture) was given differed concerning it, after clear proofs had come unto them, through hatred one of another. And Allah by His Will guided those who believe unto the truth of that concerning which they differed. Allah guideth whom He will unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was once a single community, [but then people developed differences], so God sent prophets to them as bearers of good tidings and warning, and sent down with them the Book containing the truth, so that He might judge between their disputes. It was only those to whom it [the scripture] was given who disagreed about it after clear signs had come to them, because of rivalry between them. God by His will guided the believers to the truth about which the others had disputed. God guides whom He will to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one community; thereafter Allah raised prophets as bearers of glad tidings and warners, as He sent down the Book With truth that He may judge between mankind in that wherein they disputed. And none differed therein save those unto whom it was vouchsafed after the evidences had come to them, out of spite among themselves; then Allah guided those who believed unto the truth of that regarding which they differed, by His leave. Allah guideth whomsoever He listeth unto a path straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were a single community; then Allah sent the prophets as bearers of good news and warners, and He sent down with them the Book with the truth, that it may judge between the people concerning that about which they differed, and none differed in it except those who had been given it, after the manifest proofs had come to them, out of envy among themselves. Then Allah guided those who had faith to the truth of what they differed in, by His will, and Allah guides whomever He wishes to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was one single nation, and Allah sent Messengers with glad tidings and warnings; and with them He sent the Book in truth, to judge between people in matters wherein they differed; but the People of the Book, after the clear Signs came to them, did not differ among themselves, except through selfish contumacy. Allah by His Grace Guided the believers to the Truth, concerning that wherein they differed. For Allah guided whom He will to a path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind were one community and Allah sent Prophets with glad tidings and warnings, and with them He sent the Scripture in truth to judge between people in matters wherein they differed. And only those to whom (the Scripture) was given differed concerning it after clear proofs had come unto them through hatred, one to another. Then Allah by His Leave guided those who believed to the truth of that wherein they differed. And Allah guides whom He wills to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people were one nation. Then Allah sent forth Prophets to give them glad tidings and to warn them; and with them He sent down the Book with the truth, that He might rule between the people in that which they differ. Only those to whom it had been given differed about it after the clear verses had come to them, transgressing between themselves. Then Allah guided those who believed concerning that which they were at variance in the truth, by His permission. Allah guides whom He will to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Humanity used to be one community; then God sent the prophets, bringing good news and giving warnings. And He sent down with them the Scripture, with the truth, to judge between people regarding their differences. But none differed over it except those who were given it—after the proofs had come to them—out of mutual envy between them. Then God guided those who believed to the truth they had disputed, in accordance with His will. God guides whom He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind was [of] one religion [before their deviation]; then Allah sent the prophets as bringers of good tidings and warners and sent down with them the Scripture in truth to judge between the people concerning that in which they differed. And none differed over the Scripture except those who were given it - after the clear proofs came to them - out of jealous animosity among themselves. And Allah guided those who believed to the truth concerning that over which they had differed, by His permission. And Allah guides whom He wills to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:213] People were one community, in faith, but they fell into disagreement, and some believed, while others disbelieved; then God sent forth the prophets, to them, as bearers of good tidings, of Paradise for the believers, and warners, of the Fire for the disbelievers; and He revealed with them the Scripture, meaning, the Books, with the truth (bi’l-haqqi, ‘with the truth’, is semantically connected to anzala, ‘He revealed’) that He might decide, according to it, between people regarding their differences, in religion; and only those who had been given it, the Scripture, so that some believed while others disbelieved, differed about it, [about] religion, after the clear proofs, the manifest arguments for God’s Oneness, had come to them (min [of min ba‘di, ‘after’] is semantically connected to ikhtalafa, ‘they differed’, and together with what follows should be understood as coming before the exception [illā lladhīna, ‘only those’]); out of insolence, on the part of the disbelievers, one to another; then God guided those who believed to the truth, regarding which (min [of min al-haqqi, ‘of the truth’] here is explicative) they were at variance, by His leave, by His will; and God guides, with His guidance, whomever He will to a straight path, the path of truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Mankind were) in the times of Noah and Abraham (one community) of disbelievers; as it is said that this means: there were in the time of Abraham followers of the true Religion (Muslims), (and Allah sent Prophets) from the children of Noah and Abraham (as bearers of good tidings) of Paradise for whoever believes in Allah (and as warners) from hell for whoever does not believe in Allah, (and revealed therewith the Scripture) He sent down Gabriel to them with the Scripture, (with the Truth) expositing what is true and what is false (that it might judge) so that each prophet would judge by his Scripture (between mankind concerning that wherein they differed) in Religion; it is also said that this means: so that the Scripture is used as a final authority; and it is also said that this means: so that the Prophet Muhammad (pbuh) rules them by the Scripture. (And only those unto whom (the Scripture) was given differed concerning it) concerning the Religion and Muhammad (pbuh) (after clear proofs had come unto them) clear proofs from their own Scripture, (through hatred one of another) out of resentful envy from their part and this is why they disbelieved in it. (And Allah by His will guided those who believe) by means of the prophets (unto the Truth of that concerning which they differed) in Religion. It is also said that this means: Allah protected the believers by means of the prophets from that which they differed over in matters of Religion, and directed them from falsehood to the Truth. (Allah guideth whom He will) whomever deserves it; and it is also said that this means: Allah holds firm whomever He wills by His grace and will (unto a straight path) unto an established religion that He is pleased with.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَانَ ٱلنَّاسُ أُمَّةً وَٰحِدَةً } قالَ زيدُ بن علي عليهما السَّلامُ: يريدُ بِهِ آدمَ صلى الله عليه\n والأُمَّةُ: المِلَّةُ\n\n\n\n\nوقولهُ تعالى:\n\n[الرعد: 30] معناه مَضتْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كان الناس أمّة واحدة } أي: على الفطرة ودين الحق، كما قال صلى الله عليه وسلم:\n\n \" كلّ مولود يولد على الفطرة \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَانَ ٱلنَّاسُ } في الفطرة الأصلية والمرتبة الحقيقية الجبلية { أُمَّةً وَٰحِدَةً } وملة واحدة مستوجهة إلى مبدئهم الحقيقي ومقصدهم الأصلي طوعاً، ثم اختلفت آراؤهم وتشتت أهواؤهم بشياطين القوى الوحدانية التي هي من جنود إبليس، فظهر بينهم العداوة والبغضاء والمجادلة والمراء { فَبَعَثَ ٱللَّهُ } المدبر لأمورهم { ٱلنَّبِيِّينَ } من بني نوعهم، المؤيدين من عند ربهم { مُبَشِّرِينَ } لهم طريق الإطلاق والتوحيد { وَمُنذِرِينَ } لهم عن الكثرة والتقييد { وَأَنزَلَ مَعَهُمُ } تصديقاً لهم { ٱلْكِتَٰبَ } الجامع لما يبشر به وينذر عنه ملتبساً { بِٱلْحَقِّ } المطابق للواقع { لِيَحْكُمَ } كل نبي به { بَيْنَ ٱلنَّاسِ } المنسوبين إليه { فِيمَا ٱخْتَلَفُواْ فِيهِ } من أمور معاشهم ومعادهم\n\n\n\n\n{ وَمَا ٱخْتَلَفَ فِيهِ } أي: في الكتاب المنزل إليهم بالتكذيب والإنكار أحد من الناس { إِلاَّ } القوم { ٱلَّذِينَ أُوتُوهُ } أي: الكتاب، وكان اختلافهم { مِن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ } الواضحات المصدقات، بأنه منزل لهم من عند الله العليم الحكيم { بَغْياً } خروجاً عن طريق الحق وحسداً لأهله واقعاً { بَيْنَهُمْ } من وساوس شياطينهم، من الجاه و الرئاسة والعتو والاستكبار { فَهَدَى ٱللَّهُ } بلطفه { ٱلَّذِينَ آمَنُواْ } بالنبي المبعوث، والكتاب المنزل معه { لِمَا ٱخْتَلَفُواْ فِيهِ } من الأمور الدينية مع المعاندين المنكرين، والحال أنه { مِنَ ٱلْحَقِّ } الصريح المطابق للواقع، واختلافاتهم أيضاً معهم إنما يكون { بِإِذْنِهِ } أي: بأمره المنزل في كتابه { وَٱللَّهُ } المرشد لكل العباد إلى ما هم عليه { يَهْدِي } بفضله { مَن يَشَآءُ } من خلص عباده { إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ } [البقرة: 213] الموصل إلى بابه بلا عوج وضلال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فبعث } معطوف على محذوف، أي: فاختلفوا فبعث، و { بغياً }: مفعول له، و { من الحق } بيان { لما }\n يقول الحقّ جلّ جلاله: { كان الناس } في زمن آدم عليه السلام وما قرُب منه { أمة واحدة } أي: جماعة واحدة، متفقة على التوحيد، والطاعة، فاختلفوا بعد ذلك في أمر التوحيد، { فبعث الله النبيين مبشرين } لأهل التوحيد والطاعة بالنعيم المقيم، { ومنذرين } أي: مخوفين لأهل الكفر والعصيان بالعذاب الأليم\n { وأنزل معهم الكتاب } أي: جنب الكتب، فيشمل الكتب السماوية كلها، متلبساً ذلك الكتاب { بالحق } ، ودالاً عليه { ليحكم } الحق تعالى على لسان الرسل { بين الناس } في الأمر الذي { اختلفوا فيه } من أمر التوحيد وغيره\n ثم اختلفوا أيضاً في الكتب المنزلة فبعضهم آمن، وبعضهم كفر بها أو ببعضها، { وما اختلف فيه } أي: في الكتاب المنزل: { إلا الذين اوتوه } حسداً أو كبراً فاليهود آمنوا بالتوراة وكفروا بالإنجيل، والنصارى آمنوا بالإنجيل وكفروا بالتوراة، { من بعد ما جاءتهم }: الآيات الواضحات في صحة ذلك الكتاب الذي كفروا به، والأمر بالإيمان به\n وإنما وقع ذلك الكفر منهم { بغياً } وحسداً { بينهم } ، فأنزل الله العلم ليجمعهم ويؤلف بينهم على طاعته، فأمرهم أن يتألفوا بالعلم، فتحاسدوا، واختلفوا طلباً للرئاسة والجاه، { فهدى الله الذين آمنوا } بمحمد - عليه الصلاة والسلام - للأمر الذي اختلف فيه أهل الكتاب، وهو الحق الذي جاءت به الرسل، فآمنوا بالجميع، وتآلفوا على طاعة الله { بإذنه } وإرادته، { والله يهدي من يشاء إلى صراط مستقيم } ، ويضل من يشاء عن طريقه القويم،\n\n[الأنبيَاء: 23]\n الإشارة: الإصل في الأرواح كلها، الاتفاقُ والإقرار، وإنما حصل لها الخلاف والإنكار بعد دخولها في عالم الأشباح، وهبوطها من عالم الأرواح، فبعث الله النبيين يُذكْرون الناس العهدَ القديم، فمن سبقت له السعادة حصل له الإقرار، ومن سبق له الشقاء حصل له الإنكار، ولذلك قال - عليه الصلاة والسلام-:\n\n \" كُلُّ مَوْلُودٍ يُولَد على الْفطْرةِ، فأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصّرَانِهِ أوْ يُمَجِّسَانِهِ \" \n\nثم بعث الله الحكما، وهم العارفون بالله، يعالجون ما حصل للروح من الجهل والإنكار، فمن سبقت له العناية آمن بهم، وصدقهم، واستسلم بكليته إليهم، فحصل له الوصول، وبلغ كل المأمول، ومن سبق له الحرمان لم يحصل له بهم إيمان، وبقي دائماً في قلبه حيران\n وما وقع هذا الإنكار في الغالب إلا من أهل الرئاسة والجاه، أو من كان عبداً لدنياه وهواه بغياً وحسداً منهم، فهدى الله الذين آمنوا - وهم أهل الفطرة والنيّة - لما اختلفوا فيهم من الحق بإذنه، فحصل لهم التصديق، ووصلوا إلى عين التحقيق، { والله يهدي مَن يشاء إلى صراط مستقيم } وهو طريق الوصول إلى الحضرة القدسية التي كانت مقرّاً للأرواح الزكية، منها جاءت وإليها عادت\n وفي ذلك يقول ابن البنا رضي الله عنه:\n",
      "translations": []
    }
  ]
}