{
  "chapter": "البقرة",
  "text": "ان الذين ءامنوا۟ والذين هاجروا۟ وجهدوا۟ فى سبيل الله او۟لئك يرجون رحمت الله والله غفور رحيم",
  "translations": [
    {
      "translation": "Surely those who believe, and those who leave their homes and fight in the way of God, may hope for His benevolence, for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In contrast to them, those, who have believed And left their homes in the way of Allah and exerted their utmost in His cause, rightly look forward to His mercy: and Allah is Forgiving and full of mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers and the Emigrants from Mecca who fight for the cause of God, indeed have hope in receiving the mercy of God; God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed, and those who migrated for the sake of Allah, and fought in Allah's cause – they are hopeful of gaining Allah’s mercy; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who have believed, and those who have emigrated (for Allah's religion) and have striven hard in the way of Allah, all these hope for Allah's mercy. And Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believed and those who fled (their home) and strove hard in the way of Allah these hope for the mercy of Allah and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the believers, and those who emigrate and struggle in God's way -- those have hope of God's compassion; and God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe, and those who emigrate (to escape the persecution) and strive in the way of Allah, these have hope of Allah's mercy. Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have believed, migrated, and striven for God's cause, can look forward to God's mercy: God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who have believed and those who have emigrated and have striven hard in the way of Allah, all these shall hope for the mercy of Allah, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are faithful and those who have migrated and waged jihad in the way of Allah—it is they who expect Allah’s mercy, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and those who suffered exile and fought (and strove and struggled) in the path of Allah,- they have the hope of the Mercy of Allah: And Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who have believed, and those who have emigrated (for Allah's Religion) and have striven hard in the Way of Allah, all these hope for Allah's Mercy. And Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and those who migrate and struggle in the way of Allah, those, have hope of the Mercy of Allah. Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed, and those who migrated and fought for the sake of God—those look forward to God’s mercy. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed and those who have emigrated and fought in the cause of Allah - those expect the mercy of Allah. And Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:218] When those of the raiding party [of ‘Abd Allāh b. Jahsh] thought that, although they had been released from the sin [of having slain in the sacred month], they would not receive any reward, the following was revealed: Verily the believers, and those who emigrate, and depart from their homeland, and struggle in God’s way, in order to elevate His religion — those have hope of God’s compassion, His reward; and God is Forgiving, of believers, Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following was also revealed about 'Abdullah Ibn Jahsh and his companions: (Lo! Those who believe) in Allah and His Messenger, (and those who emigrate) from Mecca to Medina (and strive in the way of Allah) by killing the unbeliever 'Amr Ibn al-Hadrami, (these have hope in Allah's mercy) they shall obtain Allah's Garden. (And Allah is Forgiving) of what they have done, (Merciful) towards them, since He did not punish them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إن الذين آمَنوا } يقيناً { وهاجَرُوا } أوطان النفس ومألوفات الهوى { وجاهَدُوا في سبيلِ الله } وجنود الشيطان والنفس الأمّارة { أولئك يَرْجون رحمة الله } تجليات الصفات وأنوار المشاهدة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ ءَامَنُواْ } بالتوحيد الذاتي وأدى إيمانهم إلى أن وصولوا إلى مرتبة اليقين العلمي { وَٱلَّذِينَ هَاجَرُواْ } وتركوا ما يضاده وينازعه إلى أن وصلوا إلى مرتبة اليقين العيني { وَ } بعد ذلك { جَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ } مع نفوسهم إلى أن وصلوا بل اتصلوا باليقين الحقي { أُوْلۤـٰئِكَ } المقربون المدرجون في طريق الوصول { يَرْجُونَ رَحْمَتَ ٱللَّهِ } ما داموا في السلوك بأشباحهم { وَٱللَّهُ } المطلع لضمائرهم { غَفُورٌ } ساتر لهم أشباحهم عن عيون بصائرهم { رَّحِيمٌ } [البقرة: 218] لهم، يوصلهم إلى ما يتوجهون إليه من جنة الذات بمنه وجوده\n\n\n\n\nأدركنا بلطفك يا خفي الألطاف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولمّا نزلت الآية في إسقاط الحرج، ظنوا أنه لا أجر لهم في ذلك الجهاد، فأنزل الحقّ جلّ جلاله: { إن الذين آمنوا والذين هاجروا وجاهدوا في سبيل الله أولئك يرجون رحمت الله } أي ثوابه، { والله غفور } لهم { رحيم } بهم، فلا يضيع جهادهم في هذه السرِيَّة، وأعاد الموصول لتعظيم شأن الهجرة والجهاد، وعبَّر بالرجاء إشعاراً بأن العمل غير موجب للثواب، وإنما هو عبودية، والأمر بيد الله إن شاء أثاب وإن شاء عاقب،\n\n\n\n[الأنبيَاء: 23]\n الإشارة: تعظيم الزمان والمكان يكون بقدر ما يقع فيه من طاعة الملك الديان، فالزمان الذي تهب فيه نفحات القبول والإقبال، لا ينبغي أن يقع فيه ملاججة ولا قتال، وهو وقت حضرة الذكر، أو التذكير، أو الجلوس مع العارفين أهل الإكسير، فسوء الأدب فيه أمره كبير، ومنع القاصدين من وصوله جُرمه كبير، وصد القلوب عن نفحات تلك الحضرة أكبر من كل كبير، ولا يزال قُطَّاع هذه الطريق يردون من أراد سلوكها على التحقيق، لكن من سبق له التأييد لا يرده عن الحق جبار ولا عنيد، ومن سبق له الحرمان، وحَكم عليه القضاءُ بالخذلان، رجع ولو بعد العيان، وأنشدوا:\n\nإن الذين آمنوا وصدَّقُوا بطريق الله، وهاجروا أهواءهم في مرضاة الله، وجاهدوا نفوسهم في محبة الله، أولئك يرجون رحمة الله، فلا يُخيبهم الكريم لأنه غفور رحيم\n ولمّا كان الخمر حلالاً في أول الإسلام، وكانوا يشربونه، ويتِّجُرون فيه، فيتصدقون بثمنه وبثمن القمار، بيَّن الحقّ تعالى ذلك، بعد الأمر بالإنفاق لئلا يقع التساهل في المعاملة بعلَّة الصدقة\n\n",
      "translations": []
    }
  ]
}