{
  "chapter": "البقرة",
  "text": "سل بنى اسرءيل كم ءاتينهم من ءايةۭ بينة ومن يبدل نعمة الله منۢ بعد ما جاءته فان الله شديد العقاب",
  "translations": [
    {
      "translation": "Ask the children of Israel how many a clear sign We had given them. But if one changes the favour of God after having received it, then remember, God is severe in revenge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the children of Israel how many a clear sign We have shown to them: (also ask them) what a severe chastisement Allah inflicts on the community that, after receiving Allah's favour exchanges it (for wretchdness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask the children of Israel about how many visible miracles We had shown them. God is certainly stern in His retribution to those who change the bounty of God (His revelation), after having received His guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Descendants of Israel how many clear signs We gave them; and whoever alters Allah’s favour which came to him, then indeed Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) We gave them. And whoever changes Allah's favor after it has come to him, [e.g., renounces the religion of Allah (Islam) and accepts Kufr (disbelief)] then surely, Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Israelites how many a clear sign have We given them; and whoever changes the favor of Allah after it has come to him, then surely Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many a clear sign We gave them. Whoso changes God's blessing after it has come to him, God is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask of the Children of Israel how many a clear revelation We gave them! He who altereth the grace of Allah after it hath come unto him (for him), lo! Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear signs We have given them. Anyone who changes God's blessing once it has come to him will find God is stern in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask thou the Children of Isra'il, how many a manifest sign We brought unto them. And whosoever altereth the favour of Allah after it hath come unto him, then verily Allah is severe in Chastising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many a manifest sign We had given them. Whoever changes Allah’s blessing after it has come to him, indeed Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear (Signs) We have sent them. But if any one, after Allah's favour has come to him, substitutes (something else), Allah is strict in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) We gave them. And whoever changes Allah's Favour after it had come to him, [e.g. renounces the Religion of Allah (Islam) and accepts Kufr (disbelief),] then surely, Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear signs We have given them. Whoever changes the Favor of Allah after it has come to him, Allah is Firm in inflicting the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many clear signs We have given them. Whoever alters the blessing of God after it has come to him—God is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask the Children of Israel how many a sign of evidence We have given them. And whoever exchanges the favor of Allah [for disbelief] after it has come to him - then indeed, Allah is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:211] Ask, O Muhammad (s), the Children of Israel, by way of rebuke, how many a clear proof, manifest ones such as the parting of the sea, and the sending down of manna and quails, which they exchanged for unbelief, did We give them (kam, ‘how many’, is the interrogative particle linking the second object of the verb sal, ‘ask’, and is also the second object of the verb ātaynā, ‘We gave’, and its specifier); whoever changes God’s grace, that is, what God has blessed him with in the way of signs, for these constitute the causes of guidance, after it has come to him, out of unbelief, God is severe in retribution against him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ask the children of Israel) tell the children of Jacob (how many a clear revelation We gave them!) how may times We addressed them with commands and prohibitions, and honoured them with Religion in the time of Moses, but they exchanged all that with disbelief. (He who altereth the grace of Allah) whoever exchanges the Religion and Scripture of Allah with disbelief (after it hath come unto him) after what Muhammad has come with ((for him), lo! Allah is severe in punishment) for whoever disbelieves in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل يا أكمل الرسل نيابة عنا إلزاماً له: { سَلْ بَنِيۤ إِسْرَائِيلَ } أي: تذكر قصتهم { كَمْ } كثيراً { آتَيْنَاهُم مِّنْ آيَةٍ بَيِّنَةٍ } مبينة في كتبهم، فأنكروا عليها ظلماً وعداوناً، فأخذناهم بظلمهم إلى أن أستأصلناهم بالمرة { وَ } لا يختص هذا ببني إسرائيل، بل { مَن يُبَدِّلْ } ويطير { نِعْمَةَ ٱللَّهِ } المسلتزمة للشكر والإيمان كفراً وكفراناً { مِن بَعْدِ مَا جَآءَتْهُ } الموضحة المبينة، فله من العذاب والنكال ما جرى عليهم { فَإِنَّ ٱللَّهَ } المتجلي باسم المنتقم { شَدِيدُ ٱلْعِقَابِ } [البقرة: 211] صعب الانتقام وسريع الحساب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}