{
  "chapter": "البقرة",
  "text": "يايها الناس اعبدوا۟ ربكم الذى خلقكم والذين من قبلكم لعلكم تتقون",
  "translations": [
    {
      "translation": "So, O you people, adore your Lord who created you, as He did those before you, that you could take heed for yourselves and fear Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind, submit to your Lord Who created you and those who were before you; in this way only you may expect to save yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, worship your Lord who created you and those who lived before you, so that you may become pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Worship your Lord, Who has created you and those before you, in the hope of attaining piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Worship your Lord (Allah), Who created you and those who were before you so that you may acquire Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! serve your Lord Who created you and those before you so that you may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you men, serve your Lord Who created you, and those that were before you; haply so you will be godfearing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! worship your Lord, Who hath created you and those before you, so that ye may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, worship your Lord, who created you and those before you, so that you may become righteous,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind worship your Lord who hath created you and those before you, haply ye may become God-fearing-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Worship your Lord, who created you and those who were before you, so that you may be Godwary\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye people! Adore your Guardian-Lord, who created you and those who came before you, that ye may have the chance to learn righteousness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Worship your Lord (Allah), Who created you and those who were before you so that you may become Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, worship your Lord who has created you and those who have gone before you, so that you will be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Worship your Lord who created you and those before you, that you may attain piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, worship your Lord, who created you and those before you, that you may become righteous -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:21] O people, of Mecca, worship, profess the oneness of, your Lord Who created you, made you when you were nothing, and created those that were before you; so that you may be fearful, of His punishment by worshipping Him (la‘alla, ‘so that’, is essentially an optative, but when spoken by God it denotes an affirmative),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind!) people of Mecca; and it is also said that this refers to the Jews, (Worship your Lord), declare Him as the only One God, (Who hath created you) as different lineages beginning from a drop of sperm, (and those before you) just as He created those who came before you, (so that ye may ward off) so that you may ward off His wrath and torment and obey Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الناسُ } ثم لما فرغ من ذكر السعداء والأشقياء، دعاهم إلى التوحيد\n وأوّل مراتب التوحيد: توحيد الأفعال، فلهذا علّق العبودية بالربوبية ليستأنسوا برؤية النعمة، فيحبوه، كما قال:\n\n \" خلقت الخلق وتحببت إليهم بالنِعَم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰـأَيُّهَا ٱلنَّاسُ } الذين نسوا حقوق الله بمتابعة آبائكم { ٱعْبُدُواْ } تذللوا وتفزعوا وانقادوا { رَبَّكُمُ ٱلَّذِي خَلَقَكُمْ } أخرجكم وأظهركم من كتم العدم بإشراق تجلياته اللطيفة إلى فضاء الوجود { وَ } أيضاً أخرج آباءكم { ٱلَّذِينَ } مضوا { مِن قَبْلِكُمْ } إن عبدتم كما ذكر { لَعَلَّكُمْ تَتَّقُونَ } [البقرة: 21] تحذرون من تجلياته القهرية، فهو في بدء الوجود في المعاني اعبدوا ربكم:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة الترجي حال من الواو في { اعْبُدُوا } ، أي: اعبدوا ربكم راجين أن تنخرطوا في سلك المتقين الفائزين بالهدي والفلاح، المستوجبين جوار الله تعالى، نبّه به على أن التقوى منتهى درجات السالكين وهو التبري من كل شيء سوى الله تعالى - إلى الله تعالى\n و { الَّذي جَعَلَ } صفة للرب، و { فَلا تَجْعَلُوا } معطوف على { اعْبُدُوا } على أنه نهي، أو منصوب بأن، جواب له، والأنداد جمع نِدِّ، بكسر النون",
      "translations": []
    }
  ]
}