{
  "chapter": "البقرة",
  "text": "زين للذين كفروا۟ الحيوة الدنيا ويسخرون من الذين ءامنوا۟ والذين اتقوا۟ فوقهم يوم القيمة والله يرزق من يشاء بغير حساب",
  "translations": [
    {
      "translation": "Enamoured are the unbelievers of the life of this world, and scoff at the faithful. But those who keep from evil and follow the straight path will have a higher place than they on the Day of Reckoning; for God gives in measure without number whomsoever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This worldly life has been made very charming and alluring for those who have adopted the way of disbelief. So they mock at those who have adopted the way of belief, but (they forget that) the pious people will rank above them on the Day of Resurrection. As to the wordly provisions, Allah has full authority and power to bestow these without measure on anyone He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is made to seem attractive to the disbelievers who scoff at the faithful, but the pious, in the life hereafter, will have a position far above them. God grants sustenance (without account) to anyone He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to appear beautiful in the sight of the disbelievers, and they make fun of the believers; and the pious will be above them on the Day of Resurrection; and Allah may give to whomever He wills, without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who have Taqwa, will be above them on the Day of Resurrection. And Allah gives (of His bounty, blessings, favors, and honors on the Day of Resurrection) to whom He wills without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to seem fair to those who disbelieve, and they mock those who believe, and those who guard (against evil) shall be above them on the day of resurrection; and Allah gives means of subsistence to whom he pleases without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Decked out fair to the unbelievers is the present life, and they deride the believers; but those who were godfearing shall be above them on the Resurrection Day; and God provides whomsoever He will without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of the world for those who disbelieve; they make a jest of the believers. But those who keep their duty to Allah will be above them on the Day of Resurrection. Allah giveth without stint to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is made to appear attractive for those who deny the truth and they scoff at those who believe. But those who fear God shall be above them on the Day of Resurrection: God bestows His bounties on whoever He pleases without stinting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fair-seeming is made the life of the world unto those who disbelieve, and they scoff at those who believe, whereas those who fear God shall be above them on the Day of Resurrection. And Allah provideth whomsoever He listeth without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worldly life has been glamorized for the faithless, and they ridicule the faithful. But those who are Godwary shall be above them on the Day of Resurrection, and Allah provides for whomever He wishes without any reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is alluring to those who reject faith, and they scoff at those who believe. But the righteous will be above them on the Day of Resurrection; for Allah bestows His abundance without measure on whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they mock at those who believe. But those who obey Allah's Orders and keep away from what He has forbidden, will be above them on the Day of Resurrection. And Allah gives (of His Bounty, Blessings, Favours, Honours, etc. on the Day of Resurrection) to whom He wills without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who disbelieve, the worldly life is decked with all manner of decorations. They scoff at those who believe, but the cautious shall be above them on the Day of Resurrection. Allah gives without count to whom He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is the life of this world for those who disbelieve, and they ridicule those who believe. But the righteous will be above them on the Day of Resurrection. God provides to whomever He wills without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for those who disbelieve is the life of this world, and they ridicule those who believe. But those who fear Allah are above them on the Day of Resurrection. And Allah gives provision to whom He wills without account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:212] Decked out fair to the disbelievers, of Mecca, is the life of this world, in disguise and they have fallen in love with it; and they deride the believers, on account of their poverty, the likes of Bilāl [al-Habashī], ‘Ammār [b. Yāsir], and Suhayb [al-Rūmī], mocking them and treating them condescendingly with their wealth; but those who fear, idolatry, namely, those mentioned, shall be above them on the Day of Resurrection; and God sustains whomever He will without reckoning, with ample sustenance in the Hereafter or in this world, when He gives to those that were mocked possession of the property and lives of those that mocked them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Beautified is the life of the world) what is in this world of comfortable living (for those who disbelieve) Abu Jahl and his entourage; (they make a jest of believers) Salman [al-Farisi], Bilal [Ibn Rabah], Suhayb [al- Rumi] and their fellow believers because of their abject poverty. (But those who ward off) disbelief and ascribing partners to Allah: i.e. Salman and his fellow believers (will be above them) in this world by having a strong argument against them and also by having status and standing (on the Day of Resurrection. Allah giveth) abundant wealth (without stint) without faltering or affectation; it is also said that He gives to whoever He wills in Paradise without stint (to whom He will).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَٱلَّذِينَ ٱتَّقَواْ فَوْقَهُمْ } معناهُ أَفضلَ مَنْهم\n ويقال فَوقهم فِي الجَنَّة\n\n\n\n\nوقولهُ تعالى: { وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ } معناه بغيرِ مُحاسبةٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ذكر سبحانه مساوئ أهل الكفر وسوء معاملتهم مع المؤمنين المخلصين؛ ليجتنب المؤمنون عن أمثاله، فقال على وجه الإخبار: { زُيِّنَ لِلَّذِينَ كَفَرُواْ } أي: حسن في عيونهم وارتكز في قلوبهم { ٱلْحَيَاةُ ٱلدُّنْيَا } أي: الحياة المستعارة المنسوبة إلى الدنيا { وَ } أدى أمرهم في هذا التزيين والتحسين إلى أن { يَسْخَرُونَ } ويستهزئون { مِنَ ٱلَّذِينَ آمَنُواْ } أي: صار المؤمنون لفقرهم وعرائهم عن أمتعة الدنيا الدنية محل استهزائهم وسخريتهم، متى قصدوا الاستهزاء على مناقد الدنيا أخذوا منهم { وَ } الحال أن المؤمنين { ٱلَّذِينَ ٱتَّقَواْ } عن الدنيا ومزخرفاتها الفانية الغير الباقية يكون { فَوْقَهُمْ } رتبة ومنزلة عند الله { يَوْمَ ٱلْقِيَامَةِ } المعد لجزاء الأعمال الصالحة في النشأة الأولى { وَٱللَّهُ } الرزاق للكل { يَرْزُقُ مَن يَشَآءُ } من عباده بالرزق الدنيوي { بِغَيْرِ حِسَابٍ } [البقرة: 212] فيها، بل مستجبرين متكبرين مفتخرين بمزخرفاتها إلى النشأة الأخرى، فيحاسبهم فيها ويجازيهم عليها، ويرزق أيضاً من يشاء من عباده بالرزق الأخروي بغير حساب، لا في النشأة الأولى ولا في الأخرى، بل صاروا في حمائه أزلاً وأبداً لا يشوشهم الحساب ولا تتفاوت عندهم اللذة والعذاب، بل صاروا ما صاروا بلا سترة وحجاب\n\n\n\n\nآتنا من لدنك رحمة إنك أنت الوهاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { زُين } مبني للمفعول، والفاعل هو الله، إذ لا فاعل سواه\n يقول الحقّ جلّ جلاله: { زيّن للذين كفروا } من اهل الكتاب وغيرهم، { الحياة الدنيا } أي: حُسِّنَتْ في أعينهم، وأُشربت محبتها في قلوبهم، حتى تهالكوا عليها، واعرضوا عن غيرها، فلم تتفرغ قلوبهم للتفكر والاعتبار، ولم تستمع آذانهم للوعظ والتذكار، بل أعمتهم، وأصمّتهم، وقصروا عليها همتهم، حتى جعلوا يسخرون ممن أعرض عنها، كفقراء المسلمين وأهل الصفة، فكانوا يستهزئون بهم، حيث رفضوا الدنيا وأقبلوا على الله، فرفعهم الله في أعلى عليين، وخفض الكفار في أسفل سافلين\n فهم يسخرون منهم في دار الدنيا { والذين اتقَوْا فوقَهم يومَ القيامة } لأنهم في عليين، والآخرين في أسفل سافلين\n أو لأنهم في كرامة، والآخرون في مذلة\n أو لأنهم يسخرون منهم يوم القيامة كما سخروا منهم في الدنيا\n وعبَّر بالتقوى لأنها سبب رفعهم واستعلائهم\n وأما استهزاؤهم بهم لأجل فقرهم، فإن الفقر شرف للعبد، والبسط في الدنيا على شرفه فقد يكون استدراجاً، وقد يكون عوناً، فالله { يرزق مَن يشاء بغير حساب } ، أي: بغير تقدير، فيوسع في الدنيا استدراجاً وابتلاء، ويقتر على مَي يشاء اختباراً وتمحيصاً،\n\n[الأنبيَاء: 23]\n الإشارة: اعلم أن عمل أهل الباطن كله باطني قلبي، بين تفكر واعتبار، وشهور واستبصار، أو نقول: بين فكرة ونظرة وعكوف في الحضرة، فلا يظهرون من أعمالهم إلا المهم من الواجبات، ولذلك قال بعضهم: إذا وصل العمل إلى القلوب استراحت الجوارح، ومعلوم أن الذرة من أعمال القلوب أفضل من أمثال الجبال من أعمال الجوارح لأن أعمال القلوب خفية، لا يطلع عليها ملك فيكتبها، ولا شيطان فيفسدها، الإخلاص فيها محقق\n وأيضاً: \" تفكر ساعة أفضل من عبادة ستين سنة \"\n\n\n \" وسئل - عليه الصلاة والسلام -:أيُّ الأَعْمَال أَفْضَلُ؟ قال: العلْمُ بالله\n قيلَ: يا رسُولَ الله سَأَلْنَاكَ عن العَمَل؟ فقال: العلمُ بالله ثم قال صلى الله عليه وسلم: إذا حَصَلَ العلمُ بالله كَفَى قلِيلُ العَملِ \" \n\nأو كما قال عليه الصلاة والسلام،\n\n \" فلما خفيت أعمال أهل الباطن سخر منهم أهل الظاهر، واستصغروا شأنهم حيث لم يروا عليهم من الأعمال ما رأوا على العُبَّاد والزُهاد\n والذين اتقوا شهود ما سوى الله، أو كل ما يشغل عن الله، فوقهم يوم القيامة لأنهم من المقربين وغيرهم من عوام المسلمين، والله يرزق من يشاء في الدارين بغير حساب، أي: بغير تقدير ولا حصر، فيرزق العلوم، ويفتح مخازن الفهوم على مَن توجه إلى مولاه، وفرغ قلبه مما سواه \" \n",
      "translations": []
    }
  ]
}