{
  "chapter": "البقرة",
  "text": "كتب عليكم القتال وهو كره لكم وعسى ان تكرهوا۟ شيـا وهو خير لكم وعسى ان تحبوا۟ شيـا وهو شر لكم والله يعلم وانتم لا تعلمون",
  "translations": [
    {
      "translation": "Enjoined on you is fighting, and this you abhor. You may dislike a thing yet it may be good for you; or a thing may haply please you but may be bad for you. Only God has knowledge, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have been enjoined to go to war, and you dislike it; it may be that you dislike a thing and the same is good for you, and you love a thing and the same is bad for you: Allah knows but you do not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting is made mandatory for you, but you dislike it. You may not like something which, in fact, is for your good and something that you may love, in fact, may be evil. God knows, but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting in Allah's cause is ordained for you, whereas it is disliked by you; and it is possible that you hate a thing which is better for you; and it is possible that you like a thing which is bad for you; and Allah knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting is ordained for you (Muslims) though you dislike it, and it may be that you dislike a thing which is good for you and that you like a thing which is bad for you. Allah knows but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting is enjoined on you, and it is an object of dislike to you; and it may be that you dislike a thing while it is good for you, and it may be that you love a thing while it is evil for you, and Allah knows, while you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed for you is fighting, though it be hateful to you. Yet it may happen that you will hate a thing which is better for you; and it may happen that you will love a thing which is worse for you; God knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warfare is ordained for you, though it is hateful unto you; but it may happen that ye hate a thing which is good for you, and it may happen that ye love a thing which is bad for you. Allah knoweth, ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting [in defence] is ordained for you, abhorrent as it may be to you. You may dislike something although it is good for you, or like something although it is bad for you: God knows but you do not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prescribed unto you is fighting, albeit it is abhorrent unto you. Belike ye abhor at thing whereas it is good for you, and belike ye desire a thing whereas it Is bad for you. And Allah knowcth and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warfare has been prescribed for you, though it is repulsive to you. Yet it may be that you dislike something, which is good for you, and it may be that you love something, which is bad for you, and Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting is prescribed for you, and ye dislike it. But it is possible that ye dislike a thing which is good for you, and that ye love a thing which is bad for you. But Allah knoweth, and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jihad (holy fighting in Allah's Cause) is ordained for you (Muslims) though you dislike it, and it may be that you dislike a thing which is good for you and that you like a thing which is bad for you. Allah knows but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Offensive) fighting is obligatory for you, though it is hateful to you. But you may hate a thing although it is good for you, and may love a thing although it is evil for you. Allah knows, and you do not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting is ordained for you, even though you dislike it. But it may be that you dislike something while it is good for you, and it may be that you like something while it is bad for you. God knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fighting has been enjoined upon you while it is hateful to you. But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah Knows, while you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:216] Prescribed for you, obligatory [for you], is fighting, disbelievers, though it be hateful to you, by nature, because of the hardship involved. Yet it may happen that you hate a thing which is good for you; and it may happen that you love a thing which is bad for you: because the soul inclines towards those desires which result in its destruction and its rejection of the religious obligations that would bring about its happiness. Perhaps, then, even if you are averse to it, you will find much good in fighting, as a result of victory, booty, martyrdom or reward; while, if you were to reject fighting, even if you would like to do so, you will find much evil, because then you may be subjugated, impoverished and denied the reward; God knows, what is good for you, and you know, this, not, so strive in what He commands you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Warfare is ordained for you) in times of a general call to arms with the Prophet (pbuh) (though it is hateful unto you) hard on you; (but it may happen that ye hate a thing) fighting in the way of Allah (which is good for you) in that you obtain martyrdom and spoils, (and it may happen that ye love a thing) abstaining from fighting in the way of Allah (which is bad for you) in that you will not obtain martyrdom or spoils. (And Allah knoweth) that fighting in His way is better for you, (ye know not) that abstention from fighting in His way is bad for you. This was revealed about Sa'd Ibn Abi Waqqas, al-Miqdad Ibn al-Aswad and their associates. It was then revealed regarding 'Abdullah Ibn Jahsh and his companions who killed 'Amr Ibn al-Hadrami and their asking about warfare during the sacred month-in reference here to Rajab: i.e. the last afternoon of Jumada II, before seeing the moon of Rajab-for the unbelievers had censored them from doing so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { [وَهُوَ] كُرْهٌ لَّكُمْ } معناهُ وهو شَديدٌ عَليكُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ظهر أمر الإسلام وعلا قدره وارتفع مناره، فرض الله سبحانه على المؤمنين الموقنين بطريق التوحيد المشاجرة والمقاتلة مع المخالفين، الناكبين عن طريق الحق بالشرك والإشراك؛ ليظهر شمس التوحيد على النفاق، ويضمحل شوب الكثرة والثنوية المنبعثة عن الكفر والنفاق، ويتميز الحق عن الباطل والوجود عن العدم العاطل، فقال: { كُتِبَ عَلَيْكُمُ } أيها المؤمنون { ٱلْقِتَالُ } مع مخالفيكم من أهل الكثرة { وَهُوَ كُرْهٌ } مكروه مستهجن { لَّكُمْ } ما دمتم في أنانيتكم وهويتكم هذا، وما دمتم فيها مع تكثر الإضافات ولوازم الإمكان والإضافات { وَعَسَىٰ أَن تَكْرَهُواْ شَيْئاً } في النشأة الأولى { وَهُوَ خَيْرٌ لَّكُمْ } في النشأة الأخرى { وَعَسَىٰ أَن تُحِبُّواْ شَيْئاً } منها { وَهُوَ شَرٌّ لَّكُمْ } فيها { وَٱللَّهُ } الهادي لكم إلى سواء السبيل { يَعْلَمُ } خيركم ويأمركم به وشرك فيحذركم عنه { وَأَنْتُمْ } بهويتكم هذه { لاَ تَعْلَمُونَ } [البقرة: 216] شيئاً من الخير والشر، بل لكم الإطاعة والإنقياد بما أمر ونهى والعلم عند الله العزيز العليم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}