{
  "chapter": "البقرة",
  "text": "ولا تجعلوا۟ الله عرضة لايمنكم ان تبروا۟ وتتقوا۟ وتصلحوا۟ بين الناس والله سميع عليم",
  "translations": [
    {
      "translation": "Do not implicate God in your oaths to avoid doing good and being pious and keeping peace among men, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not use Allah's name for such oaths which are taken to keep back from virtue, piety and the welfare of mankind:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not swear by God not to do good things, or have piety, or make peace among people. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not make Allah a target of your oaths, by pledging against being virtuous and pious, and against making peace among mankind; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah's (Name) an excuse in your oaths against doing good and acting piously, and making peace among mankind. And Allah is All-Hearer, All-Knower (i.e., do not swear much and if you have sworn against doing something good then give an expiation for the oath and do good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah because of your swearing (by Him) an obstacle to your doing good and guarding (against evil) and making peace between men, and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make God a hindrance, through your oaths, to being pious and godfearing, and putting things right between men. Surely God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah, by your oaths, a hindrance to your being righteous and observing your duty unto Him and making peace among mankind. Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make God a pretext, when you swear by Him, to avoid doing good, being righteous and making peace between people. God is all hearing and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah a butt of your oaths that ye shall not act piously nor fear Allah nor set things right between and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make Allah an obstacle, through your oaths, to being pious and Godwary, and to bringing about concord between people. And Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah's (name) an excuse in your oaths against doing good, or acting rightly, or making peace between persons; for Allah is One Who heareth and knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And make not Allah's (Name) an excuse in your oaths against your doing good and acting piously, and making peace among mankind. And Allah is All-Hearer, All-Knower (i.e. do not swear much and if you have sworn against doing something good then give an expiation for the oath and do good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not make Allah a deterrent through your oaths, that you be righteous, cautious, and reform between people. Surely, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not allow your oaths in God's name to hinder you from virtue, and righteousness, and making peace between people. God is Listener and Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not make [your oath by] Allah an excuse against being righteous and fearing Allah and making peace among people. And Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:224] Do not make God, by swearing in His Name, a hindrance, a cause of impediment, in your oaths, that is, setting up [such impediments] by swearing in His Name frequently, so as not, to be pious and God-fearing; in such instances oaths are hateful, and result in perjury, which requires a redemption, effected by doing the opposite [of the oath], such as performing righteous deeds and so forth, which constitute an act of obedience; and to put things right between people: this means, do not be prevented from doing righteous deeds, as mentioned, just because you swore against them; nay, do them and make redemption; [this understanding of the verse is] justified by the reason for its revelation, namely, their refraining from such deeds; surely God is All-Hearing, of what you say, Knower, of your circumstances.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And make not Allah, by your oaths, a hindrance) a reason by means of which you make your oaths. This 38 was revealed about 'Abdullah Ibn Rawahah who swore not to show kindness to his sister and her husband and not to speak with them or make up between them. But Allah warned him against doing so, saying: do not make Allah a reason by means of which you make oaths, (to your being righteous) that you should not honour your oath (and observing your duty unto Him) and ward off severing ties of kinship (and making peace) and not make peace (among mankind). He says: return to that which is better for you and make amend for your oaths; it is also said that this means: avoid making oaths by Allah about not showing kindness to anyone and your not making peace between people. (For Allah is Hearer) of your oath to stop showing kindness to people, (Knower) of your intentions and the amends that will absolve you from your oaths.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلاَ تَجْعَلُواْ ٱللَّهَ عُرْضَةً لأَيْمَانِكُمْ } معناهُ لا تَنْصبوهُ نَصباً؛ وهو الرَّجلُ يَحلفُ فِي الأَمرِ فَيجْعَلَ يَمينَهُ عَرضةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأخلاق المنزلة لكم أن { لاَ تَجْعَلُواْ } اسم { ٱللَّهَ عُرْضَةً } وجهةً ومعرضاً { لأَيْمَانِكُمْ } المتعلقة بكل دني خسيس وحقٍ وباطل؛ أي: لا تكثروا الحلف بالله في الأمور؛ إذ أنتم بشريتكم ما تخلون عن شوب الكذب والبطلان، ما لكم والتلفظ باسم الحق الحقيق الحقية لترويج الأمور المزخرفة بالباطلة { أَن تَبَرُّواْ } افعلوا الخيرات وواظبا على الطاعات، وتوجهوا إلى الله في عموم الأوقات وشمول الحالات { وَ } إن أردتم أن { تَتَّقُواْ } اجتنبوا عن المحظورات، واحذروا عن المحرمات، وارجعوا نحو ربكم بإسقاط الإضافات { وَ } إن أردتم أن { تُصْلِحُواْ بَيْنَ ٱلنَّاسِ } تلييناً لقلوبهم، ادعوهم إلى التوحيد بالحكمة والموعظة الحسنة، وجادلهم بالتي هي أقوم { وَٱللَّهُ سَمِيعٌ } لإيمانكم { عَلِيمٌ } [البقرة: 224] بنياتكم فيجازيكم على مقتضى علمه بحالكم، هذا في الأيمان المثبتة للوقائع والأحكام، المقاربة للقصد والإرادة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقل: العرضة: فُعلة، بمعنى مفعولة: أي: معرضاً منصوباً، لأيمانكم تحلفون به كثيراً، فيصير اسم الجلالة مبتذلاً بينكم\n و { أن تبروا }: مفعول من أجله\n يقول الحقّ جلّ جلاله: { ولا تجعلوا الله } أي: اسم الجلالة، معرضاً { لأيمانكم } ، فتتبذلونه بكثرة الحلف، فتمتنعون من فعل الخير بسبب الحلف، كراهة { أن تبروا } أي: تفعلوا فعل البر، وهو الإحسان، وكراهة أن { تتقوا } أن تجعلوا بينكم وبين الله وقاية بفعل المعروف، وذلك أن يحلف الرجل ألا يصل رحمه، أو لا يسلم على فلان، او لا يضمن أحداً، أو لا يبيع بدين، أو لا يسلف أحداً، أو لا يتصدق، فهذه الأمور كلها بر وتقوى، نهى الله تعالى عن الحلف على عدم فعلها، أو يحلف ألا يصلح بين الناس، فيجب على الحالف على ذلك أن يحنث، ويكفر عن يمينه\n ولذلك قال - عليه الصلاة والسلام -:\n\n \" إنِّي لأَحْلِفُ عَلَى يَمِينٍ فَأَرَى خيْراً منْهَا، فأكفر عن يميني، وآتي الَّذِي هُوَ خَيْرٌ \" \n\nوقال لابن سَمُرَة:\n\n \" إذا حَلَفْتَ عَلَى يَمِينٍ، فَرأيْتَ غَيرهَا خَيْراً مِنْهَا، فاتِ الَّذِي هُوَ خَيْرٌ، وَكَفّرْ عَنْ يمِينِك \"\n \n\nأو يقول الحقّ جلّ جلاله { ولا تجعلوا لله } معرضاً لأيمناكم، تحلفون به كثيراً، نهيتكم عن ذلك، إرَادَةَ أنْ تكونوا أبراراً متقين، مصلحين { بين الناس } فإن الحالف مجترئ على الله، والمجترئ لا يكون برّاً متقياً، ولا موثوقاً به في إصلاح ذات البين، { والله سميع } لأيمانكم، { عليم } بنياتكم\n ثم رفع الحق تعالى الحرج عن يمين اللغو الذي لا قصد فيه - فقال: { لا يؤاخذكم الله باللغو في أيمانكم } ، وهو ما يجري على اللسان من غير قصد، كقول الرجل في مجرى كلامه: لا والله وبلى والله، قاله ابن عباس وعائشة - رضي الله عنهما -، وبه قال الشافعي\n وقال أبو هريرة والحسنُ وابنُ عباس - في أحد قوليه -: هو أن يحلف على ما يعتقد فيظهر خلافه",
      "translations": []
    }
  ]
}