{
  "chapter": "البقرة",
  "text": "لا يؤاخذكم الله باللغو فى ايمنكم ولكن يؤاخذكم بما كسبت قلوبكم والله غفور حليم",
  "translations": [
    {
      "translation": "God will not call you to account for that which is senseless in your oaths, but only for what is in your hearts; for God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hears everything you utter and knows everything. Allah does not call you to Account for unintentional and meaningless oaths, but will surely take you to task for oaths taken deliberately and in earnest: Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not take into account your inattentive oath. However, He will question you about what your hearts have gained. God is All-forgiving and Lenient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not take you to task for oaths which are made unintentionally but He does take you to task for deeds which your hearts have done; and Allah is Oft Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for that which is unintentional in your oaths, but He will call you to account for that which your hearts have earned. And Allah is Oft-Forgiving, Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not call you to account for what is vain in your oaths, but He will call you to account for what your hearts have earned, and Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not take you to task for a slip in your oaths; but He will take you to task for what your hearts have earned; and God is All-forgiving, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for that which is unintentional in your oaths. But He will take you to task for that which your hearts have garnered. Allah is Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not call you to account for any oaths you uttered unintentionally, but He will take you to task for what is intended in your hearts. God is most forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for the vain in Your oaths, but he shall take you to task for that which your hearts have earned, and He is the Forgiving, the Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for what is unconsidered in your oaths, but He will take you to task for what your hearts have incurred, and Allah is all-forgiving, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for thoughtlessness in your oaths, but for the intention in your hearts; and He is Oft-forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for that which is unintentional in your oaths, but He will call you to account for that which your hearts have earned. And Allah is Oft-Forgiving, Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for a slip in your oaths. But He will take you to task for that which is intended in your hearts. Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not hold you responsible for your unintentional oaths, but He holds you responsible for your intentions. God is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not impose blame upon you for what is unintentional in your oaths, but He imposes blame upon you for what your hearts have earned. And Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:225] God will not take you to task for a slip, that results, in your oaths, which is what the tongue utters spontaneously and unintentionally, such as ‘By God’, ‘Indeed, by God’: in such instances there is no sin and no redemption required; but He will take you to task for what your hearts have earned, what their intention is, when you commit perjury in your oaths; and God is Forgiving, of slips [in your oaths], Forbearing, since He delays the punishment of the one deserving it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah will not take you to task for that which is unintentional in your oaths) by imposing amends for unintentional oaths such as saying: \"No, by Allah\" or \"Yes indeed, by Allah\" upon buying and selling and upon other instances of idle talk. (But He will take you to task for that which your hearts have garnered) what is hidden in your hearts. (And Allah is Forgiving) of your unintentional oaths, (Clement) in that He does not hasten punishment upon you; it is also said: idle talk is an oath for committing transgression. If one refrains from it and makes amends, then Allah does not take one to task for it; but if one does not refrain from so doing, then Allah will take one to task for it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَّ يُؤَاخِذُكُمُ ٱللَّهُ بِٱلَّلغْوِ فِيۤ أَيْمَانِكُمْ } قالَ زيدُ بن علي عليهما السَّلامُ: فاللَّغوُ: أَنْ يَحلِفَ الرَّجلُ عَلى شَيءٍ وهو يَظُنُ أَنهُ كَذلِكَ\n ويقالُ إِنَّ اللَّغوَ: هو قولُ الرَّجلِ لاَ وَالله، وبلى والله، وهو لاَ يُريدُ أَنْ يُكَلِّمَ بِهَا مَالَ أَحداً، أَو يَقْطعَ بِهَا مَالَ إِنْسانٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوأما الإيمان الجارية على ألسنة العوام بلا إثبات ونفي، بل على سبيل الاتفاق فمما يُعفى عنه، فلذلك قال سبحانه: { لاَّ يُؤَاخِذُكُمُ ٱللَّهُ بِٱلَّلغْوِ } الواقع { فِيۤ أَيْمَانِكُمْ } بلا قصد وإرادةٍ { وَلَـٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ } بواسطة الأيمان الكاذبة من الأمور الباطلة التي لا تطابق الواقع، فلبستم فيها وأثبتهم بها { وَٱللَّهُ غَفُورٌ } لكم لو تبتم ورجعتم إليه عما كسبتم من الآثام { حَلِيمٌ } [البقرة: 225] بالانتقام رجاء أن يتوبوا عنها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وبه قال مالك رضي الله عنه، والأول ألْيَق بقوله تعالى: { ولكن يؤاخذكم بما كسبت قلوبكم } أي: بما عقدت عليه قلوبكم، { والله غفور } حيث لم يؤاخذكم باللغو، { حليم } حيث لم يعجل بالمؤاخذة على يمين الجدّ، تربصاً للتوبة\n الإشارة: يقول الحقّ جلّ جلاله: { لا تجعلوا الله عُرضة لأيمانكم } ، لكن اجعلوه عرضة لتعظيم قلوبكم ومشاهدة لأسراركم، فإني ما أظهرت اسمي لتبتذلوه في الأيمان والجدال، وإنما اسمي لتتلقَّوْه بالتعظيم والإجلال، فمن عظَّم اسمي فقد عظَّم ذاتي، ومن عظم ذاتي جعلته عظيماً في أرضي وعند أهل سمواتي، وجعلته برّاً تقيّاً، من أهل محبتي وودادي، وداعياً يدعو إلى معرفتي، ويصلح بيني وبين عبادي، فمن حلمي ورأفتي: أني لا أؤاخذ بما يجري على اللسان، وإنما أؤاخذ بما يقصده الجَنَان\n تنبيه: كثرة الحلف مذموم يدل على الخفة والطيش، وعدم الحلف بالكلية تعسف، وخيرُ الأمور أوساطها، كان عليه الصلاة والسلام يحلف في بعض أحيانه، يقول:\n\n \" لاَ وَمُقَلِّبِ الْقُلُوبِ \" \n\n \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ \" \n",
      "translations": []
    }
  ]
}