{
  "chapter": "البقرة",
  "text": "وان عزموا۟ الطلق فان الله سميع عليم",
  "translations": [
    {
      "translation": "And if they are bent on divorce, God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they resolve on divorce, (let them remember that Allah hears everything and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they choose divorce, God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they firmly decide to divorce them, Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they decide upon divorce, then Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they have resolved on a divorce, then Allah is surely Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if they resolve on divorce, surely God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they decide upon divorce (let them remember that) Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if they decide upon divorce, God is all hearing and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they resolve on divorcement, then verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they resolve on divorce, Allah is indeed all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if their intention is firm for divorce, Allah heareth and knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they decide upon divorce, then Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they resolve on divorce, surely, Allah is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they resolve to divorce—God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they decide on divorce - then indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:227] But if they resolve upon divorce, by not repealing it, then let them go through with it; surely God is Hearing, of what they say; Knowing, of their resolve, meaning that after the waiting period mentioned, they can only revert or divorce.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they decide upon divorce) have actually divorced and honoured their oaths ((let them remember that) Allah is Hearer) of one's oath, (Knower) of the fact that one's wife has been divorced through one single pronouncement of divorce after a period of fourth months and through honouring the oath that was made. This verse was revealed about a man who swore not to have sex with his wife for four months or longer. If this man had honoured his oath, his wife would have been considered divorced from him, one single act of divorce; if, on the other hand, he had sex with her before the elapse of this period, he should make amends for breaking his oath.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنْ عَزَمُواْ ٱلطَّلاَقَ } بلا حنث الحلف { فَإِنَّ ٱللَّهَ سَمِيعٌ } يسمع منهم الطلاق { عَلِيمٌ } [البقرة: 227] بنفرة قلوبهم منهن\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}