{
  "chapter": "البقرة",
  "text": "الذى جعل لكم الارض فرشا والسماء بناء وانزل من السماء ماء فاخرج به من الثمرت رزقا لكم فلا تجعلوا۟ لله اندادا وانتم تعلمون",
  "translations": [
    {
      "translation": "Who made the earth a bed for you, the sky a canopy, and sends forth rain from the skies that fruits may grow -- your food and sustenance. So, do not make another the equal of God knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has made the earth a bed for you and the sky a canopy; and it is He Who sends down rain from above for the growth of every kind of food products for your sustenance. So, when you know this, you should not set up equals to rank with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship God who has rendered the earth as a floor for you and the sky as a dome for you and has sent water down from the sky to produce fruits for your sustenance. Do not knowingly set up anything as an equal to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who has appointed the earth a base for you, and the sky a canopy – and caused water to pour down from the sky, thereby producing fruits as food for you; and do not knowingly set up rivals to Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a resting place for you, and the sky as a canopy, and sent down water (rain) from the sky and brought forth therewith fruits as a provision for you. Then do not set up rivals unto Allah (in worship) while you know (that He alone has the right to be worshipped).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who made the earth a resting place for you and the heaven a canopy and (Who) sends down rain from the cloud, then brings forth with it subsistence for you of the fruits; therefore do not set up rivals to Allah while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who assigned to you the earth for a couch, and heaven for an edifice, and sent down out of heaven water, wherewith He brought forth fruits for your provision; so set not up compeers to God wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath appointed the earth a resting-place for you, and the sky a canopy; and causeth water to pour down from the sky, thereby producing fruits as food for you. And do not set up rivals to Allah when ye know (better).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who made the earth a bed, and the sky a canopy; and it is He who sends down rain from above for the growth of every kind of food for your sustenance. And do not knowingly set up rivals to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath made the earth for you a carpet and the heaven a structure, and sent down from heaven water, and brought forth therewith fruits as a Provision for you; wherefore set not up compeers unto Allah while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—He who made the earth a place of repose for you, and the sky a canopy, and He sends down water from the sky and with it brings forth crops for your sustenance. So do not set up equals to Allah, while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth your couch, and the heavens your canopy; and sent down rain from the heavens; and brought forth therewith Fruits for your sustenance; then set not up rivals unto Allah when ye know (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a resting place for you, and the sky as a canopy, and sent down water (rain) from the sky and brought forth therewith fruits as a provision for you. Then do not set up rivals unto Allah (in worship) while you know (that He Alone has the right to be worshipped).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has made the earth a bed for you and the sky a dome, and has sent down water from the sky to bring forth fruits for your provision. Do not knowingly set up rivals to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who made the earth a habitat for you, and the sky a structure, and sends water down from the sky, and brings out fruits thereby, as a sustenance for you. Therefore, do not assign rivals to God while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He] who made for you the earth a bed [spread out] and the sky a ceiling and sent down from the sky, rain and brought forth thereby fruits as provision for you. So do not attribute to Allah equals while you know [that there is nothing similar to Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:22] He Who assigned to you, created [for you], the earth for a couch, like a carpet that is laid out, neither extremely hard, nor extremely soft so as to make it impossible to stand firm upon it; and heaven for an edifice, like a roof; and sent down from the heaven water, wherewith He brought forth, all types of, fruits for your provision; so set not up compeers to God, that is partners in worship, while you know that He is the Creator, that you create not and that only One that creates can be God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who hath appointed the earth a resting-place for you), a place for dwelling and sleeping, (and the sky a canopy), raised high above; (and causeth water to pour down from the sky), i.e. rain, (thereby producing) through this rain (fruits) different kinds of fruit (as food for you) as sustenance for you and all created beings. (So do not set up rivals to Allah) do not say that Allah has peers, different forms or coequals (when you know) that He is the fashioner of all these things. It is also said that (when you know) means: when you know from your own scripture that Allah does not have a son, coequal or peer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلَّذِي جَعَلَ لَكُمُ ٱلأَرْضَ فِرَاشاً } أَي مِهاداً\n\n\n\n\nوقولهُ تعالى: { فَلاَ تَجْعَلُواْ للَّهِ أَندَاداً } أي أَضدَاداً، وواحدُهَا نِدٌّ ونَديدٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِي جَعَلَ لَكُمُ ٱلأَرْضَ فِرَٰشاً } مبسوطاً؛ لتستقروا عليها وتسترزقوا منها { وَٱلسَّمَاءَ بِنَآءً } مرفوعاً؛ لترتقي الأبخرة والأدخنة والمتصاعدة إليهم وتتراكم السحب فيها { وَ } بعد وجود هذه الأسباب { أَنزَلَ } بمحض فضله وفيضه { مِنَ } جانب { ٱلسَّمَآءِ مَآءً } منبتاً لكم الزروع والأثمار المقومة لمزاجكم وإذا أنزل { فَأَخْرَجَ بِهِ } سبحانه؛ أي: بسبب الماء { مِنَ ٱلثَّمَرَٰتِ رِزْقاً لَّكُمْ } أي: أخرج رزقاً لكم من الثمرات والطعوم؛ لتعيشوا بها وتقدروا إلى التوجه إلى توحيده وتفريده الذي هو غاية إيجادكم وخلقكم وما يترتب على وجودكم، وإذا كان كذلك { فَلاَ تَجْعَلُواْ } أيها المنعمون بانتزاع النعم { للَّهِ } الواحد القهار لجميع الأغيار { أَندَاداً } أمثالاً في استحقاق العبادة والإيجاد والتكوين والترزيق والإنبات والإضاء وغير ذلك مما يتعلق بالألوهية { وَأَنْتُمْ } إن وصلتم إلى مرتبة التوحيد الذي { تَعْلَمُونَ } [البقرة: 22] أن سلسلة الأسباب منتهية إليه سبحانه، ولا موجود إلا هو، بل لا موجود إلا هو\n\n[الأنعام: 59] والتحقيق بهذا المقام والوصول إلى هذا المرام لا يحصل إلا بعد التخلق بأخلاق الله، والتخلق بأخلاقه لا يتيسر إلا بمتابعة المتخلق الكامل، وأكمل المتخلفين نبينا صلى الله عليه وسلم، والمتخلق بخلقه صلى الله عليه وسلم إنما يكون بالكتاب الجامع لجميع أخلاق الله، المنزل على مرتبته، الجامع جميع مراتب المظان، وفي نسخة أخرى: المظاهر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهو الشبه والمثل، و { أَنتُمْ تَعْلَمُونَ } حال من ضمير { فَلاَ تَجْعَلُوا } أي: فلا تجعلوا لله أنداداً والحال أنكم من أهل العلم\n يقول الحقّ جلّ جلاله: يا عبادي اعبدوني بقلوبكم بالتوحيد والإيمان، وبجوارحكم بالطاعة والإذعان، وبأرواحكم بالشهود والعيان، فأنا الذي أظهرتكم من العدم - أنتم ومَن كان قبلكم - وأسبلت عليهم سوابغ النعم، الأرض تقلكم والسماء تظلكم، والجهات تكتنفكم، وأنزلت من السماء ماء فأخرجت به أصنافاً { من الثمرات رزقاً لكم } ، فأنتم جوهرة الصدق، تنطوي عليكم أصداف مكنوناتي، وأنتم الذين أطلعتكم على أسرار مكنوناتي، فكيف يمكنكم أن تتوجهوا إلى غيري؟ وقد أغنيتكم بلطائف إحساني وبري، أنعمت عليكم أولاً بالإيجاد، وثانياً بتوالي الإمداد، خصصتكم بنور العقل والفهم، وأشرقت عليكم نبذة من أنوار القِدم، فبي عرفتموني، وبقدرتي عبدتموني، فلا شريك معي ولا ظهير، ولا احتياج إلى معين ولا وزير\n الإشارة: توجه الخطاب إلى العارفين الكاملين في الإنسانية الذي يعبدون الله تعظيماً لحق الربوبية، وقياماً بوظائف العبودية، وفيهم قال صاحب العينية:\n\nوقال قبل ذلك:\n",
      "translations": []
    }
  ]
}