{
  "chapter": "البقرة",
  "text": "نساؤكم حرث لكم فاتوا۟ حرثكم انى شئتم وقدموا۟ لانفسكم واتقوا۟ الله واعلموا۟ انكم ملقوه وبشر المؤمنين",
  "translations": [
    {
      "translation": "Women are like fields for you; so seed them as you intend, but plan the future in advance. And fear God, and remember, you have to face Him in the end. So convey glad tidings to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are your tilth: so you may go to your tilth as you please, but you should take care of your future and refrain from the displeasure of Allah. Know it well that One Day you shall meet Him. (O Prophet!) bear good tidings to the Believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are as fields for you. You may enter your fields from any place you want. Reserve something good for your souls (for the life hereafter). Have fear of God and know that you are going to meet Him. (Muhammad) give the glad news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you; so come into your tillage as you will; and first perform the deeds that benefit you; and keep fearing Allah, and know well that you have to meet Him; and (O dear Prophet Mohammed – peace and blessings be upon him) give glad tidings to the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go to your tilth, when or how you will, and send (good deeds, or ask Allah to bestow upon you pious offspring) for your own selves beforehand. And fear Allah, and know that you are to meet Him (in the Hereafter), and give good tidings to the believers (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go into your tilth when you like, and do good beforehand for yourselves, and be careful (of your duty) to Allah, and know that you will meet Him, and give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you; so come unto your tillage as you wish, and forward for your souls; and fear God, and know that you shall meet Him. Give thou good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tilth for you (to cultivate) so go to your tilth as ye will, and send (good deeds) before you for your souls, and fear Allah, and know that ye will (one day) meet Him. Give glad tidings to believers, (O Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are your fields. Go, then, into your fields as you will. Do good deeds, and fear God, and know that you shall meet Him.\" Give good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are tilth Unto you, so go in unto your tilth as ye list, and provide beforehand for your souls. And fear Allah, and know that ye are going to meet Him; and give thou glad tidings Unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are a tillage for you, so come to your tillage whenever you like, and send ahead for your souls, and be Godwary, and know that you will encounter Him; and give good news to the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are as a tilth unto you; so approach your tilth when or how ye will; but do some good act for your souls beforehand; and fear Allah. And know that ye are to meet Him (in the Hereafter), and give (these) good tidings to those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a tilth for you, so go to your tilth when or how you will, and send (good deeds, or ask Allah to bestow upon you pious offspring) before you for your ownselves. And fear Allah, and know that you are to meet Him (in the Hereafter), and give good tidings to the believers (O Muhammad SAW).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women are your planting place (for children); come then to your planting place as you please and forward (good deeds) for your souls, and fear Allah. And know that you shall meet Him. Give glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your women are cultivation for you; so approach your cultivation whenever you like, and send ahead for yourselves. And fear God, and know that you will meet Him. And give good news to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wives are a place of sowing of seed for you, so come to your place of cultivation however you wish and put forth [righteousness] for yourselves. And fear Allah and know that you will meet Him. And give good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:223] Your women are a tillage for you, that is, the place where you sow [the seeds of] your children; so come to your tillage, that is, the specified place, the front part, as, in whichever way, you wish, whether standing up, sitting down, lying down, from the front or the back: this was revealed in response to the Jews saying that if a person had vaginal intercourse with his wife from behind, the child would be born cross-eyed; and offer for your souls, righteous deeds, such as saying, ‘In the Name of God’ (bismillāh) when you commence intercourse; and fear God, in what He commands and prohibits; and know that you shall meet Him, at the Resurrection, where He will requite you according to your deeds; and give good tidings, of Paradise, to the believers, who feared Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your women are a tilth for you (to cultivate)) He says: the vulvas of your wives are plantations for your offspring (so go to your tilth) your plantations (as ye will) as you please, from behind or front as long as the penetration is in the pudendum, (and send (good deeds) before you for your souls) righteous children, (and fear Allah) regarding penetrating your wives in their anus or having sex with them during menstruation, (and know that ye will (one day) meet Him) that you will see Him after you die and He will reward you according to your deeds. (Give glad tidings to believers (0 Muhammad)) Allah says: give glad tidings, Muhammad, to the believers, who ward off penetrating their wives in their anus and further abstain from having sex with them when they are menstruating, that Paradise will be theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَنَّىٰ شِئْتُمْ } معناه كَيفَ شِئْتُمْ فِي المأتى ومِنْ حَيثُ يكونُ الوَلدُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ نِسَآؤُكُمْ } أيها المؤمنون { حَرْثٌ لَّكُمْ } أي: موضع حراثتكم ومحل إتيانكم { فَأْتُواْ حَرْثَكُمْ أَنَّىٰ شِئْتُمْ } مقبلين أو مدبرين، روي أن اليهود كانوا يقولون: من جامع امرأته من جانب دبرها كان ولده أحول، رد الله عليهم بهذه الآية { وَقَدِّمُواْ لأَنْفُسِكُمْ } أيها المستكشفون عن سرائر الأمور من الحكم والأسرار المودعة في التلذذ والنزول والانبعاث والشوق والانتعاش، وأنواع الكيفيات المستحدثة عند الوقاع لإيجاد النسل وإبقاء النوع، ولا تغفلوا عن سرائره، ولا تطمئوا بمجرد قضاء الشهوة كالحيوانات العُجم { وَٱتَّقُواْ ٱللَّهَ } عن الخيانة والخباثة، والإتيان إلى غير المآتي المأمورة في الشرع، وغير ذلك من المحظورات المسقطة لحرمات الله الواقعة في أمر الجماع والاجتماع؛ إذ هو منزلة إقدام أولي الأحلام من عظماء الأنام { وَٱعْلَمُوۤاْ أَنَّكُمْ } بأجمعكم { مُّلاَقُوهُ } سبحانه فتزودوا بزادٍ يليق بجانبه { وَبَشِّرِ } يا أكمل الرسل { ٱلْمُؤْمِنِينَ } [البقرة: 223] القائمين بحدود الله، المحافظين عليها دائماً، الخائفين من خشية الله، الراجين من رحمة الله بأن لهم عند ربهم روضة الرضاء وجنة التسليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن الحق تعالى كيفية إتيان النساء بعد الطُهر، فقال: { نساؤكم حرث لكم } ، أي: مواضع حرثكم، شبه ما يلقى في أرحامهن من النطف، بالبذر، والأرحام أرض لها، { فأتوا حرثكم } أي: محل حرثكم، وهو الفرج، { أنى شئتم } أي: من أي جهة شئتم\n رُوِيَ أن اليهود كانوا يقولون: مَنْ جامع امرأته مِنْ خَلْفهَا في قُبُلِهَا جَاء الولُد أَحْولَ، فذُكر لرسول الله صلى الله عليه وسلم فنزلت\n وقيل: إنَّ قُريشاً كانوا يأتون النساء من قُدَّام، مستلقية، والأنصار كانوا يأتوهن من خلف، باركة، فتزوج رجل من المهاجرين امراة من الأنصار، فأراد أن يفعل عادته، فامتنعت، وأرادت عادتها، فاختصما إلى رسول الله صلى الله عليه وسلم، فنزلت الآية بالتخيير للرجل، مع الإتيان في المحل، وأما الإتيان في الدُّبُر فحرام، ملعونٌ فاعله، وقال في القوت: { فأتوا حرثكم أنى شئتم } أي: في أي وقت شئتم، ومن أي مكان شئتم، مع اتحاد المحل\n هـ\n ثم حذَّر الحق تعالى من متابعة شهوة النساء، والغفلة عن الله، فقال: { وقدموا لأنفسكم } ما تجدون ثوابه مُدخراً عنده، وهو ذكر الله في مظان الغفلة، قيل: التسمية قبل الوطء وقيل: طلب الولد، والتحقيق: أنه الحضور مع الحق عند هيجان الشهوة، قال بعض العارفين: إني لا أغيب عن الله ولو في حالة الجماع\n\n\nهـ\n وهذا شأن أهل الجمع، لا يفترقون عن الحضرة ساعة\n وهذه التقوى التي أمر الله بها بقوله: { واتقوا الله } أي: لا تغيبكم عنه شهوةُ النساء، { واعلموا أنكم ملاقوه } فترون وبال الغفلة وجزاء اليقظة، { وبشر المؤمنين } بالقرب من رب العالمين\n الإشارة: إذا سُئلت - أيها العارف - عن النفس في حال جنابتها بالغفلة، وحال تلبسها بنجاسة حب الدنيا، فقل: هي أذى، أي: قذر ونجس، من قَرُب منها لطَّخته بنجاستها، فلا يحل القرب منه، أو الصحبة معها، حتى تطهر من جنابة الغفلة باليقظة، ومن نجاسة حب الدنيا بالزهد، ورفع الهمة عنها، فإذا تطهرت فاتها، وردها إلى حضرة مولاها، كما أمرك الله، { إن الله يحب التوابين } ، وقد تابت ورجعت إلى مولاها، { ويحب المتطهرين } ، وقد تطهرت من جنابة الغفلة، وتنزهت عن نجاسة الدنيا برفع الهمة، فصارت لك أرضاً لزراعة حقوق العبودية، ومَنْبَتا لبذر شهود عظمة الربوبية، فأتوا حرثكم - أيها العارفون - أنى شئتم، أي: ازرعوا في أرض نفوسكم من أوصاف العبودية ما شئتم، وفي أي وقت شئتم\n فبقدر ما تزرعون من العبودية تحصدون من الحرية\n وبقدر ما تزرع فيها من الذل تحصده من العز، وبقدر ما تزرع فيها من الفقر تحصده من الغنى، وبقدر ما تزرع فيها من التواضع تحصده من الشرف والرفعة\n والحاصل: بقدر ما تزرع فيها من السفليات تحصد ضده من العلويات\n قال تعالى:\n\n[القصص: 5، 6]\n فإذا تركتها هَمَلاً، أنبتت لك الشوك والحنظل، { وقدموا لأنفسكم } من أوصاف العبودية ما تجدونه أمامكم من مشاهدة الربوبية، واتقوا الله فلا تشهدوا معه سواه، واعلموا أنكم ملاقوه حين تغيبون عن وجودكم وتفقدونه، وبشر المؤمنين الموقنين بشهود رب العالمين\n ولما تكلم الحقّ جلّ جلاله على بعض أحكام النكاح، أراد أن يتكلم على الإيلاء، وهو الحلف على عدم مس المرأة وجماعها، وقدّم على ذلك النهي عن كثرة الحلف لأنه هو السبب في الوقوع في الإيلاء\n\n",
      "translations": []
    }
  ]
}