{
  "chapter": "البقرة",
  "text": "والمطلقت يتربصن بانفسهن ثلثة قروء ولا يحل لهن ان يكتمن ما خلق الله فى ارحامهن ان كن يؤمن بالله واليوم الءاخر وبعولتهن احق بردهن فى ذلك ان ارادوا۟ اصلحا ولهن مثل الذى عليهن بالمعروف وللرجال عليهن درجة والله عزيز حكيم",
  "translations": [
    {
      "translation": "Women who are divorced have to wait for three monthly periods, and if they believe in God and the Last Day they must not hide unlawfully what God has formed within their wombs. Their husbands would do well to take them back in that case, if they wish to be reconciled. Women also have recognised rights as men have, though men have an edge over them. But God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall keep themselves in waiting for three menstrual courses and it is unlawful for them, if they believe in Allah and the Last Day, to hide whatever Allah might have created in their wombs. Should their husbands desire reconciliation during this time they are entitled to take them back into wedlock. Women have the same rights against their men as men have against them; but men have a degree above them. Allah is All- Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The divorced women must wait up to three menstrual cycles before another marriage. If they believe in God and the Day of Judgment, it is not lawful for them to hide what God has created in their wombs. Within their waiting period their husbands have the right to resume marital relations, if they want reconciliation. Women have benefits as well as responsibilities. Men have a status above women. God is Majestic and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And divorced women shall restrain themselves for three menstrual periods; and it is not lawful for them to conceal what Allah has created in their wombs if they believe in Allah and the Last Day; and their husbands have the right to take them back, during this time, if they desire reconciliation; and the women also have rights similar to those of men over them, in accordance with Islamic law – and men have superiority over them; and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And divorced women shall wait (as regards their marriage) for three menstrual periods, and it is not lawful for them to conceal what Allah has created in their wombs, if they believe in Allah and the Last Day. And their husbands have the better right to take them back in that period, if they wish for reconciliation. And they (women) have rights (over their husbands as regards living expenses) similar (to those of their husbands) over them (as regards obedience and respect) to what is reasonable, but men have a degree (of responsibility) over them. And Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the divorced women should keep themselves in waiting for three courses; and it is not lawful for them that they should conceal what Allah has created in their wombs, if they believe in Allah and the last day; and their husbands have a better right to take them back in the meanwhile if they wish for reconciliation; and they have rights similar to those against them in a just manner, and the men are a degree above them, and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall wait by themselves for three periods; and it is not lawful for them to hide what God has created in their wombs; if they believe in God and the Last Day. In such time their mates have better right to restore them, if they desire to set things right. Women have such honourable rights as obligations, but their men have a degree above them; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Women who are divorced shall wait, keeping themselves apart, three (monthly) courses. And it is not lawful for them that they should conceal that which Allah hath created in their wombs if they are believers in Allah and the Last Day. And their husbands would do better to take them back in that case if they desire a reconciliation. And they (women) have rights similar to those (of men) over them in kindness, and men are a degree above them. Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women should wait for three menstrual cycles; it is unlawful for them, if they believe in God and the Last Day, to hide what God has created in their wombs. Their husbands have the right to take them back within that time, if they desire to be reconciled. The wives have rights corresponding to those which the husbands have, according to what is recognized to be fair, but men have a rank above them. God is almighty and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the divorced women shall keep themselves in waiting for three courses nor is it allowed unto them that they should hide that which Allah hath created in their wombs, if they believe in Allah and the Last Day. And their husbands are more entitled to their restorations during the same, if they desire rectification. Unto women is due likes that which is due from women reputably. And for men is a degree over them. And Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall wait by themselves for three periods of purity [after menses], and it is not lawful for them to conceal what Allah has created in their wombs if they believe in Allah and the Last Day; and their husbands have a greater right to restore them during this [duration], if they desire reconcilement. The wives have rights similar to the obligations upon them, in accordance with honourable norms; and men have a degree above them, and Allah is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall wait concerning themselves for three monthly periods. Nor is it lawful for them to hide what Allah Hath created in their wombs, if they have faith in Allah and the Last Day. And their husbands have the better right to take them back in that period, if they wish for reconciliation. And women shall have rights similar to the rights against them, according to what is equitable; but men have a degree (of advantage) over them. And Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And divorced women shall wait (as regards their marriage) for three menstrual periods, and it is not lawful for them to conceal what Allah has created in their wombs, if they believe in Allah and the Last Day. And their husbands have the better right to take them back in that period, if they wish for reconciliation. And they (women) have rights (over their husbands as regards living expenses, etc.) similar (to those of their husbands) over them (as regards obedience and respect, etc.) to what is reasonable, but men have a degree (of responsibility) over them. And Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall wait by themselves for three periods. It is unlawful for them, if they believe in Allah and the Last Day, to hide what He has created in their wombs, in which case their husbands would have a better right to restore them should they desire reconciliation. And for them similar to what is due from them with kindness. But men have a degree above them. Allah is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women shall wait by themselves for three periods. And it is not lawful for them to conceal what God has created in their wombs, if they believe in God and the Last Day. Meanwhile, their husbands have the better right to take them back, if they desire reconciliation. And women have rights similar to their obligations, according to what is fair. But men have a degree over them. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorced women remain in waiting for three periods, and it is not lawful for them to conceal what Allah has created in their wombs if they believe in Allah and the Last Day. And their husbands have more right to take them back in this [period] if they want reconciliation. And due to the wives is similar to what is expected of them, according to what is reasonable. But the men have a degree over them [in responsibility and authority]. And Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:228] Divorced women shall wait by themselves, before remarrying, for three periods (qurū’in is the plural of qar’), of purity or menstruation — these are two different opinions — which begin from the moment of divorce. This [stipulation] applies to those who have been sexually penetrated but not to those otherwise, on account of His saying, there shall be no [waiting] period for you to reckon against them [Q. 33:49]. The waiting period for immature or menopausal women is three months; pregnant women, on the other hand, must wait until they give birth, as stated in the sūrat al-Talāq [Q. 65:4], while slavegirls must wait two months, according to the Sunna. And it is not lawful for them to hide what God has created in their wombs, of child or menstruation, if they believe in God and the Last Day. Their mates, their spouses, have a better right to restore them, to bring them back, even if they refuse, in such time, that is, during the waiting period, if they desire to set things right, between them, and put pressure on the woman [to return]; the statement is not a condition for the possibility of return, but an incitement [to set things right] in the case of repealed divorce; the term ahaqq, ‘better right to’, does not denote any priority, since, in any case, no other person has the right to marry them during their waiting period; women shall have rights, due from their spouses, similar to those, rights, due from them, with justice, as stipulated by the Law, in the way of kind conjugality and not being harmed; but their men have a degree above them, in rights, as in their duty to obey their husbands, because of their [the husbands’] payment of a dowry and their [husbands] being the bread-winners; God is Mighty, in His Kingdom, Wise, in what He has ordained for His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Women who are divorced) through one or two pronouncements of divorce (shall wait) shall wait a certain time called the waiting period, (keeping themselves apart, three (monthly) courses) for three menstruation periods. (And it is not lawful for them that they should conceal) their pregnancy (that which Allah hath created in their wombs) of offspring (if they are believers in Allah and the Last Day. And their husbands would do better to take them back) to take them back as their wives (in that case) during the waiting period or if they are pregnant (if they desire reconciliation.) This is because in the early period of Islam, when a man divorced his wife via one or two pronouncements of divorce, he had a better right to take her back after the lapse of the waiting period, before her marrying again. Later, the right to take one's wife back was abrogated by the saying of Allah: (Divorce must be pronounced twice). Similarly, a man had a better right to take his wife back if she were pregnant, even if he had pronounced her divorce a thousand times. This was however abrogated by Allah's saying: (divorce them for their (legal) period) [65:1]. (And they (women) have rights) and inviolability with their husbands (similar to those) of their husbands (over them in kindness) in kind companionship and intercourse, (and men are a degree above them) in relation to the reasoning faculty, inheritance, blood money, as witnesses in court and also that which they owe them in terms of expenditure and service. (Allah is Mighty) in that He is vengeful vis-a-vis whoever leaves that which is between a husband and wife of rights and inviolability, (Wise) regarding that which He has ruled between 39 them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ } معناه يَمسُكنَّ أَنْفُسُهُنَّ لاَ يَتزوجنَّ حتَّى تَنقَضِي عِدَّتُهُنَّ\n\n\n\n\nوقولهُ تعالى: { ثَلاَثَةَ قُرُوۤءٍ } فالقُروء: الحيضُ واحدُها قُرءٌ\n والجمعُ: أَقراءٌ\n وقالَ بعضُهُمْ القُرءُ: الطُّهرُ\n\n\n\n\nوقولهُ تعالى: { لاَ يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ ٱللَّهُ فِيۤ أَرْحَامِهِنَّ } قالَ زيدُ بن علي عليهما السَّلامُ: المعنى يريدُ بهِ الحَيضَ والحَبلَ\n\n\n\n\nوقولهُ تعالى: { وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ } فالبُعُولَةُ والبُعُولُ واحدٌ: وهو الأَزواجُ\n [و] بَعْلُ الشيءِ أَيضاً ربُّهُ، وَمالِكُهُ\n\n\n\n\nوقولهُ تعالى: { وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ } معناهُ مَنْزِلَةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلْمُطَلَّقَاتُ } المدخولات بهن { يَتَرَبَّصْنَ } ينتظرن { بِأَنْفُسِهِنَّ ثَلاَثَةَ قُرُوۤءٍ } أي: مضى مدتها والقروء: يطلق على الحيض والطهر، وأصل وضعه للانتقال من الطهر إلى الحيض، وهو المراد في الآية لأنه لاستبراء الرحم والدال على البراءة، هذا { وَلاَ يَحِلُّ لَهُنَّ } أي: المطلقات المعتدات { أَن يَكْتُمْنَ مَا خَلَقَ ٱللَّهُ فِيۤ أَرْحَامِهِنَّ } مدة المعدة من الحيض؛ لئلا يختلط النسب { إِن كُنَّ يُؤْمِنَّ بِٱللَّهِ } العالم بالسرائر { وَٱلْيَوْمِ ٱلآخِرِ } الذي تبلى فيه جميع السرائر والضمائر { وَبُعُولَتُهُنَّ أَحَقُّ } أليق وأولى { بِرَدِّهِنَّ } إليهم { فِي ذَلِكَ } أي: في زمان التربص { إِنْ أَرَادُوۤاْ } أي: الأزواج { إِصْلاَحاً وَ } اعلموا أيها المؤمنون { لَهُنَّ } عليكم من الرعاية والمحافظة على آداب الخدمة، والاستئناس وغير ذلك { مِثْلُ ٱلَّذِي } لكم { عَلَيْهِنَّ بِٱلْمَعْرُوفِ } من الحقوق والرعاية والمحافظة { وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ } فضيلة بحسب الخلق والعقل والتميز وكمال الإيمان والمحافظة على حدود الله وامتثال مأموراته { وَٱللَّهُ عَزِيزٌ } يعز من يشاء من عباده ويذل من يشاء { حَكِيمٌ } [البقرة: 228] في فعله لا يُسأل عما يفعل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَٱلْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلاَثَةَ قُرُوۤءٍ وَلاَ يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ ٱللَّهُ فِيۤ أَرْحَامِهِنَّ إِن كُنَّ يُؤْمِنَّ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَلِكَ إِنْ أَرَادُوۤاْ إِصْلاَحاً\n\n\n }  قلت: القُرء هو الطهر الذي يكون بعد الحيض، عند مالك، وجمع القلة: أقراء، والكثرة: قروء، واستعمله هنا باعتبار كثرة المطلقات، و { ثلاثة }: مفعول مطلق، أو ظرف، و { بعولتهن }: جمع بعل، والتاء لتأنيث الجماعة\n يقول الحقّ جلّ جلاله: { والمطلقات يتربصن } أي: يمكثن عن التزوج، { بأنفسهن ثلاثة قروء } أي: أطهار، وتَعْتَدُّ بالطهر الذي طلقها فيه، فتحيض، ثم تطهر، ثم تحيض، ثم تطهر، فإذا رأت الحيضة الثالثة خرجت من العدة، هذا في غير الحامل، واما الحامل فعدتها وضع حملها\n { ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن } من الولد استعجالاً لإتمام العدة، أو من الحيض استبقاءً لتمادي العدة، وتُصدق في ذلك كله، فإن كانت { تؤمن بالله واليوم الآخر } فلا يحل لها أن تكتم ما استؤمنت عليه، { وبعولتهن } أي: أزواجهن: { أحق بردهن في ذلك } التربص، إن كان الطلاق رجعيّاً، وإلا بانت منه، وينبغي للزوج أن يراجعها في العدة، إن أراد بذلك الإصلاح والمودة، لا الإضرار بها، وإلا حرم عليه ارتجاعها، إذ\n\n \" لاَ ضَرَرَ ولا ضرار \" \n\n، كما قال - عليه الصلاة والسلام -\n الإشارة: إذا طُلّقَتْ النَّفْسُ، ووقع البعد منها حتى طهرت ثلاثة: الطهر الأول: من الإصرار على الذنوب والمخالفات، الطهر الثاني: من العيوب والغفلات، الطهر الثالث: من الركون إلى العادات الوقوف مع المحسوسات، دون المعاني وأنوار التجليات - حلَّتْ رجعتُها والاصطلاح معها، ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن: من العلوم والمعارف والأنوار، وذلك إذا استشرفَتْ على حضرة الأسرار، فإنها تفيض بالعلوم والحكم، أو ما لا يحصى، فينبغي أن تطلع عليها من يقتدي بشأنها\n وبعولتهن أحق بردهن، والصلح معهن، بعد تمام تطهيرهن، إن أرادوا بذلك إصلاحاً، وهو إدخالها في الحضرة، ونعيمها بالشهود والنظرة\n وبالله التوفيق\n ثم ذكر الحقّ جلّ جلاله حقوق الزوجية، فقال: {\n\n\n وَلَهُنَّ مِثْلُ الَّذِي عَلَيْهِنَّ بِالْمَعْرُوفِ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ وَاللَّهُ عَزِيزٌ حَكِيمٌ }  يقول الحقّ جلّ جلاله: وللنساء حقوق على الرجال، كما أن للرجال حقوقاً على النساء، فحقوق النساءعلى الرجال: الإنفاق، والكسوة، والإعفاف، وحسن المعاشرة، وكان ابنُ عمر - رضي الله عنهما - يقول: إني لأُحِبُّ أن أتزيَّنَ للمرأة كما تتزين لي، ويقرأ هذه الآية\n وحقوق الرجل على المرأة: إصلاح الطعام والفراش، وطاعة زوجها في كل ما يأمرها به من المباح، وحفظ فرجها، وصاينة ماله الذي ائتمنت عليه - إلى غير ذلك من الحقوق، فللنساء حقوق على الرجال { مثل الذي عليهن بالمعروف } من غير ضرر ولا ضرار\n\n\nولا تفريط ولا إفراط، { وللرجال عليهم درجة } أي: فضيلة لأن الرجال قوّامون على النساء، ولهم فضل في الميراث، والقسمة، وكثير من الحقوق، فضلهم الله على النساء: { والله عزيز } لا يعجزه عقاب من خالف أمره، لكنه يمهل ولا يُهمل، { حكيم } لا يفعل إلا لمصلحة ظاهرة أو خفية\n والله تعالى أعلم\n الإشارة: للنفس حقوق على صاحبها، كما له حقوق عليها، قال - عليه الصلاة والسلام -:\n\n \" إنَّ لنفْسك عَلَيْكَ حَقّاً، وَلزَوْجِكَ عَلَيْك حَقّاً، ولِربِكَ عليك حَقّاً، فأَعْطِ كُلّ ذِي حَقِ حَقَّهُ \" \n\nفالنفس مغرفة للسر، فإذا تعبت سقط منها السر، كذلك نفس الإنسان، إذا تحامل عليها حتى تعللت، ودخلها الوجع، تعذر عليها كثر من العبادات، لا سيما الفكرة، فلا بد من حفظ البشرية، وإنا ينبغي قتلها بالأمور التي لا تُخِلُّ بصحتها، فعليها طاعتك فيما تأمرها به، كما عليك حفظها مما تتضرر به\n وللرجال الأقوياء عليها تسلطٌ وتصرف، فهي مملوكة في أيديهم، وهم غالبون عليها، والله غالب على أمره، وهو العزيز الحكيم\n\n",
      "translations": []
    }
  ]
}