{
  "chapter": "البقرة",
  "text": "الطلق مرتان فامساكۢ بمعروف او تسريحۢ باحسن ولا يحل لكم ان تاخذوا۟ مما ءاتيتموهن شيـا الا ان يخافا الا يقيما حدود الله فان خفتم الا يقيما حدود الله فلا جناح عليهما فيما افتدت به تلك حدود الله فلا تعتدوها ومن يتعد حدود الله فاو۟لئك هم الظلمون",
  "translations": [
    {
      "translation": "Divorce is (revokable) two times (after pronouncement), after which (there are two ways open for husbands), either (to) keep (the wives) honourably, or part with them in a decent way. You are not allowed to take away the least of what you have given your wives, unless both of you fear that you would not be able to keep within the limits set by God. If you fear you cannot maintain the bounds fixed by God, there will be no blame on either if the woman redeems herself. Do not exceed the limits of God, for those who exceed the bounds set by God are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce may be pronounced twice; then either the wife be kept honourably or parted with gracefully. And it is not lawful for you to take back anything out of what you have given them. There is, however, an exception to this; if you fear that they might not be able to keep within the limits imposed by Allah, there is no harm if both agree mutually that the wife should obtain divorce by giving something as compensation to the husband. These are the bounds set by Allah; therefore do not violate them, for those who violate the bounds of AIIah are the tansgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A marital relation can only be resumed after the first and second divorce, otherwise it must be continued with fairness or terminated with kindness. It is not lawful for you to take back from women what you have given them unless you are afraid of not being able to observe God's law. In this case, it would be no sin for her to pay a ransom to set herself free from the bond of marriage. These are the laws of God. Do not transgress against them; those who do so are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This type of divorce is up to twice; the woman must then be retained on good terms or released with kindness; and it is not lawful for you to take back from women a part of what you have given them except when both fear that they may not be able to stay within the limits established by Allah; so if you fear that they may not be able to observe the limits of Allah, then it is no sin on them if the woman pays to get her release; these are the limits set by Allah, so do not exceed them; and those who transgress Allah’s limits are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The divorce is twice, after that either you retain her on reasonable terms or release her with kindness. And it is not lawful for you (men) to take back (from your wives) any of what you gave them (the Mahr, bridal-money given by the husband to his wife at the time of marriage), except when both parties fear that they would be unable to keep the limits ordained by Allah (e.g., to deal with each other on a fair basis). Then if you fear that they would not be able to keep the limits ordained by Allah, then there is no sin on either of them if she gives back (the Mahr or a part of it). These are the limits ordained by Allah, so do not transgress them. And whoever transgresses the limits ordained by Allah, then such are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce may be (pronounced) twice, then keep (them) in good fellowship or let (them) go with kindness; and it is not lawful for you to take any part of what you have given them, unless both fear that they cannot keep within the limits of Allah; then if you fear that they cannot keep within the limits of Allah, there is no blame on them for what she gives up to become free thereby. These are the limits of Allah, so do not exceed them and whoever exceeds the limits of Allah these it is that are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce is twice; then honourable retention or setting free kindly. It is not lawful for you to take of what you have given them unless the couple fear they may not maintain God's bounds; if you fear they may not maintain God's bounds, it is no fault in them for her to redeem herself. Those are God's bounds; do not transgress them. Whosoever transgresses the bounds of God -- those are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce must be pronounced twice and then (a woman) must be retained in honour or released in kindness. And it is not lawful for you that ye take from women aught of that which ye have given them; except (in the case) when both fear that they may not be able to keep within the limits (imposed by) Allah. And if ye fear that they may not be able to keep the limits of Allah, in that case it is no sin for either of them if the woman ransom herself. These are the limits (imposed by) Allah. Transgress them not. For whoso transgresseth Allah's limits: such are wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce may be pronounced twice, and then a woman must be retained honourably or released with kindness. It is not lawful for you to take away anything of what you have given your wives, unless both fear that they would not be able to observe the bounds set by God. In such a case it shall be no sin for either of them if the woman opts to give something for her release. These are the bounds set by God; do not transgress them. Those who transgress the bounds of God are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorcement is twice: thereafter either retaining her reputably, or letting her off kindly. And it is not allowed unto you to take away aught ye have given them, except the twain fear that they may not observe the bonds of Allah. If yes fear that the twain may not observe the bonds of Allah, then no blame is on the twain for that where with she ransometh herself. These are the bonds of Allah, wherefore trespass them not; and whosoever trespasseth the bonds of Allah, then verily these! they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Revocable] divorce may be only twice; then [let there be] either an honourable retention, or a kindly release. It is not lawful for you to take back anything from what you have given them, unless the couple fear that they may not maintain Allah’s bounds; so if you fear they would not maintain Allah’s bounds, there is no sin upon them in what she may give to secure her own release. These are Allah’s bounds, so do not transgress them, and whoever transgresses the bounds of Allah—it is they who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A divorce is only permissible twice: after that, the parties should either hold Together on equitable terms, or separate with kindness. It is not lawful for you, (Men), to take back any of your gifts (from your wives), except when both parties fear that they would be unable to keep the limits ordained by Allah. If ye (judges) do indeed fear that they would be unable to keep the limits ordained by Allah, there is no blame on either of them if she give something for her freedom. These are the limits ordained by Allah; so do not transgress them if any do transgress the limits ordained by Allah, such persons wrong (Themselves as well as others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness. And it is not lawful for you (men) to take back (from your wives) any of your Mahr (bridal money given by the husband to his wife at the time of marriage) which you have given them, except when both parties fear that they would be unable to keep the limits ordained by Allah (e.g. to deal with each other on a fair basis). Then if you fear that they would not be able to keep the limits ordained by Allah, then there is no sin on either of them if she gives back (the Mahr or a part of it) for her Al-Khul' (divorce). These are the limits ordained by Allah, so do not transgress them. And whoever transgresses the limits ordained by Allah, then such are the Zalimun (wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce is twice, then an honorable keeping or allowed to go with kindness. It is unlawful for you to take from them anything you have given them, unless both fear that they will not be able to keep within the Bounds of Allah; in which case it shall be no offense for either of them if she ransom herself. These are the Bounds of Allah; do not transgress them. Those who transgress the Bounds of Allah are harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce is allowed twice. Then, either honorable retention, or setting free kindly. It is not lawful for you to take back anything you have given them, unless they fear that they cannot maintain God's limits. If you fear that they cannot maintain God’s limits, then there is no blame on them if she sacrifices something for her release. These are God’s limits, so do not transgress them. Those who transgress God’s limits are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Divorce is twice. Then, either keep [her] in an acceptable manner or release [her] with good treatment. And it is not lawful for you to take anything of what you have given them unless both fear that they will not be able to keep [within] the limits of Allah. But if you fear that they will not keep [within] the limits of Allah, then there is no blame upon either of them concerning that by which she ransoms herself. These are the limits of Allah, so do not transgress them. And whoever transgresses the limits of Allah - it is those who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:229] Divorce, that is, repudiation of the type that may be revoked, is twice; then honourable retention, that is to say, you are then obliged to revert to them to retain them, without harming them; or setting, them, free kindly. It is not lawful for you, O male spouses, to take of what you have given them, of dowry, if you   divorce them, unless the, married, couple fear that they may not maintain God’s bounds, that is to say, that they will not honour the rights God has established for them (a variant reading [for yakhāfā, ‘they (dual form) fear’] has yukhāfā, with the direct object taking the accusative ending; allā yuqīmā is an inclusive substitution for the person [governing the verb]; both verbs are also read in the second person [sc. takhāfā, ‘you fear’, tuqīmā, ‘you maintain’]). If you fear they may not maintain God’s bounds, neither of them would be at fault if she were to ransom herself, of some money, so that he should divorce her. In other words, in this instance, there is no culpability either for the man, should he take of the dowry, or for the woman, should she offer of it. Those, prescriptions mentioned, are God’s bounds; do not transgress them. Whoever transgresses God’s bounds — those are the evildoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Divorce must be pronounced twice) He says: the divorce in which a man is entitled to take back his wife is pronounced once on two separate occasions (and then (a woman) must be retained) before she is pronounced divorced a third time and before performing major ritual ablution from the third menstruation (in honour) with kind companionship and intercourse (or released in kindness) or divorced a third time with such kindness as restores her rights. (And it is not lawful for you that ye take from women aught of that which ye have given them) of dowry; (except (in the case) when both arbiters) when the husband and wife both know that she wants to ransom her divorce (fear that they may not be able to keep the limits (imposed by) Allah) the rulings of Allah regulating the relationship between husband and wife. (And if ye fear) if you know (that they may not be able to keep the limits (imposed by) Allah) the rulings of Allah regulating the relationship between husband and wife, (in that case it is no sin for either of them) and especially the husband (if the woman ransom herself) if the husband takes what the woman ransoms herself with, out of the generosity of her soul. This verse was revealed about Thabit Ibn Qays Ibn Shammas whose wife Jamilah was the daughter of 'Abdullah Ibn Ubayy Ibn Salul, chief of the hypocrites. This woman ransomed her divorce from her husband by giving him back what he gave her as dowry. (These are the limits of Allah) the rulings of Allah regulating the relationship between husband and wife, (Transgress them not) do not step beyond that which Allah has prohibited. (For whoso transgresseth Allah's limits) steps beyond them: (such are wrong-doers) harmful to themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِلاَّ أَن يَخَافَآ } معناهُ استَقينا\n ومثلُهُ:\n\n[النساء: 3] معناه أَيْقَنْتُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلطَّلَٰقُ } الصادر من أولي العزائم وذوي الألباب { مَرَّتَانِ } مرة عند عروض النفرة المنافية للرغبة السابقة، المستلزمة للزواج والازدواج، المنبعث عن طبيعته المقتضية بالطبع للاختلافات والازدواجيات الواقعة بين أسبابها، وهي الأوصاف الإلهية، ثم إذا رجع العازم عنه لا بد أن يكون رجوعه أيضاً عن رويةٍ وتدبرٍ، بأن يلاحظ أنه سبب انبعاث الرغبة السابقة واشتياقها ثانياً، فيكذب نفسه ويرجع إليها، وإن طلقها بعد تلك المراجعة { فَإِمْسَاكٌ بِمَعْرُوفٍ } أي: فعليه بعد الطلقة الثانية أحد الأمرين، ولا يتجاوز عنه إلى الطلقة الثالثة، وإلا لسقط عن زمرة العقلاء العازمين على الأمور الشرعية بالعزيمة الخالصة، إمَّا إمساك بالمعروف، والمستحسن عند الله وعند المؤمنين، بل لا بد أن يكون هذا الإمساك أحسن من الإمساك السابق على الطلاق حي الوفاق { أَوْ تَسْرِيحٌ } وإطلاق وتبعيد مقارن { بِإِحْسَٰنٍ } من مالٍ وخلقٍ وكلمةٍ طيبة؛ ليرتفع غبار العداوة والبغضاء الواقعة بإغواء الشيطان بينهماز\n\n\n\n{ وَلاَ يَحِلُّ لَكُمْ } أيها الحكام المقيمون للأحكام الشرعية أصلاً { أَن تَأْخُذُواْ } من النساء { مِمَّآ آتَيْتُمُوهُنَّ } من المهور والصداقات { شَيْئاً } وتردوه إلى أزواجهن { إِلاَّ أَن يَخَافَآ } أي: الزوجان كل منهما على نفسه { أَلاَّ يُقِيمَا حُدُودَ ٱللَّهِ } الموضوعة من عنده سبحانه لإصلاح حالهما { فَإِنْ خِفْتُمْ } أيها الحكام أيضاً { أَلاَّ يُقِيمَا حُدُودَ ٱللَّهِ } بينهما { فَلاَ جُنَاحَ } إثم { عَلَيْهِمَا } على الرجل { فِيمَا } أخذ { ٱفْتَدَتْ بِهِ } المراة للخلاص والطلاق، وعلى المرأة لإعطائه له { تِلْكَ } الأحكام المذكورة { حُدُودُ ٱللَّهِ } الموضوعة فيكم أيها المؤمنون لإصلاح أحوالكم { وَ } فلا تتجاوزوا عنها بالمخالفة وعدم الامتثال { فَلاَ تَعْتَدُوهَا } اعملوا أن { مَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَأُوْلَـٰئِكَ هُمُ ٱلظَّٰلِمُونَ } [البقرة: 229] المجاوزون عن حد الإنسانية إلى البهيمية، والمضيعون لمقتضيات العقل الشريف المفاض عليهم من لدنه سبحانه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}