{
  "chapter": "البقرة",
  "text": "فى الدنيا والءاخرة ويسـلونك عن اليتمى قل اصلاح لهم خير وان تخالطوهم فاخونكم والله يعلم المفسد من المصلح ولو شاء الله لاعنتكم ان الله عزيز حكيم",
  "translations": [
    {
      "translation": "On this world and the next. And they ask you about the orphans. Tell them: \"Improving their lot is much better; and if you take interest in their affairs, they are your brethren; and God is aware who are corrupt and who are honest; and if He had pleased He could surely have imposed on you hardship, for God is all-powerful and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask \"What ought we to spend (in the way of Allah)\"? Say \"Spend whatever you can spare.\" Thus Allah makes His commands clear to you so that you may think about the good of both this world and the Hereafter. They ask you about the right way of dealing with orphans. Say \"The right way is that which is for their good.\" Then there is no harm if you live a common life with them for they are after all your own brethren. Allah knows well the one who means harm and also the one who means good. If Allah had willed He would have been hard upon you in this matter for He is All-Powerful but He is at the same time AlI-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "about this life and the life hereafter. They ask you about the orphans. Tell them, \"The best thing to do is what is for their good. They are your brethren if you would associate with them. God knows who is corrupt or a reformer. Had God wanted He would have brought upon you hardship. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before you execute your deeds of this world and of the Hereafter; and they ask you the decree regarding orphans; say, “To do good towards them is better; and if you combine your expenses with theirs, they are your brothers”; and Allah knows very well the one who spoils from him who improves; and if Allah willed, He could have put you in hardship; and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In (to) this worldly life and in the Hereafter. And they ask you concerning orphans. Say: \"The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers. And Allah knows (the one) who means mischief (e.g., to swallow their property) from (the one) who means good (e.g., to save their property). And if Allah had wished, He could have put you into difficulties. Truly, Allah is All-Mighty, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this world and the hereafter. And they ask you concerning the orphans Say: To set right for them (their affairs) is good, and if you become co-partners with them, they are your brethren; and Allah knows the mischief-maker and the pacemaker, and if Allah had pleased, He would certainly have caused you to fall into a difficulty; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in this world, and the world to come. They will question thee concerning the orphans. Say: 'To set their affairs aright is good. And if you intermix with them, they are your brothers. God knows well him who works corruption from him who sets aright; and had He willed He would have harassed you. Surely God is All-mighty, All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the world and the Hereafter. And they question thee concerning orphans. Say: To improve their lot is best. And if ye mingle your affairs with theirs, then (they are) your brothers. Allah knoweth him who spoileth from him who improveth. Had Allah willed He could have overburdened you. Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon this world and the Hereafter. They ask you about orphans. Say, \"Promotion of their welfare is an act of great goodness. There is no harm in your living together with them, for they are your brothers. God knows the mischief-maker from the reformer. If God had so willed, He would have afflicted you with hardship. Surely, God is mighty and wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this Wor1d and the Here after. And they ask thee of orphans. Say thou: to set right affairs for them were best. If ye mix with them, then they are your brethren. Allah knoweth the foul-dealer from the fair-dealer. And had Allah so willed, He could have harassed you; verily Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "about the world and the Hereafter. And they ask you concerning the orphans. Say, ‘It is better to set right their affairs, and if you intermingle with them, they are of course your brothers: Allah knows those who cause corruption from those who set things right, and had Allah wished He would have put you to hardship.’ Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their bearings) on this life and the Hereafter. They ask thee concerning orphans. Say: \"The best thing to do is what is for their good; if ye mix their affairs with yours, they are your brethren; but Allah knows the man who means mischief from the man who means good. And if Allah had wished, He could have put you into difficulties: He is indeed Exalted in Power, Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In (to) this worldly life and in the Hereafter. And they ask you concerning orphans. Say: \"The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers. And Allah knows him who means mischief (e.g. to swallow their property) from him who means good (e.g. to save their property). And if Allah had wished, He could have put you into difficulties. Truly, Allah is All-Mighty, All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon this world and the Everlasting Life. They will question you concerning orphans. Say: 'Doing good for them is best. If you mix their affairs with yours, remember they are your brothers. Allah knows the corrupter from the reformer. If Allah willed He could have brought hardship upon you. He is Almighty and Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "About this world and the next. And they ask you about orphans. Say, “Improvement for them is best. And if you intermix with them, then they are your brethren.” God knows the dishonest from the honest. Had God willed, He could have overburdened you. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To this world and the Hereafter. And they ask you about orphans. Say, \"Improvement for them is best. And if you mix your affairs with theirs - they are your brothers. And Allah knows the corrupter from the amender. And if Allah had willed, He could have put you in difficulty. Indeed, Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:220] on, the matters of, this world and the Hereafter, and follow what is best for you in both. They will ask you about orphans, and the distress their affair caused them, for, if they became intimate with them, they may slip into error, but if they put aside the money due to them and prepare their meals for them separately, this would distress them. Say: ‘To set their affairs aright, in terms of their funds, by looking after it, and your mingling with them, is better’, than you not doing this; and if you intermix with them, your funds and theirs, they are your brothers, in religion and it is only natural for one to intermix his affair with his brother, so you do too; God knows well him who works corruption, in their property when he intermixes with them, from him who sets, it, aright, and God will requite both; and had He willed He would have harassed you, and made it difficult for you by prohibiting you from intermixing with them. Surely God is Mighty, victorious in His affair, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Upon the world and the Hereafter) that it is lasting. (And they question thee concerning orphans). This was revealed about 'Abdullah Ibn Rawahah who asked the Prophet (pbuh) about whether it was lawful to share food, drink and shelter with orphans. Allah told His Prophet: they ask you about sharing food, drink and shelter with orphans, (Say) Muhammad: (To improve their lot) and their wealth (is best) rather than not sharing with them. (And if you mingle your affairs with theirs) as regards food, drink and shelter, (then (they are) your brothers) in Religion and you should therefore safeguard their shares. (And Allah knoweth him who spoileth) the wealth of orphans (from him who improveth) their wealth. (Had Allah willed He could have overburdened you) He could have forbidden such sharing. (Indeed Allah is Mighty) and takes revenge against whoever spoils the wealth of orphans, (Wise) ruling that the wealth of orphans should be improved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لأَعْنَتَكُمْ } معناه لأَهْلَككم\n ويقال: لَشَدَّدَ عليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فِي } الآيات المتعلقة لأمور { ٱلدُّنْيَا } فتتصفوا بما فيها { وَ } أيضاً تأملوا في الآيات المتعلقة لأمور { ٱلآخِرَةِ } فتحققوا بها، وتمكنوا عليها واطمأنوا بسببها؛ ليتم لكم تهذيب الظاهر والباطن، وبعد ذلك يترتب ما يترتب { وَيَسْأَلُونَكَ } أيضاً { عَنِ } أحوال { ٱلْيَتَامَىٰ } الذين لم يبلغوا الحلم، ولا متعهد لهم من ذوي القربى { قُلْ إِصْلاَحٌ لَّهُمْ } أحوالهم { خَيْرٌ } من إبقائهم في المذلة والهوان { وَإِنْ تُخَالِطُوهُمْ } من غاية المرحمة والإشفاق { فَإِخْوَانُكُمْ } في الدين، يجزيكم الله خيراً إن كتنتم قاصدين فيه إصلاحهم ورعايتهم، دون إفساد مالهم وعرضهم { وَٱللَّهُ } الماطلع بمقاصدكم { يَعْلَمُ ٱلْمُفْسِدَ } المبطل منكم { مِنَ ٱلْمُصْلِحِ } المحق، فيجازي كلاً منهم على مقتضى علمه { وَلَوْ شَآءَ ٱللَّهُ } المطلع لإفسادكم وإعناتكم أن يفسد عليكم ويعنتكم { لأَعْنَتَكُمْ } أذلكم وأفسدكم أشد من إفسادكم وإعناتكم إياهم { إِنَّ ٱللَّهَ عَزِيزٌ } غالب قادر على الانتقام { حَكِيمٌ } [البقرة: 220] لا ينتقم بلا موجب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوتتفكرون في { الآخرة } ودوام نعيمها، وسعة فضائها، وبهجة منظرها فترغبون في الوصول إليه، وتتأهبون للقائها، فتؤثرونها على هذه الدار الفانية\n قال بعض الحكماء: لو كانت الدنيا من ذهب يفنى، والآخرة من طين يبقى، لكان ينبغي للعاقل أن يختار ما يبقى على ما يفنى، لا سيما والأمر بالعكس، الدنيا من طين يفنى، والآخرة من ذهب يبقى، فلا يختار هذه الدار إلاَّ أحمق خسيس الهمة، وبالله التوفيق\n الإشارة: كما نهى الحقّ جلّ جلاله عن السرف في الأموال، نهى عن السرف في الأحوال، فالسرف، من حيث هو، يؤدي إلى الملل والانقطاع، \" أحبُ العملِ إلى اللّهِ ما دَامَ عليه صاحبُه، وإنْ قَلَ \" كما في الحديث،\n\n \" والله ما رأينا أحداً أسرف في الأحوال إلا مَلَّ، وضعف حاله \" \n\n، وفي الحديث:\n\n \" لاَ يكْن أحَدُكُم كالمُنْبَتِّ - أي: المنقطع - لا أرضاً قطع، ولا ظَهْراً أبقى \" \n\n \n\nوقال في المباحث:\n\nفلا يزال يُسايس نفسه شيئاً فشيئاً حتى يملكها، ويظفر بها، فإذا ظفر بها كانت له شبكة يصطاد بها العلوم والمعارف، فتتفكر في الدنيا فتراها فانية فترحل عنها، ثم تتفكر في الآخرة فتراها باقية، فإذا رامت السُّكْنَى فيها رأتْها كَوْناً مخلوقاً فرحلت إلى خالقها، فكشف الحقّ عنها الحجاب، وأدخلها مع الأحباب، وأدخلها مع الأحباب، فغابت عن الكونين في شهود المكون، فلم يبق لها دنيا ولا آخرة، بل هي الآن في بهجة ونضرة { إلى ربها ناظرة } ، حققنا الله بهذا المقام العلي\n آمين\n ثم سألوا أيضاً عن مخالطة اليتامى، فأجابهم الحقّ تعالى بقوله: {\n\n\n وَيَسْأَلُونَكَ عَنِ ٱلْيَتَامَىٰ قُلْ إِصْلاَحٌ لَّهُمْ خَيْرٌ وَإِنْ تُخَالِطُوهُمْ فَإِخْوَانُكُمْ وَٱللَّهُ يَعْلَمُ ٱلْمُفْسِدَ مِنَ ٱلْمُصْلِحِ وَلَوْ شَآءَ ٱللَّهُ لأَعْنَتَكُمْ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ }  قلت: العنت: التعب والمشقة، أعنتكم: أتعبكم\n يقول الحقّ جلّ جلاله: { ويسألونك عن } مخالطة { اليتامى } أي: خَلْط مال اليتامى بمال الوصيّ، أو القائم به، فيأكلون جميعاً، { قل } لهم: يفعلون ما هو { إصلاح } لليتيم وأحفظ لماله، فإنْ كان خلط مال اليتيم مع مال الوصي أحفظُ لماله، وأوفر، فهو خير، فإنما هم إخوانكم في الدين، وإن كان عزلُ ما لهم عن مالكم، وأكله وحده، اوفر لماله، فاعتزالهم خير، { والله يعلم } من قصدُه الإفساد، ممن قصده الإصلاح، فيعامل كل واحد بقصده، { ولو شاء الله } لأمركم بعزلهم وحفظ مالهم مطلقاً، فيُحرجكم، ويشق عليكم، { إن الله عزيز } غالب، لا يعجزه شيء، { حكيم } لا يفعل شيئاً إلا لحكمة ومصلحة\n ولما نزل قوله تعالى:\n\n[النِّساء: 10] الآية، تحرَّج الصحابة من مخالطة اليتامى، فسألوا رسول الله صلى الله عليه وسلم، فنزلت الآية\n الإشارة: كل من لا شيخ له في طريق القوم فهو يتيم، لا أبَ له، فإن ادعى شيئاً من الخصوصية سُمي عندهم لقيطاً أو دعياً، أي منسوباً إلى غير أبيه، وما زالت الأشياخ تُحذِّر من مخالطة العوام، ومن مخالطة المتفقرة الجاهلة، أعني: الذين لا شيخ لهم يصلح للتربية، حتى قالوا: مخالطتهم سُم قاتل\n وقال بعضهم: يجتنب المريد مخالطة ثلاثة أصناف من الناس: المتفقرة الجاهلين، والقراء المداهنين، والجبابرة المتكبرين\n قلت: وكذلك الفروعية المتجمدين على ظاهر الشريعة، فصُحبتهم أقبحُ من الجميع، ومن ابتلى بمخالطة العوام فلينصحهم، ويرشدهم إلى مصالح دينهم، إنما هم إخوان في الدين، والله يعلم المفسد من المصلح، فمن خالطهم طمعاً في مالهم أو جاههم، أفسده الله، ومن خالطهم نُصحاً وإرشاداً أصلحه الله، ولو شاء الله لأمر الفقراء باعتزالهم بالكلية، وفي ذلك حرج ومشقة، ومِنْ حكمته تعالى أن جعلهم حجاباً لأهل الحجاب، ومدخلاً لذوي الألباب، حجاباً للضعفاء، ومدخلاً ومشهداً للأقوياء\n والله تعالى أعلم\n ولمّا فرغ الحق جلّ جلاله من ذكر بعضَ أمر الجهاد وما يتعلق به، شَرَع يتكلم على النكاح\n\n",
      "translations": []
    }
  ]
}