{
  "chapter": "البقرة",
  "text": "ويسـلونك عن المحيض قل هو اذى فاعتزلوا۟ النساء فى المحيض ولا تقربوهن حتى يطهرن فاذا تطهرن فاتوهن من حيث امركم الله ان الله يحب التوبين ويحب المتطهرين",
  "translations": [
    {
      "translation": "They ask you about menstruation. Tell them: \"This is a period of stress. So keep away from women in this state till they are relieved of it. When they are free of it, you may go to them as God has enjoined. For God loves those who seek pardon, and those who are clean.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask about the monthly course. Say, \"It is a state of impurity; so keep apart from women during their monthly course and do not go near them until they are clean. When they have cleansed themselves, then you may go to them in the manner Allah has enjoined you.\" Most surely Allah loves those people who refrain from evil and keep themselves pure and clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about women's menses. Tell them, \"It is an ailment. Avoid having carnal relations with them until their period is over.\" Then you may have carnal relations with them according to the rules of God. God loves those who repent and those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you the decree concerning menstruation; say, “It is an impurity, so stay away from women at such times, and do not cohabit with them until they have cleansed themselves; so when they have cleansed themselves, cohabit with them the way Allah has determined for you”; indeed Allah loves those who repent profusely, and loves those who keep clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning menstruation. Say: \"That is an Adha, therefore, keep away from women during menses and go not in unto them till they are purified.\" And when they have purified themselves, then go in unto them as Allah has ordained for you. Truly, Allah loves those who turn unto Him in repentance and loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about menstruation. Say: It is a discomfort; therefore keep aloof from the women during the menstrual discharge and do not go near them until they have become clean; then when they have cleansed themselves, go in to them as Allah has commanded you; surely Allah loves those who turn much (to Him), and He loves those who purify themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the monthly course. Say: 'It is hurt; so go apart from women during the monthly course, and do not approach them till they are clean. When they have cleansed themselves, then come unto them as God has commanded you.' Truly, God loves those who repent, and He loves those who cleanse themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question thee (O Muhammad) concerning menstruation. Say: It is an illness, so let women alone at such times and go not in unto them till they are cleansed. And when they have purified themselves, then go in unto them as Allah hath enjoined upon you. Truly Allah loveth those who turn unto Him, and loveth those who have a care for cleanness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about menstruation. Say, \"It is an impurity, so keep away from women during it and do not approach them until they are cleansed; when they are cleansed you may approach them as God has ordained. God loves those who turn to Him in penitence and He loves those who keep themselves clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thee of menstruation. Say thou: it is a pollution, so keep away from women during menstruation, and go not in unto them until they have purified themselves. Then when they have thoroughly purified themselves, go in unto them as Allah hath commanded you. Verily Allah loveth the penitents, and loveth the purifiers of themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning [intercourse during] menses. Say, ‘It is hurtful.’ So keep away from wives during the menses, and do not approach them till they are clean. And when they become clean, go into them as Allah has commanded you. Indeed Allah loves the penitent and He loves those who keep clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning women's courses. Say: They are a hurt and a pollution: So keep away from women in their courses, and do not approach them until they are clean. But when they have purified themselves, ye may approach them in any manner, time, or place ordained for you by Allah. For Allah loves those who turn to Him constantly and He loves those who keep themselves pure and clean.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning menstruation. Say: that is an Adha (a harmful thing for a husband to have a sexual intercourse with his wife while she is having her menses), therefore keep away from women during menses and go not unto them till they have purified (from menses and have taken a bath). And when they have purified themselves, then go in unto them as Allah has ordained for you (go in unto them in any manner as long as it is in their vagina). Truly, Allah loves those who turn unto Him in repentance and loves those who purify themselves (by taking a bath and cleaning and washing thoroughly their private parts, bodies, for their prayers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about menstruation. Say: 'It is an injury. Stay away from women during their menstrual periods and do not approach them until they are cleansed. When they have cleansed themselves, then come to them from where Allah has commanded you. Allah loves those who turn to Him in repentance and He loves those who cleanse themselves'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about menstruation: say, “It is harmful, so keep away from women during menstruation. And do not approach them until they have become pure. Once they have become pure, approach them in the way God has directed you.” God loves the repentant, and He loves those who keep clean.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you about menstruation. Say, \"It is harm, so keep away from wives during menstruation. And do not approach them until they are pure. And when they have purified themselves, then come to them from where Allah has ordained for you. Indeed, Allah loves those who are constantly repentant and loves those who purify themselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:222] They will ask you about the monthly period, that is, menstruation and the spot in which it occurs, and how should one treat women during it. Say: ‘It is an ailment, filth, or the place whence it issues is so; so part with women, refrain from sexual intercourse with them, in the monthly period, in this time, or in the part affected; and do not approach them, for sexual intercourse, until they are pure (yathurna, or yattahharna: the original tā’ [of yatatahharna] has been assimilated with the tā’), that is, until they have cleansed themselves after its cessation; when they have cleansed themselves, then come to them, in sexual intercourse, as God has commanded you’, by avoiding it, the female organ, during menstruation and not resorting to any other part. Truly, God loves, that is, He rewards and honours, those who repent, of sins, and He loves those who cleanse themselves, from impurities.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They question thee (0 Muhammad) concerning menstruation) this was revealed about Abu'l-Dahdah who asked the Prophet (pbuh) about it. Allah said to His Prophet: they ask you about sexual intercourse during menstruation, (Say) Muhammad: (it is harmful) it is filth and unlawful, (so keep away from women at such time) so refrain from having sexual intercourse during menstruation (and go not unto them) do not have sex with them (till they are cleansed) of menstruation. (And when they have purified themselves) and have had a major ritual ablution (ghusl), (then go in unto them) you may have sex with them (as Allah hath enjoined upon you) as you were dispensed to do before, i.e. penetration ought to be in the pudendum. (Truly Allah loveth those who turn unto Him) those who repent of transgression (and loveth those who have a care for cleanness) those who have a care for turning away from transgression and filth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَيَسْأَلُونَكَ عَنِ ٱلْمَحِيضِ قُلْ هُوَ أَذًى } معناه قَذرٌ\n\n\n\n\nوقولهُ تعالى: { وَلاَ تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ } معناهُ حتَّى يَنقطعَ الدَّمُ عَنهُنَّ\n ويَتَطَّهَرْنَ: يَغْتَسِلْنَ بالماءِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَسْأَلُونَكَ } أيضاً { عَنِ ٱلْمَحِيضِ } روي أن أهل الجاهلية كانوا لم يسكانوا لحيِّض ولم يؤاكلوها كفعل اليهود والمجوس، واستمر ذلك إلى أن سألوا أبا الدحداح مع جمع من الصحابة عن ذلك فنزلت: { قُلْ هُوَ أَذًى } مؤذٍ يتأذى منه من يقربه { فَٱعْتَزِلُواْ ٱلنِّسَآءَ فِي ٱلْمَحِيضِ وَلاَ تَقْرَبُوهُنَّ } بالإتيان والوقاع لا بالمصاحبة والمخالطة والمؤاكلة { حَتَّىٰ يَطْهُرْنَ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ ٱللَّهُ } قاصدين فيه حكمة إبقاء نوع الإنسان المستخلف عن الله { إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّابِينَ } عن الميل إلى خلاف ما أمر الله به { وَيُحِبُّ ٱلْمُتَطَهِّرِينَ } [البقرة: 222] عن الأناس الظاهرة والباطنة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: المحيض: مصدر، كالمقيل والمعيش والمجيء، وهو الحيض\n يقول الحقّ جلّ جلاله: { ويسألونك } يا محمد { عن } قرب النساء بالجماع في زمن { المحيض قل } لهم: { هو أذى } ، أي: مُضِرٍّ، أو مُنتن مستقذر، لا يَرضى ذو همة أن يقربه، { فاعتزلوا } مجامعة { النساء في } زمن { المحيض ولا تقربوهن } بالجماع في المحل { حتى يطهرن } من الدم، بانقطاعه، ويغتسلن بالماء، { فإذا تطهرن } بالماء { فأتوهن من حيث أمركم الله } وهو الفرج، الذي أمركم باجتنابه في الحيض إذ هو محل زراعة النطفة\n فمن غلبته نفسه حتى وطئء في الحيض، أو النفاس، فليبادر إلى التوبة، { إن الله يحب التوابين } كلما أذنبوا تابوا\n ولا تجب كفارة على الواطئ، على المشهور\n وقال ابن عباس والأوزاعي: من وطئ قبل الغسل تصدق بنصف دينار، ومن وطئ في حال سيلان الدم تصدق بدينار\n رواه أبو داود حديثاً\n ومن صبر وتنزَّه عن ذلك فإن الله { يحب المتطهرين } من الذنوب والعيوب كلها، وإنما أعاد العامل لأن محبته للمتنزهين أكثر\n قال البيضاوي: رُوِيَ أن أهل الجاهلية كانوا لا يُسَاكنون الحائض ولا يُؤاكلونها، كفعل اليهود والمجوس، واستمر ذلك إلى أنْ سأل أبو الدحْداح، في نفر من الصحابة، عن ذلك، فنزلت\n ولعله سبحانه - إنما ذكر \" إنما يسألونك \" من غير واو، ثلاثاً، ثم بها ثلاثاً لأن السؤالات الأُوَل كانت في أوقات متفرقة، والثلاثة الأخيرة كانت في وقت واحد فلذلك ذكرها بحرف الجمع\n هـ",
      "translations": []
    }
  ]
}