{
  "chapter": "البقرة",
  "text": "ولا جناح عليكم فيما عرضتم به من خطبة النساء او اكننتم فى انفسكم علم الله انكم ستذكرونهن ولكن لا تواعدوهن سرا الا ان تقولوا۟ قولا معروفا ولا تعزموا۟ عقدة النكاح حتى يبلغ الكتب اجله واعلموا۟ ان الله يعلم ما فى انفسكم فاحذروه واعلموا۟ ان الله غفور حليم",
  "translations": [
    {
      "translation": "There is no harm in proposing in secret to (any of) these women, or keeping the intention to yourself: God is aware that you will keep them in mind. Yet do not make a promise in secret, unless you speak in a manner that is proper; and do not resolve upon marriage till the fixed term of waiting is over. Remember that God knows what is in your hearts; so be fearful of Him, and remember that God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is no offence if you make indirect proposal of marriage to widows during their waiting term or keep it concealed in your hearts: for Allah knows that you will naturally think of them. But be careful not to make any secret engagement. If you have to do anything, do it in an honourable way. And you should not settle anything finally about the marriage until the waiting term expires. Understand it well that Allah even knows what is hidden in your hearts; so fear Him. Also know that Allah is Lenient and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not a sin if you make an indirect marriage proposal or have such an intention in your hearts. God knows that you will cherish their memories in your hearts. Do not have secret dates unless you behave lawfully. Do not decide for a marriage before the appointed time is over. Know that God knows what is in your hearts. Have fear of Him and know that He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you propose marriage to women while they are hidden from your view, or hide it in your hearts; Allah knows that you will now remember them, but do not make secret pacts with women except by decent words recognised by Islamic law; and do not consummate the marriage until the written command reaches its completion; know well that Allah knows what is in your hearts, therefore fear Him; and know well that Allah is Oft Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you make a hint of betrothal or conceal it in yourself, Allah knows that you will remember them, but do not make a promise (of contract) with them in secret except that you speak an honorable saying. And do not be determined on the marriage bond until the term prescribed is fulfilled. And know that Allah knows what is in your minds, so fear Him. And know that Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no blame on you respecting that which you speak indirectly in the asking of (such) women in marriage or keep (the proposal) concealed within your minds; Allah knows that you will mention them, but do not give them a promise in secret unless you speak in a lawful manner, and do not confirm the marriage tie until the writing is fulfilled, and know that Allah knows what is in your minds, therefore beware of Him, and know that Allah is Forgiving, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no fault in you touching the proposal to women you offer, or hide in your hearts; God knows that you will be mindful of them; but do not make troth with them secretly without you speak honourable words. And do not resolve on the knot of marriage until the book has reached its term; and know that God knows what is in your hearts, so be fearful of Him; and know that God is All-forgiving, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin for you in that which ye proclaim or hide in your minds concerning your troth with women. Allah knoweth that ye will remember them. But plight not your troth with women except by uttering a recognised form of words. And do not consummate the marriage until (the term) prescribed is run. Know that Allah knoweth what is in your minds, so beware of Him; and know that Allah is Forgiving, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be no offence for you to hint at a proposal of marriage [to divorced or widowed women] or to cherish them in your hearts. God knows that you will bear them in mind. But do not enter into any secret arrangement with them, beyond conveying some indication to them of your inclination. Do not proceed with tying the marriage-knot before the end of their waiting period. Know that God has knowledge of all your thoughts. Therefore, take heed and bear in mind that God is forgiving and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no blame is on you in that ye speak indirectly of your troth unto the said women or conceal it in, your souls! Allah knoweth that ye will anon make mention of these women: but make no promises unto them in secret, except ye speak a reputable saying. And even resolve not on wedding-knot until the prescribed term hath attained its end; and know that Allah knoweth that which is in your souls, wherefore beware of Him, and know that Allah is Forgiving, Forbearing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no sin upon you in what you may hint in proposing to [recently widowed] women, or what you may secretly cherish within your hearts. Allah knows that you will be thinking of them, but do not make troth with them secretly, unless you say honourable words, and do not resolve on a marriage tie until the prescribed term is complete. Know that Allah knows what is in your hearts, so beware of Him; and know that Allah is all-forgiving, all-forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame on you if ye make an offer of betrothal or hold it in your hearts. Allah knows that ye cherish them in your hearts: But do not make a secret contract with them except in terms Honourable, nor resolve on the tie of marriage till the term prescribed is fulfilled. And know that Allah Knoweth what is in your hearts, and take heed of Him; and know that Allah is Oft-forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no sin on you if you make a hint of betrothal or conceal it in yourself, Allah knows that you will remember them, but do not make a promise of contract with them in secret except that you speak an honourable saying according to the Islamic law (e.g. you can say to her, \"If one finds a wife like you, he will be happy\"). And do not consummate the marriage until the term prescribed is fulfilled. And know that Allah knows what is in your minds, so fear Him. And know that Allah is Oft-Forgiving, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No guilt shall be on you in the indication of an engagement to women or what you suppress in yourself. Allah knows that you will remember them; but do not promise them secretly unless you speak kind words (only of indication). And do not resolve on the knot of marriage until the writing has reached its term. And know that Allah knows what is in your hearts, so be cautious of Him. And know that Allah is the Forgiver, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You commit no error by announcing your engagement to women, or by keeping it to yourselves. God knows that you will be thinking about them. But do not meet them secretly, unless you have something proper to say. And do not confirm the marriage tie until the writing is fulfilled. And know that God knows what is in your souls, so beware of Him. And know that God is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no blame upon you for that to which you [indirectly] allude concerning a proposal to women or for what you conceal within yourselves. Allah knows that you will have them in mind. But do not promise them secretly except for saying a proper saying. And do not determine to undertake a marriage contract until the decreed period reaches its end. And know that Allah knows what is within yourselves, so beware of Him. And know that Allah is Forgiving and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:235] You would not be at fault regarding the proposal, with the intention of marriage, you present, offer, or hide in your hearts, during the waiting period, to women, whose spouses have died: such as men saying, ‘How beautiful you are!’, or, ‘Who could find one like you?’, or ‘How many a man must desire you!’. God knows that you will be mindful of them, in proposing to them impatiently, and so He has permitted you to make such offers; but do not make arrangements, of marriage, with them secretly, unless you speak honourable words, such as are acknowledged by the Law, in other words, such as proposals, that which is permitted to you. And do not resolve on the knot, the consummation, of marriage until that which is written, the period prescribed, has reached its term, and has been completed; and know that God knows what is in your souls, of resolve or otherwise; so be fearful of Him, that He should chastise you if you have made such resolve; and know that God is Forgiving, toward him who is fearful of Him, Forbearing, in delaying the chastisement of the one deserving it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is no sin on you) there is no harm in talking (in that which ye proclaim or hide in your mind concerning your troth with women) concerning your offer to the woman whose husband is dead, before the waiting period ends, that you desire to marry her after the waiting period, such as saying to her: \"If Allah unites us lawfully, I would like that\". (Allah knoweth that you will remember them) remember marrying them. (But plight not your troth with them) to have sexual intercourse with them (except by uttering a recognised form of words) properly and unequivocally by saying for example: \"If Allah unites us lawfully, I would like that\", and no more. (And do not consummate the marriage until (the term) prescribed is run) until the waiting period comes to an end. (And know that Allah knoweth what is in your minds) in your hearts whether you are going to honour your pledge or not, (so beware of Him) beware of contravening Him; (and know that Allah is Forgiving) of those who repent of transgressing against Him, (Clement) since He does not hasten His punishment upon those who transgress against Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَلَـٰكِن لاَّ تُوَاعِدُوهُنَّ سِرّاً } معناهُ نِكَاحٌ، والسِّرُ: الزِّنَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ جُنَاحَ عَلَيْكُمْ } أيها المؤمنون { فِيمَا } أي: في كلام وألفاظ { عَرَّضْتُمْ بِهِ } تعريضاً حسناً وتلميحاً مليحاً خالياً عن ومصة الفساد، ناشئاً { مِنْ } إرادة { خِطْبَةِ ٱلنِّسَآءِ } المعتادت للوفاة { أَوْ أَكْنَنتُمْ } أضمرتم وأخفيتم { فِيۤ أَنْفُسِكُمْ } إذ { عَلِمَ ٱللَّهُ } منكم وإن أخفيتم { أَنَّكُمْ } يميل طبيعتكم إليهن { سَتَذْكُرُونَهُنَّ } فاذكروهن على الوجه الأحسن ألابعد عن التهمة { وَلَـٰكِن لاَّ تُوَاعِدُوهُنَّ سِرّاً } أي: الوقاع والجماع؛ أي: لا تخالطوا معهن إلى حيث يرتفع الحجاب عنكم، فتتكلمون معهن بالكلمات التي جرت بين الزوج والزوجة { إِلاَّ أَن تَقُولُواْ قَوْلاً مَّعْرُوفاً } يومئ إلى خطبتكم إياهن إن خفتم أن يسبق عليكم الغير من الخطباء { وَ } عليكم أن { لاَ تَعْزِمُوۤاْ عُقْدَةَ ٱلنِّكَاحِ } أي: لا تستعجلوا في العزيمة على العقد { حَتَّىٰ يَبْلُغَ ٱلْكِتَابُ أَجَلَهُ } أي: ما فرض في الكتاب؛ أي: من العدة المقدرة فيه { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ } المطلع لضمائركم { يَعْلَمُ مَا فِيۤ أَنْفُسِكُمْ } من الخيانة في حدوده { فَٱحْذَرُوهُ } لتنجوا من غضبه { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ غَفُورٌ } لمن عزم المعصية ولم يفعل { حَلِيمٌ } [البقرة: 235] لا يستعجل بالعقوبة على العاصين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}