{
  "chapter": "البقرة",
  "text": "فان طلقها فلا تحل له منۢ بعد حتى تنكح زوجا غيره فان طلقها فلا جناح عليهما ان يتراجعا ان ظنا ان يقيما حدود الله وتلك حدود الله يبينها لقوم يعلمون",
  "translations": [
    {
      "translation": "If a man divorces her again (a third time), she becomes unlawful for him (and he cannot remarry her) until she has married another man. Then if he divorces her there is no harm if the two unite again if they think they will keep within the bounds set by God and made clear for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the husband divorces his wife (for the third time), she shall not remain his lawful wife after this (absolute) divorce, unless she marries another husband and the second husband divorces her. (In that case) there is no harm if they re-marry, provided that the woman and her first husband are convinced that they will be able to keep within the bounds fixed by Allah. And these are Allah's bounds, which He makes clear for the guidance of those who know (the consequences of transgression).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After a divorce for the third time, it is not lawful for the husband to resume marital relations with her or remarry her until she has been married and divorced by another husband. In that case, there is no sin for the former husband to marry her if they (both) think that they can abide by the law. These are the laws of God. He explains them for the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if he divorces her the third time, she will not be lawful to him until she has stayed with another husband; then if the other husband divorces her, it is no sin for these two to reunite if they consider that they can keep the limits of Allah established; these are the limits set by Allah which He explains for people of intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if he has divorced her (the third time), then she is not lawful unto him thereafter until she has married another husband. Then, if the other husband divorces her, it is no sin on both of them that they reunite, provided they feel that they can keep the limits ordained by Allah. These are the limits of Allah, which He makes plain for the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if he divorces her she shall not be lawful to him afterwards until she marries another husband; then if he divorces her there is no blame on them both if they return to each other (by marriage), if they think that they can keep within the limits of Allah, and these are the limits of Allah which He makes clear for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorces her finally, she shall not be lawful to him after that, until she marries another husband. If he divorces her, then it is no fault in them to return to each other, if they suppose that they will maintain God's bounds. Those are God's bounds; He makes them clear unto a people that have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if he hath divorced her (the third time), then she is not lawful unto him thereafter until she hath wedded another husband. Then if he (the other husband) divorce her it is no sin for both of them that they come together again if they consider that they are able to observe the limits of Allah. These are the limits of Allah. He manifesteth them for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if man finally divorces his wife, he cannot remarry her until she has married another man. Then if the next husband divorces her, there will be no blame on either of them if the former husband and wife return to one another, provided they think that they can keep within the bounds set by God. These are the bounds prescribed by God, which He makes clear to men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorceth her, then she is not allowed unto him thereafter until she wed a husband other than he; then if he divorceth her, no blame is on the twain in that they return unto each other, if they imagine they will oh serve the bonds of Allah. And these are the bonds of Allah; He expoundeth them unto a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if he divorces her, she will not be lawful for him thereafter until she marries a husband other than him, and if he divorces her, there is no sin upon them to remarry if they think that they can maintain Allah’s bounds. These are Allah’s bounds, which He clarifies for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if a husband divorces his wife (irrevocably), He cannot, after that, re-marry her until after she has married another husband and He has divorced her. In that case there is no blame on either of them if they re-unite, provided they feel that they can keep the limits ordained by Allah. Such are the limits ordained by Allah, which He makes plain to those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if he has divorced her (the third time), then she is not lawful unto him thereafter until she has married another husband. Then, if the other husband divorces her, it is no sin on both of them that they reunite, provided they feel that they can keep the limits ordained by Allah. These are the limits of Allah, which He makes plain for the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorces her (for the third time), she shall not be lawful to him after that until she has wed (not for the purpose of remarrying her former husband) another spouse and then if he divorces her it shall be no offense for either of them to return to each other, if they think that they can keep within the Bounds of Allah. Those are the Bounds of Allah. He makes them plain to people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorces her, she shall not be lawful for him again until she has married another husband. If the latter divorces her, then there is no blame on them for reuniting, provided they think they can maintain God's limits. These are God’s limits; He makes them clear to people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if he has divorced her [for the third time], then she is not lawful to him afterward until [after] she marries a husband other than him. And if the latter husband divorces her [or dies], there is no blame upon the woman and her former husband for returning to each other if they think that they can keep [within] the limits of Allah. These are the limits of Allah, which He makes clear to a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:230] If he, the husband, divorces her, after the two utterances [of divorce]; she shall not be lawful to him after that, after the third [utterance of] divorce, until she marries another husband, who has sexual intercourse with her, as reported by the two Shaykhs [Bukhārī and Muslim]. If he, the second husband, divorces her, then neither of them would be at fault, that is, the woman and her first husband, to return to each other, in wedlock, after the completion of the waiting period, if they think that they will maintain God’s bounds. Those, matters mentioned, are God’s bounds, which He makes clear to a people who have knowledge, [a people who] reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then went back to His saying: (Divorce must be pronounced twice) saying: (And if he hath divorced her) i.e. the third time, (then she is not lawful unto him thereafter) after the third divorce (until she hath wedded another husband) and the marriage must be consummated. (Then if he (the other husband) divorce her) this was revealed about 'Abd al-Rahman Ibn al-Zubayr, (it is no sin for both of them) the first husband and the woman (that they come together again) with a new dowry and marriage contract (if they consider) if they know (that they are able to observe the limits of Allah) the rulings of Allah regulating the relationship between husband and wife. (These are the limits of Allah) these are Allah's rulings and obligations. (He manifesteth them for people who have knowledge) they are from Allah and believe them to be so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { إِن ظَنَّآ } [معناه] إِنْ أَيقَنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِنْ طَلَّقَهَا } أي: إن وقع الطلاق بينهما بعد المرتين { فَلاَ تَحِلُّ } المرأة المطلقة { لَهُ } أي: للرجل المطلق { مِن بَعْدُ } أي: بعد وقوع الطلاق الثالثة { حَتَّىٰ تَنْكِحَ } تتزوج المرأة { زَوْجاً } ثانياً { غَيْرَهُ } أي: غير الزوج الأول { فَإِن طَلَّقَهَا } الزوج الثاني { فَلاَ جُنَاحَ عَلَيْهِمَآ أَن يَتَرَاجَعَآ } أي: يرجع كل من الزوج الاول والمرأة إلى الآخر بالزواج، ويلمس كل منهما عسلية الزوج الثاني إن اشتهى، وذلك حين { إِن ظَنَّآ أَن يُقِيمَا حُدُودَ ٱللَّهِ } بينهما { وَتِلْكَ } الأحكام { حُدُودُ ٱللَّهِ يُبَيِّنُهَا لِقَوْمٍ يَعْلَمُونَ } [البقرة: 230] يعقلون ويفهمون حدوده ويعلمون بها بمقتضى العقل؛ إذ التكاليف الواقعة في الشرع الماضي لأجله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}