{
  "chapter": "البقرة",
  "text": "وان طلقتموهن من قبل ان تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم الا ان يعفون او يعفوا۟ الذى بيده عقدة النكاح وان تعفوا۟ اقرب للتقوى ولا تنسوا۟ الفضل بينكم ان الله بما تعملون بصير",
  "translations": [
    {
      "translation": "And if you divorce them before the consummation of marriage, but after settling the dowry, then half the settled dowry must be paid, unless the woman forgoes it, or the person who holds the bond of marriage pays the full amount. And if the man pays the whole, it is nearer to piety. But do not forget to be good to each other, and remember that God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In case you fixed a dower for them and then divorced them before you touched them, you should pay half of the fixed dower. But there is no harm if the woman agrees to forego it or the man, in whose hands is the marriage tie, is generous enough (to pay the dower in full). And if you (men) act generously, it is akin to piety. Do not forget to show generosity in your dealings with one another for Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you divorce your wives before the consummation of the marriage and the amount of dowry has been fixed, pay your wives half of the amount of their dowry unless she or her guardians drop their demand for payment. To drop such a demand is closer to piety. Be generous to each other. God is Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you divorce them before you have touched them and have appointed the bridal money, then payment of half of what is agreed is ordained unless the women forgo some of it, or he in whose hand is the marriage tie, pays more; and O men, your paying more is closer to piety; and do not forget the favours to each other; indeed Allah is seeing what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you have touched (had a sexual relation with) them, and you have appointed for them their due (dowry), then pay half of that, unless they (the women) agree to remit it, or he (the husband), in whose hands is the marriage tie, agrees to remit it. And to remit is nearer to At-Taqwa (piety, righteousness). And do not forget liberality between yourselves. Truly, Allah is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you have touched them and you have appointed for them a portion, then (pay to them) half of what you have appointed, unless they relinquish or he should relinquish in whose hand is the marriage tie; and it is nearer to righteousness that you should relinquish; and do not neglect the giving of free gifts between you; surely Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you have touched them, and you have already appointed for them a marriage-portion, then one-half of what you have appointed, unless it be they make remission, or he makes remission in whose hand is the knot of marriage; yet that you should remit is nearer to godfearing. Forget not to be bountiful one towards another. Surely God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye divorce them before ye have touched them and ye have appointed unto them a portion, then (pay the) half of that which ye appointed, unless they (the women) agree to forgo it, or he agreeth to forgo it in whose hand is the marriage tie. To forgo is nearer to piety. And forget not kindness among yourselves. Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you divorce them before the marriage is consummated, but after their dower money has been settled, give them the half of their dower money, unless they [the women] agree to forego it, or the man [the husband] in whose hand lies the marriage knot foregoes it. To forego is nearer to righteousness. Do not neglect any chance of behaving benevolently towards each other. God is observant of whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye divorce them ere ye have touched them but have settled unto them a settlement, then due from you is half of that which ye have settled unless the wives forego, or he in whose hand is the wedding-knot foregoeth, and that ye should forego is nigher unto piety. And forget not grace amongst yourself; verily of that which ye work Allah is the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you touch them, and you have already settled a dowry for them, then [pay them] half of what you have settled, unless they forgo it, or someone in whose hand is the marriage tie forgoes it. And to forgo is nearer to Godwariness; so do not forget graciousness among yourselves. Indeed Allah watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye divorce them before consummation, but after the fixation of a dower for them, then the half of the dower (Is due to them), unless they remit it or (the man's half) is remitted by him in whose hands is the marriage tie; and the remission (of the man's half) is the nearest to righteousness. And do not forget Liberality between yourselves. For Allah sees well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you have touched (had a sexual relation with) them, and you have appointed unto them the Mahr (bridal money given by the husbands to his wife at the time of marriage), then pay half of that (Mahr), unless they (the women) agree to forego it, or he (the husband), in whose hands is the marriage tie, agrees to forego and give her full appointed Mahr. And to forego and give (her the full Mahr) is nearer to At-Taqwa (piety, right-eousness, etc.). And do not forget liberality between yourselves. Truly, Allah is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you divorce them before you have touched them but after their dowry has been determined, give them half of what you determined, unless they pardon, or he pardons in whose hand is the marriage knot. And if you pardon it is nearer to wardingoff (evil). Do not forget the generosity between each other. Allah is the Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you divorce them before you have touched them, but after you had set the dowry for them, give them half of what you specified—unless they forego the right, or the one in whose hand is the marriage contract foregoes it. But to forego is nearer to piety. And do not forget generosity between one another. God is seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you divorce them before you have touched them and you have already specified for them an obligation, then [give] half of what you specified - unless they forego the right or the one in whose hand is the marriage contract foregoes it. And to forego it is nearer to righteousness. And do not forget graciousness between you. Indeed Allah, of whatever you do, is Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:237] And if you divorce them before you have touched them, and you have already appointed for them an obligation, then one-half of what you have appointed, must be given to them and the other half returns to you; unless it be that they, the women, make remission, and forgo it, or he makes remission, by leaving her the entire amount, the one in whose hand is the knot of marriage, the husband to be, or as Ibn ‘Abbās is reported to have said, ‘The legal guardian, where the female is a minor’; in which case nobody would be at fault; yet that you should remit (wa-an ta‘fū is the subject) is nearer to piety (aqrabu li’l-taqwā is its predicate). Forget not kindness between you, that is, to be bountiful towards one another; surely God sees what you do, and will requite you accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah exposited on the legal ruling of she whose dowry had been specified, saying: (And if ye divorce them before ye have touched them) before you have had sexual intercourse with them (and ye have appointed unto them a portion) you have specified a dowry for them, (then (pay the) half of that which ye appointed) half of the dowry you specified, (unless they (the women) agree to forgo it) unless the woman forgoes her right and leaves it to the husband, (or he agreeth to forgo it in whose is the marriage tie), or the husband forgoes his right and gives the woman her full dowry. (To forgo) your rights (is nearer to piety) is nearer to piety for the God-fearing. Allah says here to the husband and wife: it is more conducive to God- fearing if you forgo your right to the other; (And forget not kindness among yourselves) Allah says to both: continue to be kind and generous to each other. (Indeed Allah is Seer of what ye do) of acts of kindness and generosity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِلاَّ أَن يَعْفُونَ } معناهُ أَنْ يَترُكْنَّ، يَعني النِّساءَ\n\n\n\n\nوقولهُ تعالى: { ٱلَّذِي بِيَدِهِ عُقْدَةُ ٱلنِّكَاحِ } وهو الزوجُ\n ويقالُ: هو الوَليُّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَ } الحال أنه { قَدْ فَرَضْتُمْ } سميتم { لَهُنَّ فَرِيضَةً } صداقاً ومهراً { فَنِصْفُ مَا فَرَضْتُمْ } أي: فلزمكم أداء نصف ما سميتم من المهر إليهن { إِلاَّ أَن يَعْفُونَ } أي: المطلقات فلا يأخذن شيئاً اتقاءً عن التهمة { أَوْ يَعْفُوَاْ ٱلَّذِي بِيَدِهِ عُقْدَةُ ٱلنِّكَاحِ } ويرد جميع المهر إليها تبرعاً { وَأَن تَعْفُوۤاْ } أي: وعفوكم أيها المؤمنون في أمثال هذا { أَقْرَبُ لِلتَّقْوَىٰ } وأفضل عند المولى { وَلاَ تَنسَوُاْ } أي: لا تتركوا { ٱلْفَضْلَ } والإحسان { بَيْنَكُمْ } أيها المحسنون بل أحسنوا بعضاً مما أحسن الله لكم إلى مستحقيكم { إِنَّ ٱللَّهَ } المراقب لجميع أعمالكم { بِمَا تَعْمَلُونَ } من الفضل والإحسان { بَصِيرٌ } [البقرة: 237] يجازيكم عليه بفضله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}