{
  "chapter": "البقرة",
  "text": "واذا طلقتم النساء فبلغن اجلهن فلا تعضلوهن ان ينكحن ازوجهن اذا ترضوا۟ بينهم بالمعروف ذلك يوعظ به من كان منكم يؤمن بالله واليوم الءاخر ذلكم ازكى لكم واطهر والله يعلم وانتم لا تعلمون",
  "translations": [
    {
      "translation": "When you have divorced your wives and they have completed the fixed term (of waiting), do not stop them from marrying other men if it is agreed between them honourably. This warning is for those among you who believe in God and the Last Day. This is both proper and right for you, for God knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have divorced your wives absolutely and they have completed their prescribed term, then you should not prevent them from marrying their prospective husbands, if they mutually agree to marry each other in a lawful way. You are enjoined not to commit such an offence, if you sincerely believe in Allah and the Last Day. It is most decent and pure for you to desist from this; Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the waiting period of the divorced women has ended, you (her relatives) must not prevent them from marrying their (previous) husbands again if they might reach an honorable agreement. This is an advice for those of you who believe in God and the Day of Judgment. It is the most beneficial and pure way of treating each other. God knows but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they complete their waiting period – then O guardians of such women, do not prevent them from marrying their husbands if they agree between themselves in accordance with Islamic law; this lesson is for those among People who Believe in Allah and the Last Day; this is purer for you, and cleaner; and Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they have fulfilled the term of their prescribed period, do not prevent them from marrying their (former) husbands, if they mutually agree on reasonable basis. This (instruction) is an admonition for him among you who believes in Allah and the Last Day. That is more virtuous and purer for you. Allah knows and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they have ended-- their term (of waiting), then do not prevent them from marrying their husbands when they agree among themselves in a lawful manner; with this is admonished he among you who believes in Allah and the last day, this is more profitable and purer for you; and Allah knows while you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women, and they have reached their term, do not debar them from marrying their husbands, when they have agreed together honourably. That is an admonition for whoso of you believes in God and the Last Day; that is cleaner and purer for you; God knows, and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands if it is agreed between them in kindness. This is an admonition for him among you who believeth in Allah and the Last Day. That is more virtuous for you, and cleaner. Allah knoweth; ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women and they reach the end of their waiting period, do not prevent them from marrying other men, if they have come to an honourable agreement. This is enjoined on every one of you who believes in God and the Last Day; it is more wholesome and purer for you. God knows, but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye have divorced women and they have attained their period; straiten them not so that they wed not their husbands when they have agreed between themselves reputably; hereby is exhorted he among you who believeth in Allah and the Last Day: this is cleanest for you and purest. Allah knoweth and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women and they complete their term, do not hinder them from [re]marrying their husbands, when they honourably reach mutual consent. Herewith are advised those of you who believe in Allah and the Last Day. That will be more decent and purer for you, and Allah knows and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye divorce women, and they fulfil the term of their ('Iddat), do not prevent them from marrying their (former) husbands, if they mutually agree on equitable terms. This instruction is for all amongst you, who believe in Allah and the Last Day. That is (the course Making for) most virtue and purity amongst you and Allah knows, and ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they have fulfilled the term of their prescribed period, do not prevent them from marrying their (former) husbands, if they mutually agree on reasonable basis. This (instruction) is an admonition for him among you who believes in Allah and the Last Day. That is more virtuous and purer for you. Allah knows and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women, and they have reached their term, do not restrain them from marrying their (future) husbands, when they have agreed together with kindness. That is an exhortation for whosoever of you believes in Allah and the Last Day. That is cleaner and purer for you. Allah knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women, and they have reached their term, do not prevent them from marrying their husbands, provided they agree on fair terms. Thereby is advised whoever among you believes in God and the Last Day. That is better and more decent for you. God knows, and you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you divorce women and they have fulfilled their term, do not prevent them from remarrying their [former] husbands if they agree among themselves on an acceptable basis. That is instructed to whoever of you believes in Allah and the Last Day. That is better for you and purer, and Allah knows and you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:232] When you divorce women, and they have reached, completed, their term, of waiting, do not debar them — addressing the guardians here — from marrying their, divorced, husbands when they, the male spouses and their women, have agreed together honourably, in accordance with the Law. The occasion for the revelation [of this verse] was: Ma‘qil b. Yasār’s sister was divorced by her husband, who then wanted to restore her, but Ma‘qil refused, as reported by al-Hākim. That, the prohibition against debarring, is an admonition for whoever of you believe in God and the Last Day, because it is for the benefit of such a person; that, refraining from debarring, is purer for you, better, and cleaner, for you and for them, bearing in mind the suspicion that can be aroused by the couple on account of prior intimacy. God knows, what is in your interest, and you know not, any of this, so follow His commands.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye have divorced women) one or two pronouncements of divorce (and they have reached their term) have completed their waiting period and want to return to their first husbands with a new dowry and marriage contract, (place not difficulties in the way of) do not prevent them (their marrying their husbands if it is agreed between them in kindness) a new dowry and marriage contract. (This) what is mentioned above (is an admonition) a command (for him among you who believeth in Allah and the Last Day. This) what is mentioned above (is more virtuous) better (for you, and cleaner) for your hearts and theirs from misgivings 40 and enmity. (Allah knoweth) the love of the wife for her husband: (while ye know not) this. This verse was revealed about Ma'qil Ibn Yasar al-Muzani who prevented his sister Jamilah from returning to her first husband 'Abdullah Ibn 'Asim with a new dowry and marriage contract. Allah forbade him from doing so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَلاَ تَعْضُلُوهُنَّ } قالَ زيدُ بن علي عليهما السَّلامُ: معناهُ لاَ تُضيقُوا عَليهُنَّ، وَلاَ تَحبِسُوهنَّ عن الأَزواجِ\n\n\n\n\nوقولهُ تعالى: { إِذَا تَرَاضَوْاْ بَيْنَهُمْ بِٱلْمَعْرُوفِ } معناهُ تَزويجٌ صَحيحٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا طَلَّقْتُمُ } أيها المؤمنون { ٱلنِّسَآءَ فَبَلَغْنَ } بعد الطلاق { أَجَلَهُنَّ } من المعدة المفروضة المقدرة لاستبراء الرحم { فَلاَ تَعْضُلُوهُنَّ } أي: لا تحبسوهن ولا تعيروهن إن أردن { أَن يَنكِحْنَ أَزْوَاجَهُنَّ إِذَا تَرَاضَوْاْ بَيْنَهُمْ بِٱلْمَعْرُوفِ } كما يفعله الجهال من الحمية الجاهلية { ذٰلِكَ } التذكر والعظمة المنزلة من عند الله { يُوعَظُ بِهِ مَن كَانَ مِنكُمْ يُؤْمِنُ بِٱللَّهِ } بجميع ما أنزل من الأحكام والمواعظ { وَٱلْيَوْمِ ٱلآخِرِ } بجميع ما فيه من النكال والعذاب والحساب العقاب { ذٰلِكُمْ } أي: الأحكام والمواعظ والأخلاق والآداب { أَزْكَىٰ لَكُمْ } لتزيكة نفوسكم من الأهواء والآراء الباطلة { وَأَطْهَرُ } لقلوبكم عن متابعتها { وَٱللَّهُ يَعْلَمُ } مصالح عباده { وَأَنْتُمْ لاَ تَعْلَمُونَ } [البقرة: 232] فعليكم الامتثال والانقياد على وجه التعبد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}