{
  "chapter": "البقرة",
  "text": "وان كنتم فى ريب مما نزلنا على عبدنا فاتوا۟ بسورة من مثله وادعوا۟ شهداءكم من دون الله ان كنتم صدقين",
  "translations": [
    {
      "translation": "If you are in doubt of what We have revealed to Our votary, then bring a Surah like this, and call any witness, apart from God, you like, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you be in doubt whether the Book We have sent down to Our Servant is from Us or not, then produce, at least, one Surah like this. You may call all your associates to assist you and avail yourselves of the help of any one other than Allah. If you are genuine in your doubt, do this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should you have any doubt about what We have revealed to Our servant, present one chapter comparable to it and call all your supporters, besides God, if your claim is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in any doubt concerning what We have sent down upon Our distinguished bondman (Prophet Mohammed – peace and blessings be upon him), bring forth a single surah (chapter) equal to it; and call upon all your supporters, other than Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you (Arab pagans, Jews, and Christians) are in doubt concerning that which We have sent down (i.e. the Qur'an) to Our servant (Muhammad), then produce a Surah (chapter) of the like thereof and call your witnesses (supporters and helpers) besides Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in doubt as to that which We have revealed to Our servant, then produce a chapter like it and call on your witnesses besides Allah if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in doubt concerning that We have sent down on Our servant, then bring a sura like it, and call your witnesses, apart from God, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye are in doubt concerning that which We reveal unto Our slave (Muhammad), then produce a surah of the like thereof, and call your witness beside Allah if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in doubt about the revelation We have sent down to Our servant, then produce a single chapter like it, and call upon your helpers besides God, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye be in doubt concerning that which We have revealed unto Our bondsman, then bring a chapter like thereunto, and call your witnesses as against Allah, if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in doubt concerning what We have sent down to Our servant, then bring a surah like it, and invoke your helpers besides Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye are in doubt as to what We have revealed from time to time to Our servant, then produce a Sura like thereunto; and call your witnesses or helpers (If there are any) besides Allah, if your (doubts) are true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you (Arab pagans, Jews, and Christians) are in doubt concerning that which We have sent down (i.e. the Quran) to Our slave (Muhammad Peace be upon him), then produce a Surah (chapter) of the like thereof and call your witnesses (supporters and helpers) besides Allah, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are in doubt of what We have sent down to Our worshiper (Prophet Muhammad), produce a chapter comparable to it. Call upon your helpers, other than Allah, to assist you, if you are true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in doubt about what We have revealed to Our servant, then produce a chapter like these, and call your witnesses apart from God, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are in doubt about what We have sent down upon Our Servant [Muhammad], then produce a surah the like thereof and call upon your witnesses other than Allah, if you should be truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:23]   And if you are in doubt, in uncertainty, concerning what We have revealed to Our servant, Muhammad (s), of the Qur’ān, that it is from God, then bring a sūra like it, that is also revealed (min mithlihi: min is explicative, that is, a sūra like it in its eloquence, fine arrangement and its bestowal of knowledge of the Unseen; a sūra is a passage with a beginning and end made up of a minimum of three verses); and call your witnesses, those other gods that you worship, besides God, that is, other than Him, so that it can be seen, if you are truthful, in [your claim] that Muhammad (s) speaks it from himself. So do this, for you are also fluent speakers of Arabic like him. When they could not do this, God said:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye are in doubt concerning that which We revealed) through the Archangel Gabriel (unto Our slave) Muhammad whom you accuse of fabrication, (then produce a surah like it) produce a surah like the surah of the Cow (al-Baqarah), (and call your witnesses), seek help from the gods that you worship, (apart from Allah), it is said that this refers to their leaders, (if ye are truthful) in your claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن كُنْتُمْ } أيها المحجوبون بالأديان الباطلة { فِي رَيْبٍ } شكٍ وارتيابٍ { مِّمَّا نَزَّلْنَا } من مقام كما ترتيبنا وإرشادنا { عَلَىٰ عَبْدِنَا } الذي هو خليفتنا ومرآنا ومظهر جميع أوصافنا، وحامل وحينا المنزل عليه، المشتمل على جميع الأخلاق الإلهية { فَأْتُواْ بِسُورَةٍ } جملة قصيرة { مِّن مِّثْلِهِ } إذ من خواص هذا الكتاب أن مجموعة مشتمل على جميع الأخلاق الإلهية، وكل سورة منه تشتمل على ما اشتمل عليه المجموع، تأمل\n\n\n\n\n{ وَ } إن عجزتم أنتم عن إتيانه { ٱدْعُواْ شُهَدَآءَكُم } حضراءكم الذين أنتم تشهدون بألوهيتهم وترجعون في الخطاب إليهم { مِّن دُونِ ٱللَّهِ } المحيط بكم وبهم، فأمروهم بإتيان كل سورةٍ جامعة جميع أوصاف المعبود بالحق { إِنْ كُنْتُمْ صَٰدِقِينَ } [البقرة: 23] أنهم آلهة غير الله، سبحان الله وتعالى عما يقولون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفإن قلت: الريب في القرآن قد وقع من الكفار قطعاً، فكيف عبّر بإِنْ الدالة على الشك والتردد؟ قلت: { إن } جازمة للفظ الشرط أو محله، موضوعة للشك في الشرط\n و \" إذا \" لا تجزم في اللفظ، وتدل على الجزم في المعنى، وفي ذلك يقول القائل:\n\nفإن قلت: الريب في القرآن قد وقع من الكفار قطعاً، فكيف عبّر بإنْ الدالة على الشك والتردد؟ قلت: لما كان ريبهم واقعاً في غير محله - إذ لو تأملوا أدنى تأمل لزال ريبهم لوضوح الأمر وسطوع البرهان - كان ريبهم كأنه مشكوك فيه ومتردد في وقوعه، والشهداء جمع شهيد بمعنى الحاضر، أو القائم بالشهادة، أو الناصر، أُطْلِقَ على الأصنام لأنهم يزعمون أنها تشهد لهم، ومعنى دون: أدنى مكان من الشيء، ثم استعير للرُّتَب فقيل: زيد دون عمرو أي: في الشرف، ثم اتسع فيه فاستعير لكل تجاوزِ حدّ إلى حد، وتخطّي أمرٍ إلى آخر\n يقول الحقّ جلّ جلاله: { وَإِن كُنتُمْ } يا معشر الكفار { فِي } شك { مِمَّا نَزَّلْنَا عَلَى } محمد { عَبْدِنَا } ورسولنا المختار لِسِرّ وحينا، { فَأْتُوا بِسُورَةٍ مِن } جنسه في البلاغة والفصاحة، مشتملة على علوم وأسرار ومغيبات كما اشتمل عليه كتابي، { وَادْعُوا } من استطعتم ممن تنتصرون به على ذلك الإتيان، مِن آلهتكم التي تزعمون أنها تشهد لكم يوم القيامة، أو من حضركم من البلغاء والفصحاء ممن تنتصرون به { مِن دُونِ اللَّهِ إن كُنتُمْ صَادِقِينَ } في أنها تنفعكم",
      "translations": []
    }
  ]
}