{
  "chapter": "البقرة",
  "text": "واذا طلقتم النساء فبلغن اجلهن فامسكوهن بمعروف او سرحوهن بمعروف ولا تمسكوهن ضرارا لتعتدوا۟ ومن يفعل ذلك فقد ظلم نفسه ولا تتخذوا۟ ءايت الله هزوا واذكروا۟ نعمت الله عليكم وما انزل عليكم من الكتب والحكمة يعظكم به واتقوا۟ الله واعلموا۟ ان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "When you have divorced your wives, and they have reached the end of the period of waiting, then keep them honourably (by revoking the divorce), or let them go with honour, and do not detain them with the intent of harassing lest you should transgress. He who does so will wrong himself. Do not mock the decrees of God, and remember the favours God has bestowed on you, and revealed to you the Book and the Law to warn you of the consequences of doing wrong. Have fear of God, and remember, God is cognisant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced your wives and they are about to complete their prescribed term, then either retain them gracefully or release them generously. It is transgression to retain them merely for harassment; and whoever' does that indeed wrongs his own self. Do not play with Allah's Commandments, and remember that Allah has blessed you with a great favour. He admonishes you to show due respect to the Book and the Wisdom He has sent to you. Fear Allah and know that He is fully aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce your wives and their waiting period has almost ended, you may resume marital relations with honor or leave them with kindness. Do not force them to live with you in suffering to satisfy your hostility. Whoever commits such transgressions, he has only harmed himself. Do not make jest of God's words. Remember the favors that God has done to you and the Book and wisdom He has revealed for your guidance. Have fear of God and know that God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women, and their term reaches its end, either retain them on good terms within this period or release them with kindness; and do not retain them in order to hurt them, hence transgressing the limits; and he who does so harms only himself; and do not make the signs of Allah the objects of ridicule; and remember Allah’s favour that is bestowed upon you and that He has sent down to you the Book and wisdom, for your guidance; keep fearing Allah and know well that Allah knows everything. (The traditions of the Holy Prophet – sunnah and hadith – are called wisdom.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they have fulfilled the term of their prescribed period, either take them back on a reasonable basis or set them free on a reasonable basis. But do not take them back to hurt them, and whoever does that, then he has wronged himself. And treat not the verses (Laws) of Allah in jest, but remember Allah's favors on you (i.e., Islam), and that which He has sent down to you of the Book (i.e., the Qur'an) and Al-Hikmah (the Prophet's Sunnah ـ legal ways ـ Islamic jurisprudence) whereby He instructs you. And fear Allah, and know that Allah is All-Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you divorce women and they reach their prescribed time, then either retain them in good fellowship or set them free with liberality, and do not retain them for injury, so that you exceed the limits, and whoever does this, he indeed is unjust to his own soul; and do not take Allah's communications for a mockery, and remember the favor of Allah upon you, and that which He has revealed to you of the Book and the Wisdom, admonishing you thereby; and be careful (of your duty to) Allah, and know that Allah is the Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women, and they have reached their term, then retain them honourably or set them free honourably; do not retain them by force, to transgress; whoever does that has wronged himself. Take not God's signs in mockery, and remember God's blessing upon you, and the Book and the Wisdom He has sent down on you, to admonish you. And fear God, and know that God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye have divorced women, and they have reached their term, then retain them in kindness or release them in kindness. Retain them not to their hurt so that ye transgress (the limits). He who doeth that hath wronged his soul. Make not the revelations of Allah a laughing-stock (by your behaviour), but remember Allah's grace upon you and that which He hath revealed unto you of the Scripture and of wisdom, whereby He doth exhort you. Observe your duty to Allah and know that Allah is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once you divorce women, and they have reached the end of their waiting period, then either retain them in all decency or part from them decently. Do not retain them in order to harm them or to wrong them. Whoever does this, wrongs his own soul. Do not make a mockery of God's revelations. Remember the favours God has bestowed upon you, and the Book and the wisdom He has revealed to exhort you. Fear God and know that God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye have divorced your women, and they have attained their period, then either retain them reputably or let them off kindly; and retain them not to their hurt that ye may trespass; and whosoever doth this assuredly wrongeth his soul. And hold not Allah's commandments in mockery and remember Allah's favour upon you, and that he hath sent down unto you the Book and the wisdom wherewith He exhorted you; and fear Allah, and know that verily Allah is of everything the Knower\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women and they complete their term [of waiting], then either retain them honourably or release them honourably, and do not retain them maliciously in order that you may transgress; and whoever does that certainly wrongs himself. Do not take the signs of Allah in derision, and remember Allah’s blessing upon you, and what He has sent down to you of the Book and wisdom, to advise you therewith. Be wary of Allah and know that Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye divorce women, and they fulfil the term of their ('Iddat), either take them back on equitable terms or set them free on equitable terms; but do not take them back to injure them, (or) to take undue advantage; if any one does that; He wrongs his own soul. Do not treat Allah's Signs as a jest, but solemnly rehearse Allah's favours on you, and the fact that He sent down to you the Book and Wisdom, for your instruction. And fear Allah, and know that Allah is well acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you have divorced women and they have fulfilled the term of their prescribed period, either take them back on reasonable basis or set them free on reasonable basis. But do not take them back to hurt them, and whoever does that, then he has wronged himself. And treat not the Verses (Laws) of Allah as a jest, but remember Allah's Favours on you (i.e. Islam), and that which He has sent down to you of the Book (i.e. the Quran) and Al-Hikmah (the Prophet's Sunnah - legal ways - Islamic jurisprudence, etc.) whereby He instructs you. And fear Allah, and know that Allah is All-Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you have divorced women and they have reached the end of their waiting period, either keep them in kindness or let them go with kindness. But you shall not keep them, being harmful, in order to transgress. Whoever does this wrongs himself. Do not take the verses of Allah in mockery. Remember the favor of Allah upon you, and what He sent down to you from the Book and Wisdom to exhort you. Fear Allah and know that He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you divorce women, and they have reached their term, either retain them amicably, or release them amicably. But do not retain them to hurt them and commit aggression. Whoever does that has wronged himself. And do not take God’s revelations for a joke. And remember God's favor to you, and that He revealed to you the Scripture and Wisdom to teach you. And fear God, and know that God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you divorce women and they have [nearly] fulfilled their term, either retain them according to acceptable terms or release them according to acceptable terms, and do not keep them, intending harm, to transgress [against them]. And whoever does that has certainly wronged himself. And do not take the verses of Allah in jest. And remember the favor of Allah upon you and what has been revealed to you of the Book and wisdom by which He instructs you. And fear Allah and know that Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:231] When you divorce women, and they have, very nearly, reached, the end of, their term, then retain them, by returning to them, honourably, not harming them, or set them free honourably, or leave them until their term is completed; do not retain them, when reverting, in harm (dirāran is an object denoting reason), to transgress, that is, so as to force them to redemption, or to repudiate them or confine them indoors for a long time; whoever does that has wronged his soul, by exposing it to God’s chastisement; take not God’s verses in mockery, in jest by contravening them, and remember God’s grace upon you, that is, Islam, and the Book, the Qur’ān, and the wisdom, the rulings contained therein, He has revealed to you, to exhort you therewith, so that you should give thanks by acting in accordance with it; and fear God, and know that God has knowledge of all things, and nothing can be hidden from Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When ye have divorced women) one pronouncement of divorce, (and they have reached their term) their waiting period before they have a major ritual ablution after the third menstruation, (then retain them) take them back as your wives (in kindness) with kind companionship and intercourse (or release them) let them have their major ritual ablution and end the waiting period (in kindness) that will restore their rights. (Retain them not to their hurt) in a way that causes their hurt (so that ye transgress (the limits)) that you transgress against them by prolonging their waiting period for them. (He who doeth that) he who so hurts his wife (hath wronged his own soul) has caused harm to himself. (Make not the revelations of Allah) His commands and prohibitions (a laughing stock (by your behaviour)) by not acting upon them, (but remember Allah's grace upon you) preserve Allah's blessing on you Who gave you Islam (and that which He hath revealed unto you of the Scripture) in the Scripture of commands and prohibitions (and of wisdom) the lawful and the unlawful, (whereby He doth exhort you) prohibits you from hurting them. (Observe your duty to Allah) fear Allah if you hurt them (and know that Allah is Aware of all things) harming others as well as other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { فَبَلَغْنَ أَجَلَهُنَّ } معناهُ بَلغَ النِّساءُ فِي عَدَّتِهنَّ منتهى كُلِ قُرءٍ أَوْ شَهرٍ\n وعِدَّةُ المطلَّقةِ إِذا كان مَدخُولاً بِهَا ثَلاثَةُ قُروءٍ إِنْ كَانتْ تَحيضُ وإِنْ كانتْ ممن لاَ تَحيضُ لِصغَرٍ أَوْكِبَرٍ؛ فَثلاثَة أَشْهرٍ، وإِنْ كَانتْ حاملاً؛ فحتَّى تضعَ حَملَهَا\n وإِنْ طَلَّقَها قَبلَ أَنْ يَدخُلَ بِهَا؛ فَلاَ عِدَّةَ عليهَا\n والمُتوفَى عَنهَا زَوجُهَا دَخَلَ بِها أَوْ لَمْ يَدْخُلْ صَغيرةً كانتْ أَوْ كَبيرةً\n كَانتْ تَحيضُ أَوْ لاَ تحيضُ\n فعِدَّتُهَا أَربعةُ أَشهرٍ وعَشرةُ أَيامٍ مِنْ سَاعةِ مَوتِ زَوجِهَا\n إِلاَّ أَنْ تَكونَ حَامِلاً فعِدَّتُهَا أَنْ تَضَعَ حَملَهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَبَلَغْنَ أَجَلَهُنَّ } أي: قرب انقضاء عدتهن { فَأَمْسِكُوهُنَّ } أي: فعليكم بعدما قرب انقضاء مدة العدة أن تراجعوهن فيها وتمسكوهن { بِمَعْرُوفٍ } مستحسن عقلاً وشرعاً { أَوْ سَرِّحُوهُنَّ } وفارقوهن { بِمَعْرُوفٍ } حتى لا يتضررن بعدم الزواج وطول المدة { وَلاَ تُمْسِكُوهُنَّ } أي: ولا تراجعوهن { ضِرَاراً } أي: بمجرد أن تضروهن { لِّتَعْتَدُواْ } أي: تبقوا مدة طويلة بلا محبة ومودة حتى يأتيهن الموت كما يفعله الجهال غيره وحمية { وَمَن يَفْعَلْ ذَلِكَ } الفعلة منكم { فَقَدْ ظَلَمَ نَفْسَهُ } بتعريضها على عقاب الله بإبطال حكمته وتعطيل محل خلقه وقدرته\n\n\n\n\n{ وَلاَ تَتَّخِذُوۤاْ } أيها المؤمنون { آيَاتِ ٱللَّهِ } النازلة عليكم { هُزُواً } تتهاونون عليها وتأخذونها سهلاً، احذوا عن انتقامه { وَٱذْكُرُواْ نِعْمَتَ ٱللَّهِ } المنعمة { عَلَيْكُمْ } واشكروا لها { وَ } خصوصاً { مَآ أَنزَلَ عَلَيْكُمْ } لإصلاح حالكم { مِّنَ ٱلْكِتَابِ } المبين لكم طريق المعاش في النشأة الأولى { وَٱلْحِكْمَةِ } الموصلة إلى ذروة التوحيد في النشأة الأخرى لكي { يَعِظُكُمْ بِهِ } فعليكم أن تتعظوا وتتذكروا به { وَٱتَّقُواْ ٱللَّهَ } عن مساخطته وانتقاماته ولا تتجاوزوا عن حدوده المبينة في كتابه { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ } المحيط بكم وبحالاتكم { بِكُلِّ شَيْءٍ } صدر عنكم من الخير والشر والنفع والضر العائد لنفوسكم { عَلِيمٌ } [البقرة: 231] بالعلم الحضوري، لا يعرب عن علمه شيء مما ظهر وكان، ويظهر ويكون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ضراراً }: مفعول له، أو حال، أي: مُضَارِّين\n يقول الحقّ جلّ جلاله: { وإذا طلقتم النساء } فَقَرُبَ بلوغُ أَجَل عِدَّتِهِنَّ { فأمسكوهن } بالرجعة متلبسين بالمعروف والإحسان إليها، { أو سرحوهن } يتزوجن غيركم { بمعروف } لا إضرار فيه، { ولا تمسكوهن } بنية طلاقهن { ضراراً } أي: لأجل الضرر بتطويل عدتهن { لتعتدوا } عليهن { ومن يفعل ذلك فقد ظلم نفسه }\n نزلت في رجل قال لامرأته: لا آويك، ولا أدعك تحلِّين لغيري\n فقالت: كيف؟ فقال: أطلقك، فإذا دنا مُضِيُّ عِدَّتِك راجعتك، فَشَكَتْ ذلك لرسول الله صلى الله عليه وسلم فنزلت الآية\n وكان بعضهم يطلق، ويعتق، ثم يرجع، ويقول: كُنت أهزأ بذلك وألعب، فنزل قوله تعالى: { ولا تتخذوا آيات الله هزواً } أي: مهزوءاً بها، وفي الحديث:\n\n \" ثَلاَثٌ هزْلُهُنَّ جدٌ: النّكَاحُ، والطَّلاقُ، والرَّجْعَةُ \" \n\n{ واذكروا نعمة الله عليكم } بالهداية وبعثة الرسول، { وما أنزل عليكم من الكتاب } فيه ما تحتاجون إليه ظاهراً وباطناً، { والحكمة } أي: السنة المطهرة، { يعظكم } بذلك ويزكيكم { واتقوا الله } فيما يأمركم به، وينهاكم عنه، { واعلموا أن الله بكل شيء عليم }\n\n \" يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ \" \n",
      "translations": []
    }
  ]
}