{
  "chapter": "البقرة",
  "text": "والولدت يرضعن اولدهن حولين كاملين لمن اراد ان يتم الرضاعة وعلى المولود له رزقهن وكسوتهن بالمعروف لا تكلف نفس الا وسعها لا تضار ولدةۢ بولدها ولا مولود له بولده وعلى الوارث مثل ذلك فان ارادا فصالا عن تراض منهما وتشاور فلا جناح عليهما وان اردتم ان تسترضعوا۟ اولدكم فلا جناح عليكم اذا سلمتم ما ءاتيتم بالمعروف واتقوا۟ الله واعلموا۟ ان الله بما تعملون بصير",
  "translations": [
    {
      "translation": "The mothers should suckle their babies for a period of two years for those (fathers) who wish that they should complete the suckling, in which case they should feed them and clothe them in a befitting way; but no soul should be compelled beyond capacity, neither the mother made to suffer for the child nor the father for his offspring. The same holds good for the heir of the father (if he dies). If they wish to wean the child by mutual consent there is no harm. And if you wish to engage a wet nurse you may do so if you pay her an agreed amount as is customary. But fear God, and remember that God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (divorced) mothers shall suckle their children for two whole years, if the fathers desire the suckling to be completed. In that case the father of the child shall, in the fair known way, be responsible for their food and clothing. But none should be burdened with more than one can bear: neither the mother should be pressed unjustly (to accept unfair terms) just because she is the mother nor should the father be burdened just because he is the father. And the same responsibility for the maintenance of the mother devolves upon the father of the child and his heir. There is no harm if they wean the child by mutual consent and consultation. Moreover, there is no harm if you choose to give your children a suckle by a wet nurse, provided that you pay her fairly. Fear Allah and know it well that whatever you do is in the sight of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers will breast feed their babies for two years if the fathers want them to complete this term. The father has to pay them reasonable expenses. No soul is responsible for what is beyond its ability. None of the parents should suffer any loss from the other because of the baby. The heirs are responsible to look after the children of a deceased. It is no sin for the parents to have a mutual agreement about weaning the baby. There is no sin in hiring a woman to breast feed your children for a reasonable payment. Have fear of God and know that God is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mothers shall breast-feed their children for two full years – for those who wish to complete the term of milk feeding; and the father of the child must provide for food and clothing of the mother in accordance with custom; no one will be burdened except with what he can bear; a mother should not be harmed because of her child, nor he to whom the child is born be harmed because of his child (or a mother should not harm the child nor he to whom the child is born should harm the child); and the same is incumbent on the guardian in place of the father; then if the parents desire to wean the child by mutual consent and consultation, it is no sin for them; and if you wish to give your children out to a (milk feeding) nurse, it is no sin for you, provided you pay to them what is agreed, with kindness; and keep fearing Allah, and know well that Allah is seeing what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mothers should suckle their children for two whole years, (that is) for those (parents) who desire to complete the term of suckling, but the father of the child shall bear the cost of the mother's food and clothing on a reasonable basis. No person shall have a burden laid on him greater than he can bear. No mother shall be treated unfairly on account of her child, nor father on account of his child. And on the (father's) heir is incumbent the like of that (which was incumbent on the father). If they both decide on weaning, by mutual consent, and after due consultation, there is no sin on them. And if you decide on a foster suckling-mother for your children, there is no sin on you, provided you pay (the mother) what you agreed (to give her) on a reasonable basis. And fear Allah and know that Allah is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the mothers should suckle their children for two whole years for him who desires to make complete the time of suckling; and their maintenance and their clothing must be-- borne by the father according to usage; no soul shall have imposed upon it a duty but to the extent of its capacity; neither shall a mother be made to suffer harm on account of her child, nor a father on account of his child, and a similar duty (devolves) on the (father's) heir, but if both desire weaning by mutual consent and counsel, there is no blame on them, and if you wish to engage a wet-nurse for your children, there is no blame on you so long as you pay what you promised for according to usage; and be careful of (your duty to) Allah and know that Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers shall suckle their children two years completely, for such as desire to fulfil the suckling. It is for the father to provide them and clothe them honourably. No soul is charged save to its capacity; a mother shall not be pressed for her child, neither a father for his child. The heir has a like duty. But if the couple desire by mutual consent and consultation to wean, then it is no fault in them. And if you desire to seek nursing for your children, it is no fault in you provide you hand over what you have given honourably; and fear God, and know that God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers shall suckle their children for two whole years; (that is) for those who wish to complete the suckling. The duty of feeding and clothing nursing mothers in a seemly manner is upon the father of the child. No-one should be charged beyond his capacity. A mother should not be made to suffer because of her child, nor should he to whom the child is born (be made to suffer) because of his child. And on the (father's) heir is incumbent the like of that (which was incumbent on the father). If they desire to wean the child by mutual consent and (after) consultation, it is no sin for them; and if ye wish to give your children out to nurse, it is no sin for you, provide that ye pay what is due from you in kindness. Observe your duty to Allah, and know that Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the [divorced] mothers should nurse their children for two whole years, if they wish to complete the period of nursing; and during that period the father of the child shall be responsible for the maintenance of the mother in a reasonable manner. No soul is charged with more than it can bear. No mother should be made to suffer on account of her child, and no father should be made to suffer on account of his child. The same duties devolve upon the father's heir [in case of the death of the father]. But if, after consultation, they choose by mutual agreement to wean the child, there shall be no blame on them. Nor shall it be any offence for you if you desire to engage a wet-nurse for your children, provided you hand over what you have agreed to pay, in a reasonable manner. Have fear of God and know that God is observant of all your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mothers shall suckle their children two whole years: this is for him who intendeth that he shall complete the suckling; and on him to whom the child is born, is their provision and clothing reputably; not a soul is tasked except according to its capacity. Neither shall a mother be hurt because of her child, nor shall he to whom the child is born because of his Child; and on the heir shall devolve the like thereof. Then if the twain desire weaning by agreement between them and mutual counsel, on the twain is no blame. And if ye desire to give your children out for suckling, On you is no blame when ye hand over that which ye had agreed to give her reputably. And fear Allah, and know that of that which ye work Allah is the Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers shall suckle their children for two full years—that for such as desire to complete the suckling—and on the father shall be their maintenance and clothing, in accordance with honourable norms. No soul is to be tasked except according to its capacity: neither the mother shall be made to suffer harm on her child’s account, nor the father on account of his child, and on the [father’s] heir devolve [duties and rights] similar to that. And if the couple desire to wean with mutual consent and consultation, there will be no sin upon them. And if you want to have your children wet-nursed, there will be no sin upon you so long as you pay what you give in accordance with honourable norms, and be wary of Allah and know that Allah watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mothers shall give such to their offspring for two whole years, if the father desires to complete the term. But he shall bear the cost of their food and clothing on equitable terms. No soul shall have a burden laid on it greater than it can bear. No mother shall be Treated unfairly on account of her child. Nor father on account of his child, an heir shall be chargeable in the same way. If they both decide on weaning, by mutual consent, and after due consultation, there is no blame on them. If ye decide on a foster-mother for your offspring, there is no blame on you, provided ye pay (the mother) what ye offered, on equitable terms. But fear Allah and know that Allah sees well what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mothers shall give suck to their children for two whole years, (that is) for those (parents) who desire to complete the term of suckling, but the father of the child shall bear the cost of the mother's food and clothing on a reasonable basis. No person shall have a burden laid on him greater than he can bear. No mother shall be treated unfairly on account of her child, nor father on account of his child. And on the (father's) heir is incumbent the like of that (which was incumbent on the father). If they both decide on weaning, by mutual consent, and after due consultation, there is no sin on them. And if you decide on a foster suckling-mother for your children, there is no sin on you, provided you pay (the mother) what you agreed (to give her) on reasonable basis. And fear Allah and know that Allah is All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers shall suckle their children for two years completely, for whoever desires to fulfill the suckling. It is for the father to provide for them and clothe them with kindness. No soul is charged except to its capacity. A mother shall not be harmed for her child, neither a father for his child. And upon the heir is like that. If both desire to wean by mutual consent and consultation, then no guilt shall be on them. And if you desire a wet nurse for your children, then no guilt shall be on you if you hand over what you have given with kindness. And fear Allah, and know that Allah is the Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers may nurse their infants for two whole years, for those who desire to complete the nursing-period. It is the duty of the father to provide for them and clothe them in a proper manner. No soul shall be burdened beyond its capacity. No mother shall be harmed on account of her child, and no father shall be harmed on account of his child. The same duty rests upon the heir. If the couple desire weaning, by mutual consent and consultation, they commit no error by doing so. You commit no error by hiring nursing-mothers, as long as you pay them fairly. And be wary of God, and know that God is Seeing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mothers may breastfeed their children two complete years for whoever wishes to complete the nursing [period]. Upon the father is the mothers' provision and their clothing according to what is acceptable. No person is charged with more than his capacity. No mother should be harmed through her child, and no father through his child. And upon the [father's] heir is [a duty] like that [of the father]. And if they both desire weaning through mutual consent from both of them and consultation, there is no blame upon either of them. And if you wish to have your children nursed by a substitute, there is no blame upon you as long as you give payment according to what is acceptable. And fear Allah and know that Allah is Seeing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:233] Mothers, shall, suckle their children for two full years (kāmilayn, ‘two full ones’, is an adjective for emphasis); this is, for such as desire to fulfil the suckling, and this is the maximum length of time. It is for the father to provide, food for, them, the mothers, and clothe them, during the suckling if they be divorced, honourably, to the best of his ability. No soul is charged save to its capacity, its ability; a mother shall not be harmed by her child, that is, on account of the child, by being forced to suckle it, if she does not want to; neither, should, a father, be harmed, by his child, that is, on account of it, by being charged with more than he is able to bear. The mention of both parents here in relation to the child is intended to show sympathy [for both]. The heir, the one inheriting from his father, that is, the young man who is the trustee of his [father’s] property, has a similar duty, to that of the father in terms of providing sustenance and clothing for the [other] parent. But if the two, parents, desire by mutual consent, agreement, and consultation, so that   the child’s best interests are clear, to wean, that is, to effect ablactation before the completion of the twoyear period, then they would not be at fault, in this matter. And if you (addressing the parents) desire to seek nursing, from other than the mothers, for your children, you would not be at fault, in this respect, provided you hand over, to them, what you have given, what you intend to give them in the way of wages, honourably, in kindness and good nature; and fear God, and know that God sees what you do, and that nothing of it can be hidden from Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Mothers) who are divorced (shall suckle their children for two whole years; (that is) for those who wish to complete the suckling) of the child. (The duty of feeding) of suckling the child (and clothing nursing mothers in a seemly manner) without excess or stinginess (is upon the father of the child. No soul should be charged) for providing sustenance for suckling (beyond its capacity) except in proportion of what Allah has given it of wealth. (A mother should not be made to suffer because of her child) by taking her child from her after having accepted what was given to someone else for suckling her child, (nor should he whom the child is born) i.e. the father ((be made to suffer) because of his child) by handing him the child after the latter became familiar with his mother and would not take any other breast. (And on the (father's) heir) the heir of the father and it is also said the heir of the child (is incumbent the like of that (which was incumbent on the father)) in terms of providing sustenance and avoiding causing harm, in case this person is not the father. (If they) the mother and father (desire to wean the child by mutual consent) of the father and mother (and (after) consultation) between them, (it is no sin for them) i.e. the father and mother, if they do not suckle the child two full years; (and if ye wish to give your children out to nurse) by other than the mother and the latter wants to remarry, (it is no sin for you) for both the mother and father, (provided that ye pay what is due from you) provided that you spend what you have given (in kindness) in consent and without any disagreement. (And observe your duty to Allah) fear Allah regarding harming and disagreement, (and know that Allah is Seer of what ye do).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلْوَالِدَاتُ } سواءً كانت مطلقات أو غيرها { يُرْضِعْنَ } ولا يضيعن { أَوْلاَدَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ أَرَادَ أَن يُتِمَّ ٱلرَّضَاعَةَ } أي: يرضعن للأب الذي أراد إتما إرضاع ولده { وَعلَى ٱلْمَوْلُودِ لَهُ } أي: على الأب { رِزْقُهُنَّ } أي: رزق المرضعات { وَكِسْوَتُهُنَّ بِٱلْمَعْرُوفِ } المتعارف { لاَ تُكَلَّفُ نَفْسٌ إِلاَّ وُسْعَهَا } إذ من سنته سبحانه أن لا يكلف عبده إلا بما يطيقه ويقدر عليه؛ لذلك { لاَ تُضَآرَّ وَالِدَةٌ بِوَلَدِهَا } بأن ألزم عليها بأنه ولدك لا بد لك أن تسترضعيه بلا أجرةٍ { وَلاَ } يضار أيضاً { مَوْلُودٌ لَّهُ بِوَلَدِهِ } بأن حمل عليه ما ليس في وسعه ن أجرة الرضاعة\n\n\n\n\n{ وَ } إن لم يكن المولود له موجوداً يجب { عَلَى ٱلْوَارِثِ } الحائز لأمواله { مِثْلُ ذٰلِكَ } أي: ما يجب على المولود له لإرضاع ولده { فَإِنْ أَرَادَا } المولود له والمرضعة قبل انقضاء الحولين { فِصَالاً } فطاماً صادراً { عَن تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ } أي: شورة واقعة بينهما { فَلاَ جُنَاحَ عَلَيْهِمَا } في هذا الفطام إن لم يتضرر الرضعي، وإن تضرر فللحاكم أن يمنعها؛ لإفضائه إلى تضييع الرضيع وتخريب بناء الله { وَإِنْ أَرَدتُّمْ } أيها المؤمنون { أَن تَسْتَرْضِعُوۤاْ أَوْلاَدَكُمْ } أي: تطلبوا المرضعة لإرضاع رضيعكم سواء كانت المرضعة أم الرضيع أملا لا { فَلاَ جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُم مَّآ آتَيْتُم بِٱلْمَعْرُوفِ } أي: لا ضيق ولا تعب عليكم أن تسلموا باطلريق المعروف المستحسن ما سميتم من الأجرة للإرضاع قبل انقضاء مدة الرضاع { وَٱتَّقُواْ ٱللَّهَ } عن تضييع الرضيع وتنقيص أجرة المرضعة { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ } [البقرة: 233] يجازيكم على مقتضى علمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}