{
  "chapter": "البقرة",
  "text": "فلما فصل طالوت بالجنود قال ان الله مبتليكم بنهر فمن شرب منه فليس منى ومن لم يطعمه فانه منى الا من اغترف غرفةۢ بيده فشربوا۟ منه الا قليلا منهم فلما جاوزه هو والذين ءامنوا۟ معه قالوا۟ لا طاقة لنا اليوم بجالوت وجنوده قال الذين يظنون انهم ملقوا۟ الله كم من فئة قليلة غلبت فئة كثيرةۢ باذن الله والله مع الصبرين",
  "translations": [
    {
      "translation": "When Saul led his armies, he said: \"God will test you by a stream. Whoever drinks its water will not be of me; but those who do not drink shall be on my side. The only exception will be those who scoop up a palmful of water with their hands.\" And but for a few they all drank of its water. When they had crossed it, and those who believed with him, they said: \"We have no strength to combat Goliath and his forces today. But those who believed they have to face their Lord, said: \"Many a time has a small band defeated a large horde by the will of God. God is with those who are patient (and persevere).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Saul marched out with his army, he warned: \"Allah is going to put you to a test by the side of a river: whoso drinks of its water shall cease to be my companion: he alone shall be~my companion who does not quench his thirst with its water: one may, however, take except a few, drank their fill of it. Afterwards when Saul, and those who had believed with him, crossed the river and advanced forward, the former said to Saul, \"We have no power left this day to fight against Goliath and his hosts.\" But those who believed that one Day they shall meet Allah, declared, \"lt has often been that a small host has, by Allah's grace, overcome a big host: for Allah is with those who show fortitude.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Saul set forth with the army he said, \"God will test you with a river. Those who drink its water will not be of my people and those who do not even taste the water or who only taste some of it from within the hollow of their hand, will be my friends. They all drank the water except a few of them. When Saul and those who believed in him crossed the river, his people said, \"We do not have the strength to fight against Goliath and his army.\" Those who thought that they would meet God said, \"How often, with God's permission, have small groups defeated the large ones?\" God is with those who exercise patience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Talut left the city along with the armies, he said, “Allah will surely test you with a river; so whoever drinks its water is not mine – and whoever does not drink is mine – except him who takes it in the hollow of his hand”; so they all drank it, except a few of them; thereafter when Talut and the believers with him had crossed the river, they said, “We do not have power this day to face Jalut (Goliath) and his armies”; those who were certain of meeting Allah said, “Many a times has a smaller group overcome a bigger group by Allah’s command; and Allah is with the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Talut set out with the army, he said: \"Verily, Allah will try you by a river. So whoever drinks thereof, he is not of me; and whoever tastes it not, he is of me, except him who takes (thereof) in the hollow of his hand.\" Yet, they drank thereof, all, except a few of them. So when he had crossed it (the river), he and those who believed with him, they said: \"We have no power this day against Jalut (Goliath) and his hosts.\" But those who knew with certainty that they were going to meet Allah, said: \"How often has a small group overcome a mighty host by Allah's leave\" And Allah is with As-Sabirin (the patient).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when Talut departed with the forces, he said: Surely Allah will try you with a river; whoever then drinks from it, he is not of me, and whoever does not taste of it, he is surely of me, except he who takes with his hand as much of it as fills the hand; but with the exception of a few of them they drank from it. So when he had crossed it, he and those who believed with him, they said: We have today no power against Jalut and his forces. Those who were sure that they would meet their Lord said: How often has a small party vanquished a numerous host by Allah's permission, and Allah is with the patient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Saul went forth with the hosts he said, 'God will try you with a river; whosoever drinks of it is not of me, and whoso tastes it flot, he is of me, saving him who scoops up with his hand.' But they drank of it, except a few of them; and when he crossed it, and those who believed with him, they said, 'We have no power today against Goliath and his hosts.' Said those who reckoned they should meet God, 'How often a little company has overcome a numerous company, by God's leave! And God is with the patient.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Saul set out with the army, he said: Lo! Allah will try you by (the ordeal of) a river. Whosoever therefore drinketh thereof he is not of me, and whosoever tasteth it not he is of me, save him who taketh (thereof) in the hollow of his hand. But they drank thereof, all save a few of them. And after he had crossed (the river), he and those who believed with him, they said: We have no power this day against Goliath and his hosts. But those who knew that they would meet Allah exclaimed: How many a little company hath overcome a mighty host by Allah's leave! Allah is with the steadfast.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Talut set out with his forces, he said to them, \"God will test you with a river: whoever drinks from it is not with me and whoever does not drink is with me. There will, however, be no blame upon one who sips only a handful from it.\" But, except for a few of them, they all drank from it. When he and those who believed along with him had crossed the river, they said, \"We have no strength today against Goliath and his warriors.\" But those of them who believed that they would meet God replied, \"Many a small group, by God's command has prevailed against a large group. God is indeed with the steadfast.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Talut sallied forth with the hosts, he said, verily God will prove you with a river: then whosoever drinketh thereof shall be none of mine, and whosoever tasteth it not, verily shall be mine, excepting him who ladeth a lading with his hand. But they drank thereof, save a few of them. Then when he had crossed it, he, and those who believe with him, they said: We have no strength to-day against Jalut and his hosts. But those who imagined that they were going to meet Allah Said how oft hath a small party prevailed against a large party by God's leave! And Allah is with the patiently persevering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As Saul set out with the troops, he said, ‘Allah will test you with a stream: anyone who drinks from it will not belong to me, but those who do not drink from it will belong to me, barring someone who draws a scoop with his hand.’ But they drank from it, [all] except a few of them. So when he crossed it along with the faithful who were with him, they said, ‘We have no strength today against Goliath and his troops.’ Those who were certain that they would encounter Allah said, ‘How many a small party has overcome a larger party by Allah’s will! And Allah is with the patient.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Talut set forth with the armies, he said: \"Allah will test you at the stream: if any drinks of its water, He goes not with my army: Only those who taste not of it go with me: A mere sip out of the hand is excused.\" but they all drank of it, except a few. When they crossed the river,- He and the faithful ones with him,- they said: \"This day We cannot cope with Goliath and his forces.\" but those who were convinced that they must meet Allah, said: \"How oft, by Allah's will, Hath a small force vanquished a big one? Allah is with those who steadfastly persevere.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when Talut (Saul) set out with the army, he said: \"Verily! Allah will try you by a river. So whoever drinks thereof, he is not of me, and whoever tastes it not, he is of me, except him who takes (thereof) in the hollow of his hand.\" Yet, they drank thereof, all, except a few of them. So when he had crossed it (the river), he and those who believed with him, they said: \"We have no power this day against Jalut (Goliath) and his hosts.\" But those who knew with certainty that they were to meet their Lord, said: \"How often a small group overcame a mighty host by Allah's Leave?\" And Allah is with As-Sabirin (the patient ones, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Saul marched out with his army, he said: 'Allah will test you with a river. He who drinks from it shall cease to be one of mine but he who does not drink from it, except he who scoops up once with his hand, shall be of mine' But for a few of them, they all drank from it. And when he had crossed it with those who believed, they said: 'We have no power this day against Goliath and his soldiers' But those of them who reckoned they would meet Allah replied: 'Many a small band has, by the permission of Allah, vanquished a mighty army. Allah is with the patient'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Saul set out with the troops, he said, “God will be testing you with a river. Whoever drinks from it does not belong with me. But whoever does not drink from it, does belong with me, except for whoever scoops up a little with his hand.” But they drank from it, except for a few of them. Then, when he crossed it, he and those who believed with him, they said, “We have no strength to face Goliath and his troops today.” But those who knew that they would meet God said, “How many a small group has defeated a large group by God’s will. God is with the steadfast.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Saul went forth with the soldiers, he said, \"Indeed, Allah will be testing you with a river. So whoever drinks from it is not of me, and whoever does not taste it is indeed of me, excepting one who takes [from it] in the hollow of his hand.\" But they drank from it, except a [very] few of them. Then when he had crossed it along with those who believed with him, they said, \"There is no power for us today against Goliath and his soldiers.\" But those who were certain that they would meet Allah said, \"How many a small company has overcome a large company by permission of Allah. And Allah is with the patient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:249] And when Saul went forth with the hosts, from the Holy House [sc. Jerusalem], the heat was intense and so they asked him for water; he said, ‘God will try, test, you, in order to distinguish the obedient among you from the disobedient, with a river, between Jordan and Palestine, whoever drinks of it, of its water, is not of me, is not of my followers, and whoever tastes it not, he is of me, except for him who scoops up with his hand’ (ghurfa, or gharfa, ‘a scoop’), satisfying himself therewith and not taking more, he is also of my followers. But they drank of it, when they reached it and saw that it was abundant, except a few of them, who restricted themselves to a scoop: it is reported that one scoop was enough for each man and his horse, and they numbered over three hundred; and when he crossed it, with those who believed, the ones who confined themselves to the one scoop, they, the ones that drank profusely, said, ‘We have no power today against Goliath and his troops’, that is, [no power] to fight them, and they were cowardly and did not cross it. Those who thought, with certainty that, they would meet God, at the Resurrection, and these were the ones that crossed it, said, ‘How often (kam, ‘how’, functions as a predicate, meaning kathīr, ‘many’) a little company, group of men, has overcome a numerous one, by God’s leave, by His will; and God is with the patient’, [providing them] with help and assistance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "43 When they were given the Ark back, they accepted him as their king and went out with him to fight. (And when Saul set out) went forth (with the army) through a wasteland and became very thirsty, they asked him to provide them with water, (he) i.e. Saul (said: Lo! Allah will try you by a river) Allah will test you by a flowing river. (Whosoever therefore drinketh thereof) from the river (he is not of me) he is not going to be with me in the fight against my enemy and will not go further, (and whoever tasteth it not he is of me) against my enemy, but then he made an exception, (save him who taketh (thereof) in the hollow of his hand) and this was enough for them, their beasts and transportation. (But they drank thereof) when they reached the river however they drank as much as they wanted to, (all save a few of them) 313 men who did not drink except as they had been directed. (And after he had crossed) the river, (he) i.e. Saul (and those who believed with him, they said) to each other: (We have no power this day against Goliath and his hosts. But those who knew) and were convinced (that they would meet Allah) in person after they died (exclaimed: How many a little company) of believers (hath overcome a mighty host) of unbelievers (by Allah's leave!) by the help of Allah. (And Allah is with the steadfast) He assists the steadfast in war by giving them victory.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ } معناهُ مُختَبرُكُمْ\n والنَّهرُ: بينَ الأَردنِ وفلسطينَ\n\n\n\n\nوقولهُ تعالى: { فَمَن شَرِبَ مِنْهُ فَلَيْسَ مِنِّي } معناه ليسَ مَعي عَلى عَدوّي\n\n\n\n\nوقولهُ تعالى: { إِلاَّ مَنِ ٱغْتَرَفَ غُرْفَةً بِيَدِهِ } فالغُرْفَةُ: مِلءُ الكَفِ\n وتجمعُ غَرَفاً وغَرَفاتٍ، وغُرْفَةً، وغُرْفاتٍ\n\n\n\n\nوقولهُ تعالى: { فَشَرِبُواْ مِنْهُ إِلاَّ قَلِيلاً مِّنْهُمْ } فالقَليلُ ثلاثمائةٌ وثَلاثَةَ عشرَ رجلاً وكَانَ عِدَّةُ أَصحَابِ بَدرٍ مِنْ المُسلِمينَ مِثلَ ذَلِكَ\n\n\n\n\nوقولهُ تعالى: { كَم مِّن فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً } فالفِئَةُ: الجماعةُ وجمعُهَا فِئاتٌ، وفِئُون\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الله مُبْتَليكم بنهرٍ } هو منهل الطبيعة الجسمانية { فمن شَرِب منه فليس مني } أي: من كرع فيه مفرطاً في الريّ منه\n لأنّ أهل الطبيعة وعبدة الشهوات أذلّ وأعجز خلق الله، لا قوّة لهم بقتال جالوت النفس الأمّارة، ولا بجالوت عدّو الدين، إذ لا حمية لهم ولا تشدّد { إلا من اغْتَرف غَرْفة بيده } أي: إلا من اقتنع منه بقدر الضرورة والاحتياج من غير حرص وانهماك فيه { فشَربُوا منه } أي: كرعوا فيه وانهمكوا { إلا قليلاً منهم } إذ المتنزهون عن الأقذار الطبيعية، المتقدّسون عن ملابسها، المتجرّدون عن غواشيها قليلون بالنسبة إلى من عداهم\n قال الله تعالى:\n\n[ص، الآية: 24]،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا فَصَلَ طَالُوتُ بِٱلْجُنُودِ } وكان في شدة الحر والعبور على مفازة لا ماء فيها، ناجى مع الله كل من جنوده في نفسه أن يظهر عليهم نهراً في تلكل المفازة؛ خوفاً من شدة العطش، ألهم الله مناجاتهم إلى قلب طالوت { قَالَ } لهم { إِنَّ ٱللَّهَ } القادر على ما يشاء { مُبْتَلِيكُمْ } ومجربكم في هذه المفازة { بِنَهَرٍ } عظيم { فَمَن شَرِبَ مِنْهُ فَلَيْسَ مِنِّي } أي: ليس من أتباعي وأعواني وظهيري { وَمَن لَّمْ يَطْعَمْهُ } ولم يذقه { فَإِنَّهُ مِنِّيۤ إِلاَّ مَنِ ٱغْتَرَفَ غُرْفَةً بِيَدِهِ } لا لتسكين العطش، بل لشكر نعمة الله وإنجاز وعده وتعديد إحسانه وفضله، ولما وصلوا إليه { فَشَرِبُواْ مِنْهُ } من النهر { إِلاَّ قَلِيلاً مِّنْهُمْ } معدودين، قيل: ثلاثمائة وثلاثة عشر، وقيل: ثلاثة آلاف، وقيل: ألف\n\n\n\n\nوإياك أيها المبتلى بنهر الدنيا في فضاء الوجود أن تشرب منها خوفاً من عطش حرارة العشق المفني للعاشق والعشق في المعشوق الحقيقي بالمرة، حتى لا يخرج عن زمرة المحبين المحترفين بنيران المحبة إلى أن خلصوا عن هوياتهم بالكلية، وأن يطعم ويذوق من مستلذاتها ومشتهاتها حتى لا يحرم من مرتبة أولي النهى واليقين، الفائزين بجنة اللقاء وروضة التسليم { فَلَمَّا جَاوَزَهُ هُوَ وَٱلَّذِينَ آمَنُواْ مَعَهُ قَالُواْ } أي: بعضهم لبعض خفية: { لاَ طَاقَةَ لَنَا ٱلْيَوْمَ بِجَالُوتَ وَجُنودِهِ } لقوتهمه وشوكتهم { قَالَ ٱلَّذِينَ يَظُنُّونَ } بربهم ظناً حسناً، بل يعلمون يقيناً { أَنَّهُمْ } بعد انخلاعهم عن ملابس الإمكان { مُلاَقُواْ ٱللَّهِ } بلا سترة الثنوية وحجاب الهوية: { كَم مِّن فِئَةٍ قَلِيلَةٍ } من العقل والنهى { غَلَبَتْ فِئَةً كَثِيرَةً } من جنود النفس والهوى { بِإِذْنِ ٱللَّهِ } بتوفيقه وتيسيره { وَٱللَّهُ } المختبر لعباده { مَعَ ٱلصَّابِرِينَ } [البقرة: 249] لبلواه ينصرهم على من يعاديهم بحوله وقوته، وما النصر إلا من عند الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال في القاموس: غَرَفَ الماء يِغْرُفُه: أخذ بيده، كاغْتَرَفه، والغَرْفَةُ للمَرَّة، وبالكسر: هيئة الغرف وبالضام: اسم للمفعول، كالغرافة، لأنك ما لم تغرفه لا تسميه غُرْفَة، ثم قال: والغُرْفَةُ، بالضم: العُلِّيَّة\n يقول الحقّ جلّ جلاله: ولما اتفقوا على مُلك طالوت تجهز للخروج، وقال: لا يخرج معه إلا الشبابُ النشيط الفارغُ ليس وراءه غُلْقة، فاجتمع ممن اختار ثمانون ألفاً، وقي: ثلاثون، فلما انفصل عن بلده بالجنود وساروا في البيداء - وكان وقت الحرِّ والقيّظ - عطشوا، وسألوا طالوتَ أن يُجري لهم نهراً، فقال لهم بوحْي، أو بإلهام، أو بأمر نبيهم: { إن الله مبتليكم } أي: مُختبركم { بنهر } بسبب اقتراحكم، { فمن شرب منه } كَرْعاً بلا واسطة { فليس مني } أي: من جيشي، { ومن لم يطعمه } أي: يَذْقه، { فإنه مني إلا من اغترف غرفة بيده } فإنها تكفيه لنفسه ولفرسه، فالاستثناء من الجملة الأولى\n { فشربوا منه } أي: كَرعُوا، وسقطوا على وجوههم، { إلا قليلاً منهم } ثلاثُمائةٍ وأربعةَ عشر، على عدد أهل بدر، وقيل: ألفاً\n رُوِيَ أن من اقتصر على الغَرفة كَفَتْه لشربه ودوابه، ومن لم يقتصر غلب عطشُه، واسودَّتْ شفتُه ولم يقدْر أن يمضيَ\n وعن ابن عباس: أن القومَ شربوا على قدر يقينهم: فالكفار شربوا شُربَ الهيم، وشَرِب العاصي دون ذلك، وانصرف من القوم ستةٌ وسبعون ألفاً، وبقي بعضُ المؤمنين لم يشرب شيئاً، وأخذ بعضهم الغَرفة، فأما من شرب فاشتد به العطشُ وسقط، وأما من ترك الماءَ فحسن حالُه، وكان أجلَد ممن أخذ الغرفة\n هـ\n وحكمة هذ الامتحان: ليتخلص للجهاد المطيعون المخلصون، إذ لا يقع النصر إلاَّ بهم، فلما جاوز النهرَ طالوتُ ومن بقيَ معه ممن لم يشربْ قال بعضهم لبعض: { لا طاقة لنا اليوم بجالوت وجنوده } لكثرتهم وقلة عددنا، { قال الذين يظنون } أي: يَتَيَقَّنْون { أنهم ملاقوا الله } ويتوقعون ثوابَ الشهادة وهم الخُلْصُ من أهل البصيرة: لا تفزعوا من كثرة عددهم { كم من فئة قليلة غلبت فئة كثيرة بإذن الله } وإرادته ومعونته، و { كم } للتكثير، { والله مع الصابرين } بالنصر والمعونة\n الإشارة: قال بعض الحكماء: الدنيا كنهر طالوت، لا ينجو منها إلا من لم يشربْ أو اغترف غرفةً بيده، فمن أخذ منها قَدْرَ الضرورةِ كَفَتْه، ونَشَطَ لعبادة مولاه، ومن أخذ فوق الحاجة حُبس في سجنها، وكان أسيراً في يدها\n وقال بعضهم: طالبُ الدنيا كشارب ماءِ البحر، كلما زاد شربه ازداد عطشه\n هـ\n وقال صلى الله عليه وسلم:\n\n \" من أُشرب قلبه حُبَ الدنيا التاط منها بثلاث: بشغل لا ينفد عناه، وأمل لا يبلغ منتهاه، وحرص لا يدرك مداه \" \n\nوقال عيسى عليه السلام: الدنيا مزرعة لإبليس، وأهلها حراث له هـ\n وقال عليّ رضي الله عنه: الدنيا كالحية: لَيِّن مسها، قاتل سمها، فكن أحذر ما تكونُ منها، أَسَرَّ ما تكون بها فإن من سكن منها إلى إيناس أزاله عنها إيحاش\n\n\nوقال عليه الصلاة والسلام:\n\n \" مِنْ هوان الدنيا على الله أنه لا يُعصى إلا فيها، ولا ينال ما عنده إلا بتركها \" \n\nوقال سيدنا عليّ - كرّم الله وجهه-: أول الدنيا عناء، وآخرها فناء، حلالها حساب، وحرامها عقاب، ومتشابهها عتاب، من استغنى فيها فُتن، ومن افتقر فيها حزن\n هـ\n وقيل: الدنيا تُقبل إقبال الطالب، وتُدبر إدبار الهارب، وتصل وصال الملول، وتُفارق فراق العجول، خيرها يسير، وعمرها قصير، ولذاتها فانية، وتبعاتها باقية\n وقال عيسى عليه السلام: تعملون للدنيا، وأنتم تُرزقون فيها بغير عمل، ولا تعملون للآخرة، وأنتم لا ترزقون فيها إلا بالعمل\n هـ\n وقيل: أوحى الله إلى الدنيا: مَنْ خدَمني فاخدِميه، ومن خدمك فاستخدِميه\n وكان عمرُ بنُ عبد العزيز يتمثل بهذه الأبيات:\n\nوقال آخر:\n",
      "translations": []
    }
  ]
}