{
  "chapter": "البقرة",
  "text": "فان لم تفعلوا۟ ولن تفعلوا۟ فاتقوا۟ النار التى وقودها الناس والحجارة اعدت للكفرين",
  "translations": [
    {
      "translation": "But if you cannot, as indeed you cannot, then guard yourselves against the Fire whose fuel is men and rocks, which has been prepared for the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not do this, and you can never do this, then fear the Fire which has been prepared for the disbelievers and which shall have men and stones for fuel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not produce such a chapter and you never will then guard yourselves against the fire whose fuel will be people and stones and is prepared for those who hide the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you are unable to bring forth (one chapter) – and We declare that you can never bring one – then fear the fire (of hell), the fuel of which is men and stones; kept ready for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do it not, and you can never do it, then fear the Fire (Hell) whose fuel is men and stones, prepared for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do (it) not and never shall you do (it), then be on your guard against the fire of which men and stones are the fuel; it is prepared for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not -- and you will not -- then fear the Fire, whose fuel is men and stones, prepared for unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye do it not - and ye can never do it - then guard yourselves against the Fire prepared for disbelievers, whose fuel is of men and stones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you cannot do it, and you can never do it, then guard yourselves against the Fire whose fuel is men and stones, prepared for those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye do it not, --and by no means ye shall, --then dread the Fire, the fuel whereof is men and stones, gotten ready for the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not—and you will not—then beware the Fire whose fuel will be humans and stones, prepared for the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye cannot- and of a surety ye cannot- then fear the Fire whose fuel is men and stones,- which is prepared for those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do it not, and you can never do it, then fear the Fire (Hell) whose fuel is men and stones, prepared for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you fail, as you are sure to fail, then guard yourselves against the Fire whose fuel is people and stones, prepared for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not—and you will not—then beware the Fire whose fuel is people and stones, prepared for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not - and you will never be able to - then fear the Fire, whose fuel is men and stones, prepared for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:24] And if you do not, do what was mentioned because you are incapable, and you will not (a parenthetical statement), that is, never [will you be able to], because of its inimitability, then fear, through belief in God and [belief] that this is not the words of a human, the Fire, whose fuel is men, disbelievers, and stones, like their very idols, indicating that its heat is extreme, since it burns with the [stones] mentioned, unlike the fires of this world that burn with wood and similar materials; prepared, and made ready, for disbelievers, so that they are punished in it (this [phrase, u‘iddat li’l-kāfirīna, ‘prepared for disbelievers’] is either a new sentence or a sustained circumstantial qualifier).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye do it not-and you can never do it-) this you can never do and if you try you will never succeed (then guard yourselves against the Fire) if you are bent on not believing, for you should fear hell (whose fuel is men) the unbelievers, (and stones) of sulphur, (prepared) created, prepared and preordained (for disbelievers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فإن لم تفعلوا } فاذعنوا وأسلموا وآمنوا، واتركوا العناد المفضي بكم إلى النار\n فحذف الملزوم الذي هو الإيمان أو الإسلام، وأقام لازمه الذي هو اتقاء النار مقامه ليكون أدلّ على أن الإنكار موجب لدخول النار وحصول العذاب لهم\n وقوله: { ولن تفعلوا } اعتراض على طريق الإخبار بالغيب للعلم بامتناع عقول المحجوبين عن مثله\n والمراد بالنار احتراقهم بثورة نفوسهم، وشرر طباعهم المصروفة عن الروح القدسيّ الروحانيّ، والنسيم الذوقيّ الرحمانيّ، المحرومة عن لذّة برد اليقين، وسلامة دار القرار المقطوعة بالمألوفات الحسيّة، واللذات البدنيّة الممنوعة، بما ضربت به وألفته مع بقاء حنينها إليه وولهها، ورسوخ هيئات التعلّق بالأمور السفليّة، ومحبة الأجساد الأرضية فيها التي هي سبب استيقاد نيرانها، ولهذا قال: { وقُودُها الناسُ والحجارةُ } أي: الأمور الجاسية، السفلية، الصامتة، التي تعلقوا بها بالمحبة فرسخت صورتها في أنفسهم، وسجنت نفوسهم بميلهم إليها، كما قال رسول الله صلى الله عليه وسلم\n\n \" المرء يحشر مع من أحبّ حتى لو أحبّ أحدكم حجراً حشر معه \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن لَّمْ تَفْعَلُواْ } فإن لم تفعلوا الإتيان أنتم في حين التحدي والمعارضة { وَلَن تَفْعَلُواْ } أيضاً بعدما رجعتم إليهم، فلا تكابروا ولا تنازعوا، بل انقادوا وامتثلوا بأوامر الكتاب المنزل على عبدنا، واجتنبوا عن نواهيه { فَٱتَّقُواْ ٱلنَّارَ ٱلَّتِي } أخبر فيه بأنه { وَقُودُهَا } أي: ما يتقد به النار { ٱلنَّاسُ } الذين يعبدون غير الله { وَٱلْحِجَارَةُ } التي هي معبوداتهم التي نحتوها بأيديهم وما { أُعِدَّتْ } هذه النار إلا { لِلْكَٰفِرِينَ } [البقرة: 24] الجاهلين طريق توحيد الحق، والمكذبين كتاب الله ورسوله المنزل عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَإن لَّمْ } تقدروا أن { تَفْعَلُوا } ذلك { ولَن } تقدروا ابداً فأسلموا وأقرُّوا بالحق، و { اتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ } أي: حجارة الكبريت، فَهُمَا حطبُها ووقودها { أُعِدَّتْ لِلْكَافِرينَ }",
      "translations": []
    }
  ]
}