{
  "chapter": "البقرة",
  "text": "والذين يتوفون منكم ويذرون ازوجا وصية لازوجهم متعا الى الحول غير اخراج فان خرجن فلا جناح عليكم فى ما فعلن فى انفسهن من معروف والله عزيز حكيم",
  "translations": [
    {
      "translation": "Those among you about to die leaving wives behind, should bequeath a year's maintenance and lodging for them, without expelling them from home. But if they leave (of their own accord), you will not be blamed for what they do with themselves in their own rights. God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you, who shall die and leave wives behind them, should make a will to the effect that they should be provided with a year's maintenance and should not be turned out of their homes. But if they leave their homes of their own accord, you shall not be answerable for whatever they choose for themselves in a fair way; Allah is All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are about to die and leave widows behind should bequeath for their wives the expenses of one year's maintenance. The widows must not be expelled from the house for up to one year. It is no sin for the relatives of the deceased to permit the widows to leave the house before the appointed time and do what is reasonable. God is Majestic and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those among you who die leaving wives behind them – they should bequeath for their wives a complete provision for one full year without turning them out; so if they go out themselves, there is no sin on you regarding what they do of themselves in a reasonable manner; and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who die and leave behind wives should bequeath for their wives a year's maintenance (and residence) without turning them out, but if they (wives) leave, there is no sin on you for that which they do of themselves, provided it is honorable (e.g., lawful marriage). And Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who die and leave wives behind, (make) a bequest in favor of their wives of maintenance for a year without turning (them) out, then if they themselves go away, there is no blame on you for what they do of lawful deeds by themselves, and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who die, leaving wives, let them make testament for their wives, provision for a year without expulsion; but if they go forth, there is no fault in you what they may do with themselves honourably; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(In the case of) those of you who are about to die and leave behind them wives, they should bequeath unto their wives a provision for the year without turning them out, but if they go out (of their own accord) there is no sin for you in that which they do of themselves within their rights. Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of you die and leave widows, make a bequest for them of a year's maintenance without causing them to leave their homes; but if they leave of their own accord, you will not be blamed for what they may reasonably choose to do with themselves. God is almighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who die and leave wives behind, they shall make a bequest unto their wives a year's maintenance without their having to go out, then if they go out, then no blame is on you for that which they, do with themselves reputably, and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who die leaving wives shall bequeath for their wives providing for a year, without turning them out; but if they leave, there is no sin upon you in respect of what they may do with themselves in accordance with honourable norms. And Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who die and leave widows should bequeath for their widows a year's maintenance and residence; but if they leave (The residence), there is no blame on you for what they do with themselves, provided it is reasonable. And Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who die and leave behind wives should bequeath for their wives a year's maintenance and residence without turning them out, but if they (wives) leave, there is no sin on you for that which they do of themselves, provided it is honourable (e.g. lawful marriage). And Allah is All-Mighty, All-Wise. [The order of this Verse has been cancelled (abrogated) by Verse 4:12].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who die and leave wives behind should bequeath to them a year's maintenance without causing them to leave their homes; but if they leave, no blame shall be attached to you in what they do with themselves kindly. Allah is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of you who die and leave wives behind—a will shall provide their wives with support for a year, provided they do not leave. If they leave, you are not to blame for what they do with themselves, provided it is reasonable. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are taken in death among you and leave wives behind - for their wives is a bequest: maintenance for one year without turning [them] out. But if they leave [of their own accord], then there is no blame upon you for what they do with themselves in an acceptable way. And Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:240] And those of you who die, leaving wives, let them, make testament (wasiyyatan, or wasiyyatun) for their wives, as an obligation, and give them provision, what they can enjoy of property and clothes, for, until the completion of, a year (matā‘an ilā l-hawl, ‘provision for a year’, is a circumstantial qualifier), that is, without expelling them from their habitations; but if they go forth, of their own accord, you would not be at fault, [you] the guardians of the dead one, regarding what they may do with themselves honourably, in accordance with the Law, such as adorning themselves or abandoning the mourning, or that you should cut off their expenditure; God is Mighty, in His Kingdom, Wise, in His actions. The testament mentioned here was abrogated by the ‘inheritance’ verse [Q. 4:12], and the waiting of one year [without expulsion] was abrogated by the previous verse four months and ten [Q. 2:234] which was revealed later. In the opinion of al-Shāfi‘ī, may God have mercy on him, the habitation remains hers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((In the case of) those who are about to die and leave behind them wives, they should bequeath unto their wives a provision) regarding their wealth (for the year) sustenance and habitation for a year (without turning them out) of the houses of their husbands, (but if they go out) of their own accord, or if they marry before the lapse of a year (there is no sin on you) on the inheritors of the deceased to stop providing sustenance and habitation after she leaves the house of her husband or remarries (in that which they do of themselves) nor is there any blame on them in what the wives do to themselves (within their rights) looking forward to remarriage, making themselves beautiful for this purpose. This, i.e. the sustenance due on the deceased towards any wife he leaves behind, was however abrogated by her inheritance. (Allah is Mighty) for He is vengeful towards any that leaves what He has commanded, (Wise) in that He abrogated apportioning a year of sustenance and habitation to the wife whose husband is deceased and substituted it with what is due to her of inheritance: a quarter or eighth of the deceased's wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يُتَوَفَّوْنَ } يستشرفون إلى الوفاة { مِنكُمْ } أيها المؤمنون { وَيَذَرُونَ } يتركون { أَزْوَاجاً } بعدم لزمهم أن يوصوا { وَصِيَّةً } مستخرجة من أموالهم { لأَزْوَاجِهِمْ } ليتمتعن بها { مَّتَاعاً إِلَى } انقضاء { ٱلْحَوْلِ } بعد موتهم { غَيْرَ إِخْرَاجٍ } لهن من المسكن المألوف، وكان ذلك في أول الإسلام، ثم نسخت بتعيين المدة لعدة الوفاة من أربعة أشهر وعشراً { فَإِنْ خَرَجْنَ } من مسكن الأزواج { فَلاَ جُنَاحَ عَلَيْكُمْ } أيها الحكام { فِي مَا فَعَلْنَ } من التطيب وترك الحداد وطلب الخطبة { فِيۤ } إصلاح { أَنْفُسِهِنَّ } إن كانت الأمور الصادرة منهم { مِن مَّعْرُوفٍ } مستحسن مشروع مرخص، وإن لم يكن كذلك فعليكم الجناح أيها الحكام { وَٱللَّهُ عَزِيزٌ } غالب قادر على الانتقام، ينتقم من المتجاوزين عن حدوده، المتهاونين في إجراء أحكامه { حَكِيمٌ } [البقرة: 240] في رعاية مصالح عباده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وصية }: مبتدأ، والخبر محذوف، أي: عليهم وصية، ومَنْ نَصَبَ، فمفعول مطلق، أي: فليوصوا وصية، و { غير }: حال من الأزواج، أي: حَالَ كَوْنِهِنَّ غَيْرَ مُخْرَجَاتِ\n يقول الحقّ جلّ جلاله: { والذين يتوفون منكم } ويتركون { أزواجاً } بعدهم، فيجب عليهم أن يوصوا لأزواجهم وصية يتمتعن بها من كسوة ونفقة وسكنى، إلى تمام { الحول } ما دام الأزواج لم يخرجن من مسكن الزوج، { فإن خرجن } بأنفسهن، فلا نفقة ولا كسوة ولا سكنى عليكم أيها الأولياء، ولا حرج عليكم { فيما فعلن في أنفسهن } من التزين والتعرض للنكاح بعد تمام عدتهن، على ما هو معروف في الشرع، والوصية منسوخة بآية الميراث، وتربص الحول بآية\n",
      "translations": []
    }
  ]
}