{
  "chapter": "البقرة",
  "text": "من ذا الذى يقرض الله قرضا حسنا فيضعفه له اضعافا كثيرة والله يقبض ويبصۜط واليه ترجعون",
  "translations": [
    {
      "translation": "Who will give a goodly loan to God which He might double many times? For God withholds and enlarges, and to Him you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is there among you who will lend to Allah a good loan that He may return it after multiplying it manifold? Allah alone can decrease and increase (wealth) and to Him you shall all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who generously lends to God will be paid back in many multiples of the loan. It is God who reduces and expands things and to Him you will all return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there someone who will lend an excellent loan to Allah, so that He may increase it for him several times over? And Allah restricts and eases (the sustenance) – and it is to Him that you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend to Allah a goodly loan so that He may multiply it to him many times And it is Allah that decreases or increases (your provisions), and unto Him you shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that will offer of Allah a goodly gift, so He will multiply it to him manifold, and Allah straitens and amplifies, and you shall be returned to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend God a good loan, and He will multiply it for him manifold? God grasps, and outspreads; and unto Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that will lend unto Allah a goodly loan, so that He may give it increase manifold? Allah straiteneth and enlargeth. Unto Him ye will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who will give God a generous loan? He will multiply it many times over. It is God who withholds, and God who gives abundantly, and it is to Him that you shall all be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend unto Allah a goodly loan, so that he will multiply it unto him manifold And Allah scanteth and amplifieth, and unto Him ye shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that will lend Allah a good loan that He may multiply it for him severalfold? Allah tightens and expands [the means of life], and to Him you shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will loan to Allah a beautiful loan, which Allah will double unto his credit and multiply many times? It is Allah that giveth (you) Want or plenty, and to Him shall be your return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend to Allah a goodly loan so that He may multiply it to him many times? And it is Allah that decreases or increases (your provisions), and unto Him you shall return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend Allah a good loan! He will multiply it many multiples! Allah grasps and outspreads and to Him you shall be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he who will offer God a generous loan, so He will multiply it for him manifold? God receives and amplifies, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that would loan Allah a goodly loan so He may multiply it for him many times over? And it is Allah who withholds and grants abundance, and to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:245] Who is he that will lend God a loan, by expending his property in the way of God, that is good, by expending it for the sake of God, Mighty and Majestic, out of pureness of heart, and He will multiply (yudā‘if, also read yuda‘‘if) it for him manifold?, up to ten or seven hundred times or more, as will be mentioned soon. God straitens, sustenance for whomever He wills in order to try him, and enlarges, it in abundance for whomever He wills in order to test him; and to Him you shall be returned, in the Hereafter through the Resurrection, where He will requite you for your deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then prompted the believer to give in charity, saying: (Who is it that will lend unto Allah a goodly loan) in charity sincerely wanting nothing but the sake of Allah, (so that He may give it increase manifold for him?) every act is rewarded a thousand times (Allah straiteneth) withholds wealth from people (and enlargeth) gives plenty to whomever He wills in this worldly life. (Unto Him ye will return) after you die and He will requite each according to his works. This verse was revealed about a man from the Helpers (al- Ansar) named Abu'l-Dahdah or Abu'l-Dahdahah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَّن ذَا } العارف { ٱلَّذِي يُقْرِضُ ٱللَّهَ } أي: يفوض ويسلم هوية الإمكان وماهية الكوني والكياني إلى الله المسقط للهويات مطلقاً { قَرْضاً حَسَناً } تفويضاً سلساً نشطاً فرحاناً بلا مضايقة ولا مماطلة، راضياً بما قضى عليه، صابراً على عموم البلوى المقربة إليه { فَيُضَٰعِفَهُ لَهُ } بعدما فني عن هيوته فيه { أَضْعَافاً كَثِيرَةً } لا يحيط بكنهها إلا هو؛ إذ المحدث قرن بالعديم، وترتب عليه ما ترتب عليه بل سقط الاثنينية بالكلية، وارتفع غيار الأغيار بالمرة { وَٱللَّهُ } الواحد الأحد الصمد { يَقْبِضُ } إلى ذاته ما ينشر { وَيَبْسُطُ } كم أظلال أسمائه وصفاته وآثار تجلياته الذاتية { وَإِلَيْهِ } لا إلى غيره { تُرْجَعُونَ } [البقرة: 245] أيها الأظلال والآثار طوعاً وكرهاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: القرض هو القطع، أطْلِقَ على السلف لأن المُقْرِضَ يقطع قطعة من ماله ويدفعها للمستلف، والمراد بها الصدقة لأن المتصدق يدفع الصدقة فيردها الحق تعالى له بضعف أمثالها فأشبهت القرض في مطلق الرد\n يقول الحقّ جلّ جلاله: مَنْ هذا الذي يعامل الله تعالى ويقرضه { قرضاً حسناً } بأن بتصدق على عباده صدقة حسنة بنية خالصة، فيُكثرها الله تعالى له { أضعافاً كثيرة } بسبعمائة إلى ما لا نهاية له، ولا يحمله خوف الفقر على ترك الصدقة فإن الله تعالى يقبض الرزق عمن يشاء ولو قل إعطاؤه، ويبسط الرزق على من يشاء ولو كثر إعطاؤه، بل يقبض على من قبض يده شحّاً وبخلاً، ويبسط على من بسط يده عطاءً وبذلاً، يقول:\n\n \" يا ابن آدم أَنْفِقْ أُنِفقْ عليك \" \n\n،\n\n \" أُنْفِقْ ولا تَخْش مِنْ ذِي العَرِشَ إِقلالاً \"\n \n\nونسبة القرض إليه تعالى ترغيب وتقريب للإفهام، كما قال في الحديث القدسي:\n\n \" يقول الله تعالى يوم القيامة: يَا ابْنَ آدَمَ، مَرِضْتُ فَلَمْ تَعُدْني، قَالَ: يَا رَبّ! كَيْفَ أَعُودُكَ وَأَنْتَ رَبُّ الْعَالِّمِين؟ قَالَ: أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلاَناً مَرِضَ فَلَمْ تَعُدْهُ\n أَمَا إِنَكَ لَوْ عُدْتَهُ لَوَجَدْتِني\n يَا ابْنَ آدَم اسْتَطْعَمتُكَ فَلَمْ تُطْعِمني\n قال: يَا رَبّ! كَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلاَنٌ فَلَمْ تُطْعمْه؟ أَمَأ عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَه لَوَجَدْتَ ذَلكَ عِنْدِي\n يَا ابْنَ آدَمَ اسْتَسْقَيتك فَلَمْ تَسْقِيني\n قَالَ: يَا رَبِّ كَيْفَ أَسْقِيك وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قال: اسْتَسْقَاكَ عَبْدِي فُلاَنٌ فَلَمْ تسْقِه\n أَمَا عَلِمْتَ أَنَّكَ لَوْ سَقَيْتَهُ لوَجَدْتَ ذَلِكَ عِنْدِي \"\n \n\nالإشارة: من هذا الذي يقطع قلبه عن حب الدارين، ويرفع همته عن الكونين، فإن الله { يضاعفه له أضعافاً كثيرة } بأن يُمَلِّكَهُ الوجودَ بما فيه، \" أنت مع الأكوان ما لم تشهد المكون، فإذا شهدت المكون كانت الأكوان معك \" ، { والله يقبض ويبسط } فيقبض الوجود تحت حكمك وهمتك، إن رفعت همتك عنه، ويبسط يدك بالتصرف فيه، إن علقت عمتك بخالقه\n أو يقبض القلوب بالفقد والوحشة، ويبسطها بالإيناس والبهجة\n أو يقبض الأرواح بالوفاة، ويبسطها بالحياة\n والقبض والبسط عند أهل التصوف: حالتان تتعاقبان على القلوب تعاقب الليل والنهار، فإذا غلب حال الخوف كان مقبوضاً، وإذاغلب حال الرجاء كان مبسوطاً، وهذا حال السائرين\n أما الواصلون فقد اعتدل خوفهم ورجاؤهم، فلا يؤثر فيهم قبض ولا بسط، لنهم مالكوا الأحوالَ\n قال القشيري: فإذا كاشف العبدَ بنعت جماله بسطَه، وإذا كاشفه بنعت جلاله قَبضه\n فالقبض يوجب إيحاشَه، والبسط يُوجب إيناسه، واعلم أنه يَرُدُّ العبد إلى حال بشريته، فيقبضه حتى لا يُطيق ذَرَّة، ويأخذه مَرَّة عن نعوته، فيجد لحمل ما يَرِدُ عليه قدرة وطاقة، قال الشَّبْلِي رضي الله عنه: من عَرَفَ الله حمَل السماوات والأرض على شعرة من جَفْن عينه، ومن لم يعرف الله - جلّ وعلا - لو تعلق به جَناح بعوضة لضجَّ\n\n\nوقال أهل المعرفة: [أذا قَبض قَبض حتى لا طاقة، وإذا بسط بسط حتى لا فاقة، والكل منه وإليه]\n ومن عرف أن الله هو القابض الباسط، لم يَعتِب أحداً من الخلق، ولا يسكن إليه في إقبال ولا إدبار، ولم ييأس منه في البلاء، ولا يسكُن إليه في عطاء، فلا يكون له تدبير أبداً\n هـ\n ولكلٍّ من القبض والبسط آداب، فآداب القبض: السكون تحت مجاري الأقدار، وانتظار الفرج من الكريم الغفار\n وآداب البسط: كف اللسان، وقبض العنان، والحياء من الكريم المنان\n والبسط مَزَلَّة أقدام الرجال\n قال بعضهم: فُتح عليَّ بابٌ من البسط فزللتُ زَلَّة، فحُجِبْتُ عن مقامي ثلاثين سنة\n ولذلك قيل: قف على البساط وإياك والانبساطَ\n واعلم أن القبض والبسط فوق الخوف والرجاء، وفوق القبض والبسط: الهيبة والأنس فالخوف والرجاء للمؤمنين، والقبض والبسط للسائرين، والهيبة والأنس للعارفين، ثم المحو في وجود العين للمتمكنين، فلا هيبة لهم، ولا أنس، ولا علم، ولا حس\n وأنشدوا:\n",
      "translations": []
    }
  ]
}