{
  "chapter": "البقرة",
  "text": "وقتلوا۟ فى سبيل الله واعلموا۟ ان الله سميع عليم",
  "translations": [
    {
      "translation": "Fight in the way of God, and remember that God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Muslims, fight in the way of Allah and know that Allah hears everything and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight for the cause of God and know that God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in Allah's cause and know well that Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah and know that Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah, and know that Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fight in God's way, and know that God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah, and know that Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight [in defence] in God's cause and remember that He is all hearing and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the way of Allah and know that verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah, and know that Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then fight in the cause of Allah, and know that Allah Heareth and knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the Way of Allah and know that Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the way of Allah. And know that Allah is the Hearer and the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fight in the cause of God, and know that God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fight in the cause of Allah and know that Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:244] So fight in God’s way, in order to elevate His religion, and know that God is Hearing, of your sayings, Knowing, of your affairs, and He will requite you accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then said to them after He brought them back to life: (And fight in the way of Allah) in obedience of Allah against your enemies, (and know that Allah is Hearer) of what you say, (Knower) of your intentions and the punishment that is going to visit you if you disobey what you have been commanded to do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن أردتم أيها المؤمنون أن تكونوا من الشاكرين لنعمه الفائزين بفضله وإحسانه { قَٰتِلُواْ } مع الكفرة التي هي القوى الحيوانية { فِي سَبِيلِ اللَّهِ } المفني للغير مطلقاً، واعلموا إن متم فإلى الله تحشرون، وإن عشتم فإلى الله تبعثون، وما لكم أيها المؤمنون ألاَّ تقاتلوا مع جنود الشياطين حتى تنجوا من مهلكة الإمكان، وتصلوا إلى فضاء الوجوب { وَٱعْلَمُوۤاْ أَنَّ ٱللَّهَ سَمِيعٌ } لأقوالكم المتعلقة بعدم الجهاد { عَلِيمٌ } [البقرة: 244] بنياتكم المترتبة على الحياة الطبيعية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وقاتلوا } الكفار { في سبيل الله } وإعلاء كلمة الله حتى يكون الدين كله لله، { واعلموا أن الله سميع } لأقوالكم ودعائكم { عليم } بنياتكم وإخلاصكم فيجازي المخلصين، ويحرم المخلطين\n الإشارة: وجاهدوا نفوسكم في طريق الوصول إلى الله، وأديموا السير إلى حضرة الله، فحضرة القدوس محرمة على أهل النفوس\n قال الششتري:\n",
      "translations": []
    }
  ]
}