{
  "chapter": "البقرة",
  "text": "الم تر الى الذين خرجوا۟ من ديرهم وهم الوف حذر الموت فقال لهم الله موتوا۟ ثم احيهم ان الله لذو فضل على الناس ولكن اكثر الناس لا يشكرون",
  "translations": [
    {
      "translation": "Have you never thought of men who went out of their homes as a measure of safety against death, and they were thousands, to whom God said: \"Die,\" then restored them to life? Indeed God bestows His blessings on men; only most men are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you ever reflected upon the case of those who fled their homes for fear of death, and they were thousands in number? So Allah said to them, \"Die\"; then He again gave them life. Indeed Allah is bountiful to mankind, but most of the people are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), consider the thousands who left their homes for fear of death, who were then caused by God to die and brought back to life. God is generous to men but most people are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you (O dear Prophet Mohammed – peace and blessings be upon him) not see those who left their homes, whereas they numbered in thousands, fearing death? So Allah said to them, “Die”; He then brought them back to life; indeed Allah is Most Munificent towards mankind, but most men are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you (O Muhammad) not think of those who went forth from their homes in the thousands, fearing death Allah said to them, \"Die\". And then He restored them to life. Truly, Allah is full of bounty to mankind, but most men thank not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who went forth from their homes, for fear of death, and they were thousands, then Allah said to them, Die; again He gave them life; most surely Allah is Gracious to people, but most people are not grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who went forth from their habitations in their thousands fearful of death? God said to them, 'Die!' Then He gave them life. Truly God is bounteous to the people, but most of the people are not thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink thee (O Muhammad) of those of old, who went forth from their habitations in their thousands, fearing death, and Allah said unto them: Die; and then He brought them back to life. Lo! Allah is a Lord of Kindness to mankind, but most of mankind give not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who fled their homes in their thousands for fear of death, whereupon God said to them, \"Die!\" and later brought them back to life? Surely God is bountiful to mankind, but most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethinkest thou not of those Who Went forth from their habitations, and they were in their thousands, to escape death Then Allah said unto them: die and thereafter quickened them. Verily Allah is Gracious unto men; albeit most men give not thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who left their homes in thousands, apprehensive of death, whereupon Allah said to them, ‘Die,’ then He revived them? Indeed Allah is gracious to mankind, but most people do not give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Didst thou not Turn by vision to those who abandoned their homes, though they were thousands (In number), for fear of death? Allah said to them: \"Die\": Then He restored them to life. For Allah is full of bounty to mankind, but Most of them are ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you (O Muhammad SAW) not think of those who went forth from their homes in thousands, fearing death? Allah said to them, \"Die\". And then He restored them to life. Truly, Allah is full of Bounty to mankind, but most men thank not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Haven't you seen those who went out from their homes in their thousands cautious of death? Allah said to them: 'Die' and then He revived them. Surely, Allah is Bountiful to the people, but most people do not thank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who fled their homes, by the thousands, fearful of death? God said to them, “Die.” Then He revived them. God is Gracious towards the people, but most people are not appreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who left their homes in many thousands, fearing death? Allah said to them, \"Die\"; then He restored them to life. And Allah is full of bounty to the people, but most of the people do not show gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:243] Have you not seen (an interrogative to provoke amazement and a longing to hear what will follow), that is, ‘Has your knowledge not attained’, those thousands, four, eight, ten, thirty, forty or seventy thousand, who went forth from their habitations fearful of death? (hadhara’l-mawt: an object denoting reason). These were a people from among the Children of Israel who fled their homeland after it was afflicted with plague. God said to them, ‘Die!’, and they did. Then He gave them life, after eight days or more, as a result of the supplication of their prophet Ezekiel (Hizqīl), and they lived on for a while with the effects of death still upon them, such that when they wore garments these turned into shrouds for the deceased; and this [phenomenon] remained with their descendants. Truly God is bounteous to people, such as when He gave life back to those just mentioned, but most people, that is, disbelievers, are not thankful. The purpose of   mentioning the story of these people is to encourage believers to fight [in the way of God], which is why the following [statement] is supplemented to it:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the story of the fighters among the Children of Israel, saying: (Bethink thee (0 42 Muhammad)) have you not been informed, Muhammad, (of those of old, who went forth from their habitations) to fight their enemies (in their thousands) eight thousand in total, but they proved too cowardly to fight, (fearing death) out of fear of being killed, (and Allah said unto them: Die) Allah killed them on the spot, (and then He brought them back to life) after eight days. (Lo! Allah is the Lord of Kindness to mankind) to these people for He brought them back to life, (but most of mankind give not thanks) for life.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي { إِلَى ٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِمْ } وهم أهل \" داود \" قرية قبل \" واسط \" وقع فيهم طاعون فخرجوا هاربين { وَهُمْ أُلُوفٌ } كثيير { حَذَرَ ٱلْمَوْتِ فَقَالَ لَهُمُ ٱللَّهُ } بعدما علم منهم الفرار عن قضائه: { مُوتُواْ } فماتوا بالمرة { ثُمَّ أَحْيَٰهُمْ } بدعاء حزقيل عليه السلام حين مر على تلك القرية، فأبصروا قد عريت عظامهم وتفرقت أجسامهم فتعجب من ذلك، فأوحى الله تعالى إليه، ناد فيهم: أن قوموا بأمر الله ومشيئته، فنادى فقاموا يقولون: سبحانك اللهم وبحمدك لا إله إلا أنت { إِنَّ ٱللَّهَ } المدبر لمصالح عباده { لَذُو فَضْلٍ } وإحسان { عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لاَ يَشْكُرُونَ } [البقرة: 243] فضله وإحسانه\n\n\n\n\nوبوجه آخر { أَلَمْ تَرَ } أيها المغتر الرائي { إِلَى ٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِمْ } المألوفة المأنوسة وهي بقعة الإمكان { وَ } الحال أنهم { هُمْ أُلُوفٌ } متألفون فيها مع بني نوعهم { حَذَرَ ٱلْمَوْتِ } الإرادي { فَقَالَ لَهُمُ ٱللَّهُ } الهادي إلى توحيد الذات بلسان مرشديهم: { مُوتُواْ } عن إنابتكم وهويتكم أيها المتوجهون إلى بحر الحقيقة، فماتوا عن مقتضيات القوى البشرية، ولوازم الحياة الطبيعية بالكلية { ثُمَّ أَحْيَٰهُمْ } الله بالحياة الحقيقية والعلم اللدني والوجود العيني الحقي، والبقاء الأزلي السرمدي { إِنَّ ٱللَّهَ } المتكفل لأمور عباده { لَذُو فَضْلٍ عَلَى ٱلنَّاسِ } الناسين منزلهم الأصلي ومقصدهم الحقيقي بإيصالهم إلى ما هم عليه قبل نزولهم إلى فضاء الإمكان { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لاَ يَشْكُرُونَ } [البقرة: 243] ولا يعقلون ولا يفهمون نعمة الوصول إلى الموطن الأصلي والمقام الحقيقي حتى يقوموا بشكره ويتواظبوا عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الاستفهام للتعجب والتشويق، والرؤية قلبية، والواو للحال، و { حَذَرَ } مفعول من أجله\n يقول الحقّ جلّ جلاله: ألم تنظر يا محمد، بعين الفكر والاعتبار، { إلى الذين خرجوا من ديارهم وهم ألوف } عشرة، أو ثلاثون، أو أربعون، أو سبعون، حذراً من { الموت } في زمن الطاعون\n وكانوا في قرية يقال لها: داوردان فلما وقع بها الطاعون، خرجت طائفة هاربين، وبقيت أخرى، فهلك أكثر من بقي، وسلم الخارجون، ثم رجعوا، فقال الباقون: لو صنعنا مثلهم لبقينا، لئن أصابنا الطاعون مرة ثانية لخرجنا، فأصابهم من قابل، فهربوا كلهم، ونزلوا وادياً أفيح، فناداهم ملك من أسفل الوادي، وآخر من أعلاه، أن: موتوا، فماتوا كلهم أجمعون، ومرت عليهم مدة ثمانية أيام أو أكثر حتى انتفخوا، وقيل: صاروا عظاماً، فمرَّ عليهم نبيّ الله حزقيل، فدعا الله تعالى، واستشفع فيهم، فأحياهم الله، وعاشوا دهراً، عليهم سيما الموت لا يلبسون ثوباً إلا عاد كالكفن، واستمر في أسباطهم\n هـ\n قال الأصمعي: لما وقع الطاعون بالبصرة، خرج رجل منها على حمار معه أهله، وله عبد يسوق حماره، فأنشأ العبد يقول:\n\nفرجع الرجل بعياله\n والآية تدل على أن الفرار من الطاعون حرام في تلك الشريعة، كما حرم في شرعنا، وروى عبد الرحمن بن عوف أن النبيّ صلى الله عليه وسلم قال:\n\n \" إِذَا سَمِعْتُمْ هذا الوباء بِبلد فَلاَ تَقْدُمُوا عَلَيْهِ، وإذَا وَقَعَ بِبلد وَأَنْتُمْ فيه فَلاَ تَخْرُجُوا مِنْهُ \"\n \n\nقلت: وقد اختلف الأئمة في حكم الفرار والقدوم: فمنهم من شهر المنع فيهما تمسكاً بظاهر الحديث، ومنهم من شهر الكراهة، والمختار في الفرار: التحريم، وفي القدوم: التفصيل، فمن قوي يقينه، وصفا توحيده، حَلَّ له القدوم، ومن ضعف يقينه، بحيث إذا أصابه شيء نسب التأثير لغير الله حرم عليه القدوم\n وفي حديث عائشة - رضي الله عنها - قلت: يا رسول الله، ما الطاعون؟ قال:\n\n \" غدة كغدة البعير، المقيم فيه كالشهيد، والفارُّ منه كالفار من الزحْف \" \n\nقال ابن حجر: كون المقيم فيه له أجر شهيد إنما بشرط أن يعلم أنه لا يصيبه إلا ما كتب الله له، وأن يسلم إليه أمره ويرضى بقضائه، وأن يبقى في مكانه ولا يخرج منه بقصد الفرار، فإذا اتصف الجالس بهذه القيود حصل له أجر الشهادة، ودخل تحته ثلاث صور، الأولى: من اتصف بذلك فوقع له الطاعون ومات فهو شهيد\n والثانية: من وقع به ولم يمت به فهو شهيد وإن مات بعد ذلك\n والثالثة: من لم يقع به أصلاً ومات بغيره عاجلاً أو آجلاً فهو شهيد، إذا حصلت فيه القيود الثلاثة، ومن لم يتصف بالقيود الثلاثة فليس بشهيد، ولو مات بالطاعون، والله أعلم\n\n\nهـ\n وأما القدوم من بلد الطاعون إلى البلد السالمة منه فجائز\n ولا يُمنع من الدخول، قاله الباجي وابن حجر والحطاب وغيرهم لقوله - عليه الصلاة والسلام -:\n\n \" لاَ عَدْوَى وَلاَ طِيَرَةَ \" \n\nوأما قوله عليه الصلاة والسلام:\n\n \" فِرَّ مِنَ المَجْذُومِ فِرَارَكَ مِنَ الأَسَدِ \" \n\nوقوله:\n\n \" لاَ يُرد مُمْرِضٌ عَلَى مُصِحٍّ \" \n\nفهو محمول على حسم المادة، وسد الذريعة لئلا يحدث للمخالط شيء من ذلك، فيظنه بسبب المخالطة، فيثبت العدوى التي نفاها الشارع، هذا المختار في الجمع بين الحديثين\n والله تعالى أعلم\n وإنما أطلت في المسألة لِمَسْ الحاجة لأن التأليف وقع في زمن الوباء، حفظنا الله من وبالها\n وقيل: إن الذين خرجوا من ديارهم قوم من بني إسرائيل، أُمروا بالجهاد، فخافوا الموت بالقتل في الجهاد، فخرجوا من ديارهم فراراً من ذلك، فأماتهم الله ليعرفهم أنهم لا ينجيهم من الموت شيء، ثم أحياهم وأمرهم بالجهاد، بقوله: { وقاتلوا في سبيل الله } الآية\n وقوله تعالى: { إن الله لذو فضل على الناس } حيث أنزل بهم رحمته، ففروا منها، ولم يعاقبهم، حيث أحياهم بعد موتهم، { ولكن أكثر الناس لا يشكرون } إذ لا يفهم النعم في طي النقم إلا القليل، فيشكروا الله في السراء والضراء\n الإشارة: ألم تر أيها السامع إلى الذين خرجوا من ديار عوائدهم وأوطان شهواتهم، وهم جماعة أهل التجريد، القاصدين إلى صفاء التوحيد، الغرق في بحر التفريد، حذراً من موت أرواحهم بالجهل والفَرْقِ، فاصطفاهم الله لحضرته، وجذبهم إلى مشاهدة ذاته، فقال لهم الله: موتوا عن حظوظكم، وغيبوا عن وجودكم، فلما ماتوا عن حظوظهم، وغابوا عن وجودهم، أحياهم الله بالعلم والمعرفة، { إن الله لذو فضل على الناس } حيث فتح لهم باب السلوك، وهيأهم لمعرفة ملك الملوك، { ولكن أكثر الناس لا يشكرون } حيث تجلّى لهم، وعرَّفهم به، وهم لا يشعرون، إلا من فتح الله بصيرتهم، وقليل ما هم\n\n",
      "translations": []
    }
  ]
}