{
  "chapter": "البقرة",
  "text": "وللمطلقت متعۢ بالمعروف حقا على المتقين",
  "translations": [
    {
      "translation": "Making a fair provision for women who are divorced is the duty of those who are God-fearing and pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, the divorced women should also be given something in accordance with the known fair standard. This is an obligation upon the God-fearing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The divorced women have the right to receive reasonable provisions. It is an obligation for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for divorced women also, is a complete provision in reasonable manner; this is a duty upon the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for divorced women, maintenance (should be provided) on reasonable (scale). This is a duty on Al-Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the divorced women (too) provision (must be made) according to usage; (this is) a duty on those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be for divorced women provision honourable -- an obligation on the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For divorced women a provision in kindness: a duty for those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For divorced women a provision according to what is fair shall also be made. This is an obligation binding on the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the divorced women shall be a reputable present: and duty on the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the divorced women there shall be a provision, in accordance with honourable norms—an obligation on the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For divorced women Maintenance (should be provided) on a reasonable (scale). This is a duty on the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for divorced women, maintenance (should be provided) on reasonable (scale). This is a duty on Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Provision should be made for divorced women with kindness. That is a right on the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And divorced women shall be provided for, equitably—a duty upon the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for divorced women is a provision according to what is acceptable - a duty upon the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:241] There shall be provision for divorced women, which they are given, honourably, as is feasible — an obligation (haqqan, ‘obligation’, is in the accusative because it is governed by an implied verb) on those who fear God, may He be exalted. He has repeated the phrase in order to include the woman that has been touched [sexually], since the previous verse addresses a different issue.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For divorced women a provision in kindness) with generosity and kindness: (a duty for those who ward off (evil)). It is an obligation because it is in surplus to the dowry, and it is done out of generosity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } واعلموا أيها المؤمنون أن { لِلْمُطَلَّقَاتِ } مطلقاً { مَتَاعٌ بِٱلْمَعْرُوفِ } المشروع المستحسن لازم { حَقّاً } ثابتاً { عَلَى } ذمة { ٱلْمُتَّقِينَ } [البقرة: 241] المطلقين لهن منا دمن في العدة؛ أي: جميع مؤنتهن عليهم فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}