{
  "chapter": "البقرة",
  "text": "وقال لهم نبيهم ان ءاية ملكه ان ياتيكم التابوت فيه سكينة من ربكم وبقية مما ترك ءال موسى وءال هرون تحمله الملئكة ان فى ذلك لءاية لكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Their prophet said to them: \"The sign of his kingship will be that you will come to have a heart full of peace and tranquility from your Lord and the legacy left by Moses' and Aaron's family supported by angels. This shall be a token for you if you really believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet further informed them, \"The sign of his appointment as king from Allah is that during his reign you will get back the Ark, wherein are the means of your peace of mind from your Lord, and which contains the sacred relics of the family of Moses and Aaron, and which is being borne at this time by the angels. Herein is a great Sign for you, if you are true believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet further told them, \"As the evidence of his authority, he will bring to you the Ark which will be a comfort to you from your Lord and a legacy of the household of Moses and Aaron. It will be carried by the angels. This is the evidence for you if you have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said to them, “Indeed the sign of his kingdom will be the coming of a (wooden) box to you, in which from your Lord is the contentment of hearts and containing some souvenirs (remnants) left behind by the honourable Moosa and the honourable Haroon (Aaron), borne by the angels; indeed in it is a great sign* for you if you are believers.” (The remnants of pious persons are blessed by Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said to them: \"Verily! The sign of His kingdom is that there shall come to you At-Tabut, wherein is Sakinah (peace and reassurance) from your Lord and a remnant of that which Musa (Moses) and Harun (Aaron) left behind, carried by the angels. Verily, in this is a sign for you if you are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the prophet said to them: Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it; most surely there is a sign in this for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said to them, 'The sign of his kingship is that the Ark will come to you, in it a Shechina from your Lord, and a remnant of what the folk of Moses and Aaron's folk left behind, the angels bearing it. Surely in that shall be a sign for you, if you are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet said unto them: Lo! the token of his kingdom is that there shall come unto you the ark wherein is peace of reassurance from your Lord, and a remnant of that which the house of Moses and the house of Aaron left behind, the angels bearing it. Lo! herein shall be a token for you if (in truth) ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prophet also said to them, \"The sign of his kingship is that the Ark [of the Covenant] shall come to you. Therein shall be tranquillity from your Lord, and the relics which the House of Moses and the House of Aaron left behind. It will be borne by the angels. There is a sign in this for you, if you believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said unto them: verily the sign of his dominion is that there shall come unto you the ark wherein is tranquillity from your Lord and the relic of that which the household of Musa and the household of Harun had left, the angels bearing it; verily, herein is a sign for you if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their prophet said to them, ‘Indeed the sign of his kingship shall be that the Ark will come to you, bearing tranquillity from your Lord and the relics left behind by the House of Moses and the House of Aaron, borne by the angels. There is indeed a sign in that for you, should you be faithful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (further) their Prophet said to them: \"A Sign of his authority is that there shall come to you the Ark of the covenant, with (an assurance) therein of security from your Lord, and the relics left by the family of Moses and the family of Aaron, carried by angels. In this is a symbol for you if ye indeed have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their Prophet (Samuel) said to them: Verily! The sign of His Kingdom is that there shall come to you At-Tabut (a wooden box), wherein is Sakinah (peace and reassurance) from your Lord and a remnant of that which Musa (Moses) and Harun (Aaron) left behind, carried by the angels. Verily, in this is a sign for you if you are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their Prophet said to them: 'The sign of his kingship is the coming of the Ark to you, therein shall be tranquility from your Lord, and a remnant which the House of Moses and the House of Aaron left behind. It will be borne by the angels. That will be a sign for you if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said to them, “The proof of his kingship is that the Ark will be restored to you, bringing tranquility from your Lord, and relics left by the family of Moses and the family of Aaron. It will be carried by the angels. In that is a sign for you, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their prophet said to them, \"Indeed, a sign of his kingship is that the chest will come to you in which is assurance from your Lord and a remnant of what the family of Moses and the family of Aaron had left, carried by the angels. Indeed in that is a sign for you, if you are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:248] And their prophet said to them, after they had demanded a sign of his kingship: ‘The sign of his kingship is that there will come to you the Ark, a chest containing the images of the prophets, which God sent down to Adam, and which was handed down to them [sc. the Israelites], until the Amalekites seized it from them in battle. They used to commence fighting invoking it before their enemy and marching behind it, as well as experience peacefulness in its presence, as God says: therein is a Spirit of Peace, reassurance for your hearts, from your Lord, and a remnant of what the folk of Moses and the folk of Aaron left behind, which were Moses’s pair of sandals and his staff, Aaron’s turban, a measure (qafīz) of the manna that used to come down on them, and the pieces of the broken tablets, the angels bearing it (tahmiluhu l-malā’ikatu, the circumstantial qualifier referring to the subject of the verb ya’tiyakum, ‘there will come to’). Surely in that shall be a sign for you, of his kingship, if you are believers’. The angels bore it between the earth and the   sky while they gazed at it, until finally they placed it before Saul. They then acknowledged his kingship and hastened to enlist in the [holy] struggle, and he chose seventy thousand of their young men.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And their Prophet) Samuel (said unto them: Lo! The token) the sign (of his kingdom) that it is from Allah (is that there shall come unto you the Ark) that was taken from you (wherein is peace of reassurance) mercy and tranquillity; it is also said that this means: it includes the wind (the triumph) of his victory, of golden colour in the form of a human face (from your Lord, and a remnant of that which the house of Moses) a remnant of Moses, i.e. his Scripture; as it is said: his tablets and staff (and the house of Aaron left behind) what Aaron had left behind, namely his cloak and turban, (the angels bearing it) the angels leading it. (Lo! Herein) in giving you back the Ark (shall be a token) a sign (for you) that he has been made king by Allah (if (in truth) ye are believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ آيَةَ مُلْكِهِ أَن يَأْتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٌ مِّن رَّبِّكُمْ } قالَ زيدُ بن علي عليهما السلامُ: الآيةُ: هي علامةٌ، وحجةٌ\n والسَّكِينةُ: هي ريحٌ هَفْهَافَةٌ\n وقَدْ قِيلَ إِنَّ السَّكِينَةَ: هي طَشْتٌ من ذَهبٍ تُغْسَّلُ فِيهِ قُلوبُ الأَنبِياءِ\n والسَّكينةُ في الآيةِ الأُخرى:\n\n[التوبة: 40] [الفتح: 26] أَرادَ بِهَا الوَقارَ\n\n\n\n\nوقولهُ تعالى: { تَحْمِلُهُ ٱلْمَلاۤئِكَةُ } معْناهُ تَسوقُهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آيسوا من تغيير قضاء الله وتبديل رضاه، أتوا يطلبون الدليل والعلامات على ملكه { قَالَ لَهُمْ نِبِيُّهُمْ } بوحي الله وإلهامه أياه: { إِنَّ آيَةَ مُلْكِهِ أَن يَأْتِيَكُمُ ٱلتَّابُوتُ } الذي { فِيهِ سَكِينَةٌ } أي: فيه ما يوجب سكينتكم وطمأنينتكم وقراركم على الحرب؛ إذ هو صندوق التوراة المنزل { مِّن رَّبِّكُمْ } لإصلاح أموركم { وَ } أيضاً من آية ملكه أن يأتيكم { بَقِيَّةٌ مِّمَّا تَرَكَ آلُ مُوسَىٰ وَآلُ هَارُونَ } قيل: هي رخامة الألواح وعصا موسى وعمامة هارون، وكان أنبياء بني إسرائيل يتوارثون إلى أن { تَحْمِلُهُ ٱلْمَلاۤئِكَةُ } بأمر الله وتوصله إلى طالوت { إِنَّ فِي ذَلِكَ } المذكور { لآيَةً لَّكُمْ } على ملكية طالوت { إِن كُنْتُم مُّؤْمِنِينَ } [البقرة: 248] بالله وبما جاء من عنده على أنبيائه، وبعدما آتاه الله الملك والعلامات الدالة عليه تجهز بتوفيق الله، وخرج نحو العدو\n\n\n\n\nروي أنه قال وقت خروجه: لا يخرج معي إلا الشباب الخالي عن الحيل، الفارغ عن الأمل، النشيط للأجل، الفرحان للمقاتلة والشهادة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قال الجوهري: أصل التابوت: تأبُوة، مثل تَرْقُوة وهي فَعْلُوةٌ، فلما سُكِّنتْ الواو، انقلبت هاء التأنيث تاءٌ، فلغة قريش بالتاء، ولغة الأنصار بالهاء\n يقول الحقّ جلّ جلاله: { وقال لهم نبيهم } لَمَّا طلبوا منه الحجة على اصطفاه طالوت للملك: { إن آية ملكه أن يأتيكم التابوت } وهو صندوق من خشب الشمشار مُمَوَّه بالذهب، طوله ثلاثة أذرع في سعة ذراعين { فيه سكينة من ربكم } أي: فيه ما تسكن إليه قلوبكم وتثبت عند الحرب\n وكانوا يُقدمونه أمامهم في الحروب فلا يفرون، ويُنصرون على عدوهم، وقيل: كان فيه صور الأنبياء من آدم السلام إلى محمد صلى الله عليه وسلم\n وقيل: كان فيه طَسْت من ذهب غُسلت به قلوب الأنبياء - عليهم السلام - وهي السكينة - وفي { بقيمة مما ترك آل موسى } وهي رُضاض الألواح، وعصا موسى، وثيابه، وعمامة هارون والآل: مقحم فيهما\n { تحمله الملائكة } قال وهب: لما صار التابوت عند القوم الذين غلبوا بني إسرائيل - فوضعوه في كنيسة لهم فيها أصنام، فكانت الأصنام تُصبح مُنكسرة، فحملوه إلى قرية قوم، فأصاب أولئك القومَ أوجاعٌ، فقالوا: ما هذا إلا لهذا التابوت، فلنتركه إلى بني إسرائيل، فأخذوا عَجَلَةً فجعلوا التابوت عليها وربطوها ببقرتين، وأرسلوهما نحو بلاد بني إسرائيل، فبعث الله ملائكة تسوق البقرتين حتى دخلتا على بني إسرائيل، وهم في أمر طالوت فأيقنوا بالنصر، وقيل غيرُ ذلك\n وقوله تعالى: { إن في ذلك لآية لكم إن كنتم مؤمنين } يحتمل أن يكون من كلام نبيهم، أو من كلام الحق تعالى لنبينا - عليه الصلاة والسلام -\n الإشارة: من شأن غالب النفوس ألا تقبل الخصوصية عند أحد حتى تظهر علامتُها، ولذلك طالب الكفارُ الرسلَ بالمعجزات، وطالب العوامُ الأولياءَ بالكرامات، ويكفي في الولي استقامة ظاهره، وتحقيق اليقين في باطنه\n قال الشيخ أبو الحسن رضي الله عنه: \" إنما هما كرامتان جامعتان محيطتان: كرامة الإيمان بمزيد الإيقان ونعت العيان، وكرامة العمل على السنة والمتابعة، وترك الدعاوى والمخادعة، فَمنْ أُعطيهما ثم جعل يشتاق إلى غيرهما فهو مفترٍ كذاب، أو ذو خطأ في العلم والعمل\n\n\n \" الخ كلامه رضي الله عنه\n وقال في العوارف: وقد يكون مَنْ لا يُكَاشَفُ بشيء من معاني القَدَر أفضل ممن يكاشف بها، إذا كاشفه الله تعالى بصرف المعرفة، فالقدرة أثر من القادر، ومن أُهِّل لقرب القادر لا يستغرب ولا يستكثر شيئاً من القدرة، ويرى القدرة تتجلّى من سُحُب أجزاء عالم الحكمة\n فالكرامة إنما تظهر للقلوب المضطربة والنفوس والمتزلزلة، وأما من سكن قلبه باليقين واطمأنت نفسه بالعيان لم يحتج إلى دليل برهان إذ الجبال الراسية لا تحتاج إلى دُعامة، والله تعالى أعلم\n وكل من طالب أهلَ الخصوصية بالكرامة الحسية ففيه نزعة إسرائيلية، حيث قالوا لنبيهم بعد أن عيَّن لهم مَنْ أكرمه الله بخصوصية الملك:\n",
      "translations": []
    }
  ]
}