{
  "chapter": "البقرة",
  "text": "تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ورفع بعضهم درجت وءاتينا عيسى ابن مريم البينت وايدنه بروح القدس ولو شاء الله ما اقتتل الذين منۢ بعدهم منۢ بعد ما جاءتهم البينت ولكن اختلفوا۟ فمنهم من ءامن ومنهم من كفر ولو شاء الله ما اقتتلوا۟ ولكن الله يفعل ما يريد",
  "translations": [
    {
      "translation": "Of all these apostles We have favoured some over the others. God has addressed some of them, and the stations of some have been exalted over the others. And to Jesus, son of Mary, We gave tokens, and reinforced him with divine grace. If God had so willed those who came after them would never have contended when clear signs had come to them. But dissensions arose, some believed, some denied. And if God had willed they would never have fought among themselves. But God does whatsoever He please.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of these Messengers (whom We sent for the guidance of mankind), We raised some above the others in rank. Among them was one with whom Allah Himself had direct talks. There were others whom He raised high in rank in other ways. Likewise We gave clear signs to Jesus, son of Mary, and supported him with the Holy Spirit. Had Allah so willed the people who had seen clear signs would not have fought against one another after the Prophets. But (it was not Allah's will to prevent people forcibly from differences: so) they disagreed; then some of them accepted the Truth and others rejected it. If Allah had so willed they would have never fought against one another, but Allah does whatever He pleases (to fulfil His designs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave some of Our Messengers preference over others. To some of them God spoke and He raised the rank of some others. We gave authoritative proofs to Jesus, son of Mary, and supported him by the Holy Spirit. Had God wanted, the generations who lived after those Messengers would not have fought each other after the authority had come to them. But they differed among themselves, some of them believed in the authority and others denied it. They would not have fought each other had God wanted, but God does as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the Noble Messengers, to whom We gave excellence over each other; of them are some with whom Allah spoke, and some whom He exalted high above all others; and We gave Eisa (Jesus), the son of Maryam, clear signs and We aided him with the Holy Spirit; and if Allah willed, those after them would not have fought each other after the clear evidences had come to them, but they differed – some remained on faith and some turned disbelievers; and had Allah willed, they would not have fought each other; but Allah may do as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those Messengers! We preferred some of them to others; to some of them Allah spoke (directly); others He raised to degrees (of honor); and to `Isa, the son of Maryam, We gave clear proofs and evidences, and supported him with Ruh-il-Qudus [Jibril]. If Allah had willed, succeeding generations would not have fought against each other, after clear Verses of Allah had come to them, but they differed ـ some of them believed and others disbelieved. If Allah had willed, they would not have fought against one another, but Allah does what He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made some of these apostles to excel the others among them are they to whom Allah spoke, and some of them He exalted by (many degrees of) rank; and We gave clear miracles to Isa son of Marium, and strengthened him with the holy spirit. And if Allah had pleased, those after them would not have fought one with another after clear arguments had come to them, but they disagreed; so there were some of them who believed and others who denied; and if Allah had pleased they would not have fought one with another, but Allah brings about what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those Messengers, some We have preferred above others; some there are to whom God spoke, and some He raised in rank. And We gave Jesus son of Mary the clear signs, and confirmed him with the Holy Spirit. And had God willed, those who came after him would not have fought one against the other after the clear signs had come to them; but they fell into variance, and some of them believed, and some disbelieved; and had God willed they would not have fought one against the other; but God does whatsoever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those messengers, some of whom We have caused to excel others, and of whom there are some unto whom Allah spake, while some of them He exalted (above others) in degree; and We gave Jesus, son of Mary, clear proofs (of Allah's Sovereignty) and We supported him with the holy Spirit. And if Allah had so wiled it, those who followed after them would not have fought one with another after the clear proofs had come unto them. But they differed, some of them believing and some disbelieving. And if Allah had so willed it, they would not have fought one with another; but Allah doeth what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of these messengers, We have given something additional among them. There are some to whom God spoke directly and others He exalted in rank. We gave Jesus, son of Mary clear signs, and strengthened him with the holy spirit. Had God pleased, those who succeeded them would not have fought against one another after the clear signs had come to them. But they disagreed among themselves; some believed, while others did not. Yet had God willed, they would not have fought against one another; but God does whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These apostles: We have preferred some of them above some others: of them are some unto whom Allah spake, and some He raised many degrees. And We vouchsafed unto Isa, son of Maryam, the evidences, and We aided him with the holy spirit; and had Allah so willed those who came after them had not fought among themselves after the evidences had come unto them but they differed; then of them some believed and of them some disbelieved. And had Allah so willed, they had not fought among themselves, but Allah doth whatsoever He intendeth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the apostles, some of whom We gave an advantage over others: of them are those to whom Allah spoke and some of them He raised in rank, and We gave Jesus, son of Mary, manifest proofs and strengthened him with the Holy Spirit. Had Allah wished, those who succeeded them would not have fought one another after the manifest proofs had come to them. But they differed. So there were among them those who had faith and there were among them those who were faithless, and had Allah wished, they would not have fought one another; but Allah does whatever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those messengers We endowed with gifts, some above others: To one of them Allah spoke; others He raised to degrees (of honour); to Jesus the son of Mary We gave clear (Signs), and strengthened him with the holy spirit. If Allah had so willed, succeeding generations would not have fought among each other, after clear (Signs) had come to them, but they (chose) to wrangle, some believing and others rejecting. If Allah had so willed, they would not have fought each other; but Allah Fulfilleth His plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those Messengers! We preferred some to others; to some of them Allah spoke (directly); others He raised to degrees (of honour); and to 'Iesa (Jesus), the son of Maryam (Mary), We gave clear proofs and evidences, and supported him with Ruh-ul-Qudus [Jibrael (Gabriel)]. If Allah had willed, succeeding generations would not have fought against each other, after clear Verses of Allah had come to them, but they differed - some of them believed and others disbelieved. If Allah had willed, they would not have fought against one another, but Allah does what He likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of these Messengers, We have preferred some above others. To some Allah spoke; and some He raised in rank. We gave (Prophet) Jesus, the son of Mary, clear signs and strengthened him with the Spirit of Purity (Gabriel). Had Allah willed, those who succeeded them would not have fought against one another after the clear verses came to them. But they differed among themselves; some believed, and others disbelieved. Yet had Allah willed, they would not have fought against one another. Allah does whatever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These messengers: We gave some advantage over others. To some of them God spoke directly, and some He raised in rank. We gave Jesus son of Mary the clear miracles, and We strengthened him with the Holy Spirit. Had God willed, those who succeeded them would not have fought one another, after the clear signs had come to them; but they disputed; some of them believed, and some of them disbelieved. Had God willed, they would not have fought one another; but God does whatever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those messengers - some of them We caused to exceed others. Among them were those to whom Allah spoke, and He raised some of them in degree. And We gave Jesus, the Son of Mary, clear proofs, and We supported him with the Pure Spirit. If Allah had willed, those [generations] succeeding them would not have fought each other after the clear proofs had come to them. But they differed, and some of them believed and some of them disbelieved. And if Allah had willed, they would not have fought each other, but Allah does what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:253] Those (tilka is the subject) messengers (al-rusul is either an adjective or the predicate) some We have preferred above others, by assigning a particular trait to one not found in the other; some there are to whom God spoke, such as Moses, and some He raised in rank, namely, Muhammad (s), on account of his call being to all peoples, his being the Seal of the Prophets, on account of the superiority of his community to all others, the sundry miracles and the many special qualities. And We gave Jesus son of Mary the clear proofs, and confirmed him, strengthened him, with the Holy Spirit, namely, Gabriel who would accompany him wherever he went. And had God willed, that all people be guided, those who came after them, after the messengers, that is, their communities, would not have fought against one another after the clear proofs had come to them, because of their disagreement and their leading one another astray; but they fell into variance, as He willed, and some of them believed, and adhered firmly to his faith, and some disbelieved, as   the Christians did after Jesus (al-Masīh), and had God willed they would not have fought against one another (repeated here for emphasis), but God does whatever He desires, giving success to whomever He will and disappointment to whomever He will.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Of those messengers) whom We have named for you, (some of whom We have caused to excel others) by bestowing honour upon them, (and of whom there are some unto whom Allah spake) this is Moses, (while some of them He exalted (above others) in degrees) this is Abraham whom Allah took as a friend, and Enoch whom Allah raised to an elevated place; (and We gave Jesus son of Mary clear proofs) commands, prohibitions and the working of marvels (and We supported him) strengthened and assisted him (with the holy Spirit) with Gabriel, the pure. (And if Allah had so willed it, those who followed after them) after Moses and Jesus (would not have fought one with another) differed with one another (after clear proofs had come unto them) the exposition in their Scriptures of the description and traits of Muhammad. (But they differed) in the matter of Religion, (some of them believing) in every Scripture and Messenger (and some disbelieving) in the Scriptures and messengers. (And if Allah had so willed it, they would not have fought one with another) they would not have differed with one another in the matter of the religion; (but Allah doeth what He will) with His servants.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ ٱلرُّسُلُ } المخصوص بالوحي والإلهمام والإنزال { فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ } بأنواع الفضائل والكمالات { مِّنْهُمْ مَّن كَلَّمَ ٱللَّهُ } معه، وهو موسى صلوات الله عليه { وَ } منهم من { رَفَعَ بَعْضَهُمْ دَرَجَاتٍ } وهم ما ذكرهم الله سبحانه في كتابه بقوله في مواضع:\n\n[مريم: 57] ورفعناه كذا في وصف أنبيائه فعليك استقصاؤها، { وَآتَيْنَا } من نبيهم { عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَاتِ } الواضحة الدالة على نبوته { وَ } مع ذلك { أَيَّدْنَاهُ بِرُوحِ ٱلْقُدُسِ } المنزه عن رذائل الأغيار مطلقاً، وهو الذات البحث الخالص عن جميع الاعتبارات\n\n\n\n\nوكم بيَّن فضيلة عيسى عليه السلام، وفضل نبينا صلى الله عليه وسلم، إذ قال سبحانه في حقه:\n\n[البقرة: 87] وفي شأنه صلى الله عليه وسلم في مقام الامتنان له:\n\n[الشرح: 1] أيها المظهر الكامل بذاتها، المقدس عن السوى مطلقاً:\n\n[الشرح: 2] أي: هويتك التي بها انفصالك عنا\n\n[الشرح: 3] قبل انكشافك بذاتنا، كما أنقض ظهور جميع المخلوقات الباقية وراء الحجاب وبعد ذلك\n\n[الشرح: 4] أي: إن وصلت إليها ورفعت الاثنينية بنا لذلك قلت:\n\n \" من أطاعني فقد أطاع الله \" \n\n، وقلت أيضاً:\n\n \" من رآني فقد رأى الحق \" \n\nوقلنا لك:\n\n[الفتح: 10] وغير ذلك من الرموز والإشارات الواردة في القرآن والحديث\n\n\n\n\nولم يقدر أحد من الأنبياء أن يتفوه عن الرؤية سوى نبينا صلى الله عليه وسلم، فإنه يقول:\n\n \" رأيت ربي في ليلة المعراج \" \n\n، لذلك نزل في شأنه:\n\n[المائدة: 3] وقوله عليه السلام:\n\n \" بعثت لأتمم مكارم الأخلاق \" \n\n، وغير ذلك من الآيات والأحاديث المشعرة للتوحيد الذاتي، المسقط للإضافات والاعتبارات مطلقاً\n\n\n\n\n{ وَلَوْ شَآءَ ٱللَّهُ } الهادي للكل هداية جميع الناس { مَا ٱقْتَتَلَ ٱلَّذِينَ } آمنوا لهم { مِن بَعْدِهِم } خصوصاً { مِّن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَاتُ } الموضحة لهم طريق الرشاد والمستخلفة فهم بين أممهم لإرشادهم، ولكن جرت عادة الله وسنته أن يختلفوا ويقتتلوا بحسب اقتضاء أوصافه المتقابلة لذلك { وَلَـٰكِنِ ٱخْتَلَفُواْ فَمِنْهُمْ مَّنْ آمَنَ } بنبي بُعث إليهم { وَمِنْهُمْ مَّن كَفَرَ وَلَوْ شَآءَ ٱللَّهُ } هدايتهم { مَا ٱقْتَتَلُواْ وَلَـٰكِنَّ ٱللَّهَ } الفاعل المختار { يَفْعَلُ مَا يُرِيدُ } [البقرة: 253] لا يُسأل عن فعله، إنه حكيم حميد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ مِّنْهُمْ مَّن كَلَّمَ ٱللَّهُ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍ وَآتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ ٱلْقُدُسِ\n\n\n }  { قلت }: { تلك }: مبتدأ، و { الرسل }: نعت، أو بدل منه، أو بيان، و { فضلنا }: خبر، أو { الرسل } خبر، و { فضلنا }: خبر ثان، والإشارة إلى الجماعة المذكور قَصَصُها في السورة\n يقول الحقّ جلّ جلاله: { تلك الرسل } الذين قصصناهم عليك، وذكرتُ لك أنك منهم، { فضلنا بعضهم على بعض } بخصائص ومناقب لم توجد في غيره\n لكن هذا التفضيل إنما يكون في الجملة من غير تعيين المفضول، لأنه تنقيص في حقه وهو ممنوع\n ولذلك قال عليه الصلاة والسلام:\n\n \" لا تُخَيِّرُوا بَيْنَ الأَنبِيَاءَ \" \n\n \" ولا تفضلوني على يونس بن متى \" \n\nفإن معناه النهي عن تعيين المفضول، لأنه غيبة وتنقيص، وقد صرّح صلى الله عليه وسلم بفضله على جميع الأنياء بقوله:\n\n \" أنَا سَيِّدُ وَلَدِ آدَمَ ولا فَخْرَ \" \n\nولكن لا يُعَيِّن أحداً من الأنبياء بالمفضولية لئلا يؤدي إلى نقصه، فلا تعارُضَ ين الحديثين\n { منهم مَن كلّم الله } وهو موسى عليه السلام في جبل الطور، وسيّدنا محمد صلى الله عليه وسلم حين كان قاب قوسين أو أدنى، { ورفع بعضهم درجات } وهو نبيّنا محمد صلى الله عليه وسلم فإنه خُصَّ بالدعوة العامة، والحُجَج المتكاثرة، والمعجزات المستمرة، والآيات المتعاقبة بتعاقب الدهر، والفضائل العلمية والعملية الفائتة للحصر\n والإبهام لتفخيم شأنه، كأنه العلم المشهور المتعين لهذا الوصف المستغني عن التعيين\n وقيل: إبراهيم، خصه بالخلة التي هي أعلى المراتب\n قلت: بل المحبة أعلى منها، وقيل: إدريس لقوله:\n\n[مريَم: 57]، وقيل: أولو العزم من الرسل، قاله البيضاوي\n { وآتينا عيسى ابن مريم البينات } أي: الآيات الواضحات، كإحياء الموتى، وإبراء الأكمه والأبرص، { وأيدناه بروح القدس } ، أي: جبريل عليه السلام كان معه أينما سار، وخصَّه بالتعيين فإفراط اليهود والنصارى في تحقيره وتعظيمه، فردَّهم إلى الصواب باعتقاده نبوته دون ربوبيته\n الإشارة: كما فضَّل الله الرسل بعضهم على بعض، كذلك فضل الأولياء بعضهم على بعض، وإنما يقع التفضيل بكمال اليقين، والتغلغل في علم التوحيد الخاص، ذوقاً وكشفاً، والترقي في المعارف والأسرار، وذلك بخدمة الرجال وصحبة أهل الكمال، والتفرغ التام، والزهد الكامل في النفس والفَلْس والجنْس، فمنهم من تحصل له المشاهدة وتصحبها المكالمة، ومنهم من تحصل له المشاهدة دون المكالمة، ومنهم من تحصل له الكرامات الواضحة، ومنهم من لا يرى شيئاً من ذلك استغناءً عنها بكرامة المعرفة\n وما قيل في الرسل من عدم تعيين المفضول، مثله يقال في حق الأولياء، وإلا وقع في الغيبة الشنيعة فإن لحوم الأولياء سموم، فليعتقد الكمال في الجميع، ولا يصرح بتعيين المفضول كما تقدم\n\n\nوالله تعالى أعلم\n ولما ذكر الحقّ تعالى أحوال الرسل، وتفاوتهم في العناية، ذكر أحوال أممهم وتفاوتهم في الهداية، فقال: {\n\n\n وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِن بَعْدِهِم مِّن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَاتُ وَلَـٰكِنِ ٱخْتَلَفُواْ فَمِنْهُمْ مَّنْ آمَنَ وَمِنْهُمْ مَّن كَفَرَ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُواْ وَلَـٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ }  قلت: إذا وقع فعل المشيئة بعد { لو } فالغالب حذف مفعوله، كقوله:\n\n[الأعراف: 176]، أي: لو شئنا رفعه لرفعناه بها، وكقوله: { ولو شاء الله ما اقتتل\n\n\n } ، أي: لو شاء هدايتهم ما اقتتلوا، وغير ذلك\n يقول الحقّ جلّ جلاله: ولما بعثتُ الرسلَ، وفضَّلتُ بعضَهم على بعض، اختلفت أممهم من بعدهم فاقتتلوا، وكل ذلك بإرادتي ومشيئتي، { ولو شاء الله } هداية أممهم { ما اقتتل الذين من بعدهم من بعد ما جاءتهم } المعجزات الواضحات في تحقيق رسالتهم وصحة نبوتهم، { ولكن اختلفوا } بغياً وحسداً { فمنهم من آمن } بتوفيقه لاتباع دين الأنبياء، { ومنهم من كفر } بمخالفتهم، فكان من الأشقياء، { ولو شاء الله } جَمْعهم على الهدى { ما اقتتلوا } ، لكن حكمته اقتضت وجود الاختلاف ليظهر سر اسمه المنتقم والقهار واسمه الكريم والحليم، { ولكن الله يفعل ما يريد }\n\n[الأنبيَاء: 23]\n وفي الآية دليل على أن الحوادث كلها بيد الله خيرها وشرها، وأن أفعال العباد كلها بقدرته تعالى، لا تأثير لشيء من الكائنات فيها\n وهذا يردُّ قول المعتزلة القائلين بخلق العبد أفعاله، فما أبعدهم عن الله\n نسأل الله العصمة بمنِّه وكرمه\n الإشارة: اختلاف الناس على الأولياء سُنة ماضية وحكمة أزلية،\n\n[الأحزَاب: 62]،\n\n[هُود: 118]، فمن رأيته من الأولياء اتفق الناسُ على تعظيمه في حياته فهو ناقص أو جاهل بالله إذ الداخل على الله منكور، والراجع إلى الناس مبرور، وهذا هو الغالب، والنادر لا حكم له، فلو كان الاتفاق محموداً لكان على الأنبياء أولى، فلما لم يقع للأنبياء والرسل، لم يقع للأولياء إذ هم على قدمهم، وقائمون بالوراثة الكاملة عنهم\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}