{
  "chapter": "البقرة",
  "text": "لا اكراه فى الدين قد تبين الرشد من الغى فمن يكفر بالطغوت ويؤمنۢ بالله فقد استمسك بالعروة الوثقى لا انفصام لها والله سميع عليم",
  "translations": [
    {
      "translation": "There is no compulsion in matter of faith. Distinct is the way of guidance now from error. He who turns away from the forces of evil and believes in God, will surely hold fast to a handle that is strong and unbreakable, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion and coercion in regard to religion. The right thing has been made distinct from the wrong thing: now whoever rejects taghut and believes in Allah has taken a firm support that never gives way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion. Certainly, right has become clearly distinct from wrong. Whoever rejects the devil and believes in God has firmly taken hold of a strong handle that never breaks. God is All-hearing and knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion at all in religion; undoubtedly the right path has become very distinct from error; and whoever rejects faith in the devil (false deities) and believes in Allah has grasped a very firm handhold; it will never loosen; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion. Verily, the right path has become distinct from the wrong path. Whoever disbelieves in Taghut and believes in Allah, then he has grasped the most trustworthy handhold that will never break. And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion; truly the right way has become clearly distinct from error; therefore, whoever disbelieves in the Shaitan and believes in Allah he indeed has laid hold on the firmest handle, which shall not break off, and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No compulsion is there in religion. Rectitude has become clear from error. So whosoever disbelieves in idols and believes in God, has laid hold of the most firm handle, unbreaking; God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion. The right direction is henceforth distinct from error. And he who rejecteth false deities and believeth in Allah hath grasped a firm handhold which will never break. Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be no compulsion in religion: true guidance has become distinct from error. But whoever refuses to be led by Satan and believes in God has grasped the strong handhold that will never break. God is all hearing and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No constraint is there in the religion; surely rectitude hath become manifestly distinguished from the error. Whosoever then disbelieveth in the devil and believeth in Allah, hath of a surety rain hold of the firm cable whereof there is no giving way. And Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion: rectitude has become distinct from error. So one who disavows fake deities and has faith in Allah has held fast to the firmest handle for which there is no breaking; and Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let there be no compulsion in religion: Truth stands out clear from Error: whoever rejects evil and believes in Allah hath grasped the most trustworthy hand-hold, that never breaks. And Allah heareth and knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion. Verily, the Right Path has become distinct from the wrong path. Whoever disbelieves in Taghut and believes in Allah, then he has grasped the most trustworthy handhold that will never break. And Allah is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no compulsion in religion. Righteousness is now distinct from error. He who disbelieves in the idol and believes in Allah has grasped the firmest tie that will never break. Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be no compulsion in religion; the right way has become distinct from the wrong way. Whoever renounces evil and believes in God has grasped the most trustworthy handle; which does not break. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be no compulsion in [acceptance of] the religion. The right course has become clear from the wrong. So whoever disbelieves in Taghut and believes in Allah has grasped the most trustworthy handhold with no break in it. And Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:256] There is no compulsion in, entering into, religion. Rectitude has become clear from error, that is say, through clear proofs it has become manifest that faith is rectitude and disbelief is error: this was revealed concerning the Ansār [of Medina] who tried to compel their sons to enter into Islam; so whoever disbelieves in the false deity, namely, Satan or idols (tāghūt, ‘false deity’, is used in a singular and plural sense), and believes in God, has laid hold of the most firm handle, the tight knot, unbreaking, that cannot be severed; God is Hearing, of what is said, Knowing, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is no compulsion in religion) no one from among the people of the Book and the Magians should be coerced to believe in the divine Oneness of Allah after the Arabs' embrace of Islam. (The right direction is henceforth distinct from error) faith from disbelief and Truth from falsehood. The following was revealed about Mundhir Ibn Sawi al-Tamimi: (And he who rejecteth false deities) the command of the devil and the worship of idols (and believeth in Allah) and in what has come forth from Him (hath grasped a firm handhold) has taken in trust \"there is no God save Allah\" (which will never break) will never cease, vanish or perish; it is also said that this means: for him who believes in it, the bliss of Paradise will never cease and he will never be taken out of Paradise, nor will he perish by staying in the Fire. (Allah is Hearer) of this speech, (Knower) of its reward and bliss.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَقَدِ ٱسْتَمْسَكَ بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ } يريدُ بِهِ القُرآنَ\n وقالَ: هو قولُ لاَ إِلهَ إِلاَّ الله\n\n\n\n\nوقولهُ تعالى: { لاَ ٱنفِصَامَ لَهَا } معناهُ لاَ انكِسَارَ لَهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا إكْرَاه في الدين } لأن الدين في الحقيقة هو الهدى المستفاد من النور القلبي، اللازم للفطرة الإنسانية، المستلزم للإيمان اليقيني\n كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لاَ إِكْرَاهَ } أي: لا جبر ولا تهديد ولا إلجاء { فِي ٱلدِّينِ } أي: في الانقياد بدين الإسلام والإطاعة له بعد ما ظهر الحق؛ إذ { قَد تَّبَيَّنَ } وتميَّز { ٱلرُّشْدُ } والهداية { مِنَ ٱلْغَيِّ } والضلالة { فَمَنْ يَكْفُرْ بِٱلطَّاغُوتِ } التي هي النفس الأمارة المضلة عن طريق الحق { وَيْؤْمِن بِٱللَّهِ } الهادي إلى سواء السبيل { فَقَدِ ٱسْتَمْسَكَ } بل تمسك وتشبث { بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ } التي هي حبل الله الممدود من أزل الذات إلى أبد الأسماء والصفات { لاَ ٱنفِصَامَ } ولا انقطاع { لَهَا } أصلاً { وَٱللَّهُ } الهادي للكل { سَمِيعٌ } بذاته لأقواله { عَلِيمٌ } [البقرة: 256] بحمه ومصالحه المودعة فيها، فانظروا ما أنتم أيها الهلكى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}