{
  "chapter": "البقرة",
  "text": "الله لا اله الا هو الحى القيوم لا تاخذه سنة ولا نوم له ما فى السموت وما فى الارض من ذا الذى يشفع عنده الا باذنه يعلم ما بين ايديهم وما خلفهم ولا يحيطون بشىء من علمه الا بما شاء وسع كرسيه السموت والارض ولا يـوده حفظهما وهو العلى العظيم",
  "translations": [
    {
      "translation": "God: There is no god but He, the living, eternal, self-subsisting, ever sustaining. Neither does somnolence affect Him nor sleep. To Him belongs all that is in the heavens and the earth: and who can intercede with Him except by His leave? Known to Him is all that is present before men and what is hidden (in time past and time future), and not even a little of His knowledge can they grasp except what He will. His seat extends over heavens and the earth, and He tires not protecting them: He alone is all high and supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah: the Everlasting, the Sustainer of the whole Universe; there is no god but He. He does neither slumber nor sleep. Whatsoever is in the heavens and in the earth is His. Who is there that can intercede with Him except by His own permission.? He knows what is before the people and also what is hidden from them. And they cannot comprehend anything of His knowledge save whatever He Himself pleases to reveal. His Kingdom spreads over the heavens and the earth and the guarding of these does not weary Him. He alone is the Supreme and the Exalted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God exists. There is no God but He, the Everlasting and the Guardian of life. Drowsiness or sleep do not seize him. To Him belongs all that is in the heavens and the earth. No one can intercede with Him for others except by His permission. He knows about people's present and past. No one can grasp anything from His knowledge besides what He has permitted them to grasp. The heavens and the earth are under His dominion. He does not experience fatigue in preserving them both. He is the Highest and the Greatest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah – there is no God except Him; He is Alive (eternally, on His own) and the Upholder (keeps others established); He never feels drowsy nor does He sleep; to Him only belongs all whatever is in the heavens and all whatever is in the earth; who is he that can intercede* with Him except by His command? He knows what is in front of them and what is behind them; and they do not achieve anything of His knowledge except what He wills; His Throne (of Sovereignty) encompasses the heavens and the earth; and it is not difficult for Him to guard them; and He is the Supreme, the Greatest. (This Verse is popularly known as Ayat Al-Kursi. It has a special status and reciting it carries great reward. *Prophet Mohammed – peace and blessings be upon him – will be the first one to be granted the permission to intercede, others will follow.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! None has the right to be worshipped but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His permission He knows what happens to them (His creatures) in this world, and what will happen to them in the Hereafter. And they will never compass anything of His Knowledge except that which He wills. His Kursi extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He besides Whom there is no god, the Everliving, the Self-subsisting by Whom all subsist; slumber does not overtake Him nor sleep; whatever is in the heavens and whatever is in the earth is His; who is he that can intercede with Him but by His permission? He knows what is before them and what is behind them, and they cannot comprehend anything out of His knowledge except what He pleases, His knowledge extends over the heavens and the earth, and the preservation of them both tires Him not, and He is the Most High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God there is no god but He, the Living, the Everlasting. Slumber seizes Him not, neither sleep; to Him belongs all that is in the heavens and the earth. Who is there that shall intercede with Him save by His leave? He knows what lies before them and what is after them, and they comprehend not anything of His knowledge save such as He wills. His Throne comprises the heavens and earth; the preserving of them oppresses Him not; He is the All-high, the All-glorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no deity save Him, the Alive, the Eternal. Neither slumber nor sleep overtaketh Him. Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth. Who is he that intercedeth with Him save by His leave? He knoweth that which is in front of them and that which is behind them, while they encompass nothing of His knowledge save what He will. His throne includeth the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: there is no deity save Him, the Living, the Eternal One. Neither slumber nor sleep overtakes Him. To Him belong whatsoever is in the heavens and whatsoever is on the earth. Who can intercede with Him except by His permission? He knows all that is before them and all that is behind them. They can grasp only that part of His knowledge which He wills. His throne extends over the heavens and the earth; and their upholding does not weary Him. He is the Sublime, the Almighty One!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no God but he, the Living, the Sustainer Slumber taketh hold of Him not, nor sleep. His is whatsoever is in the heavens and whatsoever is on the earth. Who is he that shall intercede With Him except with His leave! He knoweth that which was before them and that which shall he after them, and they encompass not aught of His knowledge save that which He willeth. His throne comprehendeth the heavens and the earth, and the guarding of the twain wearieth Him not. And He is the High, the Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah—there is no god except Him—is the Living One, the All-sustainer. Neither drowsiness befalls Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that may intercede with Him except with His permission? He knows what is before them and what is behind them, and they do not comprehend anything of His knowledge except what He wishes. His seat embraces the heavens and the earth and He is not wearied by their preservation, and He is the All-exalted, the All-supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no god but He,-the Living, the Self-subsisting, Eternal. No slumber can seize Him nor sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as He permitteth? He knoweth what (appeareth to His creatures as) before or after or behind them. Nor shall they compass aught of His knowledge except as He willeth. His Throne doth extend over the heavens and the earth, and He feeleth no fatigue in guarding and preserving them for He is the Most High, the Supreme (in glory).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), the Ever Living, the One Who sustains and protects all that exists. Neither slumber, nor sleep overtake Him. To Him belongs whatever is in the heavens and whatever is on earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them (His creatures) in this world, and what will happen to them in the Hereafter. And they will never compass anything of His Knowledge except that which He wills. His Kursi extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great. [This Verse 2:255 is called Ayat-ul-Kursi.]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god except He, the Living, the Everlasting. Neither dozing, nor sleep overtakes Him. To Him belongs all that is in the heavens and the earth. Who is he that shall intercede with Him except by His permission! He knows what will be before their hands and what was behind them, and they do not comprehend anything of His Knowledge except what He willed. His Seat embraces the heavens and the earth, and the preserving of them does not weary Him. He is the High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God! There is no god except He, the Living, the Everlasting. Neither slumber overtakes Him, nor sleep. To Him belongs everything in the heavens and everything on earth. Who is he that can intercede with Him except with His permission? He knows what is before them, and what is behind them; and they cannot grasp any of His knowledge, except as He wills. His Throne extends over the heavens and the earth, and their preservation does not burden Him. He is the Most High, the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:255] God, there is no god, that is, there is none worthy of being worshipped in [all] existence, except Him, the Living, the Everlasting, the Eternal Sustainer, the One constantly engaged in the management of His creation. Slumber does not seize Him, neither sleep; to Him belongs all that is in the heavens and the earth, as possessions, creatures and servants; who is there, that is to say, none is there, that shall intercede with Him save by His leave?, in this for him. He knows what lies before them, that is, creation, and what is after them, of the affairs of this world and the Hereafter; and they encompass nothing of His knowledge, that is, they know nothing of what He knows, save such as He wills, to inform of it by way of His messengers. His throne subsumes the heavens and the earth, it is said that His knowledge encompasses them both; it is also said that the kursī (‘throne’) itself subsumes them on account of its vastness, as in the hadīth, ‘The seven heavens compared to the kursī are like seven silver coins lying in a metal shield [of armour]’; the preserving of them, the heavens and the earth, wearies Him not, does not burden Him; He is the Sublime, above His creation by virtue of His subjugation [of them], the Tremendous, the Great.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then praises Himself, saying: (Allah! There is no God save Him, the Alive) Who dies not, (the Eternal) the Self-existent Who has no beginning. (Neither slumber nor) deep (sleep overtaketh Him) such that He is distracted from running and commanding it. (Unto Him belongeth whatever is in the heavens) of angels (and whatever is in the earth) of created beings. (Who is he that intercedeth with Him) from amongst the dwellers of the heavens and the earth on the Day of Judgement (save by His leave?) except by His command? (He knoweth that which is in front of them) in front of the angels regarding the matter of the Hereafter and who is to intercede (and that which is behind them) of the life of this world, (while they encompass nothing of His knowledge save that He will). Allah says: the angels know nothing of the Hereafter or of the life of this world save that which Allah has taught them. (His throne includeth the heaven and the earth) He says that His Chair extends far beyond the heavens and the earth, (and He is never weary of preserving them) it is not burdensome for Him to preserve the Throne and Chair without the angels. (He is the Sublime) more sublime than anything, (the Tremendous) more tremendous than anything.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلْحَيُّ ٱلْقَيُّومُ } قالَ زيدُ بن علي عليهما السلامُ: فالحقُّ: الباقيُ، والقَيومُ: الدَائمُ الذي لا يَزولُ\n\n\n\n\nوقولهُ تعالى: { لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ } فالسِّنةُ: النُّعاسُ: وكذلكَ الوَسنَةُ وجمعُها سِناتٌ\n\n\n\n\nوقولهُ تعالى: { مَن ذَا ٱلَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ } قالَ زيدُ بن علي عليهما السَّلامُ: معناهُ يتكلمُ\n\n\n\n\nوقولهُ تعالى: { وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } قالَ وسِعَ عِلمُهُ السَّمواتِ والأَرضَ\n والكراسيُ: العُلماءُ\n ويقالُ: إِنَّ الكُرسيَ: موضعُ العَرشِ\n\n\n\n\nوقولهُ تعالى: { وَلاَ يَؤُودُهُ حِفْظُهُمَا } معناه لا يَكُدُ بِه ولاَ يَثقُلُ عَليهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الله لا إله إلا هو } في الوجود، فكلّ ما عبد دونه لم تقع العبادة إلا له، علِمَ أو لم يعلم، إذ لا معبود ولا موجود سواه { الحيّ } الذي حياته عين ذاته، وكلّ ما هو حيّ لم يحيى إلا بحياته { القيوم } الذي يقوم بنفسه ويقوم كلّ ما يقوم به\n فلولا قيامه ما قام شيء في الوجود { لا تَأخُذه } غفوة ونعاس، كما يعتري الأحياء من غير قصدهم\n فإنّ ذلك لا يكون إلا لمن حياته عارضة، فتغلبه الطبيعة بالحالة الذاتية طلباً للهدوء والراحة والإبدال عن تحليل اليقظة\n فأمّا من حياته عين ذاته، فلا يمكن له ذلك\n وبين كون حياته غير عارضة بقوله { ولا نَوْم } فإنّ النوم ينافي كون الحياة ذاتية، لأنه أشبه شيء بالموت\n ولهذا قيل: النوم أخو الموت\n ومن لا نوم له لذاته، لمنافاته كون الحياة غير ذاته، فلا سنة له، إذ السنة من مقدّماته وآثاره كما تقول: ليس له ضحك ولا تعجب، وقوله: { لا تأخذه سنة ولا نوم } بيان لقيوميته { له ما في السموات وما في الأرض } نواصيهم بيده، يفعل بهم ما يشاء\n { من ذا الذي يشْفَع عنده إلاّ بإذْنِه } إذ كلهم له وبه يتكلم من يتكلم به وبكلامه، فكيف يتكلم بغير إذنه وإرادته { يَعْلَم } ما قبلهم وما بعدهم، فكيف بهم وبحالهم\n أي: علمه شامل للأزمنة والأشخاص والأحوال كلها، فيعلم المستحق للشفاعة، وغير المستحق لها { ولا يُحِيطونَ بشيءٍ من عِلْمه إلاّ بما شَاء } أي: بما اقتضت مشيئته أن يعلمهم، فعلم كلّ ذي علم شيء من علمه ظهر على ذلك المظهر، كما قالت الملائكة:\n\n[البقرة، الآية: 32]\n { وسِع كُرسيه السموات والأرض } أي: علمه، إذ الكرسيّ مكان العلم الذي هو القلب\n كما قال أبو يزيد البسطامي رحمة الله عليه: لو وقع العالم وما فيه ألف ألف مرّة في زاوية من زوايا قلب العارف ما أحسّ به لغاية سعته\n ولهذا قال الحسن: كرسيه: عرشه، مأخوذ من قوله عليه السلام:\n\n \" قلب المؤمن من عرش الله \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱللَّهُ } أي: الذات الثابت الوجود والكائن الحق الحقيقي بالحقيقة والتحقق والثبوت، إياك أن تقصد بالألفاظ محتملاتها؛ إذ الغرض من التعبير التنبيه، وإلا فكيف يعبر عنه وهو أجل من أن يحيط به العقول فيعبر عنه، أو يورد في قالب الألفاظ الذي { لاَ إِلَـٰهَ } أي: لا موجود، وإن شئت قل: لا وجود ولا تحقق ولا كون ولا ثبوت { إِلاَّ هُوَ } هذا هو نهاية ما تنطق عنه ألسنة التعبير عن الذات الأحدية؛ أذ كل من التعبيرات والإدراكات والمكاشفات والمشاهدات، إنما ينتهي إليه، وبعد انتهائه إليه تكل وتجهل وتعمى وتدهش، ما للعباد ورب الأرباب حتى يتكلموا عنه، سوى أن الحق سبحانه لما ظهر لهم بذاته جميع أوصافه وأسمائه، أنزل عليهم على قدر عقولهم المودعة فيهم كلاماً جامعاً نبههم على مبدئهم بعد توفيق مه وجذب من جانبه؛ إذ أسهل الطريق بالنسبة إلى المحجوبين هو الألفاظ المنبهة عن غيب الذات؛ إذ هو خال عن المواد الغليظة والكدورات الكثيفة المزيحة لصفاء الوحدة، ومع ذلك أيضاً لا ينجو عن ثوب الكثرة\n\n\n\n\nوالحاصل أن من اطلع باطلاع الله وإلهامه على أن فيه مبدأ التكاليف الذي هو العقل المتشعب من العلم الحضوري الحقي، فلا بد أن يصرفه امتثال ما أمر واجتناب ما نهى، ليكون في مرتبة العبودية مطمئناً راضياً مستدرجاً من الحياة الصورية إلى الحياة المعنوية التي هي { ٱلْحَيُّ } الأزلي الأبدي السرمدي الدائم { ٱلْقَيُّومُ } الذي { لاَ تَأْخُذُهُ } فتور وفترة وتعديل وغفلة لا { سِنَةٌ } نعاس لا ينتهي إلى حد النوم { وَلاَ نَوْمٌ } يتجاوز عنها قمها، مع أن المناسب للترقي تأخيرها اهتماماً بشأنها؛ لكونها أقرب نسبة إلى الله سبحانه تعالى من النوم بالنسبة إلى أولي الأحلام السخيفة من المجسمة وغيرها، هو الذي { لَّهُ } محافظة { مَا } ظهر { فِي ٱلسَّمَٰوَٰتِ } أي: سموات الأسماء والصفات الذاتية التي هي أول كثرة ظهرت من الغيب إلى الإضافية { وَمَا } ظهر { فِي ٱلأَرْضِ } أي: طبيعة العدم التي هي آخر كثرة عادت من الشهادة الحقيقية إلى الغيب الإضافي الذي هو قلب الإنسان، وهو البرزخ بين الغيب الحقيقي والشهادة الحقيقية { مَن ذَا } من الأنبياء والأولياء { ٱلَّذِي يَشْفَعُ } يهدي ويرشد للناقصين المنحطين عن مرتبة الإنسانية { عِنْدَهُ } بعد ظهوره له بهو هو { إِلاَّ } من يرشدهم { بِإِذْنِهِ } بوحيه على قلبه ورقائق مناسباته التي لا يمكننا التعبير عنها الذي هو { يَعْلَمُ } بعلمه الحضوري { مَا بَيْنَ أَيْدِيهِمْ } حالة إذ { وَمَا خَلْفَهُمْ } أزلاً وأبداً { وَلاَ يُحِيطُونَ بِشَيْءٍ } قليل { مِّنْ عِلْمِهِ } الحضوري { إِلاَّ بِمَا شَآءَ } وتعلق إرادته ومشيئته عليه\n\n\n\n\nمن هذا يتفطن العارف أن العالم ما هو إلا مظاهر ذات الحق وأظلال أسمائه وآثار أوصافه؛ إذ الموجود هو، والوجود هو، والحي هو، والقيوم هو، الرقيب المحافظ الملازم على محافظة ما ظهر في الأولى والأخرى هو، والعالم المدبر بالحضور مصالح جميع ما ظهر وبطن هو، والعلم والإدراكات الصادرة من المظاهر هو على العلم الحضوري\n\n\nفلم يبق للعالم إلا مناسبة الظلية والانعكاس والمظهرية؛ إذ { وَسِعَ كُرْسِيُّهُ } مجلاه ومظاهره { ٱلسَّمَٰوَٰتِ } المذكورة { وَٱلأَرْضَ } المذكورة { وَلاَ يَؤُودُهُ } يثقله { حِفْظُهُمَا } وإن كانت سموات الأسماء وأرض الطبيعة غير متناهية، بل وإن فرضت بأضعافها وآلافها أموراً متعددة غير متناهية لا يثقله؛ إذ كل من تحقق بمرتبة قلب الإنسان المنعكس من الذات الأحدي المائل نحوها بالميل الحبي الشوقي المتلذذ دائماً بوجوده وحضوره، تحقق عنده من الوسعة ما لا يمكن التعبير عنه مطلقاً\n\n\n\n\nكما سمح سلطان العارفين وبرهان الواصلين - عمَّت بركات أنفاسه الشريفة على الفقراء المتوجهين نحو فضاء التوحيد - حيث قال: \" لو أن العرش وما حواه مائة ألف ألف مرة في زاوية من زوايات قلب العارف، ما أحسن \"\n\n\n\n\nجاء بعده رأس الموحدين، ورئيس أرباب التحقيق واليقين، محيي الملة والدين، الذي هيَّج بحر التوحيد تهييداً شديداً إلى حيث يترشح من تيار قلبه الزخار رشحات المعارف والحقائق، على قلوب أولي العزائم الصحيحة المقتفية إثر طريقة - قدس الله روحه وأرواحهم وشكر سعيهم وسعيه - حيث قال: هذا وسع أبي زيد في عالم الأجسام، بل أقول: \" لو أن ما لا يتناهى وجوده قدر انتهاء وجوده مع العين الموجدة له في زاوية من زوايا قلب العارفين، ما أحسن بذلك في علمه \"\n انتهى\n\n\n\n\nأقول والحديث القدسي مغنٍ عن أمثالهم إن قوله سبحانه:\n\n \" وسعني قلب عبدي المؤمن \" \n\nوسعة عجز عنها التعبير مطلقاً { وَ } بالجملة: ما لكم أيها العباد ومعرفة الذات غير هذا { هُوَ ٱلْعَلِيُّ } بذاته تعالى عن أن تدركه عقول العقلاء وتنزه عن أن تصفه ألسنة الفصحاء { ٱلْعَظِيمُ } [البقرة: 255] بآثار أسمائه وصفاته الممتدة على صفحات الإعدام، وهو في ذاته على حرافة وحدته، وهو ولا شيء سواه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الله }: مبتدأ، وجملة { لا إله إلا هو }: خبره، والضمير المنفصل بدل من المستتر في الخبر، و { الحي }: إما خبر ثانيٍ، أو لمبتدأ مضمر، أو بدل من { الله } ، و { قيوم } فَيْعُول، مبالغة من القيام، ومعناه: القائم بنفسه المستغني عن غيره\n يقول الحقّ جلّ جلاله: { الله } الواجب الوجود لا يستحق العبادة غيره، فمن عبد غيره فقد أتى بظلم عظيم { الحي } أي: الدائم بلا أول، الباقي بلا زوال الذي لا سبيل عليه للموت والفناء، { القيوم } أي: دائم القيام بتدبير خلقه في إيصال المنافع ودفع المضار، وجلب الأرزاق وأنواع الارتقاء، { لا تأخذه سنة ولا نوم } السنة: ما يتقدم النوم من الفتور، والنوم: حالة تعرض للإنسان من استرخاء أعصاب الدماغ من رطوبات الأبخرة المتصاعدة، فتقف الحواس الظاهرة عن الإحساس رأساً\n وتقديم السنَة عليه، على ترتيب الوجود، كقوله تعالى:\n\n[التّوبَة: 121]، وجمع بينهما لأنه لو اقتصر على نفس السَّنَة عند لتوهم أن النوم يغلبه لأنه أشد، ولو اقتصر على نفي النوم لتوهم أن السنة تلحقه لخفتها\n والمراد تنزيهه تعالى عن آفات البشرية، وتأكيد كونه حيّاً قيوماً، فإن من أخذه نعاس أو نوم يكون مؤوف الحياة، قاصراً في الحفظ والتدبير\n ولذلك ترك العطف فيه وفي الجمل التي بعدَه لأنها كلها مقررة له، أي: للحيّ للقيّوم\n وقد ورد أنه اسم الله الأعظم، وقال عليه الصلاة والسلام لفاظمة - رضي الله عنها:\n\n \" ما مَنَعك أن تَسْمَعي ما أُوصِيك به تَقُولين إذا أصْبَحْتِ وإذا أمْسَيتِ يا حيّ يا قيُّوم، برحمتِكَ أستغيث أصْلحْ لي شأني كُلَّه، ولا تَكلْني إلى نفْسِي طَرْفَةَ عَيْنِ \" \n\nرواه النسائي وأخرج مسلم عن أبي موسى رضي الله عنه قال: \" قَامَ فِينَا رسُولَ الله صلى الله عليه وسلم بخَمْسِ كلماتٍ قال:\n\n \" إنَّ الله عزَّ وجلَّ لا ينامُ، ولا يَنْبَغِي لَهُ أنْ يَنَام، يَخْفِضُ القِسطُ ويَرْفَعُهُ\n يُرْفَعُ إلَيْهِ عَمَلُ اللَّيل قَبْلَ عَمَلَ النَّهَارِ وعَمَلُ النَّهَارِ قَبْلَ عَملِ اللَّيلِ، حِجَابُهُ النُّورُ \" \n\n- وفي رواية\n النَّارُ -\n\n \" لَوْ كَشَفَهُ لأحْرَقَتْ سُبَحَاتُ وَجْهِهِ ما أدركه بَصَرُهُ مِنْ خَلْقِهِ \"\n \n\nله ما في السماوات وما في الأرض } هذا تقرير لقيوميته تعالى، واحتاج على تفرده في الألوهية\n والمراد بما بما فيهما: ما هو أعمُّ من أجزائهما الداخلة فيهما ومن الأمور الخارجة عنهما، المتمكنة فيهما، من العقلاء وغيرهم، فهو أبلغ من له السماوات والأرض وما فيهن، يعني: أن الله يملك جميع ذلك من غير شريك ولا منازع، وعبر بـ { ما } تغليباً للغالب\n { من ذا الذي يشفع عنده إلا بإذنه } هذا بيان لكبرياء شأنه، وأنه لا يدانيه أحد ليقدر على تغيير ما يريده بشفاعة واستكانة، فضلاً عن أن يعاوقه عناداً أو مناصبة\n\n\nوالاستفهام إنكاري، أي: لا أحد يشفع عنده لمن أراد تعالى عقوبته، إلا بإذنه، وذلك أن المشركين زعموا أن الأصنام تشفع لهم، فأخبر تعالى أنه لا شفاعة عنده إلا بإذنه، يريد بذلك شفاعة النبيّ صلى الله عليه وسلم وبعض الأنبياء والأولياء والملائكة\n { يعلم ما بين أيديهم وما خلفهم } أي: ما قبلهم وما بعدهم، أو بالعكس، لأنك تستقبل المستقبل وتستدبر الماضي وقيل: { يعلم ما بين أيديهم } من الدنيا { وما خلفهم } من الآخرة، وقيل: عكسه، لأنهم يقدمون ويُخَلِّفُون الدنيا وراءهم، وقيل: يعلم ما قدموه بين أيديهم من خير أو شر، وما خلفهم وما هم فاعلوه، أو عكسه\n والمراد أنه سبحانه أحاط بالأشياء كلها، فلا يخفى عليه شيء { ولا يحيطون بشيء من علمه إلا بما شاء } أي: لا يحيطون بشيء من معلوماته تعالى إلا بما شاء أن يُطْلعهم عليه، وعطفه على ما قبله لأن مجموعه يدل على تفرده تعالى بالعلم الذاتي التام، الدال على وحدانيته تعالى في ذاته وصفاته\n { وسع كرسِيُّه السماوات والأرض } يقال: فلان يسَعُ الشيء سعة إذا احتمله وأطاقه وأمكنه القيامُ به\n ويقال: وسع الشيءُ الشيء إذا أحاط به وغمره حتى اضمحلّ في جانبه، وهذا المعنى هو اللائق هنا\n وأصل الكرسي في اللغة: من تَركّب الشيء بعضه على بعض، ومنه الكراسة، لتركب أوراقها بعضها على بعض، وفي العرف: اسم لما يُقعد عليه، سُمِّي به لتركب خشباته\n واختلف فيه فقيل: العرش، وقيل: غيره\n والصحيح أنه مخلوق عظيم أمام العرش، فوق السماوات السبع دون العرش\n يقال: إن السماوات والأرض في جنب الكرسي كحلقة في فلاة\n والكرسي في جانب العرش كحلقة في فلاة\n وعن ابن عباس: أن السماوات في الكرسي كدراهم سبعة في تُرْسٍ وقيل: كرسيه: علمه\n قال البيضاوي: هو تصوير لعظمته تعالى وتمثيل مجرد، كقوله:\n\n[الزمر: 67] ولا كرسي في الحقيقة ولا قاعد\n وقيل: كرسيه مجاز عن علمه أو ملكه، مأخوذ من كرسي العلم والملك، وقيل: جسم بين يدي العرش محيط بالسموات السبع لقوله - عليه الصلاة والسلام-:\n\n \" ما السموات السبع والأرضون السبع في الكرسي إلا كحلقة في فلاة، وفضل العرش على الكرسي كفضل تلك الفلاة على تلك الحلقة \" \n\nولعله الفلك المشهور بفلك البروج\n هـ\n قلت: وقد اعترض السيوطي في حاشيته عليه\n فالله تعالى أعلم\n { ولا يؤوده } أي: لا يُثْقله ولاَ يُشقُّ عليه { حفظهما } أي: حفظ السماوات والأرض\n وإنما لم يتعرض لذكر ما فيهما لأن حفظهما مُسْتَتْبع لحفظه، { وهو العلي } أي: المتعالي عن الأشباه والأنداد، { العظيم } أي: عظيم الشأن، جليل القدر، الذي يُستحفرُ كلُّ شيء دون عظمته\n وهذه الآية مشتملة على أمهات المسائل الإلهية، فإنها دالّة على أنه تعالى موجود واحد في الألوهية، متصف بالحياة الذاتية، واجب الوجود لذاته، موجد لغيره إذ القيوم هو القائم بنفسه المقيم لغيره، منزه عن التحيّز والحلو، مُبرَّأ عن التغير والفتور، لا يناسب الأشباح، ولا يعتريه ما يعتري الأرواح، مالك الملك والملكوت، مبدع الأصول والفروع، ذو البطش الشديد، الذي لا يشفع عنده إلا من أذن له\n\n\nعالم بالأشياء كلها: جَليِّها وخَفِيِّها، وكُليها وجِزْئيَّها\n واسع الملك والقدرة لكل ما يصح أن يملك ويقدر عليه، لا يشقُّ عليه شاقٌّ، ولا يشْغَله شأن عن شأن، مُتَعَالٍ عن تناول الأوهام، عظيمٌ لا تحيط به الأفهام، ولذلك تفردت عن أخواتها بفضائل رائعة وخواص فائقة، قال صلى الله عليه وسلم:\n\n \" أعظمُ آيةٍ في القرآنِ آيةُ الكُرْسيّ \" \n\nوقال عليه الصلاة والسلام:\n\n \" مَنْ قَرَأَ آيَةَ الكُرْسيّ دبُر كُلِّ صلاةٍ مكتوبةٍ لم يَمْنَعْهُ من دُخُولِ الْجنَّة إلا الموتُ \" \n\n- وفي رواية -\n\n \" كانَ الذي يَتوَلَّى قَبْضَ رُوحِه ذُو الجَلاَل والإكْرَام - ولا يُوَاظِبُ عليها إلا صِدِّيقٌ أو عَابدْ، ومن قَرَأها إذا أخَذ مَضْجَعَه أمن على نفْسِه وَجارِه وَجارِ جَارِه، والأبيات حَوْلَه \"\n \n\nوقال عليه الصلاة والسلام:\n\n \" ما قُرئت هذه الآيةُ في بيْت إلا هَجَرَتْهُ الشياطينُ ثلاثين يَوْماً، ولا يدْخُله ساحرُ ولا ساحرةٌ أربعين يوماً، يا عليّ علِّمْها ولدَك وأهلكَ وجيرانَك، فما نزلَتْ آيةٌ أعظمُ منها \" \n\nقاله البيضاوي وأبو السعود، وتكلم السوطي في بعض هذه الأحاديث\n والفضائل يعمل فيها بالضعيف\n والله تعالى أعلم\n الإشارة: يا أيها الذين آمنوا أيمان أهل الخصوصية -\n\n[البقرة: 254] من سعة العلوم ومخازن الفهوم، من قبل أن يأتي يوم اللقاء، يوم تسقط فيه المعاملات وتغيب تلك الإشارت، لا ينفع فيه إلا الدخول من باب الكرم، فيلقى الله بالله دون شيء سواه، والجاحدون لهذا هم الظالمون لأنفسهم، حيث اعتمدوا على أعمالهم فلقُوا الله بالصنم الأعظم، والحيُّ اليّوم الكبير المتعال غني عن الانتفاع بالأعمال، وبالله التوفيق\n ومَنْ عرف أنه الحيّ الذي لا يموت توكل عليه\n قال تعالى:\n\n[الفُرقان: 58]\n والتعلق به: استمداد حياة الروح بالعلم والمحبة الكاملة\n ومن عرف أنه الحيّ القيّوم وثق به، ونسي ذكر كل شيء بذكره، ولم يشاهد غيره بمشاهدة قيوميته\n والتعلق به استمداد معرفة قيوميته حتى يستريح من نكد التدبير، والتخلق به بأن تكون قائماً على ما كُلِّفْتَ به من أهْلٍ وَوَلَدٍ ونَفْسٍ ومَالٍ، وكُلِّ من تعلق بك من النساء والرجال\n ولمَّا وصف الحيُّ تعالى نفسه بأوصاف الكمال من الكبرياء، والعظمة والجلال وكانت شواهد ذلك ظاهرة في خلقه حتى تبيَّن الحق من الباطل\n\n",
      "translations": []
    }
  ]
}