{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ انفقوا۟ مما رزقنكم من قبل ان ياتى يوم لا بيع فيه ولا خلة ولا شفعة والكفرون هم الظلمون",
  "translations": [
    {
      "translation": "O believers, expend of what We have given you before the day arrives on which there will be no barter, and no friendship or intercession matter, and those who are disbelievers will be sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, spend of the wealth We have bestowed upon you (in Our way) before the Day comes when there shall be no buying and no selling: when neither friendship nor intercession will be of any avail. Those, who adopt the way of disbelief are indeed the wrongdoers. '\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, out of what We have given you, spend for the cause of God before the coming of the day when there will be no trading, no friendship, and no intercession. Those who deny the Truth are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Spend in Allah's cause, from what We have provided you, before the advent of a day in which there is no trade, and for the disbelievers neither any friendship nor intercession; and the disbelievers themselves are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend of that with which We have provided for you, before a Day comes when there will be no bargaining, nor friendship, nor intercession. And it is the disbelievers who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! spend out of what We have given you before the day comes in which there is no bargaining, neither any friendship nor intercession, and the unbelievers-- they are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, expend of that wherewith We have provided you, before there comes a day wherein shall be neither traffick, nor friendship, nor intercession; and the unbelievers -- they are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! spend of that wherewith We have provided you ere a day come when there will be no trafficking, nor friendship, nor intercession. The disbelievers, they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, spend out of what We have given you, before the Day comes when there will be neither trading, friendship nor intercession. Truly, it is those who deny the truth who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe: expend of that which We have provided you ere the Day cometh wherein there will be neither bargain nor friendship nor intercession. And the infidels - they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Spend out of what We have provided you before there comes a day on which there will be no bargaining, neither friendship, nor intercession. And the faithless—they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Spend out of (the bounties) We have provided for you, before the Day comes when no bargaining (Will avail), nor friendship nor intercession. Those who reject Faith they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend of that with which We have provided for you, before a Day comes when there will be no bargaining, nor friendship, nor intercession. And it is the disbelievers who are the Zalimun (wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, spend of what We have given you before that Day arrives when there shall be neither trade, nor friendship, nor intercession. It is the unbelievers who are the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Spend from what We have given you, before a Day comes in which there is neither trading, nor friendship, nor intercession. The disbelievers are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, spend from that which We have provided for you before there comes a Day in which there is no exchange and no friendship and no intercession. And the disbelievers - they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:254] O you who believe, expend of what We have provided you with, what is due of it as alms, before there comes a day in which there shall be neither commerce, ransom, nor friendship, that can be of any benefit, nor intercession, without His permission (a variant reading has all three nouns in nominative inflection bay‘un, khullatun, shafā‘atun [as opposed to lā bay‘a, lā khullata, lā shafā‘ata]): this is the Day of Resurrection. And the disbelievers, those that disbelieve in God or in the obligations He has imposed on them — they are the evildoers, for not respecting God’s command.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "44 After this, Allah prompted them to give in charity, saying: (0 ye who believe! spend of that wherewith We have provided you) give in charity from the wealth We have given you for the sake of Allah (ere a day) the Day of Judgement (come when there will be no trafficking) no ransom is accepted, (nor friendship, nor intercession) for the disbelievers. (Disbelievers) in Allah (are the wrong-doers) who ascribe partners with Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَّ بَيْعٌ فِيهِ وَلاَ خُلَّةٌ } المعنى وَلا خَليلٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } مقتضى إيمانكم قطع العلائق عما سوى الله الحق خصوصاً عن مزخرفات الدنيا المانعة من الميل الحقيقي { أَنْفِقُواْ مِمَّا رَزَقْنَٰكُم } ابتلاءً لكم { مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لاَّ بَيْعٌ فِيهِ } ولا معاوضة ولا تجارة حتى يحصلوا فيه ما فوتم لأنفسكم { وَلاَ خُلَّةٌ } حتى تتعاونوا بها وتستظهروا { وَلاَ شَفَاعَةٌ } مقبولة من أحد حتى تستشفعوا منه { وَ } بالجلمة: { ٱلْكَٰفِرُونَ } الساترون هوية الحق بهوياتهم الباطلة، المضيفون نعم الله إليها { هُمُ ٱلظَّٰلِمُونَ } [البقرة: 254] المتجاوزون عن حدود الله عناداً واستكباراً المعتقدون أصالتهم في الوجود واستقلالهم في الآثار الصادرة عنهم، مع كونهم هالكين مستهلكين في وجود الحق وهويته إذ:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا أنفقوا مما رزقناكم } واجباً أو تطوعاً في وجوه الخير، وخصوصاً في الجهاد الذي نحن بصدد الحضّ عليه، وقدموا لأنفسكم ما تجدونه بعد موتكم { من قبل أن يأتي يوم } الحساب، واقتضاء الثواب، يوم ليس فيه { بيع } ولا شراء، فيكتسب ما يقع به الفداء، وليس فيه { خُلّة } تنفعُ إلا خلة الأتقياء { ولا شفاعة } ترجى\n",
      "translations": []
    }
  ]
}