{
  "chapter": "البقرة",
  "text": "او كالذى مر على قرية وهى خاوية على عروشها قال انى يحى هذه الله بعد موتها فاماته الله ما۟ئة عام ثم بعثه قال كم لبثت قال لبثت يوما او بعض يوم قال بل لبثت ما۟ئة عام فانظر الى طعامك وشرابك لم يتسنه وانظر الى حمارك ولنجعلك ءاية للناس وانظر الى العظام كيف ننشزها ثم نكسوها لحما فلما تبين له قال اعلم ان الله على كل شىء قدير",
  "translations": [
    {
      "translation": "Or take the man who passed by a town which lay destroyed upside down. He said: \"How can God restore this city now that it is destroyed?\" So God made him die for a hundred years, then brought him back to life, and inquired: \"How long did you stay in this state?\" \"A day or less than a day,\" he replied. \"No,\" He said, \"you were dead a hundred years, yet look at your victuals, they have not decomposed; and look at your ass! We shall make you a warning for men. And regard the bones, how We raise them and clothe them with flesh.\" When this became clear to him, the man said: \"Indeed God has power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or take the case of the one who passed by a township that had fallen down upon its roofs. He exclaimed, \"How shall Allah bring back to life this township that has become dead?\" At this Allah caused him to die and he lay dead for a hundred years. Then Allah brought him back to life and asked him, \"How long have you lain here?\" He answered. \"I might have lain here for a day or a few hours.\" Allah said, \"Nay, you have been lying here in this state for a hundred years: now, just have a look at your food and your drink; they have not become spoiled in the least. Then have a look at your ass, (and see that his very bones have become rotten) and We have done this in order to make you a Sign for the people. Look, how We raise up the skeleton and set the bones (of the ass) and cover them with flesh and (put breath of life into them).\" And when the Reality became manifest to him, he said, \"I know that Allah has power over everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Or have you heard) of the one who, on passing through an empty and ruined town, said, \"When will God bring it to life?\" God caused him to die and brought him back to life after a hundred years and then asked him, \"How long have you been here?\" He replied, \"One day or part of a day.\" The Lord said, \"No, you have been here for one hundred years. Look at your food and drink. They have not yet decayed. But look at your donkey and its bones. To make your case evidence (of the Truth) for the people, see how we bring the bones together and cover them with flesh.\" When he learned the whole story, he said, \"Now I know that God has power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like him* who passed by a dwelling and it had fallen flat on its roofs; he said, “How will Allah bring it to life, after its death?”; so Allah kept him dead for a hundred years, then brought him back to life; He said, “How long have you stayed here?”; he replied, “I may have stayed for a day or little less”; He said, “In fact, you have spent a hundred years – so look at your food and drink which do not even smell stale; and look at your donkey whose bones even are not intact – in order that We may make you a sign for mankind – and look at the bones how We assemble them and then cover them with flesh”; so when the matter became clear to him, he said, “I know well that Allah is Able to do all things.” (Prophet Uzair – peace be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like the one who passed by a town in ruin up to its roofs. He said: \"How will Allah ever bring it to life after its death\" So Allah caused him to die for a hundred years, then raised him up (again). He said: \"How long did you remain (dead)\" He (the man) said: \"(Perhaps) I remained (dead) a day or part of a day.\" He said: \"Nay, you have remained (dead) for a hundred years, look at your food and your drink, they show no change; and look at your donkey! And thus We have made of you a sign for the people. Look at the bones, how We bring them together and clothe them with flesh.\" When this was clearly shown to him, he said, \"I know (now) that Allah is able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or the like of him (Uzair) who passed by a town, and it had fallen down upon its roofs; he said: When will Allah give it life after its death? So Allah caused him to die for a hundred years, then raised him to life. He said: How long have you tarried? He said: I have tarried a day, or a part of a day. Said He: Nay! you have tarried a hundred years; then look at your food and drink-- years have not passed over it; and look at your ass; and that We may make you a sign to men, and look at the bones, how We set them together, then clothed them with flesh; so when it became clear to him, he said: I know that Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or such as he who passed by a city that was fallen down upon its turrets; he said, 'How shall God give life to this now it is dead?' So God made him die a hundred years, then He raised him up, saying, 'How long hast thou tarried?' He said, 'I have tarried a day, or part of a day.' Said He, 'Nay; thou hast tarried a hundred years. Look at thy food and drink -- it has not spoiled; and look at thy ass. So We would make thee a sign for the people. And look at the bones; how We shall set them up, and then clothe them with flesh.' So, when it was made clear to him, he said, 'I know that God is powerful over everything.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (bethink thee of) the like of him who, passing by a township which had fallen into utter ruin, exclaimed: How shall Allah give this township life after its death? And Allah made him die a hundred years, then brought him back to life. He said: How long hast thou tarried? (The man) said: I have tarried a day or part of a day. (He) said: Nay, but thou hast tarried for a hundred years. Just look at thy food and drink which have not rotted! Look at thine ass! And, that We may make thee a token unto mankind, look at the bones, how We adjust them and then cover them with flesh! And when (the matter) became clear unto him, he said: I know now that Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or of him who, when passing by a town the roofs of which had caved in, exclaimed, \"How will God restore it to life after its destruction?\" Thereupon God caused him to die, and after a hundred years, brought him back to life. God asked, \"How long have you remained in this state?\" He answered, \"I have remained a day or part of a day.\" God said, \"No, you have remained in this state for a hundred years. Now look at your food and your drink; they have not rotted. Look at your ass. We will make you a sign to mankind. Look at the bones -- how We set them together, then clothe them with flesh!\" When it had all become clear to him, he said, \"Now I know that God has power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, the like unto him who passed by a town, and it lay overturned on its roofs. He said: how shall Allah quicken this after the death thereof Thereupon Allah made him dead for a hundred years, and thereafter raised him and said: how long hast thou tarried He said: I have tarried any day, or part of any day. Allah said: nay! thou hast tarried a hundred years: look at thy food and thy drink, they have not rotten, and look at thine ass; and this We have done in order that We may make of thee a sign unto men; and look thou at the bones, how we shall make them stand up and clothe them with flesh. Then when it became manifest Allah unto him he said: I know that verily everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or him who came upon a township as it lay fallen on its trellises. He said, ‘How will Allah revive this after its death?!’ So Allah made him die for a hundred years, then He resurrected him. He said, ‘How long did you remain?’ Said he, ‘I have remained a day or part of a day.’ He said, ‘No, you have remained a hundred years. Now look at your food and drink which have not rotted! Then look at your ass! [This was done] that We may make you a sign for mankind. And now look at its bones, how We raise them up and clothe them with flesh!’ When it became evident to him, he said, ‘I know that Allah has power over all things.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or (take) the similitude of one who passed by a hamlet, all in ruins to its roofs. He said: \"Oh! how shall Allah bring it (ever) to life, after (this) its death?\" but Allah caused him to die for a hundred years, then raised him up (again). He said: \"How long didst thou tarry (thus)?\" He said: (Perhaps) a day or part of a day.\" He said: \"Nay, thou hast tarried thus a hundred years; but look at thy food and thy drink; they show no signs of age; and look at thy donkey: And that We may make of thee a sign unto the people, Look further at the bones, how We bring them together and clothe them with flesh.\" When this was shown clearly to him, he said: \"I know that Allah hath power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like the one who passed by a town and it had tumbled over its roofs. He said: \"Oh! How will Allah ever bring it to life after its death?\" So Allah caused him to die for a hundred years, then raised him up (again). He said: \"How long did you remain (dead)?\" He (the man) said: \"(Perhaps) I remained (dead) a day or part of a day\". He said: \"Nay, you have remained (dead) for a hundred years, look at your food and your drink, they show no change; and look at your donkey! And thus We have made of you a sign for the people. Look at the bones, how We bring them together and clothe them with flesh\". When this was clearly shown to him, he said, \"I know (now) that Allah is Able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or of him, who, when passing by the ruined village that was fallen on its roofs, remarked: 'How can Allah give life to this after its death' Thereupon Allahcaused him to die, and after a hundred years He revived him. He asked: 'How long have you remained' 'A day' he replied, 'or part of a day' Allah said: 'Rather, you have remained a hundred years. Look at your food and drink; they have not rotted. And look at your donkey (that had died). We will make you a sign to the people. And look at the bones (of your donkey) how We shall revive them and clothe them with flesh' And when it had all become clear to him, he said: 'I know that Allah has power over all things'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or like him who passed by a town collapsed on its foundations. He said, “How can God revive this after its demise?” Thereupon God caused him to die for a hundred years, and then resurrected him. He said, “For how long have you tarried?” He said, “I have tarried for a day, or part of a day.” He said, “No. You have tarried for a hundred years. Now look at your food and your drink—it has not spoiled—and look at your donkey. We will make you a wonder for mankind. And look at the bones, how We arrange them, and then clothe them with flesh.” So when it became clear to him, he said, “I know that God has power over all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [consider such an example] as the one who passed by a township which had fallen into ruin. He said, \"How will Allah bring this to life after its death?\" So Allah caused him to die for a hundred years; then He revived him. He said, \"How long have you remained?\" The man said, \"I have remained a day or part of a day.\" He said, \"Rather, you have remained one hundred years. Look at your food and your drink; it has not changed with time. And look at your donkey; and We will make you a sign for the people. And look at the bones [of this donkey] - how We raise them and then We cover them with flesh.\" And when it became clear to him, he said, \"I know that Allah is over all things competent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:259] Or, did you see, such as he, Ezra (‘Uzayr), who (the kāf of ka’lladhī, ‘such as he who’, is extra) passed by a city, namely, the Holy House [sc. Jerusalem], riding on an ass and carrying with him a basket of figs and a cup of juice, [a city] that was fallen down, collapsed, upon its turrets, its roof tops: after Nebuchadnezzar had destroyed it; he said, ‘How (annā means kayfa, ‘how’) shall God give life to this now that it is dead?’, challenging the power of the exalted One, so God made him die, and remain dead for, a hundred years, then he raised him up, brought him back to life to show him how this could be done; He, God, said, ‘How long have you tarried?’, been here?; he said, ‘I have tarried a day, or part of a day’, because he fell asleep before noon, and was made dead and then brought back to life again at sunset, and thus he thought it was a day’s sleep; He said, ‘Nay; you have tarried a hundred years. Look at your food, the figs, and drink, the cup of juice, it has not spoiled, despite the length of time (the final hā’ of yatasannah, ‘to spoil’, is said to belong to the original root, s-n-h; but it is also said to be silent, in which case the root would be s-n-y; a variant reading omits the final hā’); and look at your ass, how it is, and he saw that it had died, and all that remained were its withered white bones. We did this so that you would know and, so that We would make you a sign, of [the truth of] the Resurrection, for the people. And look at the bones, of the ass, how We shall set them up, how We shall raise them back to life (nunshiruhā, or nanshiruhā, derived from the two expressions, nashara and anshara; a variant reading has nunshizuhā, meaning ‘How We shall move it and make it stand’); and then clothe them with flesh’, and when he looked at it, he saw that [the bones] had been reconstituted and clothed with flesh, and that the Spirit had been breathed into it, making it bray. So, when it was made clear to him, as a result of witnessing it, he said, ‘I know (a variant reading for a‘lam, ‘I know’, has [the imperative] i‘lam, ‘know!’, thus making it a command from God), with the knowledge of direct vision, that God has power over all things’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "45 (Or (bethink thee) the like of him who, passing by a township) He says: do you not know about 'Uzayr Ibn Shurahya who passed by the township of Dayr Hiraql (which had fallen into utter ruin, exclaimed: How shall Allah give this township life after its death) How can Allah bring the people of this township back to life after their death? (So Allah made him die) right on the spot (a hundred years, then brought him back to life) at the end of the day. (He) Allah (said: How long hast thou tarried) 'Uzayr? (He said: I have tarried for a day) and then looked at the sun still in the horizon and said (or part of a day. He) Allah (said: Nay, but thou hast tarried) you were dead (for a hundred years. Just look at thy food) figs and grapes (and drink) juice (which have not rotted! Look at thine ass!) look at the bones of your ass how white they look! (And, that We may make thee a token) a sign (to mankind) regarding the matter of bringing the dead to life, that they will be resurrected in the same state they died in, because 'Uzayr died young and was brought back to life as a young person. It is said that Allah made him a lesson for people, for he died when he was 40 years old and was brought back to life when his son was 120 years old, (look at the bones) the bones of your ass, (how We adjust them and then cover them with flesh!) after this. He then said: We will make grow on it nerves and veins, flesh, skin and hair and put the spirit in it. (And when (the matter) became clear unto him) how Allah gathers the bones, (he said: I know) I had known (that Allah is Able to do all things) of life and death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا } فالخَاوي: [الخراب] الخَالي الذي لا أَنيسَ بهِ\n والعُرُوشُ: البيوتُ والأَبنِيةُ، واحدُها عَرْشٌ\n ومَا بينَ الثَّلاثةِ إِلى العَشَرةِ عُرُشٌ\n والعُرُوشُ أَكثرُ الكَلامِ\n\n\n\n\nوقولهُ تعالى: { لَمْ يَتَسَنَّهْ } معناهُ لَمْ تَأتِ عَليهِ السّنونُ؛ فَيَتغيَّر\n\n\n\n\nوقولهُ تعالى: { وَٱنْظُرْ إِلَى ٱلعِظَامِ كَيْفَ نُنْشِزُهَا } معناهُ كيفَ نَنْقُلُهَا إِلى مَواضِعهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أو كالذي مرّ على قرية } أي: أرأيت مثل الذي مرّ على قرية باد أهلها، وسقطت سقوفها، وخرّت جدرانها عليها، فتعجب من إحيائها لكونه طالباً سالكاً لم يصل إلى مقام اليقين بعد، ولم يستعد لقبول نور تجلّي اسم المحيي - والمشهور أنه كان عُزَيْر - { فأمَاتَه الله } أي: فأبقاه على موت الجهل\n كما قال:\n\n[غافر، الآية: 11] على قول، وقال تعالى:\n\n[البقرة، الآية: 28]\n { مائةَ عَام } يمكن أن يكون العام في عهدهم كان مبنياً على دور القمر، فيكون ثمانية أعوام وأربعة أشهر، وأن يكون مبنياً على فصول السنة فيكون خمسة وعشرين سنة، وأن تكون أعمارهم في ذلك الزمان كانت طويلة { ثم بَعَثه } بالحياة الحقيقية وطلب منه الوقوف على مدّة اللبث فما ظنها إلا يوماً أو بعض يوم، استصغارًا لمدة اللبث في موت الجهل المنقضية بالنسبة إلى الحياة الأبدية ولعدم شعوره بمرور المدة كالنائم الغافل عن الزمان ومروره\n ثم لما تفكّر نبّهه الله تعالى على طول مدة الجهل وموت الغفلة، بأنه مائة عام، أو أماته بالموت الإراديّ في إحدى المدد المذكورة، فتكون المدة زمان رياضته وسلوكه ومجاهدته في سبيل الله، أو أماته حتف أنفه بالموت الطبيعي فتعلق روحه ببدن آخر من جنسه لاكتساب الكمال إما بعد زمان وإما في الحال حتى مرّ عليه إحدى المدد الثلاث المذكورة، وهو لا يطلع على حاله فيها، ولم يشعر بمبدئه ومعاده وكان ميتاً ثمّ بالحياة الحقيقية فاطلع بنور العلم على حاله وعرف مبدأه ومعاده\n وقوله: { لبثْت يوماً أو بَعض يَوم } كقوله تعالى:\n\n[يونس، الآية: 45]، وقوله تعالى:\n\n[النازعات، الآية: 46]، وقوله:\n\n[الروم، الآية: 55] كل ذلك لغفلتهم عن مرور الزمان وكذا مفارق أخاً أو مصاحباً أو شيئاً آخر إذا أدرك الوصال بعد طول مدة الفراق كأن تلك المدة حينئذ لم تكن، إذ لا يحس بها بعد مضيها وإن قاساها قبل الوصال { وانظر إلى طَعَامك وشَرَابك لم يَتَسنه } قيل: طعامه التين والعنب، وشرابه الخمر واللبن\n فالتين إشارة إلى المدركات الكلية لكونه لباً كله، وكون الجزئيات فيها بالقوة، كالحبات التي في التين، والعنب إشارة إلى الجزئيات لبقاء اللواحق الماديّة معها في الإدراك كالثجير والعجم\n واللبن إشارة إلى العلم النافع كالشرائع\n والخمر إشارة إلى العشق والإرادة وعلوم المعارف والحقائق\n لم يتسنه أي: لم يتغير عما كان في الأزل بحسب الفطرة مودعاً فيك، فإن العلوم مخزونة في كل نفس بحسب استعدادها، كما قال عليه السلام:\n\n \" الناس معادن كمعادن الذهب والفضة \" \n\n \n\nفإن حجبت بالموادّ وخفيت مدّة بالتقلّب في البرازخ وظلماتها، لم تبطل ولم تتغير عن حالها\n حتى إذا رُفِعَ الحجاب بصفاء القلب ظهرت كما كانت، ولهذا قال عليه السلام:\n\n \" الحكمة ضالّة المؤمن \"\n \n\n{ وانْظُر إلى حِمَارك } أي: بدنك بحاله على الوجه الأول والثاني، وكيف نخرت عظامه وبليت على الوجه الثالث { ولنجعلك آية للناس } أي: ولنجعلك دليلاً للناس على البعث، بعثناك { وانْظُر إلى العِظَام كيفَ ننشزها } أي: نرفعها { ثمّ نَكْسوها لَحْماً } على كلا الوجهين ظاهر، فإنه إذا بعث وعلم حاله وتجرّده عن البدن على تركيب بدنه برفع العظام وجمعها وكسوتها لحماً { فلما تَبَين له } ذلك البعث والنشور { قال أعلم أنّ الله على كلّ شيء قَدِير }\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ كَٱلَّذِي } أي: ألم تر إلى الشخص الذي { مَرَّ عَلَىٰ قَرْيَةٍ } هي البيت المقدس في زمان خربها بُخْتنَصَّر فرآها { وَهِيَ خَاوِيَةٌ } ساقطة { عَلَىٰ عُرُوشِهَا قَالَ } محاجاً مجادلاً مبعداً للحشر والنشر: { أَنَّىٰ يُحْيِـي هَـٰذِهِ ٱللَّهُ بَعْدَ مَوْتِهَا } أي: كيف يقدر على إحياء أهلها وهم قد انقرضوا واندرسوا إلى حيث لم يبق منهم أثر؟ { فَأَمَاتَهُ ٱللَّهُ } فجأة؛ إظهار لقدرته وتبييناً لحجته، وألبثه { مِئَةَ عَامٍ } ميتاً كالأموات الأخر { ثُمَّ بَعَثَهُ } إحياءً بعد تلك المدة، ثم سأله هاتف بأن { قَالَ كَمْ لَبِثْتَ } في هذا المكان { قَالَ لَبِثْتُ يَوْماً } والتفت إلى الشمس فرآها باقية قال: { أَوْ بَعْضَ يَوْمٍ قَالَ } السائل: ما تعرف مدة لبثك { بَل لَّبِثْتَ مِئَةَ عَامٍ فَٱنْظُرْ } أيها المبعد للحشر الجسماني بنظر العبرة إلى كمال قدرة الله { إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ } لم يتغير مع سرعة تغييره { وَٱنْظُرْ إِلَىٰ حِمَارِكَ } كيف تفرقت عظامه وتفتت أجزاؤه مع بطء تغيره وبعد ما نظرت إليهما تذكر قولك حين مرورك على القرية: أنَّى يحيي هذه الله بعد موتها؟ فألزم\n\n\n\n\nثم قيل له من قبل الحق: { وَ } إنما فعلنا ذلك معك أيها المبعد للحشر الجسماني { لِنَجْعَلَكَ آيَةً } ودليلاً وحجة { لِلنَّاسِ } القائلين بالحشر الجسماني على المنكرين المبعدين لها { وَ } بدما تحققت حالك { ٱنْظُرْ } بنظرة العبرة { إِلَى ٱلعِظَامِ } الرفات التي تعجبت من كيفية إحيائها وأنكرت عليها { كَيْفَ نُنْشِزُهَا } نركب بعضها مع بعض { ثُمَّ نَكْسُوهَا لَحْماً } بعد تتميم تركيب العظام { فَلَمَّا تَبَيَّنَ لَهُ } أمر الحشر ألزم وسلم و { قَالَ أَعْلَمُ } يقيناً { أَنَّ ٱللَّهَ } القادر { عَلَىٰ } إحياء { كُلِّ شَيْءٍ } مبدئاً مبدعاً { قَدِيرٌ } [البقرة: 259] على إحيائه معيداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أو } عاطفة، و { كالذي }: معطوف على الموصول المجرور بإلى، أي: ألم تر إلى الذي حاج إبراهيم في ربه، وإلى مثل الذي مرّ على قرية\n وإنما أدخل حرف التشبيه لأن المُنكر للإحياء كثيرٌ، والجاهل بكيفيته أكثر، بخلاف مدعي الربوبية فإنه قليل\n وقيل: الكاف مزيدة، والتقدير: ألم تر إلى الذي حاج وإلى الذي مرَّ، و { أنَّى }: ظرف ليُحيي، بمعنى: متى، أو حال بمعنى كيف، و { يتسنه } بمعنى يتغير، وأصله: يتسنن، فأبدلت النون الثالثة حرف علة\n قال في الكافية:\n\nفصار تَسَنَّى ثم حُذفت للجازم، وأتى بهاء السَّكْت، وقفا ووصل، كالعِوض من المحذوف، وقيل: من السَّنة، وهو التغير، فالهاء أصلية، و { لنجعلنك }: معطوف على محذوف، أي: لتعتبر ولنجعلك آية للناس\n يقول الحقّ جلّ جلاله: ألم تر يا محمد أيضاً إلى مثل الذي { مرَّ على قرية } ، وهو عُزَير، حَبْرُ بني إسرائيل - وقيل: غيره - مرَّ على بيت المقدس حين خربها بُختنصر { وهي خاوية } ساقطة حيطانها { على عروشها } أي: سقفها، وذلك بعد مائة سنة حتى سقطت العروش، ثم سقطت الحيطان عليها، فلما رآها خالية، وعظام الموتى فيها بالية، { قال } في نفسه: { أنَّى يحيي هذ الله بعد موتها } أي: متى يقع هذا\n اعترافاً بالقصور عن معرفة طريق الإحياء، واستعظاماً لقدرة المحيي، إن كان القائل عزيراً، أو استبعاداً إن كان كافراً، { فأماته الله مائة عام } أي: ألبثه ميتاً مائة عام، { ثم بعثه } بالإحياء، فقال له على لسان الملك، أو بلا واسطة: { كم لبثت } ميتاً؟ { قال لبثت يوماً أو بعض يوم } ، وذلك أنه مات ضحى وبعث بعد مائة عام قبل غروب الشمس، فقال قبل النظر إلى الشمس { يوماً } ، ثم التفت فرأى بقية منها، فقال: { أو بعض يوم } على الإضراب، قال له الحقّ جلّ جلاله: { بل لبثت مائة عام }\n وذلك أن عزيراً ذهب ليخترف لأهله فجعل على حماره سَلة عنب وجَرَّة عصير\n فلما مرَّ بتلك القرية ربط حماره، وجعل يتعجب من خرابها وخلائها بعد عمارتها، فقال في نفسه ما قال، فلطف الله به، وأراه كيفية الأحياء عياناً، فأماته مائة عام، حتى بليت عظام حماره وبقي العصير والعنب كأنه حين جنى وعصر فقال له جلّ جلاله: { فانظر إلى طعامك } وهو العنب، { وشرابك } وهو العصير، { لم يتسنه } ، أي: لم يتغير بمرور الزمان وطول المدة، { وانظر إلى حمارك } كيف تفرقت أوصاله، وبليت عظامه، فعلنا ذلك بك لتشاهد قدرتنا، { ولنجعلك آية للناس } بعدك، { وانظر إلى العظام } أي: عظام حمارك، { كيف ننشرها } ، أي: نحييها، من نَشَرَ الله الموتى: أحياها\n أو: { كيف ننشزها } بالزاي - أي: نرفع بعضها، ونركبه عليه، { ثم نكسوها لحماً }\n\n\nفنظر إلى العظام، فقام كلُّ عَظْم إلى موضعه، ثم كسى لحماً وجلداً، وجعل ينهق، { فلما تبين له } ما كان استغربه وأُشكل عليه { قال أعلمُ } عليم اليقين { أن الله على كل شيء قدير } ، أو فلما تبين له الحق، وهو قدرته تعالى على كل شيء، قال لنفسه: { أعلمُ أن الله على كل شيء قدير }\n رُوِيَ أنه أتى قومه على حماره، وقال أنا عزير، فكذبوه، فقرأ التوراة من حفظه، ولم يحفظها أحد قبله، فعرفوه بذلك، وقالوا: هو ابن الله - تعالى عن قولهم - وقيل: لما رجع إلى منزله - وكان شاباً - وجد أولاده شيوخاً، فإذا حدَّثهم بحديث قالوا: حديث مائة سنة\n والله تعالى أعلم\n الإشارة: في هذه الآية والتي بعدها، الإشارة إلى الأمر بتربية اليقين والترقي فيه من علم اليقين إلى عين اليقين، فإن الروح ما دامت محجوبة بالوقوف مع الأسباب والعوائد، وبرؤية الحس والوقوف مع الوسائط، لم تخل من طوارق الشكوك وخواطر، فإذا انقطعت إلى ربها، وخرقت عوائد نفسها، كشف لها الحق تعالى عن أستار غيبه، وأطلعها على مكنونات سره، وكشف لها عن أسرار الملكوت، وأراها سنا الجبروت، فنظرت إلى قدرة الحي الذي لا يموت، وتمتعت بشهود الذات وأنوار الصفات، في هذه الحياة وبعد الممات، فحينئذٍ ينقطع عنها الشكوك والأوهام، وتتطهر من طوارق الخواطر، وتزول عنها الأمراض والأسقام\n قال في الحكم: \" كيف تُخْرَق لك العوائد وأنت لم تخرِق من نفسك العوائد \"\n فانظر إلى عزير\n\n\n ما أراه الحق قدرته عياناً حتى خرق له عوائده فأماته ثم أحياه، فكذلك أنت أيها المريد لا تطمع أن تخرق لك العوائد، فتشاهد قدرة الحق أو ذاته عياناً، حتى تموت عن حظوظك وهواك، ثم تحيا روحك وسرك، فحينئذٍ تشاهد أسرار ربك، ويكشف الأستار عن عين قلبك\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n ثم ذكر الحقّ تعالى قصة خليله عليه السلام في طلبه رؤية عين القدرة في إحياء الموتى، ليترقى من علم اليقين إلى عين اليقين\n\n",
      "translations": []
    }
  ]
}