{
  "chapter": "البقرة",
  "text": "الله ولى الذين ءامنوا۟ يخرجهم من الظلمت الى النور والذين كفروا۟ اولياؤهم الطغوت يخرجونهم من النور الى الظلمت او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "God is the friend of those who believe, and leads them out of darkness into light; but the patrons of infidels are idols and devils who lead them from light into darkness. They are the residents of Hell, and will there for ever abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah (Whose support he takes) hears everything and knows everything. Allah is the Helper and Protector of those who believe in Him: He brings them out of the depths of darkness into the light. As for the disbelievers, they have taghut as their patron, who drives them out of light into the depths of darkness. These are the people who are doomed to the Fire, wherein they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Guardian of the believers and it is He who takes them out of darkness into light. The Devil is the guardian of those who deny the Truth and he leads them from light to darkness. These are the dwellers of hell wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Guardian of the Muslims – He removes them from realms of darkness towards light; and the supporters of disbelievers are the devils – they remove them from light towards the realms of darkness; it is they who are the people of fire; they will remain in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Wali (Protector or Guardian) of those who believe. He brings them out from darknesses into light. But as for those who disbelieve, their Awliya' (supporters and helpers) are Taghut (false deities and false leaders), they bring them out from light into darknesses. Those are the dwellers of the Fire, and they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the guardian of those who believe. He brings them out of the darkness into the light; and (as to) those who disbelieve, their guardians are Shaitans who take them out of the light into the darkness; they are the inmates of the fire, in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Protector of the believers; He brings them forth from the shadows into the light. And the unbelievers -- their protectors are idols, that bring them forth from the light into the shadows; those are the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Protecting Guardian of those who believe. He bringeth them out of darkness into light. As for those who disbelieve, their patrons are false deities. They bring them out of light into darkness. Such are rightful owners of the Fire. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the patron of the faithful. He leads them from darkness to the light. As for those who deny the truth, their supporter is Satan, who brings them out of light into darkness. They are the heirs of the Fire, and there they will remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Patron of those who believe; He bringeth them forth from darknesses into the light; And, for those who disbelieve, the devils are their patrons; they bring them forth from the light into darknesses. These are the fellows of Fire, therein shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the wali of the faithful: He brings them out of darkness into light. As for the faithless, their awliya are the fake deities, who drive them out of light into darkness. They shall be the inmates of the Fire, and they will remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Protector of those who have faith: from the depths of darkness He will lead them forth into light. Of those who reject faith the patrons are the evil ones: from light they will lead them forth into the depths of darkness. They will be companions of the fire, to dwell therein (For ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Wali (Protector or Guardian) of those who believe. He brings them out from darkness into light. But as for those who disbelieve, their Auliya (supporters and helpers) are Taghut [false deities and false leaders, etc.], they bring them out from light into darkness. Those are the dwellers of the Fire, and they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the Guardian of those who believe. He brings them out from darkness into the light. As for those who disbelieve, their guides are idols, they bring them out from the light into darkness. They are the companions of the Fire and shall live in it for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Lord of those who believe; He brings them out of darkness and into light. As for those who disbelieve, their lords are the evil ones; they bring them out of light and into darkness—these are the inmates of the Fire, in which they will abide forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is the ally of those who believe. He brings them out from darknesses into the light. And those who disbelieve - their allies are Taghut. They take them out of the light into darknesses. Those are the companions of the Fire; they will abide eternally therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:257] God is the Protector, helper, of the believers; He brings them forth from the shadows, of unbelief, into the light, of faith. And the disbelievers — their protectors are false deities, that bring them forth from the light into the shadows: the repetition of ‘bringing forth from’ here is either to be taken as a reflection of His [previous] words, “He brings them forth from the shadows”, or as a reference to all those Jews who believed in the Prophet before he was sent, but then rejected him, those are the inhabitants of the Fire, therein they shall abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah is the Protecting Friend of those who believe) He protects and gives victory to the believers, referring here to 'Abdullah Ibn Salam and his companions. (He bringeth them out of darkness into light) He gave them success and brought them out of disbelief into faith. (As for those who disbelieve) i.e. Ka'b Ibn al- Ashraf and his companions, (their patrons are false deities) the devil. (They bring them out of light into darkness) they invite them from faith to disbelief. (Such are rightful owners of the Fire) the dwellers of hell. (They will abide therein forever) never to die or leave it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱللَّهُ وَلِيُّ ٱلَّذِينَ آمَنُواْ يُخْرِجُهُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } فالظُّلماتُ: الكفرُ\n والنّورُ: الإِيمانُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱللَّهُ } أي: الذات المستجمع لجميع الأسماء والصفات { وَلِيُّ ٱلَّذِينَ آمَنُواْ } بالله يريبهم حسب شموله وإحاطته { يُخْرِجُهُمْ مِّنَ ٱلظُّلُمَاتِ } ظلمة الطبيعة وظلمة الإمكان وظلمة الإضافة { إِلَى ٱلنُّورِ } صفاء الوحدة الخالصة عن رين الإضافة الخالية عن شين الكثرة { وَٱلَّذِينَ كَفَرُوۤاْ } بالله { أَوْلِيَآؤُهُمُ ٱلطَّاغُوتُ } التي هي عَلَم الجنس للنفوس البهيمية التي هي الطواغيت المضلة عن الهدي الحقيقي { يُخْرِجُونَهُمْ مِّنَ ٱلنُّورِ } أي: المرآة الصقلية المجلوة القابلة لأن يتراءى فيها جميع ما في العالم { إِلَى ٱلظُّلُمَاتِ } ظلمة الكثرة وظلمة التعيين وظلمة الغفلة { أُوْلَـٰئِكَ } البعداء المطرودين عن ساحة الوحدة { أَصْحَابُ ٱلنَّارِ } أي: نار الخذلان وسعير الإمكان { هُمْ فِيهَا خَالِدُونَ } [البقرة: 257] دائمون إلى ما شاء الله لا حول ولا قوة إلا بالله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}