{
  "chapter": "البقرة",
  "text": "الم تر الى الذى حاج ابرهم فى ربه ان ءاتىه الله الملك اذ قال ابرهم ربى الذى يحى ويميت قال انا۠ احى واميت قال ابرهم فان الله ياتى بالشمس من المشرق فات بها من المغرب فبهت الذى كفر والله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "Have you thought of the man who argued with Abraham about his Lord because God had given him a kingdom? When Abraham said: \"My Lord is the giver of life and death,\" he replied: \"I am the giver of life and death.\" And Abraham said: \"God makes the sun rise from the East; so you make it rise from the West,\" and dumbfounded was the infidel. God does not guide those who are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered the case of the person who had an argument with Abraham as to `Whom Abraham acknowledged as his Lord?' The dispute arose because Allah had given him the kingship, (which had made him arrogant). When Abraham said, \"My Lord is He Who gives life and causes death,\" he answered, \"I give life and cause death.\" Then Abraham said, \"Well, Allah brings the sun from the east: just bring it from the west.\" At this the disbeliever was confounded: (yet he did not believe), for Allah does not show guidance to unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have you heard about the one who argued with Abraham about his Lord for His granting him authority? Abraham said, \"It is only my Lord who gives life and causes things to die.\" His opponent said, \"I also can give life and make things die.\" Abraham said, \"God causes the sun to come up from the East. You make it come from the West.\" Thus the unbeliever was confounded. God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you (O dear Prophet Mohammed – peace and blessings be upon him) not see him who argued with Ibrahim (Abraham) concerning his Lord, as Allah had given him the kingdom? When Ibrahim said, “My Lord is He Who gives life and causes death”, he answered, “I give life and cause death”; Ibrahim said, “So indeed it is Allah Who brings the sun from the East – you bring it from the West!” – the disbeliever was therefore baffled; and Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not looked at him who disputed with Ibrahim about his Lord (Allah), because Allah had given him the kingdom When Ibrahim said (to him): \"My Lord is He Who gives life and causes death.\" He said, \"I give life and cause death.\" Ibrahim said, \"Verily, Allah brings the sun from the east; then bring it you from the west.\" So the disbeliever was utterly defeated. And Allah guides not the people, who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered him (Namrud) who disputed with Ibrahim about his Lord, because Allah had given him the kingdom? When Ibrahim said: My Lord is He who gives life and causes to die, he said: I give life and cause death. Ibrahim said: So surely Allah causes the sun to rise from the east, then make it rise from the west; thus he who disbelieved was confounded; and Allah does not guide aright the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded him who disputed with Abraham, concerning his Lord, that God had given him the kingship? When Abraham said, 'My Lord is He who gives life, and makes to die,' he said, 'I give life, and make to die.' Said Abraham, 'God brings the sun from the east; so bring thou it from the west.' Then the unbeliever was confounded. God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethink thee of him who had an argument with Abraham about his Lord, because Allah had given him the kingdom; how, when Abraham said: My Lord is He Who giveth life and causeth death, he answered: I give life and cause death. Abraham said: Lo! Allah causeth the sun to rise in the East, so do thou cause it to come up from the West. Thus was the disbeliever abashed. And Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not heard of him who argued with Abraham about his Lord because God had bestowed the kingdom upon him? Abraham said, \"My Lord is the one who gives life and brings death.\" He answered, \"I [too] give life and bring death!\" Abraham said, \"God brings up the sun from the east, so bring it up yourself from the west.\" Then the disbeliever was confounded. God does not guide the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bethinkest thou not of one who contended with Ibrahim concerning his Lord, because Allah had vouchsafed unto him dominion! When Ibrahim said: my Lord is He Who giveth life and causeth death, he said: give life and cause death. Ibrahim said: verily Allah bringeth the sun from the east, then bring it thou from the west. Thereupon he Who disbelieved Was dumb-founded, And Allah guideth not a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded him who argued with Abraham about his Lord, [only] because Allah had given him kingdom? When Abraham said, ‘My Lord is He who gives life and brings death,’ he replied, ‘I [too] give life and bring death.’ Abraham said, ‘Indeed Allah brings the sun from the east; now you bring it from the west.’ Thereat the faithless one was dumbfounded. And Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not Turned thy vision to one who disputed with Abraham About his Lord, because Allah had granted him power? Abraham said: \"My Lord is He Who Giveth life and death.\" He said: \"I give life and death\". Said Abraham: \"But it is Allah that causeth the sun to rise from the east: Do thou then cause him to rise from the West.\" Thus was he confounded who (in arrogance) rejected faith. Nor doth Allah Give guidance to a people unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not looked at him who disputed with Ibrahim (Abraham) about his Lord (Allah), because Allah had given him the kingdom? When Ibrahim (Abraham) said (to him): \"My Lord (Allah) is He Who gives life and causes death.\" He said, \"I give life and cause death.\" Ibrahim (Abraham) said, \"Verily! Allah causes the sun to rise from the east; then cause it you to rise from the west.\" So the disbeliever was utterly defeated. And Allah guides not the people, who are Zalimun (wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen he who argued with Abraham about his Lord that Allah had given him the kingship! When Abraham said: 'My Lord is He who revives, and causes to die' He said: 'I revive, and cause to die' Abraham said: 'Allah brings up the sun from the east; so you bring it from the west' Then he who disbelieved became pale. Allah does not guide the nation, the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered him who argued with Abraham about his Lord, because God had given him sovereignty? Abraham said, “My Lord is He who gives life and causes death.” He said, “I give life and cause death.” Abraham said, “God brings the sun from the East, so bring it from the West,” so the blasphemer was confounded. God does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered the one who argued with Abraham about his Lord [merely] because Allah had given him kingship? When Abraham said, \"My Lord is the one who gives life and causes death,\" he said, \"I give life and cause death.\" Abraham said, \"Indeed, Allah brings up the sun from the east, so bring it up from the west.\" So the disbeliever was overwhelmed [by astonishment], and Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:258] Have you not seen him who disputed with Abraham, concerning his Lord, because of the fact, that God had given him the kingship?, that is, his arrogance towards this very grace of God: this was Nimrod (Nimrūd). When (idh is a substitution for hājja, ‘disputed’) Abraham, in response to the other’s question, ‘Who is this Lord of yours to whom you are calling us?’, said: ‘My Lord is He who gives life, and makes to die’, the One that creates life and death in bodies; he [Nimrod] said, ‘I give life, by sparing, and make to die’, by killing. He then had two men brought before him, killed one and spared the other. When Abraham realised that this man was a fool, Abraham, resorting to a more sophisticated argument, said: ‘God brings the sun from the east; so bring, you, it from the west.’ Then the disbeliever was confused, perplexed and amazed; and God   guides not the folk who do evil, disbelieving, to the art of argument.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Bethink thee) have you not been informed (of him who had an argument with Abraham about his Lord) about the Religion of his Lord, (because Allah had given him the kingdom) he is Nimrod Ibn Canaan; (how, when Abraham said: My Lord is He Who giveth life and causeth death) gives life upon the resurrection and causes death by ending the life of this world, (he answered: I give life and cause death. Abraham said) give me proof of what you say. So Nimrod brought two prisoners, killed one and spared the other and then said: this is my proof. When he saw this, Abraham said: (Lo! Allah causeth the sun to rise in the East) from the direction of the East, (so do thou cause it to come up from the West) from the direction of the West. (Thus was the disbeliever abashed) the one who disbelieved kept quiet and could not argue. (And Allah guideth not) to the right argument (wrong-doing folk) the unbelievers, referring here to Nimrod.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَبُهِتَ } معناهُ انْقَطَعتْ حُجتُهُ\n ويقالُ: بَهُتَ وبَهِتَ، وأَكثرُ الكَلامِ بَهُتْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ إِلَى } الكافر العابد للطاغوت وهو نمورد اللعين المعاند { ٱلَّذِي حَآجَّ } جادل مكابرة مع { إِبْرَاهِيمَ } صلوات الرحمن عليه { فِي } شأن { رَبِّهِ } حين { أَنْ آتَاهُ ٱللَّهُ ٱلْمُلْكَ } وأبطره عليه وغيره بملكه وذلك وقت { إِذْ قَالَ إِبْرَاهِيمُ } إلزاماً له حين أخرجه من السجن، فسأكل عن ربه الذي يدعي الدعوة إليه: { رَبِّيَ ٱلَّذِي يُحْيِـي } يُوجِدُ من العدم { وَيُمِيتُ } يرد إليه بعد إيجاده { قَالَ } مكابرة ومجادلة: { أَنَا } أيضاً { أُحْيِـي وَأُمِيتُ } بالعفو والقصاص { قَالَ إِبْرَاهِيمُ } تصريحاً لإلزامه من غير التفات إلى كلام: { فَإِنَّ ٱللَّهَ } القادر على ما يشاء { يَأْتِي بِٱلشَّمْسِ مِنَ ٱلْمَشْرِقِ فَأْتِ } أيها المعاند المكابر { بِهَا مِنَ ٱلْمَغْرِبِ فَبُهِتَ ٱلَّذِي كَفَرَ } بالله بالمعارضة معه فصار مبهوتاً متحيراً { وَٱللَّهُ } الهادي للكل { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [البقرة: 259] المجاوزين عن حقوق الله وآداب العبودية معه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن آتاه }: على حذف لام العلة، و { إذ قال }: ظرف لـ { حاجَّ } ، أبو بدل من { آتاه الله }\n يقول الحقّ جلّ جلاله: متعجباً من جهالة النمرود، والمراد تعجيب السامع: { ألم تر } يا محمد، { إلى } جهالة { الذي حاج إبراهيم } أي: خاصمه { في ربه } لأجْل { أن } أعطاه { الله الملك } ، أي: حمله على ذلك بطر الملك\n وذلك أنه لما كسَّر إبراهيم الأصنام، سجنه أياماً، وأخرجه من السجن، وقال له: من ربك الذي تعبد؟ { قال } له { إبراهيم } عليه السلام: { ربي الذي يحيي ويميت } ، أي: يخلق الأرواح في الأجسام، ويخرجها عند انقضاء آجالها، { قال } نمرود: { أنا أحيي واميت } ، فدعا برجلين فقتل أحدهما، وعفا عن الآخر، فلما رأى إبراهيم عليه السلام غلطه وتشغيبه عدل له إلى حجة أخرى، لا مقدور للبشر على الإتيان بمثلها، فال له: { فإن الله يأتي بالشمس من المشرق فأت بها } أنت { من المغرب } لأنك تدَّعي الربوبية، ومن شأن الربوبية أن تقدر على كل شيء، ولا يعجزها شيء، { فبُهت الذي كفر } أي: غُلب وصار مبهوتاً، { والله لا يهدي القوم الظالمين } إلى قبول الهداية، أو إلى طريق النجاة، أو إلى محجة الاحتجاج\n الإشارة: قال بعض الحكماء: للنفس سر، ظهر على فرعون والنمرود، حتى صرّحا بدعوى الربوبية: قلت: وهذا السر هو ثابت للروح في أصل نشأتها لأنها جاءت من عالم العز والكبرياء\n انظر قوله تعالى:\n\n[الحِجر: 29]، وقال أيضاً:\n",
      "translations": []
    }
  ]
}