{
  "chapter": "البقرة",
  "text": "مثل الذين ينفقون امولهم فى سبيل الله كمثل حبة انۢبتت سبع سنابل فى كل سنۢبلة ما۟ئة حبة والله يضعف لمن يشاء والله وسع عليم",
  "translations": [
    {
      "translation": "The semblance of those who expend their wealth in the way of God is that of a grain of corn from which grow seven ears, each ear containing a hundred grains. Truly God increases for whomsoever He will, for God is infinite and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charity of those who expend their wealth in the way of Allah may be likened to a grain of corn, which produces seven ears and each ear yields a hundred grains. Likewise Allah develops manifold the charity of anyone He pleases, for He is All-Embracing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spending money for the cause of God is as the seed from which seven ears may grow, each bearing one hundred grains. God gives in multiples to those whom He wants. God is Munificent and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who spend their wealth in Allah’s way is similar to that of a grain which has sprouted seven stalks and in each stalk are a hundred grains; and Allah may increase it still more than this, for whomever He wills; and Allah is Most Capable, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who spend their wealth in the way of Allah, is that of a grain (of corn); it grows seven ears, and each ear has a hundred grains. Allah gives manifold increase to whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who spend their property in the way of Allah is as the parable of a grain growing seven ears (with) a hundred grains in every ear; and Allah multiplies for whom He pleases; and Allah is Ample-giving, Knowing\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who expend their wealth in the way of God is as the likeness of a grain of corn that sprouts seven ears, in every ear a hundred grains. So God multiplies unto whom He will; God is All-embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who spend their wealth in Allah's way is as the likeness of a grain which groweth seven ears, in every ear a hundred grains. Allah giveth increase manifold to whom He will. Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth for God's cause may be compared to a grain of corn which sprouts into seven ears, with a hundred grains in each ear: for God grants manifold increase to whom He wills; God is infinite and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who expend their substance in the way of Allah is as the likeness of a grain that groweth seven ears and in each ear one hundred grains: and Allah multiplieth unto whomsoever He listeth. Allah is Bounteous, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who spend their wealth in the way of Allah is that of a grain which grows seven ears, in every ear a hundred grains. Allah enhances severalfold whomever He wishes, and Allah is all-bounteous, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who spend their substance in the way of Allah is that of a grain of corn: it groweth seven ears, and each ear Hath a hundred grains. Allah giveth manifold increase to whom He pleaseth: And Allah careth for all and He knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of those who spend their wealth in the Way of Allah, is as the likeness of a grain (of corn); it grows seven ears, and each ear has a hundred grains. Allah gives manifold increase to whom He pleases. And Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who give their wealth in the way of Allah is like a grain of corn that sprouts seven ears, in every ear a hundred grains. Allah multiplies to whom He will, Allah is the Embracer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The parable of those who spend their wealth in God’s way is that of a grain that produces seven spikes; in each spike is a hundred grains. God multiplies for whom He wills. God is Bounteous and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven spikes; in each spike is a hundred grains. And Allah multiplies [His reward] for whom He wills. And Allah is all-Encompassing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:261] The likeness, of the quality of the expenditure, of those who expend their wealth in the way of God, that is, in obedience of Him, is as the likeness of a grain of corn that sprouts seven ears, in every ear a hundred grains: likewise what they expend will be multiplied seven hundred times; so God multiplies, even more than this, for whom He will; God is Embracing, in His bounty, Knowing, those who deserve such multiplications.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the spending of the believers in the way of Allah, saying: (The likeness of those who spend their wealth in Allah's way) He says: the likeness of the wealth of those who spend in His way (is as the likeness of a grain which groweths seven ears, in every ear a hundred grains) likewise, Allah multiplies what the believers spend in His way from one to seven hundred fold. (Allah giveth increase manifold) in surplus of this (to whom He will) to whomever deserves it; it is also said: to whomever Allah accepts his spending. (Allah is All-Embracing) by multiplying his reward manifold, (All-Knowing) of what the believers spend and of their intentions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَّثَلُ ٱلَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ } المنسوبة إليهم بنسبة شرعية { فِي سَبِيلِ ٱللَّهِ } طلباً لمرضاته { كَمَثَلِ } باذر { حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّئَةُ حَبَّةٍ وَٱللَّهُ يُضَاعِفُ } حسب قدرته الكاملة تلك المضاعفة بأضعافٍ غير متناهية { لِمَن يَشَآءُ } من خلص عباده بحسب إخلاصهم في نياتهم وإخراجهم نفوسهم عن البين، وتفويضهم الأمور كلها إلى الله أصالة { وَٱللَّهُ } المتجلي في الآفاق والأنفس { وَاسِعٌ } لا ضيق في فضله وإحسانه { عَلِيمٌ } [البقرة: 261] بحال من توجه نحوه وأنفق لرضاه مخلصاً، لا يعزب عن علمه شيء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مثل الذين }: مبتدأ، و { كمثل }: خبر، ولا بد من حذف مضاف، إما من المبتدأ أو الخبر، أي: مثل نفقة الذين ينفقون كمثل حبة، أو مثل الذين ينفقون كمثل باذر حبة\n\n\n الخ\n يقول الحقّ جلّ جلاله: في التحريض على النفقة في سبيل الله: { مثل الذين ينفقون أموالهم في سبيل الله } أي: يتصدقون بها في سبيل الله، كالجهاد ونحوه، { كمثل } زارع { حبة أنبتت } له { سبع سنابل في كل سنبلة مائة حبة } ، فالمجموع سبعمائة\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" الحَسَنَة بِعَشْرِ أَمْثَالِهَا، إلى سَبعمائَة إلى أضْعَافٍ كَثيرَةٍ \" \n\nوإسناد الإنبات إلى الحبة مجاز، والمنبت هو الله، وهذا مثال لا يقتضي الوقوع، وقد يقع في الذرة والدخن في الأرض الطيبة، بحيث تخرج الحبة ساقاً يتشعب إلى سبع شعب، في كل شعبة سنبلة، { والله يضاعف } تلك المضاعفة { لمن يشاء } بفضله، على حسب حال المنفق من إخلاصه وتعبه، وبحسبه تتفاوت الأعمال في مقادير الثواب، { والله واسع } لا يضيق عليه ما يتفضل به من الثواب، { عليم } بنية المنفق وقدر إنفاقه\n ثم ذكر شرطَيْن آخرَيْن في قبول النفقة، فقال: { الذين ينفقون أموالهم في سبيل الله ثم لا يتبعون ما أنفقوا مناً ولا أذى }\n المن: أن يعتد بإحسانه على من أحسن إليه بحيث يقول: أنا فعلت معه كذا، وكذا إظهاراً لميزته عليه\n والأذى: أن يتطاول عليه بذلك\n ويقول: لولا أنا لم يكن منك شيء، مثلاً",
      "translations": []
    }
  ]
}