{
  "chapter": "البقرة",
  "text": "ان الله لا يستحى ان يضرب مثلا ما بعوضة فما فوقها فاما الذين ءامنوا۟ فيعلمون انه الحق من ربهم واما الذين كفروا۟ فيقولون ماذا اراد الله بهذا مثلا يضل به كثيرا ويهدى به كثيرا وما يضل به الا الفسقين",
  "translations": [
    {
      "translation": "God is not loath to advance the similitude of a gnat or a being more contemptible; and those who believe know whatever is from the Lord is true. But those who disbelieve say: \"What does God mean by this parable?\" He causes some to err this way, and some He guides; yet He turns away none but those who transgress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well, Allah is not ashamed to cite the similitude of a gnat or of something even more insignificant than this. As for those who believe, they come to know from the same similitude that it is the Revelation from their Lord; but those who disbelieve, say, \"What does Allah mean by such similitudes?\" Allah leads astray many and guides many to the right way by the same thing. And He leads astray only those who disobey Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not hesitate to set forth parables of anything even a gnat. The believers know that it is the truth from their Lord, but those who deny the truth say, \"What does God mean by such parables?\" In fact, by such parables God misleads and guides many. However, He only misleads the evil doers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not, for the sake of explanation, shy to illustrate an example of anything, whether it is of a gnat or something further (inferior) than it; so the believers know it is the Truth from their Lord; as for the disbelievers, they say, “What does Allah intend by such an example?” He misleads many thereby, and He guides many thereby; and with it He misleads only those who are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah is not ashamed to set forth a parable even of a mosquito or so much more when it is bigger (or less when it is smaller) than it. And as for those who believe, they know that it is the truth from their Lord, but as for those who disbelieve, they say: \"What did Allah intend by this parable\" By it He misleads many, and many He guides thereby. And He misleads thereby only the Fasiqin (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah is not ashamed to set forth any parable-- (that of) a gnat or any thing above that; then as for those who believe, they know that it is the truth from their Lord, and as for those who disbelieve, they say: What is it that Allah means by this parable: He causes many to err by it and many He leads aright by it! but He does not cause to err by it (any) except the transgressors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is not ashamed to strike a similitude even of a gnat, or aught above it. As for the believers, they know it is the truth from their Lord; but as for unbelievers, they say, 'What did God desire by this for a similitude?' Thereby He leads many astray, and thereby He guides many; and thereby He leads none astray save the ungodly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah disdaineth not to coin the similitude even of a gnat. Those who believe know that it is the truth from their Lord; but those who disbelieve say: What doth Allah wish (to teach) by such a similitude? He misleadeth many thereby, and He guideth many thereby; and He misleadeth thereby only miscreants;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not disdain to give a parable about a gnat or a smaller creature. The faithful know that it is the truth from their Lord, but those who deny the truth ask, \"What could God mean by this parable?\" He lets many go astray through it, and guides many by it. But He makes only the disobedient go astray:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah is not ashamed to propound a similitude, be it of a gnat or of aught above it. Then as to those who believe, they know that it is the truth from their Lord. And to those who disbelieve, they say what intendeth God by similitude? He sendeth many astray thereby, and He guideth many thereby, and He sendeth not astray thereby any except the transgressors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah is not ashamed to draw a parable whether it is that of a gnat or something above it. As for those who have faith, they know it is the truth from their Lord; and as for the faithless, they say, ‘What did Allah mean by this parable?’ Thereby He leads many astray, and thereby He guides many; and He leads no one astray thereby except the transgressors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah disdains not to use the similitude of things, lowest as well as highest. Those who believe know that it is truth from their Lord; but those who reject Faith say: \"What means Allah by this similitude?\" By it He causes many to stray, and many He leads into the right path; but He causes not to stray, except those who forsake (the path),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah is not ashamed to set forth a parable even of a mosquito or so much more when it is bigger (or less when it is smaller) than it. And as for those who believe, they know that it is the Truth from their Lord, but as for those who disbelieve, they say: \"What did Allah intend by this parable?\" By it He misleads many, and many He guides thereby. And He misleads thereby only those who are Al-Fasiqun (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is not shy to strike a parable whatsoever a gnat or larger. Those who believe know that it is the truth from their Lord. As for those who disbelieve they ask: 'What could Allah mean by this parable? By it, Allah misleads many and guides many.' But He misleads none except the evildoers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not shy away from making an example of a gnat, or something above it. As for those who believe, they know that it is the Truth from their Lord. But as for those who disbelieve, they say, “What did God intend by this example?” He leads astray many thereby, and He guides many thereby; but He misleads thereby only the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah is not timid to present an example - that of a mosquito or what is smaller than it. And those who have believed know that it is the truth from their Lord. But as for those who disbelieve, they say, \"What did Allah intend by this as an example?\" He misleads many thereby and guides many thereby. And He misleads not except the defiantly disobedient,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:26] God is not ashamed to strike, to make, a similitude (mathal: is the first direct object; mā either represents an indefinite noun described by what comes after it and constitutes a second direct object, meaning ‘whatever that similitude may be’; or it [the mā] is extra to emphasise the vileness [involved], so that what follows constitutes the second direct object); even of a gnat, (ba‘ūda is the singular of ba‘ūd), that is, small flies; or anything above it, that is, larger than it, so that this explanation is not affected [by the size of the creature] with regard to the judgement [God is making]; as for the believers, they know it, the similitude, is the truth, established and given in this instance, from their Lord; but as for disbelievers, they say, ‘What did God desire by this for a similitude?’ (mathalan is a specification, meaning, ‘by this similitude’; mā is an interrogative of rejection and is the subject; dhā means alladhī, whose relative clause contains its predicate, in other words, ‘what use is there in it?’). God then responds to them saying: Thereby, that is, by this similitude, He leads many astray, from the truth on account of their disbelieving in it, and thereby He guides many, believers on account of their belief in it; and thereby He leads none astray except the wicked, those that reject obedience to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the Jews' objection to the Qur'an's similes, saying: (Lo! Allah disdaineth not), He cannot abstain from coining similes, and how can He disdain mentioning something that if all created being were to join forces to create, they would not be able to do so. Allah does not disdain (to coin the similitude) Allah does not disdain explaining to people a similitude (even of a gnat), even regarding a gnat, (or what is above it) let alone a simile of something greater than a gnat such as a fly, or a spider. (Those who believe) in Muhammad and the Qur'an (know that it), the simile, (is the Truth from their Lord; but those who disbelieve), in Muhammad and the Qur'an, (say: What doth Allah wish (to teach) by such similitude?) say: Muhammad! What Allah wishes by such simile is that (He misleadeth many thereby) of the Jews from the true Religion, (and He guideth many thereby) of the believers, (and He misleadeth thereby), by such similes, (only miscreants), the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّ ٱللَّهَ لاَ يَسْتَحْى أَن يَضْرِبَ مَثَلاً مَّا بَعُوضَةً فَمَا فَوْقَهَا } أي فما دُونها فِي الصِّغرِ\n وهذا من الأَضدادِ\n يقالُ ما هو أَكبرُ، لِما هو أصغرُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما طعن الكفار في غاية استكبارهم وعتوهم ونهاية استعظامهم نفوسهم، واعتقادهم الأصالة في الوجود، والاستقلال بالآثار المترتبة عليه الصادرة منهم ظاهراً على الكتاب، والرسول المنزل عليه قائلين بأن ما جئت به وسميته وحياً نازلاً إليك من عند الله الحكيم لا يدل على كلام من يعتد به ويعتمد عليه، فضلاً عن أن يدل على أنه كلام الحكيم المتصف بجميع أوصاف الكمال المستحق للعبادة؛ لأن ما مثل به فيه هي الأشياء الخسيسة الخبيثة والضعيفة الحقيرة، مثل الكلب والحمار والذباب والنمل والنحل والعنكبوت وغيرها، والكلام المشتمل على أمثال هذه الأمثار لا يصدر من الكبير المتعال؟!\n\n\n\nرد الله عليهم وروج أمر نبيه - صلوات الله عليه - فقال: { إِنَّ ٱللَّهَ } المستجمع لجميع الأوصاف والأسماء، المقتضية لظواهر الكائنات، المرتبة لمراتب الموجودات الظاهر على جميع المظاهر بلا تفاوت، كظهور الشمس وإشراقها على جميع الآفاق، وسريان الروح في جميع الأعضاء { لاَ يَسْتَحْى } استحياء من في فعله ضعف وعافية وضيعة، بل الله سبحانة { أَن يَضْرِبَ مَثَلاً } بمظهر { مَّا } من المظاهر غير المتفاوتة في المظهرية؛ إذ له بذاته من جميع أوصافه وأسمائه ظهور في كل ذرة من ذرائر العالم بلا إضافة، فلا تفاوت في المظاهر عنده، وما ترى في خلق الرحمن من تفاوت، وسواء كانت { بَعُوضَةً } مستحقرة عندكم أو أحقر منها { فَمَا فَوْقَهَا } في الحقارة والخساسة كالبق والنمل، فلا يبالي الله في تمثيلها؛ إذ عند الكل على السواء { فَأَمَّا ٱلَّذِينَ } صدقوا النبي الأمي صلى الله عليه وسلم و { آمَنُواْ } بما جاء به من عند ربه { فَيَعْلَمُونَ } علماً يقيناً أن التمثيل بهذه الأمثال { أَنَّهُ ٱلْحَقُّ } الثابت الصادر { مِن رَّبِّهِمْ } الذي رباهم بكشف الأمور على ما هي عليه\n\n\n\n\n{ وَأَمَّا ٱلَّذِينَ كَفَرُواْ } أعرضوا عن تصديق الله ورسوله { فَيَقُولُونَ } مستهزئين متهكمين على سبيل الاستفهام { مَاذَآ أَرَادَ ٱللَّهُ } المقدس عن جميع الرذائل المتصف بالأوصاف الحميدة { بِهَـٰذَا } الحقير الخسيس بأن يضرب { مَثَلاً } بهذا تعريض على رسول الله صلى الله عليه وسلم بأبلغ وجه؛ يعني: ما جئت به من عندك كلمات مفتريات بعضها فوق بعض، أسندته إلى الله لتروجها على أولي الأحلام الضعيفة، ومن غاية استكبارهم ونهاية جهلهم المقتضي لعمى القلب لم يروا الحكمة في تمثيله، ولم يعلموا أنه { يُضِلُّ } الله باسمه المنتقم { بِهِ } بسبب إنكار هذا المثال { كَثِيراً } من المستكبرين المستحقرين بعض المظاهر { وَيَهْدِي بِهِ كَثِيراً } من الموحدين الموقنين الذين لا يرون في المظاهر إلا الله، ففي هذا المشهد لا يسع الإضافات المستلزمة للاستعظام والاستحقار، بل سقط هناك جميع الاعتبار، ثم بيَّن سبب إضلاله له فقال: { وَمَا يُضِلُّ بِهِ إِلاَّ ٱلْفَٰسِقِينَ } [البقرة: 26]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الحياء: خُلُق كريم يمنع صاحبه من ارتكاب ما يعاب به، وفي الحديث:\n\n \" إنَّ الله حَيِيٌ كَريم \" \n\n، و { مثلاً } مفعول، و { ما } نكرة، صفته، و { بعوضة } بدل، والبعوضة: الذباب\n وفي الحديث:\n\n \" لوْ كَانَتِ الدُّنيَا تُسَاوِي عندَ الله جَنَاحَ بعُوضَةٍ مَا سَقَى الكافرَ منها جَرْعَة ماءٍ \" \n",
      "translations": []
    }
  ]
}