{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ لا تبطلوا۟ صدقتكم بالمن والاذى كالذى ينفق ماله رئاء الناس ولا يؤمن بالله واليوم الءاخر فمثله كمثل صفوان عليه تراب فاصابه وابل فتركه صلدا لا يقدرون على شىء مما كسبوا۟ والله لا يهدى القوم الكفرين",
  "translations": [
    {
      "translation": "O believers, do not nullify your charity by giving to oblige and flaunting (your favours) like a man who spends of his wealth only to show off, but does not believe in God and the Last Day. His semblance is that of a rock covered with earth which is washed away by rain exposing the hard rock bare. So they gain nothing from their earnings. God does not guide a people who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, do not spoil your charity by taunts and injury to the recipients like the one who practises charity to be seen by men, while he neither believes in Allah nor in the Last Day. His charity may be likened to the rainfall on a rock which had only a thin layer of soil upon it. When heavy rain fell on it, the whole of the soil washed away and the rock was left bare Such people do not gain the reward they imagine they have earned by their seeming charity; Allah does not show the Right Way to the ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not make your charities fruitless by reproachfully reminding the recipient of your favor or making them feel insulted, like the one who spends his property to show off and who has no faith in God or belief in the Day of Judgment. The example of his deed is as though some soil has gathered on a rock and after a rain fall it turns hard and barren. Such people can not benefit from what they have earned. God does not guide the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not invalidate your charity by expressing favour and causing injury – like one who spends his wealth for people to see, and does not believe in Allah and the Last Day; his example is similar to that of a rock covered with dust and hard rain fell on it, leaving it as a bare rock; they shall get no control over (or benefit from) anything they have earned; and Allah does not guide the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not render in vain your Sadaqah (charity) by reminders of your generosity or by injury, like him who spends his wealth to be seen of men, and he does not believe in Allah, nor in the Last Day. His likeness is the likeness of a smooth rock on which is a little dust; on it falls heavy rain which leaves it bare. They are not able to do anything with what they have earned. And Allah does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not make your charity worthless by reproach and injury, like him who spends his property to be seen of men and does not believe in Allah and the last day; so his parable is as the parable of a smooth rock with earth upon it, then a heavy rain falls upon it, so it leaves it bare; they shall not be able to gain anything of what they have earned; and Allah does not guide the unbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, void not your freewill offerings with reproach and injury, as one who expends of his substance to show off to men and believes not in God and the Last Day. The likeness of him is as the likeness of a smooth rock on which is soil, and a torrent smites it, and leaves it barren. They have no power over anything that they have earned. God guides not the people of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Render not vain your almsgiving by reproach and injury, like him who spendeth his wealth only to be seen of men and believeth not in Allah and the Last Day. His likeness is as the likeness of a rock whereon is dust of earth; a rainstorm smiteth it, leaving it smooth and bare. They have no control of aught of that which they have gained. Allah guideth not the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not cancel out your charitable deeds with reminders and hurtful words, like one who spends his wealth only to be seen by people, and not believing in God and the Last Day. Such men are like a rock covered with earth: a shower falls upon it and leaves it hard and bare. They will gain nothing from their works. God does not guide those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe! make not your alms void by laying an obligation and by hurt, like unto him who expendeth his substance to be seen of men, and believeth not in Allah and the Last Day. The likeness of him is as the likeness of a smooth stone whereon is dust; a heavy rain falleth upon it, and leaveth it bare. They shall not have power over aught of that which they have earned and Allah shall not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not render your charities void by reproaches and affronts, like those who spend their wealth to be seen by people and have no faith in Allah and the Last Day. Their parable is that of a rock covered with soil: a downpour strikes it, leaving it bare. They have no power over anything of what they have earned, and Allah does not guide the faithless lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! cancel not your charity by reminders of your generosity or by injury,- like those who spend their substance to be seen of men, but believe neither in Allah nor in the Last Day. They are in parable like a hard, barren rock, on which is a little soil: on it falls heavy rain, which leaves it (Just) a bare stone. They will be able to do nothing with aught they have earned. And Allah guideth not those who reject faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not render in vain your Sadaqah (charity) by reminders of your generosity or by injury, like him who spends his wealth to be seen of men, and he does not believe in Allah, nor in the Last Day. His likeness is the likeness of a smooth rock on which is a little dust; on it falls heavy rain which leaves it bare. They are not able to do anything with what they have earned. And Allah does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not annul your charitable giving with reproach and hurt, like he who spends his wealth to show off to the people and believes neither in Allah nor in the Last Day. His likeness is as a smooth rock covered with dust, if a heavy rain strikes it, it leaves it bare. They have no power over what they have earned. Allah does not guide the nation, the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not nullify your charitable deeds with reminders and hurtful words, like him who spends his wealth to be seen by the people, and does not believe in God and the Last Day. His likeness is that of a smooth rock covered with soil: a downpour strikes it, and leaves it bare—they gain nothing from their efforts. God does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not invalidate your charities with reminders or injury as does one who spends his wealth [only] to be seen by the people and does not believe in Allah and the Last Day. His example is like that of a [large] smooth stone upon which is dust and is hit by a downpour that leaves it bare. They are unable [to keep] anything of what they have earned. And Allah does not guide the disbelieving people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:264] O you who believe, annul not, the rewards of, your voluntary almsgivings with reproach and injury, as, in the manner of the annulment of the expenditure of, one who expends of his substance to show off to men and believes not in God and the Last Day: this is the hypocrite. The likeness of him is as the likeness of a smooth rock on which is soil, and a torrent, of intense rain, smites it, and leaves it barren, and smooth with nothing on it. They have no power (lā yaqdirūna is a resumption of the statement about the likeness of the one that expends for show; the person becomes plural on account of the [potential plural] implication of alladhī, ‘the one who’) over anything that they have earned, that they did, in other words, they find no reward for it in the Hereafter, just as one finds nothing of the dust that was on the surface of the smooth rock, after the rain has washed it away. God guides not the disbelieving folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "46 (0 ye who believe! Render not vain your almsgiving) the reward of your almsgiving (by reproach) to Allah, i.e. by being conceited (and injury) to the person receiving alms, (like him who spendeth his wealth only to be seen of men) out of ostentation (and believeth not in Allah and the Last Day) does not believe in resurrection after death. (His likeness) the likeness of the person who reminds others about what he has given them and the alms given by one who associates partners with Allah (is as the likeness of rock whereon is dust of earth; a rainstorm smiteth it, leaving it smooth and bare) without any dust on it. (They have no control of aught) to obtain a reward for anything in the Hereafter (of that which they have gained) that which they have spent in the life of this world. Allah says here: the reward of the person who boasts about what he has spent on alms and of the person who hurts those he gives alms to, is like dust on a rock when rain pours down on it and no dust remains. (Allah guideth not) rewards not (the disbelieving folk) and also those who show off their spending while still associating partners with Allah, just as He does not reward the alms of those who remind others about what they have spent on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَمَثَلُهُ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌ } فالصَّفَوانُ: الحِجَارةُ الملسُ التي لاَ يَثبُتُ فِيهَا شَيءٌ\n والواحدةُ صَفْوانةٌ\n وكذلك الصَّفا للجَمعِ\n واحدُهَا صَفَاةٌ\n\n\n\n\nوقولهُ تعالى: { فَأَصَابَهُ وَابِلٌ } معناه مَطرٌ، والجمعُ الأَوابلُ\n\n\n\n\nوقولهُ تعالى: { فَتَرَكَهُ صَلْداً } أَي يابِساً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله الغني الحليم مقتضى إيمانكم أن { لاَ تُبْطِلُواْ صَدَقَٰتِكُم } عند الله { بِٱلْمَنِّ وَٱلأَذَىٰ } حتى لا تعاقبوا عليها بأشد العقاب { كَ } الكافر { ٱلَّذِي يُنْفِقُ مَالَهُ رِئَآءَ ٱلنَّاسِ وَ } الحال أنه { لاَ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ } المعد لجزاء الأعمال { فَمَثَلُهُ } أي: مثل المرائي في أنفاقه في يوم الجزاء { كَمَثَلِ صَفْوَانٍ } حجرٍ أملسٍ { عَلَيْهِ تُرَابٌ } اجتمع من هبوب الرياح فطرح فيه البذور لتنبت وتثمر { فَأَصَابَهُ وَابِلٌ } مطر عظيم القطر { فَتَرَكَهُ صَلْداً } أملس كما كان، وذهب بالبذور والتراب إلى حيث { لاَّ يَقْدِرُونَ عَلَىٰ } تحصيل { شَيْءٍ مِّمَّا كَسَبُواْ } وبذروا عليه { وَٱللَّهُ } الهادي للكل { لاَ يَهْدِي ٱلْقَوْمَ ٱلْكَافِرِينَ } [البقرة: 264] المبطلين بالمن والأذى حكمة الله المتعلقة لتربية الفقراء وتقوية العجز والضعف، فلا بد للمؤمن أن يجتنب عن أمثاله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كالذي }: الكاف في محل نصب على المصدر، أي: إبطالاً كإبطال الذي ينفق ماله رئاء الناس\n أو حال، أي: مشبَّهين بالذي ينفق رئاء\n و { رئاء } مفعول له، والصفوان: الحجر الأملس، والصلد: البارز الذي لا تراب عليه، وجمع الضمير في قوله: { لا يقدرون } باعتبار معنى { الذي } لأن المراد به الجنس\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تبطلوا } أجر صدقتكم بسبب { المن } بها على المتصدَّقِ عليه، { والأذى } الذي يصدر منكم له، بأن تذكروا ذلك للناس، فتكون صدقتكم باطلة، { كالذي ينفق ماله رئاء الناس ولا يؤمن بالله واليوم الآخر } ، فإن أجره يوم القيامة يكون هباء منثوراً، { فمثله } في انتفاعه بصدقته، وتستره بها في دار الدنيا، وافتضاحه يوم القيامة، كحجر أملس { عليه تراب } يستره، فيظن الرائي أنه أرض طيبة تصلح للزراعة، { فأصابه وابل } أي: مظر غزير { فتركه صلداً } حجراً يابساً خالياً من التراب، كذلك المراؤون بأعمالهم، ينتفعون بها في الدنيا بثناء الناس عليهم وستر حالهم، فإذا قدموا يوم القيامة وجدوها باطلة، { لا يقدرون على } الانتفاع بـ { شيء مما كسبوا والله لا يهدي القوم الكافرين } إلى مراشدهم ومصالح دينهم\n وفيه تعريض بأن الرياء والمن والأذى من صفة الكافر، ولا بد للمؤمن أن يتجنب عنها\n وبالله التوفيق\n الإشارة: تصفية الأعمال على قدر تصفية القلوب، وتصفية القلوب على قدر مراقبة علام الغيوب، والمراقبة على قدر المعرفة\n والمعرفة على قدر المشاهدة\n والمشاهدة تحصل على قدر المجاهدة\n\n",
      "translations": []
    }
  ]
}