{
  "chapter": "البقرة",
  "text": "قول معروف ومغفرة خير من صدقة يتبعها اذى والله غنى حليم",
  "translations": [
    {
      "translation": "Saying a word that is kind, and forgiving is better than charity that hurts. (Do not forget that) God is affluent and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forbearance is better than that charity which is followed up by insult or injury. Allah is Self-Sufficient and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Instructive words and forgiveness are better than charity that may cause an insult to the recipient. God is Rich and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Speaking kind words and pardoning are better than charity followed by injury; and Allah is the Independent, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiving of faults are better than Sadaqah (charity) followed by injury. And Allah is Rich (free of all needs) and He is Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind speech and forgiveness is better than charity followed by injury; and Allah is Self-sufficient, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Honourable words, and forgiveness, are better than a freewill offering followed by injury; and God is All-sufficient, All-clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word with forgiveness is better than almsgiving followed by injury. Allah is Absolute, Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forgiveness is better than a charitable deed followed by hurtful words: God is self-sufficient and forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A reputable word and forgiveness are better than an alms which hurt followeth; and Allah is Self-Sufficient, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An honourable reply [in response to the needy] and forgiving [their annoyance] is better than a charity followed by affront. Allah is all-sufficient, most forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and the covering of faults are better than charity followed by injury. Allah is free of all wants, and He is Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiving of faults are better than Sadaqah (charity) followed by injury. And Allah is Rich (Free of all wants) and He is Most-Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A kind word and forgiveness is better than charity followed by injury. Allah is the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind words and forgiveness are better than charity followed by insults. God is Rich and Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Kind speech and forgiveness are better than charity followed by injury. And Allah is Free of need and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:263]   Honourable words, kind talk and a generous reply to the beggar, and forgiveness, towards him for his persistence, are better than a voluntary almsgiving followed by injury, through reproach and deriding him for his begging; and God is Independent, of the voluntary almsgiving of His servants, Forbearing, in His delaying the punishment of the reproachful and injurious one.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A kind word) a good word for your brother, in his absence, by praying for him and praising him in front of other people, (with forgiveness) that overlooks any misdeed (is better) for him and you (than almsgiving followed by injury) than reminding him about your favour upon him which will hurt him. (Allah is Absolute) in His freedom from the need of such a person's charity, (Clement) for He does not hasten the punishment of this person.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَوْلٌ مَّعْرُوفٌ } رد جميل للسائل ناشئ من حسن الخلق { وَمَغْفِرَةٌ } من الله بعد رده متحسراً على نعمة الإنفاق { خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَآ أَذًى } إذ بذلك القول يجرى الثواب وبتلك الصدقة يستحق العقاب { وَٱللَّهُ غَنِيٌّ } عن إنفاقكم بالمن والأذى للفقراء الذين هم من عيال الله { حَلِيمٌ } [البقرة: 263] لا يعجل بمؤاخذة من يمن ويؤذي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قول }: مبتدأ، و { خير }: خبر، والمسوِّغ الصفةُ\n يقول الحقّ جلّ جلاله: { قول } جميل يقوله الإنسان للسائل في حال رده، حيث لم يجد ما يعطيه، { خير } وأفضل عند الله من الصدقة التي يتبعها المن والأذى، ومثال القول المعروف: الله يرزقنا وإياك رزقاً حسناً\n والله يغنينا وإياك من فضله العظيم، وشبه ذلك من غير تعبيس ولا كراهية\n { ومغفرة } للسائل والعفو عن جفوته وإلحاحه، { خير } أيضاً { من صدقة يتبعها } مَنٍّ، أو { أذى } للسائل، علم الحق جلّ جلاله أن الفقير إذا رُدَّ بغير نوال شقَّ عليه، فربما أطلق لسانه وأظهر الشكوى فأمر المسؤول بالعفو والتواضع\n ولو شاء الحقّ تعالى لأغنى الجميع، لكنه أعطى الأغنياء ليظهر شكرهم، وابتلى الفقراء لينظر كيف صبرهم، { والله } تعالى { غني } عن أنفاق يصحبه مَنٌ أو أذى، { حليم } عن معالجة من يَمُنُّ أو يؤذي بالعقوبة\n والله تعالى أعلم\n الإشارة: يُفهم من الآية أن حسنَ الخلق، ولينَ الجانب، وخفض الجناح، وكف الأذى، وحمل الجفاء، وشهود الصفاء، من أفضل الأعمال وأزكى الأحوال وأحسن الخلال، وفي الحديث:\n\n \" إنَّ حُسْن الخُلق يعدل الصيام والقيام \"\n \n",
      "translations": []
    }
  ]
}