{
  "chapter": "البقرة",
  "text": "ايود احدكم ان تكون له جنة من نخيل واعناب تجرى من تحتها الانهر له فيها من كل الثمرت واصابه الكبر وله ذرية ضعفاء فاصابها اعصار فيه نار فاحترقت كذلك يبين الله لكم الءايت لعلكم تتفكرون",
  "translations": [
    {
      "translation": "Does any of you wish to have an orchard full of date-palm trees and vines, and streams of running water and fruits of all kinds, and then old age should overtake him while his children are small, and a scorching whirlwind should smite and burn it down? Thus God makes His signs clear to you that you may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would anyone of you wish that he should have a green garden of palm trees and vines, watered by canals and laden with all sorts of fruit and then it should be consumed by a fiery whirlwind at the very time when he himself has grown very old and his small children are too feeble to earn anything? Thus Allah makes His revelations clear and plain to you that you may ponder over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(What do you think of the case) of one of you who wishes to have a garden of palm-trees and grapes with water flowing therein and producing all kinds of fruits, especially if he is well advanced in age and has weak children who need support, and then a hurricane with fire in it strikes the garden and burns it to the ground? This is how God explains to you His evidence so that you may think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you like that he may own a garden of dates and grapes, with rivers flowing beneath it – in it are all kinds of fruits for him – and he reaches old age and has young children; therefore a windstorm containing fire came to the garden, burning it? This is how Allah explains His verses to you, so that you may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you wish to have a garden with date palms and vines, with rivers flowing underneath, and all kinds of fruits for him therein, while he is striken with old age, and his children are weak (not able to look after themselves), then it is struck with a fiery whirlwind, so that it is burnt Thus does Allah make clear His Ayat to you that you may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does one of you like that he should have a garden of palms and vines with streams flowing beneath it; he has in it all kinds of fruits; and old age has overtaken him and he has weak offspring, when, (lo!) a whirlwind with fire in it smites it so it becomes blasted; thus Allah makes the communications clear to you, that you may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you wish to have a garden of palms and vines, with rivers flowing beneath it, and all manner of fruit there for him, then old age smites him, and he has seed, but weaklings, then a whirlwind with fire smites it, and it is consumed? So God makes clear the signs to you; haply you will reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you like to have a garden of palm-trees and vines, with rivers flowing underneath it, with all kinds of fruit for him therein; and old age hath stricken him and he hath feeble offspring; and a fiery whirlwind striketh it and it is (all) consumed by fire. Thus Allah maketh plain His revelations unto you, in order that ye may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you, being a man well advanced in age with helpless children to support, like to have a garden of dates and grapes, watered by rivers and containing all kinds of fruits, stricken by a fiery whirlwind and utterly scorched? Thus God makes His signs clear to you, so that you may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would any of you that there be for him a garden of date-palms and grape-vines whereunder rivers flow end with every fruit therein for him, and that old age should befall him while he hath a progeny of weaklings, and that a whirlwind wherein is fire should then smite it, so that it is all consumed! In this wise Allah expoundeth unto you the signs that haply ye may ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you like to have a garden of palm trees and vines, with streams running in it, with all kinds of fruit for him therein, and old age were to strike him while he has weakly offspring; whereupon a fiery hurricane were to hit it, whereat it lies burnt? Thus does Allah clarify His signs for you so that you may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does any of you wish that he should have a garden with date-palms and vines and streams flowing underneath, and all kinds of fruit, while he is stricken with old age, and his children are not strong (enough to look after themselves)- that it should be caught in a whirlwind, with fire therein, and be burnt up? Thus doth Allah make clear to you (His) Signs; that ye may consider.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any of you wish to have a garden with date-palms and vines, with rivers flowing underneath, and all kinds of fruits for him therein, while he is striken with old age, and his children are weak (not able to look after themselves), then it is struck with a fiery whirlwind, so that it is burnt? Thus does Allah make clear His Ayat (proofs, evidences, verses) to you that you may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would any one of you, being welladvanced in age with helpless children, wish to have a garden of palmtrees, vines and all manner of fruits watered by running streams struck and burned by a fiery whirlwind? Even so, Allah makes plain to you His signs, in order that you give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would anyone of you like to have a garden of palms and vines, under which rivers flow—with all kinds of fruit in it for him, and old age has stricken him, and he has weak children—then a tornado with fire batters it, and it burns down? Thus God makes clear the signs for you, so that you may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would one of you like to have a garden of palm trees and grapevines underneath which rivers flow in which he has from every fruit? But he is afflicted with old age and has weak offspring, and it is hit by a whirlwind containing fire and is burned. Thus does Allah make clear to you [His] verses that you might give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:266] Would any of you wish to have a garden, an orchard, of date-palms and vines, with rivers flowing beneath it, for him there is in it all manner of fruit, then old age smites him, and makes him too weak to profit from it, and he has seed, but they are weak, young children who cannot manage it; then a whirlwind (i‘sār are violent winds) with fire smites it, and it is consumed?, so that he loses what he is most in need of, and now he and his children have become incapacitated, confused, without any resources. This is a similitude of how the expenditure of the one expending for show, or the one who reproaches [after having expended], vanishes and how it is of no avail when he will be most in need of it in the Hereafter (the interrogative [ayawaddu, ‘would any wish’] is intended as a denial). According to Ibn ‘Abbās, this is the person who performs deeds of obedience, but when Satan comes to him, he begins to work disobedience, until all his good deeds have been consumed. So, in the way that He has explained what has been mentioned, God makes clear the signs to you, so that you might reflect, and take heed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Would any of you like) wish (to have a garden of palm-trees and vines, with rivers flowing beneath it) under its trees, houses and rooms, (with all kinds of fruit for him therein) in the garden; (and old age hath stricken him and he hath feeble offspring) who cannot fend for themselves; (and a fiery whirlwind) a strong cold or hot wind (striketh it) i.e. the garden (and it is (all) consumed by fire. Thus Allah maketh plain His revelations) His signs through commands and prohibitions (unto you, in order that you may give thought) so that you may reflect on the similes of the Qur'an. This is also like the unbelievers in the Hereafter, they shall have no power neither will they be able to come back to the life of this world just as a person advanced in age is without strength and cannot revert to his former vigour and youth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَأَصَابَهَآ إِعْصَارٌ فِيهِ نَارٌ } فالإِعْصَارُ: رِيحٌ عَاصِفٌ تَهُبُ مِن الأَرضِ إِلى السَّماءِ كأَنَّها عَمودٌ فِيهِ نَارٌ\n والجمعُ الأَعاصيرُ\n ويقالُ: الإِعْصَارُ: السُّمومُ التي تَقتُلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أيودّ أحدكم } تمثيل لحال من عمل صالحاً إنفاقاً كان أو غيره متقرّباً به إلى الله مبتغياً رضاه، كما في هذا القسم من الإنفاق، ثم ظهرت نفسه فيه، وتحرّكت، فكانت حركاتها المتخالفة بحركة الروح ودواعيها المتفاوتة المضادّة لداعية القلب إعصاراً، فافترض الشيطان حركتها واتخذها مجالاً له بالوسوسة، فنفث فيها رؤية عملها أو رياء فكان ذلك النفث ناراً أحرقت عملها أحوج ما يكون إليه، كما قال أمير المؤمنين عليّ عليه السلام: { اللهم اغفر لي ما تقرّبت به إليك ثم خالفه قلبي \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم حثَّ سبحانه عموم عباده على الإخلاص ورغبهم عن الرياء والمن والأذى على أبلغ وجه وآكده كأنه استدل عليه فقال: { أَيَوَدُّ } ويحب { أَحَدُكُمْ } أيها المؤمنون المنتشرون في فضاء الدنيا { أَن تَكُونَ لَهُ جَنَّةٌ } مملوءة { مِّن نَّخِيلٍ وَأَعْنَابٍ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } بل { لَهُ فِيهَا مِن كُلِّ ٱلثَّمَرَاتِ } المتنوعة المتلونة { وَ } الحال أنه { أَصَابَهُ ٱلْكِبَرُ وَلَهُ ذُرِّيَّةٌ ضُعَفَآءُ } لا يقدرون على الكسب { فَأَصَابَهَآ } أي: الحنة { إِعْصَارٌ } أي: ريح عاصف تستدير عند هبوبها فيرى لغبرتها مثل العمود الممدود نحو السماء { فِيهِ نَارٌ } متكونة من الأبخرة والأدخنة المحتبسة فيها، والتقطها من شعل النار فسقطت النار فيها { فَٱحْتَرَقَتْ } بالمرة ولم ينتفع منها أصلاً، كيف يحرم هو؟!\n\n\n\nوحرمانكم في النشأة الأخرى أيها المراءون أشد من حرمانه؛ لإحراقكم جنة الأعمال الصالحة المشتملة على نخيل التوحيد، وأعناب التسليم تجري من تحتها أنهار المعارف والحقائق المنتشئة من النفحات الإلهية المثمرة ثمرات الإنفاق والصدقات، والمتشعبة من الرضا المشعر بمقام العبودية، المسقط للإضافات كلها بإعصار الرياء والمن والأذى، المشتمل على نيران الأنانية والغيرية، المشعرة بعدم التحقق بمقام الرضا التسليم، فاحترقت بالمرة\n\n\n\n\nوالحال أنكم مبطلون على الكسب، وقواكم الكاسبة قد رجعت إلى بدء رجموع القهرى ضعفاء مطلعين مثلكم { كَذَلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلأيَٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ } [البقرة: 266] فيها وتدخرون الزاد ليوم لا كسب فيه ولا مكسب، ولا زرع ولا حصاد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}