{
  "chapter": "البقرة",
  "text": "الذين ينفقون امولهم فى سبيل الله ثم لا يتبعون ما انفقوا۟ منا ولا اذى لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Those who spend in the way of God, and having spent do not boast or give pain (by word or deed), will get their reward from their Lord, and will neither have fear nor regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those people who expend their wealth in the way of Allah, and then do not follow up their charity with reminders of their generosity nor injure the feelings of the recipient, shall get their reward from their Lord; they will have no fear and no sorrow of any kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their property for the cause of God and do not make the recipient feel obliged or insulted shall receive their reward from God. They will have no fear nor will they be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in Allah’s way and thereafter do not express favour nor cause injury (hurt the recipient’s feelings), their reward is with their Lord; there shall be no fear upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the cause of Allah, and do not follow up their gifts with reminders of their generosity or with injury, their reward is with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who spend their property in the way of Allah, then do not follow up what they have spent with reproach or injury, they shall have their reward from their Lord, and they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who expend their wealth in the way of God then follow not up what they have expended with reproach and injury, their wage is with their Lord, and no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth for the cause of Allah and afterward make not reproach and injury to follow that which they have spent; their reward is with their Lord, and there shall no fear come upon them, neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth for God's cause and do not follow their almsgiving with taunts and insults shall be rewarded by their Lord; they shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who expend their riches in the way of Allah and thereafter follow not that which they have expended with the laying of an obligation or with hurt, for them shall be their hire with their Lord; and no fear shall come on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the way of Allah and then do not follow up what they have spent with reproaches and affronts, they shall have their reward near their Lord, and they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their substance in the cause of Allah, and follow not up their gifts with reminders of their generosity or with injury,-for them their reward is with their Lord: on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the Cause of Allah, and do not follow up their gifts with reminders of their generosity or with injury, their reward is with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the way of Allah and do not follow their spending with reproach and insults shall be rewarded by their Lord; they shall have nothing to fear or to regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the way of God, and then do not follow up what they spent with reminders of their generosity or with insults, will have their reward with their Lord—they have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who spend their wealth in the way of Allah and then do not follow up what they have spent with reminders [of it] or [other] injury will have their reward with their Lord, and there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:262] Those who expend their wealth in the way of God then do not follow up their expenditure with reminder of their generosity, of the one on whom they expended, for example, by saying, ‘I was good to him and restored his affairs’; and injury, to that person, by mentioning this to people whom he would prefer not to know about it; their wage, the reward for their expenditure, is with their Lord, and no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who spend their wealth for the cause of Allah) this was revealed about 'Uthman Ibn 'Affan and 'Abd al-Rahman Ibn 'Awf, (and afterward make not reproach) to Allah (and injury) upon whom they spend it on (to follow that which they have spent) after their spending; (their reward is with their Lord) in Paradise, (and there shall no fear come upon them) regarding any future torment, (neither shall they grieve) about what they have left behind.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبشّر يا أكمل الرسل { ٱلَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ ٱللَّهِ } معتقدين أنهم مستخلفون عن الله فيها لا مالكون لها { ثُمَّ لاَ يُتْبِعُونَ مَآ أَنْفَقُواُ مَنّاً وَلاَ أَذًى } لاعتقادهم الاستخلاف والنيابة { لَّهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ } المستخلف لهم لا يدرك مقداره وكيفيته أحد من خلقه { وَ } بعدما أنفقوا على الوجه المذكور { لاَ خَوْفٌ عَلَيْهِمْ } من الحساب والعقاب الأخروي { وَلاَ هُمْ يَحْزَنُونَ } [البقرة: 292] من فوات الأجرة بل لهم عند ربهم ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فمن فعل هذا فقد ذهبت صدقته هباءاً منثوراً، ومن سلم من ذلك، وأنفق ماله ابتغاء وجه الله فـ { لا خوف عليهم ولا هم يحزنون }\n وقال زيد بن أسلم رضي الله عنه: إذا أعطيت أحداً شيئاً وظننت أن سلامَكَ يَثْقُلُ عليه فَكُفَ سلامَكَ عنه\n هـ\n قيل: إن الآية نزلت في عثمان وعبد الرحمن بن عوف - رضي الله عنهما أما عثمان فإنه جهز جيش العسرة بألف بعير بأقتابها وأحلاسها\n وقال عبد الرحمن بن سمرة: جاء عُثْمَانُ بألْفِ دِينَارِ في جيش العُسْرَةِ، فصَبَها في حُجْرِ النبيّ صلى الله عليه وسلم، فَرَأيْتُ النبيَّ صلى الله عليه وسلم يُدخل يَده فيها، ويُقلِّبهَا ويقول:\n\n \" ما ضَرَّ ابن عفَّان ما عَمِلَ بَعْدَ اليوم \" \n\nزاد في رواية سعيد: فرأيت النبيّ صلى الله عليه وسلم رافعاً يدعو لعثمان، ويقول:\n\n \" يا رب عثمان بن عفان، رضيتُ عنه فارض عنه \" \n\nوأما عبد الرحمن: فإنه أتى النَّبِيَ صلى الله عليه وسلم بأربعة آلاف درهم، صدقة، وأمسك أربعة آلاف لعياله، فقال له النبيّ صلى الله عليه وسلم:\n\n \" بارك الله لك فيما أعطيتَ وفيما أمسكتَ \"\n \n\nوإنما لم يدخل الفاء في قوله: { لا خوف عليهم } ، مع أن الموصول قد تضمن معنى الشرط، إيهاماً بأنهم أهلٌ لذلك، وإن لم يفعلوا، فكيف بهم إذا فعلوا\n\n\nقاله البيضاوي\n الإشارة: التقرب إلى الله تعالى يكون بالعمل البدني وبالعملي المالي، وبالعمل القلبي، أما العمل البدني، ويدخل فيه العمل اللساني، فقد ورد فيه التضعيف بعشر وبعشرين وبثلاثين وبخمسين وبمائة، وبأكثر من ذلك أو أقل، وكذلك العمل المالي: قد ورد تضعيفه إلى سبعمائة، ويتفاوت ذلك بحسب النيات والمقاصد، وأما العمل القلبي: فليس له أجر محصور، قال تعالى:\n\n[الزُّمَر: 10]، فالصبر، والخوف، والرجاء، والورع، والزهد، والتوكل، والمحبة، والرضا، والتسليم، والمعرفة، وحسن الخلق، والفكرة، وسائر الأخلاق الحميدة، إنما جزاؤها: الرضا، والإقبال والتقريب، وحسن الوصال\n قال تعالى:\n\n[التّوبَة: 72] أي: أكبر من الجزاء الحسيّ الذي هو القصور والحور\n وأما قوله عليه الصلاة والسلام:\n\n \" تفكر ساعة أفضل من عبادة سبعين سنة \"\n \n\nفإنما هو كناية عن الكثرة والمبالغة، كقوله تعالى:\n\n[التّوبَة: 80]\n ومثله قول الشاعر:\n\nأي: سَنَة\n والله تعالى أعلم\n ثم بيَّن الحقّ تعالى أن حسن الخلق ولين الجانب أفضل من الصدقة المشوبة\n\n",
      "translations": []
    }
  ]
}