{
  "chapter": "البقرة",
  "text": "ان الذين ءامنوا۟ وعملوا۟ الصلحت واقاموا۟ الصلوة وءاتوا۟ الزكوة لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "Those who believe and do good deeds, and fulfil their devotional obligations and pay the zakat, have their reward with their Lord, and will have neither fear nor regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who believe and do good deeds, establish the Salat and pay the Zakat, they will most surely have their reward with their Lord and they will have nothing to fear nor to grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers who are steadfast in their prayers and pay the zakat, will receive their reward from God. They will have no fear nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who believed and did good deeds and kept the prayer established and paid the charity – their reward is with their Lord; and there shall be no fear upon them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, those who believe, and do deeds of righteousness, and perform the Salah and give Zakah, they will have their reward with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they who believe and do good deeds and keep up prayer and pay the poor-rate they shall have their reward from their Lord, and they shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do deeds of righteousness, and perform the prayer, and pay the alms -- their wage awaits them with their Lord, and no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe and do good works and establish worship and pay the poor-due, their reward is with their Lord and there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, do good deeds, attend to their prayers and engage in almsgiving, shall be rewarded by their Lord and shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe and work righteous works and establish prayer and give the Poor-rate, theirs shall be their hire with their Lord: no fear shall come on them nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who have faith, do righteous deeds, maintain the prayer and give the zakat, they shall have their reward near their Lord, and they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do deeds of righteousness, and establish regular prayers and regular charity, will have their reward with their Lord: on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly those who believe, and do deeds of righteousness, and perform As-Salat (Iqamat-as-Salat), and give Zakat, they will have their reward with their Lord. On them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do good works, establish the prayers and pay the obligatory charity, will be rewarded by their Lord and will have nothing to fear or to regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do good deeds, and pray regularly, and give charity—they will have their reward with their Lord; they will have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who believe and do righteous deeds and establish prayer and give zakah will have their reward with their Lord, and there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:277] Those who believe and perform righteous deeds, and establish the prayer, and pay the alms — their wage awaits them with their Lord, and no fear shall befall them, neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who believe) in Allah, His messengers, scriptures as well as in the unlawfulness of usury (and do good works) regarding what is between them and their Lord and avoid usury (and establish worship) complete the five daily prayers with all that which is obligated in them (and pay the poor-due) and give the poor-due of their wealth, (their reward is with their Lord) in Paradise (and there shall no fear come upon them) when death is slain (neither shall they grieve) when the Fire is closed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ آمَنُواْ } بالله الواحد القهار الأحد الفرد الوتر في ذاته { وَ } آمنوا أيضاً بجميع رسله المرسلة من عنده، وبجميع ما جاء به من الأوامر والنواهي { عَمِلُواْ } جميع { ٱلصَّٰلِحَٰتِ } المأمورة لهم { وَ } خصوصاً { أَقَامُواْ ٱلصَّلَٰوةَ } المفروضة لهم بكتاب الله { وَآتَوُاْ ٱلزَّكَٰوةَ } المكتوبة عليهم فيه { لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلاَ خَوْفٌ عَلَيْهِمْ } من ترقب مؤلم { وَلاَ هُمْ يَحْزَنُونَ } [البقرة: 277] من فوت ملذ مسربل، لهم ما لهم بالفعل بلا انتظار وترقب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}