{
  "chapter": "البقرة",
  "text": "ليس عليك هدىهم ولكن الله يهدى من يشاء وما تنفقوا۟ من خير فلانفسكم وما تنفقون الا ابتغاء وجه الله وما تنفقوا۟ من خير يوف اليكم وانتم لا تظلمون",
  "translations": [
    {
      "translation": "It is not for you to guide them: God guides whom He will. Whatever you spend you will do so for yourself, for you will do so to seek the way that leads to God; and what you spend in charity you will get back in full, and no wrong will be done to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, you are not responsible for their guidance; Allah Himself shows guidance to anyone He pleases. And whatever wealth you spend in charity, it is for your own good. As you spend of your wealth to win Allah's pleasure, you will be given full reward for whatever you spend and you will not be deprived in the least of your rightful due.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you do not have to guide them. God guides whomever He wants. Whatever you spend for the cause of God is for your own good, provided you do not spend anything but to please God. For anything good that you may give for the cause of God, you will receive sufficient reward and no injustice will be done to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your duty (O dear Prophet Mohammed – peace and blessings be upon him) to make them accept guidance – but Allah guides whomever He wills; and whatever good thing you spend is beneficial for yourselves; and it is not right for you to spend except to seek Allah’s pleasure; and whatever you spend will be repaid to you in full, and you will not be wronged. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not upon you (Muhammad) is their guidance, but Allah guides whom He wills. And whatever you spend in good, it is for yourselves, when you spend not except seeking Allah's Face. And whatever you spend in good, it will be repaid to you in full, and you shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To make them walk in the right way is not incumbent on you, but Allah guides aright whom He pleases; and whatever good thing you spend, it is to your own good; and you do not spend but to seek Allah's pleasure; and whatever good things you spend shall be paid back to you in full, and you shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou art not responsible for guiding them; but God guides whomsoever He will. And whatever good you expend is for yourselves, for then you are expending, being desirous only of God's Face; and whatever good you expend shall be repaid to you in full, and you will not be wronged,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guiding of them is not thy duty (O Muhammad), but Allah guideth whom He will. And whatsoever good thing ye spend, it is for yourselves, when ye spend not save in search of Allah's Countenance; and whatsoever good thing ye spend, it will be repaid to you in full, and ye will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your responsibility to make them follow the right path; God guides whomever He pleases. Whatever wealth you spend is to your own benefit, provided that you spend only to seek the favour of God. Whatever wealth you spend [for God's cause] shall be repaid to you in full and you shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not on thee is their guidance, but Allah guideth whomsoever He listeth. And whatsoever ye expend of good it is for your own souls, and ye expend not save to seek Allah's countenance and whatsoever ye expend of good shall be repaid to you, and ye shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not up to you to guide them; rather, it is Allah who guides whomever He wishes. Whatever wealth you spend, it is for your own benefit, as you do not spend but to seek Allah’s pleasure, and whatever wealth you spend will be repaid to you in full and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not required of thee (O Messenger), to set them on the right path, but Allah sets on the right path whom He pleaseth. Whatever of good ye give benefits your own souls, and ye shall only do so seeking the \"Face\" of Allah. Whatever good ye give, shall be rendered back to you, and ye shall not Be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not upon you (Muhammad SAW) is their guidance, but Allah guides whom He wills. And whatever you spend in good, it is for yourselves, when you spend not except seeking Allah's Countenance. And whatever you spend in good, it will be repaid to you in full, and you shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for you (Prophet Muhammad to cause) their guidance. Allah guides whom He will. Whatever good you spend is for yourselves, provided that you give it desiring the Face of Allah. And whatever good you spend shall be repaid to you in full, you shall not be harmed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their guidance is not your responsibility, but God guides whom He wills. Any charity you give is for your own good. Any charity you give shall be for the sake of God. Any charity you give will be repaid to you in full, and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not upon you, [O Muhammad], is [responsibility for] their guidance, but Allah guides whom He wills. And whatever good you [believers] spend is for yourselves, and you do not spend except seeking the countenance of Allah. And whatever you spend of good - it will be fully repaid to you, and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:272] When the Prophet (s) was prohibited from giving voluntary alms to idolaters [as an incentive] for them to embrace Islam, the following was revealed: You are not responsible for guiding them, that is to say, for people, that they should embrace Islam, [you are responsible] only for conveying the Message [to them]; but God guides, with His guidance, whomever He will, to embrace Islam. And whatever good, property, you expend is for yourselves, since the reward is for you; for then you are expending, desiring only God’s Face (this clause is the predicate, denoting a prohibition), that is to say, His reward and not any other transient object of this world, and whatever good you expend, its requital, shall be repaid to you in full, and you will not be wronged, you will not suffer any diminishment of it (both [of the last two] sentences emphasise the first one).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah gave dispensation to give alms to the poor among the idolaters and the people of the Book. Asma' the daughter of Abu Bakr, or Asma' the daughter of Abu'l-Nadir asked the Prophet: Messenger of Allah! Is it permissible to give alms to our relatives who do not follow our Religion? Allah answered His Prophet by saying: (The guiding of them is not thy duty (0 Muhammad)) it is not your duty to guide to Religion the poor from among the people of the Book, (but Allah guideth whomever He will) to His religion. (And whatsoever good thing) wealth (ye spend) on the poor, (it is for yourselves) its reward is for yourselves, (when ye spend) on the poor do (not) do so (save in search of Allah's Countenance) except in seeking Allah's pleasure; (and whatsoever good thing) wealth (ye spend) on the poor among the folk of the Platform, (it will be repaid to you in full) the reward of it will be saved for you in the Hereafter, (and ye will not be wronged) your reward shall not be diminished and your sins will not be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مخاطباً لنبيه كلاماً خالياً عن السترة، ناشئاً عن عين الحكمة: { لَّيْسَ عَلَيْكَ } يا أكمل الرسل { هُدَاهُمْ } أي: أن تجعلهم مهديين إلى طريق الحق، بل ما عليك إلا الإرشاد والتنبيه على مسالك التوحيد، والترغيب على محاسن الأوامر المتعلقة به، والترهيب عن مفاتح المناهي المنافية له { وَلَـٰكِنَّ ٱللَّهَ } الهادي للكل { يَهْدِي } بتوفيقه { مَن يَشَآءُ } من عباده إلى صراطه لتوصلهم إلى بابه { وَ } قل لهم يا أكمل الرسل نيابة عنا: { مَا تُنْفِقُواْ مِنْ خَيْرٍ } صدقة أو نذر { فَلأَنْفُسِكُمْ } أي: فهو لكم ونفعاه من نفعكم وانتفاعكم\n\n\n\n\n{ وَ } قل لهم أيضاً: خير إنفاقكم أنكم { مَا تُنْفِقُونَ } شيئاً { إِلاَّ ٱبْتِغَآءَ وَجْهِ ٱللَّهِ } طالباً لرضاه، شاكراً لنعمه، عارياً عما يشغلكم عن الحق، مائلاً عن مطلق الجزاء؛ إذ لا جزاء أعظم من مطالعة وجهه الكريم { وَ } اعلموا أن { مَا تُنْفِقُواْ مِنْ خَيْرٍ } على هذه الوجه { يُوَفَّ إِلَيْكُمْ } جزاؤه فوق ما يصفه ألسنة مصنوعاته أو يدرك عقولهم { وَأَنْتُمْ لاَ تُظْلَمُونَ } [البقرة: 272] لا تنقصون وتخسرون في هذه المعاملة مع الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لَّيْسَ عَلَيْكَ هُدَاهُمْ وَلَـٰكِنَّ ٱللَّهَ يَهْدِي مَن يَشَآءُ\n\n\n }  يقول الحقّ جلّ جلاله: لنبيه عليه الصلاة والسلام: { ليس عليك } يا محمد { هداهم } أي: لا يجب عليك أن تخلق الهداية في قلوبهم، وليس من شأنك ذلك، إنما أنت نذير تدلُّ على الخير، كالنفقة وغيرها، وتنهى عن الشر كالمِّن والأذى، وإنفاق الخبيث، وغير ذلك من المساوئ { ولكن الله يهدي من يشاء } بفضله وإحسانه، فالأمور كلها بيد الله خيرها وشرها، لكن من جهة الأدب\n\n[النِّساء: 79]\n وبالله التوفيق\n الإشارة: ما قيل في الرسول - عليه الصلاة والسلام - يقال في ورثته من أهل التذكير، فليس بيدهم الهداية والتوفيق، وإنما شأنهم الإرشاد وبيان الطريق، فليس من شأن الدعاة إلى الله الحرص على هداية الخلق\n وإنما من شأنهم بيان الحقّ\n\n",
      "translations": []
    }
  ]
}