{
  "chapter": "البقرة",
  "text": "الذين ياكلون الربوا۟ لا يقومون الا كما يقوم الذى يتخبطه الشيطن من المس ذلك بانهم قالوا۟ انما البيع مثل الربوا۟ واحل الله البيع وحرم الربوا۟ فمن جاءه موعظة من ربه فانتهى فله ما سلف وامره الى الله ومن عاد فاو۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "Those who live on usury will not rise (on Doomsday) but like a man possessed of the devil and demented. This because they say that trading is like usury. But trade has been sanctioned and usury forbidden by God. Those who are warned by their Lord and desist will keep (what they have taken of interest) already, and the matter will rest with God. But those who revert to it again are the residents of Hell where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who devour interest become like the one whom Satan has bewitched and maddened by his touch. They have been condemned to this condition because they say, \"Trade is just like interest\", whereas Allah has made trade lawful and interest unlawful. Henceforth, if one abstains from taking interest after receiving this admonition from his Lord, no legal action will be taken against him regarding the interest he had devoured before; his case shall ultimately go to Allah. But if one repeats the same crime after this,. he shall go to Hell, where he shall abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who take unlawful interest will stand before God (on the Day of Judgment) as those who suffer from a mental imbalance because of Satan's touch; they have said that trade is just like unlawful interest. God has made trade lawful and has forbidden unlawful interest. One who has received advice from his Lord and has stopped committing sins will be rewarded for his previous good deeds. His affairs will be in the hands of God. But one who turns back to committing sins will be of the dwellers of hell wherein he will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour usury will not stand up on the Day of Judgement, except like the one whom an evil jinn has deranged by his touch; that is because they said, “Trade is also like usury!”; whereas Allah has made trading lawful and forbidden usury; for one to whom the guidance has come from his Lord, and he refrained therefrom, is lawful what he has taken in the past; and his affair is with Allah; and whoever continues earning it henceforth, is of the people of fire; they will remain in it for ages.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who eat Riba will not stand (on the Day of Resurrection) except like the standing of a person beaten by Shaytan leading him to insanity. That is because they say: \"Trading is only like Riba,\" whereas Allah has permitted trading and forbidden Riba. So whosoever receives an admonition from his Lord and stops eating Riba, shall not be punished for the past; his case is for Allah (to judge); but whoever returns (to Riba), such are the dwellers of the Fire ـ they will Abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who swallow down usury cannot arise except as one whom Shaitan has prostrated by (his) touch does rise. That is because they say, trading is only like usury; and Allah has allowed trading and forbidden usury. To whomsoever then the admonition has come from his Lord, then he desists, he shall have what has already passed, and his affair is in the hands of Allah; and whoever returns (to it)-- these are the inmates of the fire; they shall abide in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour usury shall not rise again except as he rises, whom Satan of the touch prostrates; that is because they say, 'Trafficking (trade) is like usury.' God has permitted trafficking, and forbidden usury. Whosoever receives an admonition from his Lord and gives over, he shall have his past gains, and his affair is committed to God; but whosoever reverts -- those are the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who swallow usury cannot rise up save as he ariseth whom the devil hath prostrated by (his) touch. That is because they say: Trade is just like usury; whereas Allah permitteth trading and forbiddeth usury. He unto whom an admonition from his Lord cometh, and (he) refraineth (in obedience thereto), he shall keep (the profits of) that which is past, and his affair (henceforth) is with Allah. As for him who returneth (to usury) - Such are rightful owners of the Fire. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who live on usury shall rise up before God like men whom Satan has demented by his touch; for they say, \"Buying and selling is only a kind of usury.\" But God has made trade lawful and made usury unlawful. Therefore, he who desists because of the admonition that has come to him from his Lord may retain what he has received in the past; and it will be for God to judge him. Those who revert to it shall be the inmates of the Fire; they shall abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour Usury Shall not be able to stand except standeth one whom the Satan hath confounded with his touch. That shall be because they say: bargaining is but as usury whereas Allah hath allowed bargaining and hath forbidden usury. Wherefore Unto whomsoever an exhortation cometh from his Lord, and he desisteth, his is that which is past, and his affair is with Allah. And whosoever returnoth --such shall be the fellows of the Fire, therein they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who exact usury will not stand but like one deranged by the Devil’s touch. That is because they say, ‘Trade is just like usury.’ While Allah has allowed trade and forbidden usury. Whoever relinquishes [usury] on receiving advice from his Lord shall keep [the gains of] what is past, and his matter will rest with Allah. As for those who resume, they shall be the inmates of the Fire and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour usury will not stand except as stand one whom the Evil one by his touch Hath driven to madness. That is because they say: \"Trade is like usury,\" but Allah hath permitted trade and forbidden usury. Those who after receiving direction from their Lord, desist, shall be pardoned for the past; their case is for Allah (to judge); but those who repeat (The offence) are companions of the Fire: They will abide therein (for ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who eat Riba (usury) will not stand (on the Day of Resurrection) except like the standing of a person beaten by Shaitan (Satan) leading him to insanity. That is because they say: \"Trading is only like Riba (usury),\" whereas Allah has permitted trading and forbidden Riba (usury). So whosoever receives an admonition from his Lord and stops eating Riba (usury) shall not be punished for the past; his case is for Allah (to judge); but whoever returns [to Riba (usury)], such are the dwellers of the Fire - they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consume usury shall not rise up (from their tomb) except as he who rises in madness that satan has touched. That is because they say: 'Selling is like usury' Allah has permitted trading and forbidden usury. To whomsoever an exhortation comes from his Lord then he desists, he shall have his past gains, and his matter is with Allah. But whoever reverts shall be among the people of the Fire and shall remain in it for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who swallow usury will not rise, except as someone driven mad by Satan's touch. That is because they say, “Commerce is like usury.” But God has permitted commerce, and has forbidden usury. Whoever, on receiving advice from his Lord, refrains, may keep his past earnings, and his case rests with God. But whoever resumes—these are the dwellers of the Fire, wherein they will abide forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consume interest cannot stand [on the Day of Resurrection] except as one stands who is being beaten by Satan into insanity. That is because they say, \"Trade is [just] like interest.\" But Allah has permitted trade and has forbidden interest. So whoever has received an admonition from his Lord and desists may have what is past, and his affair rests with Allah. But whoever returns to [dealing in interest or usury] - those are the companions of the Fire; they will abide eternally therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:275] Those who devour, that is, [those who] seize by way of, usury, which is an excess [levied] in transactions of money or foodstuffs either on their value or on credit, shall not rise again, from their graves, except, rising, as one whom Satan has made prostrate, demented, from touch, [through] madness (min al-mass, ‘from touch’, is semantically connected to yaqūmūna, ‘they rise’); that, which befalls them, is because, of the fact that, they say, ‘Trade is like usury’, in terms of permissibility: this [statement] is a type of reversed simile used for intensity [sc. ‘usury is like trade’ is the expected word order]. God responds to them saying that: God has permitted trade, and forbidden usury. Whoever receives an admonition from his Lord and desists, from devouring it, he shall have his past gains, those made before the prohibition and which cannot be reclaimed from him, and his affair, with regard to pardoning him, is committed to God; but whoever reverts, to devouring it, treating it like trade in terms of lawfulness — those are the inhabitants of the Fire, abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the punishment of consuming usury, saying: (Those who swallow usury) declaring it to be lawful (cannot rise up) from their graves on the Day of Judgement (save as he ariseth) in the life of this world (whom the Devil hath prostrated) confounded (by (his) touch) of insanity. (That) confusion is, in the Hereafter, the sign of the one who consumes usury (is because they say: Trade is just like usury) increase at 48 the end of selling, once the term is due, is like the increase at the beginning of a transaction when the sale is deferred; (whereas Allah permitteth trading) the former increase (and forbideth usury) the latter increase. (He unto whom and admonition from his Lord cometh) a prohibition of usury comes from his Lord, (and (he) refraineth (in obedience thereto)) from dealing in usury, (he shall keep (the profit) that which is past) he shall not be blamed for his dealing in usury before it was made unlawful, (and his affair (henceforth)) in what remains of his life (is with Allah) if He wishes He will protect him and if He wishes He will let him down. (As for him who returneth (to usury)) after usury has been made forbidden and says trade is just like usury (-such are rightful owners of the Fire) the dwellers of hell. (They will abide therein) they will abide therein until Allah wills.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيْطَانُ مِنَ ٱلْمَسِّ } فالمسُ: الجُنونُ\n\n\n\n\nوقولهُ تعالى: { فَلَهُ مَا سَلَفَ } معناه مَا مَضى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبشر أيضاً يا أكمل الرسل { ٱلَّذِينَ يَأْكُلُونَ ٱلرِّبَٰواْ } وهو تنمية المال بأخس الطرق، والإضرار بأخيه المسلم، وإتلاق ماله مجاناً بلا رعاية غبطة بأنهم { لاَ يَقُومُونَ } في البعث { إِلاَّ كَمَا يَقُومُ } الشخص { ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيْطَانُ مِنَ ٱلْمَسِّ } في النوم، كيف يقوم صرعى حيارى، مضطرباً منتهكاً مشوشاً هائلاً بلا سبب { ذَلِكَ } الأمر الفظيع الهائل { بِأَنَّهُمْ قَالُوۤاْ إِنَّمَا ٱلْبَيْعُ } في التنيمة { مِثْلُ ٱلرِّبَٰواْ } وهم يسوون بين البيع والربا { وَ } الحال أنه { أَحَلَّ ٱللَّهُ ٱلْبَيْعَ } لأن غبطة المشتري مرعي فيه حالاً ومآلاً، وهو يرضاه بلا اضطرار، بخلاف الربا فإن غبطة الآخذ غير مرعية فيه، بل إنما ارتكبه اضطراراً { وَ } لذلك { حَرَّمَ } الله العليم الحكيم { ٱلرِّبَٰواْ } لئلا يتلف أموال المسلمين مجاناً بلا عوض ولا رضا { فَمَن جَآءَهُ } بلغه { مَوْعِظَةٌ } قبل { مِّنْ رَّبِّهِ } في أثناء ما يربو به { فَٱنْتَهَىٰ } نفسه بإسماعها في الربا { فَلَهُ مَا سَلَفَ } أخذ وقبل الموعظة لا يسترده الشرع { وَأَمْرُهُ } مفوض { إِلَى ٱللَّهِ } يجازيه على الانتهاء إن كان من أهل القبول والإنابة، ويعاق عليها إن كان من أهل التزلزل والاضطراب { وَمَنْ عَادَ } بعدما سمع وانتهى { فَأُوْلَـٰئِكَ أَصْحَابُ ٱلنَّارِ هُمْ فِيهَا خَالِدُونَ } [البقرة: 275] دائمون مستمرون ما شاء الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الربا } في الأصل: هو الزيادة، رَبا المال يربو: زاد\n وكتبت بالواو مراعاة للأصل، وهو المصدر، قال الفراء: إنما كتبوه بالواو لأن أهل الحجاز تعلموا الكتابة من أهل الحيرة، ولغتهم الربو، فعلموهم صورة الحروف، وكذلك قرأها أبو السمال العدوي، وقرأ الأخَوَان بالإمالة لمكان الكسرة، والباقون بالتفخيم\n والربا في اصطلاح الشرع على قسمين: ربا الفضل وربا النِّسَاءِ، فأما ربا الفضل فهو التفاضل بين الطعامين أو النقدين في المبادلة من الجنس الواحد، فإن اختلفت الأجناس فلا حرج، وأما ربا النساء فهو بيع الطعامين أو النقدين بعضهما ببعض بالتأخير، وهذا حرام ولو اختلفت الأجناس\n يقول الحقّ جلّ جلاله: { الذين يأكلون الربا } أي: يأخذونه، وإنما خص الأكل لأنه أعظم منافع المال، { لا يقومون } من قبورهم يوم البعث { إلا كما يقوم } المجنون { الذي يتخبطه الشيطان من } أجل { المس } الذي يمسه يقوم ويسقط، رُوِيَ أن بطونهم تكون أمامهم كالبيت الضخم، يقوم أحدهم فتميل به بطنه فيصرع، وعن أبي هريرة رضي الله عنه أنه قال: قال رسول الله صلى الله عليه وسلم:\n\n \" لما أُسْرِيَ بِي إلى السماء رأيتُ رِجالاً بُطُونُهُمْ كَالبُيوتِ، فيهَا حَيَّاتٌ تُرى مِنْ خِارِجِ بُطُونِهمْ، فقلت مَنْ هؤلاءِ يا جِبْرِيل؟ فقال: أكَلَةُ الرِّبا \"\n \n\nذلك العذاب بسبب أنهم استحلُّوا الربا، و { قالوا إنما البيع مثل الربا } فنظموا الربا والبيع في سلك واحد، وفيه عكس التشبيه\n والأصل: إنما الربا مثل البيع، قصدوا المبالغة، كأنهم جعلوا الربا أصلاً وقاسوا عليه البيع\n وذلك أن أهل الجاهلية كان أحدهم إذا حلّ ماله على غريمه يقول الغريم: زدني في الأجل أزدك في المال، فيفعلان، ويقولان: سواء علينا الزيادة في أول البيع بالربح أو عند محل الدين، هو مراضاة فكذبهم الحقّ تعالى بقوله: { وأحلّ الله البيع وحرّم الربا } لأن القياس مع وجود النص فاسد، والفرق ظاهر فإن من باع درهماً بدرهمين ضيع درهماً من غير فائدة، بخلاف من اشترى سلعة بدرهم، وباعها بدرهمين، فلعل مساس الحاجة، والرغبة فيها، توقع رواجها فيجبر الغبن\n { فمن جاءه موعظة من ربه } كالنهي عن الربا { فانتهى } وترك الربا { فله ما سلف } قبل التحريم ولا يَرُدُّهُ، { وأمره إلى الله } لا إلى أحد منكم، فلا يتعرض له، { ومن عاد } إلى تحليل الربا بعد بلوغه النهي { فأولئك أصحاب النار هم فيها خالدون } لأنهم كفروا وسفهوا أمر الله\n { ويمحق الله الربا } أي: يذهب بركته، ويُهلك المال الذي يدخل فيه { ويربي الصدقات } أي: يضاعف ثوابها ويُبارك في المال الذي أخرجت منه، فقد رُوِيَ عنه - عليه الصلاة والسلام - أنه قال:\n\n \" ما نَقَصَ مالٌ مِنْ صَدقة \" \n\n \" وأنه يُربي الصدقةَ حتى تكونَ مثلَ الجبل \" \n",
      "translations": []
    }
  ]
}