{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ اتقوا۟ الله وذروا۟ ما بقى من الربوا۟ ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "O believers, fear God and forego the interest that is owing, if you really believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, fear Allah and give up that interest which is still due to you, if you are true Believers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God and give up whatever unlawful interest you still demand from others, if you are indeed true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear Allah and forego the remaining usury, if you are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Have Taqwa of Allah and give up what remains from Riba, if you are (really) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be careful of (your duty to) Allah and relinquish what remains (due) from usury, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fear you God; and give up the usury that is outstanding, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Observe your duty to Allah, and give up what remaineth (due to you) from usury, if ye are (in truth) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God, and give up what is still due to you from usury, if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O O Ye who believe: fear Allah and leave that which remainoth of usury if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be wary of Allah and abandon [all claims to] what remains of usury, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fear Allah, and give up what remains of your demand for usury, if ye are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be afraid of Allah and give up what remains (due to you) from Riba (usury) (from now onward), if you are (really) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear Allah and give up what is still due to you from usury, if you are believers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fear God, and forgo what remains of usury, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fear Allah and give up what remains [due to you] of interest, if you should be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:278] O you who believe, fear God, and give up, abandon, the usury that is outstanding, if you are believers, true to your faith, since it is expected of the believer that he adhere to God’s command: this was revealed when some of the Companions, after the prohibition, wanted to reclaim some of the usury from before.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) the reference here is to the sons of 'Amr Ibn 'Umayr Ibn 'Awf al-Thaqafi, [and they were four brothers:] Mas'ud [Ibn 'Amr], Hubayb [Ibn 'Amr], 'Abd Yalayl [Ibn 'Amr] and Rabi'ah [Ibn 'Amr] (observe your duty to Allah) fear Allah regarding usury, (and give up what remaineth (due to you) from usury) leave that which the Banu Makhzum owe you of usury, (if ye are (in truth) believers) if you really believe in the prohibition of usury.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱتَّقُواْ ٱللَّهَ } أي: مقتضى إيمانكم اختيار التقوى والعزيمة الخالصة في جميع الأعمال المأمورة لكم، والاجتناب عن الرخص فيها { وَذَرُواْ } اتركوا { مَا بَقِيَ } لكم { مِنَ ٱلرِّبَٰواْ } عند الغرماء { إِن كُنْتُمْ مُّؤْمِنِينَ } [البقرة: 278] موقنين بحرمة الربا وسر حرمته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يا أيها الذين آمنوا اتقوا الله وذروا ما بقي من الربوا } أي: اتركوا بقايا ما شرطتم على الناس من الربا، فلا تقبضوها منهم، { إن كنتم مؤمنين }\n فإن دليل الإيمان: امتثال ما أمرتم به، رُوِيَ أنه كان لثقيف مال على بعض قريش، فطالبوهم عند الحَلِّ بالمال والربا، فنزلت الآية",
      "translations": []
    }
  ]
}