{
  "chapter": "البقرة",
  "text": "فان لم تفعلوا۟ فاذنوا۟ بحرب من الله ورسوله وان تبتم فلكم رءوس امولكم لا تظلمون ولا تظلمون",
  "translations": [
    {
      "translation": "If you do not, beware of war on the part of God and His Apostle. But if you repent, you shall keep your principal. Oppress none and no one will oppress you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if you do not do so, then you are warned of the declaration of war against you by Allah and His Messenger. If, however, you repent even now (and forego interest), you are entitled to your principal; do no wrong, and no wrong will be done to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you will not give up the unlawful interest which you demand, know that you are in the state of war with God and His Messenger. But if you repent, you will have your capital without being wronged or having done wrong to others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not, then be certain of a war with Allah and His Noble Messenger; and if you repent, take back your principal amount; neither you cause harm to someone, nor you be harmed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not do it, then take a notice of war from Allah and His Messenger but if you repent, you shall have your capital sums. Deal not unjustly, and you shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do (it) not, then be apprised of war from Allah and His Apostle; and if you repent, then you shall have your capital; neither shall you make (the debtor) suffer loss, nor shall you be made to suffer loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you do not, then take notice that God shall war with you, and His Messenger; yet if you repent, you shall have your principal, unwronging and unwronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye do not, then be warned of war (against you) from Allah and His messenger. And if ye repent, then ye have your principal (without interest). Wrong not, and ye shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, if you do not do so, then know that you are at war with God and His Messenger. But if you repent, you may retain your capital. Do not wrong [others] and you will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye will do it not, then be apprised of war from Allah and His apostle. And if ye repent, then yours shall be your capital sums; ye shall neither wrong nor be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not, then be informed of a war from Allah and His apostle. And if you repent, then you will have your principal, neither harming others, nor suffering harm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye do it not, Take notice of war from Allah and His Messenger: But if ye turn back, ye shall have your capital sums: Deal not unjustly, and ye shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not do it, then take a notice of war from Allah and His Messenger but if you repent, you shall have your capital sums. Deal not unjustly (by asking more than your capital sums), and you shall not be dealt with unjustly (by receiving less than your capital sums).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if you do not, then take notice of war from Allah and His Messenger. Yet, if you repent, you shall have the principal of your wealth. Neither will you harm nor will you be harmed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not, then take notice of a war by God and His Messenger. But if you repent, you may keep your capital, neither wronging, nor being wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not, then be informed of a war [against you] from Allah and His Messenger. But if you repent, you may have your principal - [thus] you do no wrong, nor are you wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:279] But if you do not, do what you have been commanded, then be warned, have knowledge, of war from God, and His Messenger, against you: herein is a grave threat for them. When it was revealed, they said, ‘What power can we have in a war against Him!’ Yet if you repent, and forgo it, you shall have your principal sums, the original amounts, not being unjust, by charging interest, and no injustice being done to you, by way of any diminution.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye do not) if you do not abstain from usury, (then be warned of war (against you) from Allah and His Messenger) then be ready for a torment from God in the Hereafter by means of the Fire and its chastisement and also be ready for the sword from His Messenger in the life of this world. (And if ye repent) from usury, (then ye have your principal (without interest)) that is owed to you by the Banu Makhzum. (Wrong not) anyone by demanding interest, (and ye shall not be wronged) by anyone if they give you back your capitals; it is also said that 'wrong not' means: do not harm others; and 'you shall not be wronged' meaning: you shall not be harmed because of your debts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَأْذَنُواْ بِحَرْبٍ مِّنَ ٱللَّهِ وَرَسُولِهِ } معناه أَخْبَروا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن لَّمْ تَفْعَلُواْ } ولم تمتثلوا بما أُمروا، ولم يتيقنوا لسر ما مُنعوا منه { فَأْذَنُواْ } انتظروا واعلموا { بِحَرْبٍ } عظيم نازل { مِّنَ ٱللَّهِ } المتجلي باسم المنتقم { وَرَسُولِهِ } التابع له المتخلق بأخلاقه { وَإِنْ تُبْتُمْ } من الارتباء والإنماء على هذا الطريق الأخس الأخبث { فَلَكُمْ } في دينكم { رُؤُوسُ أَمْوَٰلِكُمْ لاَ تَظْلِمُونَ } بأخذ الزيادة وإتلاف مال الغريم بلا عوضٍ { وَلاَ تُظْلَمُونَ } [البقرة: 279] تتضررون بالمطل والتسويف وتعويق الأداء وتأخيرها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإن لم تفعلوا } وتتركوا ما نهيتم عنه، { فأذنوا } أي: فاعلموا { بحرب من الله ورسوله } ومن قرأ: { فآذنوا } بالمد، فمعناه: أعلموا بها غيركم، رُوِيَ أنها لما نزلت، قالت ثقيف: لا يَدَانِ لنا بحرب الله ورسوله\n { وأن تبتم } من تعاطي الربا واعتقاد حله { فلكم رؤوس أموالكم لا تظلمون } الغريم بأخذ الزيادة، { ولا تظلمون } بنقص رأس مالكم\n مفهومه أن لم يتب فليس له شيء، لأنه مرتد\n والله تعالى أعلم\n الإشارة: مدار صفاء المعاملة على تصفية اللقمة، فمن صفَّا طعمته صفت معاملته، ومن صفت معاملته أفضى الصفاء إلى قلبه، ومن خلط في لقمته تكدرت معاملته، ومن تكدرت معاملته تكدر قلبه، ولذلك قال بعضهم: مَنْ أكَلَ الحلال أطاع الله، أحبَّ أم كَرِهَ، ومن أكل الحرام: عصى الله، أحبَّ أم كَرِه وكذلك الواردات الإلهية، لا ترد إلا على من صفا مطعمه ومشربه، ولذلك قال بعضهم: من لا يعرف ما يدخل بطنه لا يفرق بين الخواطر الربانية والشيطانية\n وقال سيدي علي الخواص رضي الله عنه: اعلم أن المدد الذي لم يزل فياضاً على قلب كل إنسان ويتلون بحسب القلب، والقلب يتلون بحسبه هو بحسب صلاح الطعمة وفسادها\n هـ\n فالذين يأكلون الحرام كالربا وشبهه، ولا يقومون إلى معاملتهم للحق إلا كما يقوم المجنون الذي يلعب به الشيطان، ولا يدري ما يقول ولا ما يقال له، فقد حُرم لذيذ المناجاة وحلاوة خلوص المعاملات، فإن احتج لنفسه واستعمل القياس لم يُرْجَ فلاحُه في طريق الخواص، فمن جاءه موعظة من ربه فانتهى، وطلب العفاف فقد عفا الله عما سلف\n ومن عاد إلى ما خرج عنه من متابعة هواه، فنار القطيعة مثواه ومأواه\n ومن شأن الحق جلّ جلاله مع عباده: أن من طلب الزيادة في حس ظاهره محق الله نور باطنه، ومن حسم مادة زيادة الحس في ظاهره قوي الله مدد الأنوار في باطنه،\n\n[البقرة: 276]، أي: يُقَوِّي مدد ثواب الصدقات\n\n\n[البقرة: 276]، وإنما يحب كل مطيع منيب، وهو من آمن إيمان أهل التحقيق، وسلك أهل التوفيق\n فلا جرم أنه ينخرط في سلك أهل العناية، ويسلك به مسلك أهل الولاية، الذين\n",
      "translations": []
    }
  ]
}