{
  "chapter": "البقرة",
  "text": "للفقراء الذين احصروا۟ فى سبيل الله لا يستطيعون ضربا فى الارض يحسبهم الجاهل اغنياء من التعفف تعرفهم بسيمهم لا يسـلون الناس الحافا وما تنفقوا۟ من خير فان الله به عليم",
  "translations": [
    {
      "translation": "(Give to) the needy who are engaged in the service of God who are not able to move about in the land, whom the ignorant consider to be affluent as they refrain from asking. You can know them from their faces for they do not ask of men importunately. God is surely cognisant of good things that you spend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are engaged so much in the cause of Allah that they cannot move about in the land to earn their livelihood and are, therefore, in straitened circumstances, specially deserve help. An ignorant person would suppose them to be well off because of their self-respect; you can know their real condition from their faces, for they are not the ones who would beg of people with importunity. And Allah will surely know whatever you will spend on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If the recipients of charity are) the poor whose poverty, because of their striving for the cause of God, has become an obstacle for them, and who do not have the ability to travel in the land, they seem rich compared to the ignorant, because of their modest behavior. You would know them by their faces. They would never earnestly ask people for help. God knows well whatever wealth you spend for the cause of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Spend) For the poor who are restricted while in Allah's cause, who cannot travel in the land (for earning) – the unwise think they are wealthy because of their restraint; you will recognise them by their faces; they do not seek from people in order to avoid grovelling; and Allah knows whatever you spend in charity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Charity is) for Fuqara' (the poor), who in Allah's cause are restricted (from travel), and cannot move about in the land (for trade or work). The one who knows them not, thinks that they are rich because of their modesty. You may know them by their mark, they do not beg of people at all. And whatever you spend in good, surely Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Alms are) for the poor who are confined in the way of Allah-- they cannot go about in the land; the ignorant man thinks them to be rich on account of (their) abstaining (from begging); you can recognise them by their mark; they do not beg from men importunately; and whatever good thing you spend, surely Allah knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it being for the poor who are restrained in the way of God, and are unable to journey in the land; the ignorant man supposes them rich because of their abstinence, but thou shalt know them by their mark -- they do not beg of men importunately. And whatever good you expend, surely God has knowledge of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Alms are) for the poor who are straitened for the cause of Allah, who cannot travel in the land (for trade). The unthinking man accounteth them wealthy because of their restraint. Thou shalt know them by their mark: They do not beg of men with importunity. And whatsoever good thing ye spend, lo! Allah knoweth it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The needy, who are too engrossed in God's cause to be able to travel about the land in search of a livelihood, are considered by those who are unaware of their condition to be free from want, because they refrain from begging. But they can be known from their appearance. They do not make insistent demands upon people. Whatever wealth you spend, God knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms are for the poor who are restricted in the way of Allah, disabled from going about in the land. The (unknowing taketh them for the affluent because of their modesty thou I wouldst recognise them by their appearance: they ask not of men with importunity. And whatsoever ye shall expend of good, verily Allah is thereof Knower\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The charities are] for the poor who are straitened in the way of Allah, not capable of moving about in the land [for trade]. The unaware suppose them to be well-off because of their reserve. You recognize them by their mark; they do not ask the people importunately. And whatever wealth you may spend, Allah indeed knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Charity is) for those in need, who, in Allah's cause are restricted (from travel), and cannot move about in the land, seeking (For trade or work): the ignorant man thinks, because of their modesty, that they are free from want. Thou shalt know them by their (Unfailing) mark: They beg not importunately from all the sundry. And whatever of good ye give, be assured Allah knoweth it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Charity is) for Fuqara (the poor), who in Allah's Cause are restricted (from travel), and cannot move about in the land (for trade or work). The one who knows them not, thinks that they are rich because of their modesty. You may know them by their mark, they do not beg of people at all. And whatever you spend in good, surely Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Charity is) for the poor who are restrained in the way of Allah, and are unable to journey in the land. The ignorant take them to be rich because of their abstinence. But you can recognize them by their signs. They do not persistently beg people. Whatever good you give is known to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for the poor; those who are restrained in the way of God, and unable to travel in the land. The unaware would think them rich, due to their dignity. You will recognize them by their features. They do not ask from people insistently. Whatever charity you give, God is aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Charity is] for the poor who have been restricted for the cause of Allah, unable to move about in the land. An ignorant [person] would think them self-sufficient because of their restraint, but you will know them by their [characteristic] sign. They do not ask people persistently [or at all]. And whatever you spend of good - indeed, Allah is Knowing of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:273] For the poor (this is the predicate of the missing subject, al-sadaqāt, ‘voluntary almsgiving’), who are constrained in the way of God, those who have confined themselves [in preparation] for the struggle: this was revealed concerning the people of Suffa, consisting in some four hundred of the Emigrants (muhājirūn), set apart [from the other Muslims] for the study of the Qur’ān and to take part in raids; and they are unable to journey (darban, means safaran) in the land, to engage in commerce and earn their living, since they are fully engaged in the struggle; the ignorant man supposes them, on account of the way they behave, rich because of their abstinence, that is, their refraining from asking for things; but you, the one being addressed, shall know them by their mark, by the signs of their humility and exertion; they do not beg of men, and make urgent demands, importunately, that is to say, they do not beg in the first place, so there is no question of persistence. And whatever good you expend, surely God has knowledge of it, and will requite it accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Alms are) for the poor who are straitened) He says: alms are for those who confine themselves (for the cause of Allah) for the obedience of Allah in the Prophet's Mosque, i.e. the people of the Ledge, (who cannot travel in the land) for trade. (The unthinking man) the person who does not know them (accounteth them wealthy due to their restraint) because of their attire. (Thou shalt know them) Muhammad! (by their mark) by their clothing: (They do not beg of men with importunity) He says: they neither beg with importunity nor without it. (And whatsoever good thing) wealth (ye spend) on the poor among the people of the Ledge, (lo! Allah knoweth it) Allah knows your wealth as well as your intentions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَ يَسْأَلُونَ ٱلنَّاسَ إِلْحَافاً } معناهُ إِلحاحٌ\n معناهُ كانُوا لا يَسأَلونَ النَّاسَ إِلحَافاً وَلاَ غيرَ إِلحافٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ للفقراء } أي: اقصدوا بصدقاتكم الفقراء { الذين } أحصرهم المجاهدة { في سبيل الله }  { لا يستطيعون ضرباً في الأرض } للتجارة والكسب لاشتغالهم بالله واستغراقهم في الأحوال وصرف أوقاتهم في العبادات\n { يحسبهم الجاهل أغنياء من التعفف } عن السؤال والاستغناء عن الناس { تعرفهم بسيماهم } من صفرة وجوههم، ونور جباههم، وهيئة سحناتهم، أنهم عرفاء فقراء، أهل الله، لا يعرفهم إلا الله ومن هو منهم { لا يسألون الناس إلحَافاً } أي: إلحاحاً\n والمراد نفي مسئلة الناس بالكلية كقوله:\n\nوالمراد نفي المنار والاهتداء جميعاً، أو نفي الإلحاف وإثبات التعطف في المسألة\n { وما تنفقوا من خيرٍ } على أيّ من أنفقتم، غنياً كان أو فقيراً { فإنّ الله به عليم } أي: بأن ذلك الإنفاق له أو لغيره، فيجازي بحسبه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومتى عرفتم خير الإنفاق، فعليكم أن تعرفوا خير من ينفق إليه فاجعلوا إنفاقكم: { لِلْفُقَرَآءِ } العرفاء الأمناء { ٱلَّذِينَ أُحصِرُواْ } تمكنوا { فِي سَبِيلِ ٱللَّهِ } مشمرين للفناءفيه بحيث { لاَ يَسْتَطِيعُونَ } من غاية استغراقهم في مطالعة جماله { ضَرْباً فِي ٱلأَرْضِ } لطلب الرزق الصوري ومن غاية استغنائهم عن الدنيا وما فيها { يَحْسَبُهُمُ ٱلْجَاهِلُ } بحالهم { أَغْنِيَآءَ مِنَ } أجل { ٱلتَّعَفُّفِ } المرتكز في جبلتهم { تَعْرِفُهُم } وتنتبه على حالهم أيها المؤمنون المنفق لرضاء الله { بِسِيمَاهُمْ } من ضعف القوى ورثاثة الحال، وهم من غاية رجوعهم وركونهم عن الدنيا نحو المولى { لاَ يَسْأَلُونَ ٱلنَّاسَ إِلْحَافاً } إلماماً متمنين راجين بما عندهم، بل رزقهم الله المتجلي في الآفاق يرزقهم ن حيث لا يحتسب، وبعدما سمعتم أوصاف هؤلاء الوالهين في مطالعة جمال الله وجلاله، بادروا إلى تقوية مزاجهم ليسعدوا بالسعادة العظمى التي لا مرتبة أعلى منه { وَ } اعلموا أن { مَا تُنفِقُواْ مِنْ خَيْرٍ } خصوصاً لهؤلاء { فَإِنَّ ٱللَّهَ بِهِ } بذاته { عَلِيمٌ } [البقرة: 273] يجازيكم بمقتضى علمه\n\n\n\n\nربنا اجعلنا من خدامهم وتراب أقدامهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { للفقراء }: متعلق بمحذوف، أي: يعطي ذلك للفقراء، أو اجعلوا ما تنفقونه للفقراء، والإلحاف،: هو الإلحاح في السؤال، وهو أن يلازم المسؤول حتى يعطيه، وهو منصوب على المصدر أو الحال\n يقول الحقّ جلّ جلاله: تجعلون ما تنفقونه { للفقراء الذين أحصروا } أي: حبسوا أنفسهم في { سبيل الله } وهو الجهاد، { لا يستطيعون ضرباً في الأرض } أي: ذهاباً في الأرض للتجارة أو للأسباب، بل شغلهم الجهاد والتبتل للعبادة عن الأسباب، وهم أهل الصُّفَّة، كانوا نحواً من أربعمائة من فقراء المهاجرين، يسكنون صفة المسجد، يستغرقون أوقاتهم في العلم والذكر والعبادة، وكانوا يخرجون في كل سرية بعثها رسول الله صلى الله عليه وسلم\n قال ابن عباس رضي الله عنه: \" وقف النبيّ صلى الله عليه وسلم يوماً على أصحاب الصفة، فرأى فقرهم وجهدهم وطيب قلبوهم، فقال:\n\n \" أبشروا يا أصحاب الصفة، فمن بقي من أمتي على النعت الذي أنتم عليه، راضياً بما فيه فإنه، من رفقائي \"\n \n\nوقيل: المراد الفقراء مطلقاً، حصرهم الفقر عن الضرب في الأرض للتجارة، { يحسبهم الجاهل } بهم { أغنياء من التعفف } ، أي: من أجل تعففهم عن السؤال، { تعرفهم بسيماهم } من الضعف ورثاثة الحال\n الخطاب للرسول، أو لكل أحد { لا يسألون الناس إلحافاً } ، أي: لا يسألون، وإن سألوا عن ضرورة لم يلحوا، وقيل: نفي للأمرين معاً، ليس لهم سؤال، فيقع فيه إلحاف، كقول الشاعر:\n\nوليس ثَمَّ لا حب ولا منار، وإنما المراد نفيهما، وفي الحديث عنه صلى الله عليه وسلم:\n\n \" منْ سأَلَ، وله أربعونَ دِرهماً، فَقَدْ سأل إلحافاً \"\n \n\n{ وما تنفقوا من خير فإن الله به عليم } فيجازي على القليل والكثير، وهذا ترغيب في الإنفاق، وخصوصاً على هؤلاء\n الإشارة: ما أفلح من أفلح، وخسر مَنْ خسر، إلا من نفسه وفلسه، فمن جاد بهما، أو بأحدهما، فقد فاز وأفلح وظفر بما قصد، والجود بالنفس أعظم، وهو يستلزم الجود بالفلس، والجود بالفلس، إن دام، يوصل إل الجود بالنفس، والمراد بالجود بالنفس: إسلامها للشيخ يفعل بها ما يشاء، وتكون الإشارة فيها كافية عن التصريح، ومن بخل بهما أو بأحدهما، فقد خسر وخاب في طريق الخصوص، ومصرف ذلك هو الشيخ، أو الفقراء المنقطعون إلى الله الذي حصروا أنفسهم في سبيل الله، وهو الجهاد الأكبر\n قال في القوت: وكان بعض الفضلاء يؤثر بالعطاء فقراء الصوفية دون غيرهم، فقيل له في ذلك، فقال: لأن هؤلاء هممهم الله عزّ وجلّ، فإذا ظهر منهم فاقة تَشَتَّتَ قلبُ أحدِهم، فلأنْ أرد هِمة واحدٍ إلى الله أحب إليّ من أن أعطي ألفاً من غيرهم ممن همه الدنيا\n فذكر هذا الكلام لأبي القاسم الجنيد، فقال: هذا كلام ولي من أولياء الله\n\n\nثم قال: ما سمعت كلاماً أحسنَ من هذا\n وبلغني أن هذا الرجل اقتر حاله في أمر الدنيا حتى همّ بترك الحانوت فبعث إليه الجنيد بمال كان صرف إليه، وقال له: اجعل هذا في بضاعتك، ولا تترك الحانوت فإنَّ التجارة لا تضرُّ مثلك\n ويقال: إن هذا لم يكن يأخذ من الفقراء ثمن ما يبتاعون منه\n هـ\n وكان عبد الله بن المبارك يصرف مصروفه لأهل العلم، ويقول: إني لا أعرف بعد النبوة أفضل من العلماء، فإذا اشتغل قلب أحدهم بالحاجة والعيلة لم يتفرغ للعلم، ولا يقبل على تعليم الناس، فرأيت أن أكفيهم أمر الدنيا لأفرغهم للعلم، فهو أفضل\n هـ\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}