{
  "chapter": "البقرة",
  "text": "وما انفقتم من نفقة او نذرتم من نذر فان الله يعلمه وما للظلمين من انصار",
  "translations": [
    {
      "translation": "Whatsoever you give away in alms or vow as offering, is all known to God; but the wicked will have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows whatever you may have spent and whatever vow you may have made, and the wrong-doers (who spend in the way of Satan) shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows all about whatever you spend for His cause or any vows that you make. The unjust people have no helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you spend or pledge to do, Allah is aware of it; and the unjust do not have supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you spend for spendings (e.g., in Sadaqah) or whatever vow you make, be sure Allah knows it all. And for the wrongdoers there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever alms you give or (whatever) vow you vow, surely Allah knows it; and the unjust shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever expenditure you expend, and whatever vow you vow, surely God knows it. No helpers have the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever alms ye spend or vow ye vow, lo! Allah knoweth it. Wrong-doers have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you spend and whatever vows you make are known to God, but the wrongdoers shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever expense ye expend or whatever VOW ye vow, verily Allah knoweth it: and for the wrong doers there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed knows whatever charity you may give, or vows that you may vow, and the wrongdoers have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever ye spend in charity or devotion, be sure Allah knows it all. But the wrong-doers have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you spend for spendings (e.g., in Sadaqah - charity, etc. for Allah's Cause) or whatever vow you make, be sure Allah knows it all. And for the Zalimun (wrong-doers, etc.) there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you spend and whatever vows you make are known to Allah. The harmdoers shall have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever charity you give, or a pledge you fulfill, God knows it. The wrongdoers have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever you spend of expenditures or make of vows - indeed, Allah knows of it. And for the wrongdoers there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:270] And whatever expenditure you expend, be it as alms or a voluntary almsgiving, and whatever vow you make, and fulfil, surely God knows it, and will requite you for it. For the evildoers, who prevent almsgiving and vows, or expend other than the way they should, in disobedience to God, they have no helpers, to protect them from His chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whatever alms ye spend) for the sake of Allah (or vow ye vow) in obedience of Allah which you honour, (Lo! Allah knoweth it). Allah accepts it if it is solely for His Countenance as He also rewards for it. (Wrong- doers) those who ascribe partners to Allah (have no helpers) who can save them from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المؤمنون أن { مَآ أَنفَقْتُمْ مِّن نَّفَقَةٍ أَوْ نَذَرْتُمْ مِّن نَّذْرٍ } يؤدي على الإنفاق في سبيل الله { فَإِنَّ ٱللَّهَ } الناظر لعباده في كل الأمور { يَعْلَمُهُ } يعلمه الحضوري، ويجازي عليه بأضعافه { وَمَا لِلظَّالِمِينَ } المجاوزين عن حدوده، بمتابعة الشيطان المضل عن سبيل الله { مِنْ أَنْصَارٍ } [البقرة: 270] ينصرهم عند انتقام الله على ما صدر عنهم من الفسوق والعصيان، والتبذيرات الواقعة فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}