{
  "chapter": "البقرة",
  "text": "ءامن الرسول بما انزل اليه من ربه والمؤمنون كل ءامن بالله وملئكته وكتبه ورسله لا نفرق بين احد من رسله وقالوا۟ سمعنا واطعنا غفرانك ربنا واليك المصير",
  "translations": [
    {
      "translation": "The Prophet believes in what has been revealed to him by his Lord, and so do the faithful. Each one believes in God and His angels, His Books and the prophets, and We make no distinction between the apostles. For they say: \"We hear and obey, and we seek Your forgiveness, O Lord, for to You we shall journey in the end.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger has believed in the Guidance which has been sent down to him from his Lord, and those who believe in the Messenger have also sincerely accepted the same. They all believe in Allah, His Angels, His Books and Messengers. And they say, \"We do not discriminate against any of His Messengers. We have heard the Message and submitted to it. Our Lord, we look up to You for forgiveness, for to You we shall all return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers and the believers have faith in what was revealed to them from their Lord. Everyone of them believed in God, His angels, His Books, and His Messengers, saying, \"We find no difference among the Messengers of God.\" They also have said, \"We heard God's commands and obeyed them. Lord, we need Your forgiveness and to You we shall return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Noble Messenger believes in what has been sent down to him by his Lord, and so do the believers; all have accepted faith in Allah and His angels and His Books and His Noble Messengers; saying, “We do not make any distinction, in believing, between any of His Noble Messengers”; and they said, “We hear, and we obey; Your forgiveness be granted, O our Lord, and towards You is our return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger believes in what has been sent down to him from his Lord, and (so do) the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. (They say,) \"We make no distinction between one another of His Messengers ـ and they say, \"We hear, and we obey. (We seek) Your forgiveness, our Lord, and to You is the return (of all).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The apostle believes in what has been revealed to him from his Lord, and (so do) the believers; they all believe in Allah and His angels and His books and His apostles; We make no difference between any of His apostles; and they say: We hear and obey, our Lord! Thy forgiveness (do we crave), and to Thee is the eventual course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger believes in what was sent down to him from his Lord, and the believers; each one believes in God and His angels, and in His Books and His Messengers; we make no division between any one of His Messengers. They say, 'We hear, and obey. Our Lord, grant us Thy forgiveness; unto Thee is the homecoming.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The messenger believeth in that which hath been revealed unto him from his Lord and (so do) believers. Each one believeth in Allah and His angels and His scriptures and His messengers - We make no distinction between any of His messengers - and they say: We hear, and we obey. (Grant us) Thy forgiveness, our Lord. Unto Thee is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger believes in what has been sent down to him from his Lord, and [so do] believers. They all believe in God and His angels, His scriptures, and His messengers. They say, \"We do not differentiate between any of His messengers. We hear and obey. Grant us Your forgiveness, Lord, to You we shall all return!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The apostle believeth in that which is sent down Unto him from his Lord, and so do the believers. Each one believeth in Allah and His angels and His Books and His apostles, saying: we differentiate not between any of His apostles. And they say: we hearken and obey; Thy forgiveness, Our Lord! and Unto Thee is the return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Apostle and the faithful have faith in what has been sent down to him from his Lord. Each [of them] has faith in Allah, His angels, His scriptures and His apostles. [They declare,] ‘We make no distinction between any of His apostles.’ And they say, ‘We hear and obey. Our Lord, forgive us, and toward You is the return.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger believeth in what hath been revealed to him from his Lord, as do the men of faith. Each one (of them) believeth in Allah, His angels, His books, and His messengers. \"We make no distinction (they say) between one and another of His messengers.\" And they say: \"We hear, and we obey: (We seek) Thy forgiveness, our Lord, and to Thee is the end of all journeys.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger (Muhammad SAW) believes in what has been sent down to him from his Lord, and (so do) the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. They say, \"We make no distinction between one another of His Messengers\" - and they say, \"We hear, and we obey. (We seek) Your Forgiveness, our Lord, and to You is the return (of all).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger believes in what has been sent down to him from His Lord, and so do the believers. Each believes in Allah and His Angels, His Books, and His Messengers, we do not differentiate between any one of His Messengers. They say: 'We hear and obey. (We ask) Your forgiveness Lord, and to You is the arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger has believed in what was revealed to him from his Lord, as did the believers. They all have believed in God, and His angels, and His scriptures, and His messengers: “We make no distinction between any of His messengers.” And they say, “We hear and we obey. Your forgiveness, our Lord. To you is the destiny.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], \"We make no distinction between any of His messengers.\" And they say, \"We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:285] The Messenger, Muhammad (s) believes in, affirms the truth of, what was revealed to him from his Lord, namely, the Qur’ān, and the believers (wa’l-mu’minūna is a supplement to al-rasūlu, ‘the Messenger’); each one (the tanwīn of kullun stands in place of the second noun in an annexation [sc. kullu wāhidin]) believes in God and His angels, and in His Books, all of them and each of them, and His messengers, and they say, ‘we make no distinction between any of His messengers’, believing in some and disbelieving in others, in the manner of the Jews and the Christians. And they say, ‘We hear, what we have been enjoined to hear and accept, and obey; we ask you: Your forgiveness, our Lord; to You is the homecoming’, that is, the return at the Resurrection. When the previous verse was revealed, the believers complained of evil whisperings and it grieved them that they should be taken to account according to [the principle expressed in] it, and so the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When the last verse was revealed, the believers found its content disconcerting. So when the Prophet (pbuh) ascended to heaven he prostrated to his Lord, and Allah said in praise of His Prophet: (The Messenger believeth) the Messenger Muhammad (pbuh) believes (in that which hath been revealed unto him from his Lord) i.e. the Qur'an and its content, and then the Prophet (pbuh) said on behalf of his Lord 50 (and (so do) the believers. Each one believeth in Allah and His angels and His scriptures and His messengers-We make no distinction between any of His messengers-) they say: we do not disbelieve in any of his messengers (and they say: We hear) the saying of our Lord, (and we obey) the command of our Lord, i.e. we hear and obey our Lord. The Prophet (pbuh) then said: ((Grant us) Thy forgiveness) forgive us for the discourse of our souls, (our Lord) our Lord! (Unto Thee is the journeying) unto you is the return after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ آمَنَ الرسول بما أُنْزِل إليه من ربه } صدقه بقبوله والتخلق به، كما قالت عائشة: \" كان خلقه القرآن والترقي بمعانيه والتحقق \"\n { والمؤمنون كل آمن بالله } وحده جميعاً { وملائكته وكتبه ورسله } أي: وحده تفصيلاً عند الاستقامة مشاهداً لوحدته في صورة تلك الكثرة معطياً لكل تجلّ من تجلياته في مظهر من مظاهره وحكمه { لا نفرّق } أي: يقولون: لا نفرّق بينهم بردّ بعض وقبول بعض، ولا نشك في كونهم على الحق وبالحق لشهود التوحيد ومشاهدة الحق فيهم بالحق { وقالوا سمعنا } أي: أجبنا ربّنا في كتبه ورسله ونزول ملائكته واستقمنا في سيرنا { غفرانك ربّنا } أي: اغفر لنا وجوداتنا وصفاتنا وامحها بوجودك ووجود صفاتك { وإليك المصير } بالفناء فيك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك: { ءَامَنَ ٱلرَّسُولُ } الفاني في الله، الباقي ببقائه، المستغرق بمطالعة لقائه { بِمَآ أُنْزِلَ إِلَيْهِ } من الحقائق والمعارف والمكاشفات والمشاهدات، المتجددة بتجددات التجليات، المنتشئة { مِن رَّبِّهِ } الذي يربيه؛ لاستخلافه ونيابته وتحمل أسرار أعباء نبوته ورسالته { وَٱلْمُؤْمِنُونَ } المتبعون له، المسترشدون منه المقتفون أثره { كُلٌّ آمَنَ بِٱللَّهِ } المتفرد والمتعزز بالعظمة والكبرياء { وَمَلاۤئِكَتِهِ } المرسومين بصفات الذات والأسماء { وَكُتُبِهِ } المنزلة على ألسنة رسله للهداية والإهداء { وَرُسُلِهِ } المنبهة على أولي البصائر والنهى مما في آياته الكبرى من السرائر والأسرار التي تفتت دونها الآراء، واضمحلت الأهواء، قائلين حالاً ومقالاً: { لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ } بعدما ظهر الكل منه ورجع إليه { وَ } بعدما آمنوا بالله وإحاطته { قَالُواْ } طوعاً { سَمِعْنَا وَ } سمعاً { أَطَعْنَا } بجميع ما جاءوا به؛ إذ الكل من عندك نرجو { غُفْرَانَكَ رَبَّنَا } يا من ربانا بملابس الإمكان، والمفضي بالطبع إلى الخذلان والخسران { وَإِلَيْكَ } يا هادي الكل لا إلى غيرك؛ إذ لا غير معك { ٱلْمَصِيرُ } [البقرة: 285] في الإعادة عن شيطان الإمكان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: { لا نفرق } بالنون، فعلى حذف القول، أي: قالوا: لا نفرق، ومن قرأ بالياء فيرجع إلى الكل، أي: لا يفرق كل واحد منهم بين أحد من رسله، و { بين }: من الظروف النسبية، لا تقع إلا بين شيئين أو أشياء، تقول: جلست بين زيد وعمرو، وبين رجلين، أو رجال، ولا تقول بين زيد فقط، وإنما أضيف هنا إلى أحد لأنه في معنى الجماعة، أي: لا نفرق بين آحاد منهم كقوله عليه الصلاة والسلام:\n\n \" ما أُحلَّت الغنائم لأحدٍ، سُودِ الرؤوس، غيركم \" \n\nو { غفرانك }: مفعول مطلق، أي: اغفر لنا غفرانك\n أو: نطلب غفرانك، فيكون مفعولاً به\n يقول الحقّ جلّ جلاله: { آمن الرسول بما أنزل إليه من ربه } إيمان تحقيق وشهود { والمؤمنون } كل على قدر إيقان، { كل } واحد منهم { آمن بالله } على ما يليبق به من شهود وعيان، أو دليل وبرهان، وآمن بملائكته وأنهم عباد مكرمون\n\n[التّحْريم: 6]، { وكتبه } وأنها كلام الله، مشتملة على أمر وني ووعد ووعيد وقصص وأخبار، وما عرف منها كالتوراة والإنجيل والزبور والفرقان، وجب الإيمان به بعينه، وما لم يعرف وجب الإيمان به في الجملة، { ورسله } وأنهم بشر متصفون بالكمالات، منزّهون عن النقائص، كما يليق بحالهم، حال كون الرسول والمؤمنون قائلين { لا نفرق بين أحد من رسله } أو: { لا يفرق } كل منهم بين أحد من رسله بأن يصدقوا بالبعض، دون البعض كما فرقت اليهود والنصارى، { وقالوا } أي المؤمنين { سمعنا وأطعنا } أي: سمعنا قولك وأطعنا أمرك، نطلب { غفرانك } يا ربنا { وإليك المصير } بالبعث والنشور، وهذا إقرار منهم بالبعث الذي هو من تمام أركان الإيمان",
      "translations": []
    }
  ]
}