{
  "chapter": "البقرة",
  "text": "يايها الذين ءامنوا۟ اذا تداينتم بدين الى اجل مسمى فاكتبوه وليكتب بينكم كاتبۢ بالعدل ولا ياب كاتب ان يكتب كما علمه الله فليكتب وليملل الذى عليه الحق وليتق الله ربه ولا يبخس منه شيـا فان كان الذى عليه الحق سفيها او ضعيفا او لا يستطيع ان يمل هو فليملل وليه بالعدل واستشهدوا۟ شهيدين من رجالكم فان لم يكونا رجلين فرجل وامراتان ممن ترضون من الشهداء ان تضل احدىهما فتذكر احدىهما الاخرى ولا ياب الشهداء اذا ما دعوا۟ ولا تسـموا۟ ان تكتبوه صغيرا او كبيرا الى اجله ذلكم اقسط عند الله واقوم للشهدة وادنى الا ترتابوا۟ الا ان تكون تجرة حاضرة تديرونها بينكم فليس عليكم جناح الا تكتبوها واشهدوا۟ اذا تبايعتم ولا يضار كاتب ولا شهيد وان تفعلوا۟ فانه فسوقۢ بكم واتقوا۟ الله ويعلمكم الله والله بكل شىء عليم",
  "translations": [
    {
      "translation": "O believers, when you negotiate a debt for a fixed term, draw up an agreement in writing, though better it would be to have a scribe write it faithfully down; and no scribe should refuse to write as God has taught him, and write what the borrower dictates, and have fear of God, his Lord, and not leave out a thing. If the borrower is deficient of mind or infirm, or unable to explain, let the guardian explain judiciously; and have two of your men to act as witnesses; but if two men are not available, then a man and two women you approve, so that in case one of them is confused the other may prompt her. When the witnesses are summoned they should not refuse (to come). But do not neglect to draw up a contract, big or small, with the time fixed for paying back the debt. This is more equitable in the eyes of God, and better as evidence and best for avoiding doubt. But if it is a deal about some merchandise requiring transaction face to face, there is no harm if no (contract is drawn up) in writing. Have witnesses to the deal, (and make sure) that the scribe or the witness is not harmed. If he is, it would surely be sinful on your part. And have fear of God, for God gives you knowledge, and God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Believers, when you contract a debt for a fixed; term, you should put it in writing. Let a scribe write with equity the document for the parties. The scribe whom Allah has given the gift of literacy should not refuse to write. Let him write and let the one under obligation (the debtor) dictate, and he should fear Allah, his Lord, and should not diminish from or add anything to the terms which have been settled. But if the borrower be of low understanding or weak or unable to dictate (for any reason), then let the guardian of his interests dictate it with equity. And let two men from among you bear witness to all such documents. But if two men be not available, there should be one man and two women to bear witness so that if one of the women forgets (anything), the other may remind her. The witnesses should be from among such people whom you approve of as witnesses. When the witnesses are asked to testify, they should not refuse to do so. Do not neglect to reduce to writing your transaction for a specified term, whether it be big or small. Allah considers this more just for you, for it facilitates the establishment of evidence and lessens doubts and suspicions. Of course, there is no harm if you do not put in writing the common transactions you conclude daily on the spot, but in case of commercial transactions you should have witnesses. The scribe and the witnesses should not be harassed: if you do so, you shall be guilty of sin. You should guard against the wrath of Allah; He gives you the knowledge of the right way for Allah has the knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you take a loan for a known period of time, have a just scribe write it down for you. The scribe should not refuse to do this as God has taught him. The debtor should dictate without any omission and have fear of God, his Lord. If the debtor is a fool, a minor, or one who is unable to dictate, his guardian should act with justice as his representative. Let two men or one man and two women whom you choose, bear witness to the contract so that if one of them makes a mistake the other could correct him. The witness must not refuse to testify when their testimony is needed. Do not disdain writing down a small or a large contract with all the details. A written record of the contract is more just in the sight of God, more helpful for the witness, and a more scrupulous way to avoid doubt. However, if everything in the contract is exchanged at the same time, there is no sin in not writing it down. Let some people bear witness to your trade contracts but the scribe or witness must not be harmed; it is a sin to harm them. Have fear of God. God teaches you. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If you make an agreement for debt for a specified time, write it down; and appoint a scribe to write it for you with accuracy; and the scribe must not refuse to write in the manner Allah has taught him, so he must write; and the liable person (debtor) should dictate it to him and fear Allah, Who is his Lord, and not hide anything of the truth; but if the debtor is of poor reasoning, or weak, or unable to dictate, then his guardian must dictate with justice; and appoint two witnesses from your men; then if two men are not available, one man and two women from those you would prefer to be witnesses, so that if one of them forgets, the other can remind her; and the witnesses must not refuse when called upon to testify; do not feel burdened to write it, whether the transaction is small or big – write it for up to its term’s end; this is closer to justice before Allah and will be a strong evidence and more convenient to dispel doubts amongst yourselves – except when it is an instant trade in which exchange is carried out immediately, there is no sin on you if it is not written down; and take witnesses whenever you perform trade; and neither the scribe nor the witnesses be caused any harm (or they cause any harm); and if you do, it would be an offence on your part; and fear Allah; and Allah teaches you; and Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you contract a debt for a fixed period, write it down. Let a scribe write it down in justice between you. Let not the scribe refuse to write, as Allah has taught him, so let him write. Let him (the debtor) who incurs the liability dictate, and he must have Taqwa of Allah, his Lord, and diminish not anything of what he owes. But if the debtor is of poor understanding, or weak, or is unable to dictate for himself, then let his guardian dictate in justice. And get two witnesses out of your own men. And if there are not two men (available), then a man and two women, such as you agree for witnesses, so that if one of them (two women) errs, the other can remind her. And the witnesses should not refuse when they are called (for evidence). You should not become weary to write it (your contract), whether it be small or big, for its fixed term, that is more just with Allah; more solid as evidence, and more convenient to prevent doubts among yourselves, save when it is a present trade which you carry out on the spot among yourselves, then there is no sin on you if you do not write it down. But take witnesses whenever you make a commercial contract. Let neither scribe nor witness suffer any harm, but if you do (such harm), it would be wickedness in you. So have Taqwa of Allah; and Allah teaches you. And Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when you deal with each other in contracting a debt for a fixed time, then write it down; and let a scribe write it down between you with fairness; and the scribe should not refuse to write as Allah has taught him, so he should write; and let him who owes the debt dictate, and he should be careful of (his duty to) Allah, his Lord, and not diminish anything from it; but if he who owes the debt is unsound in understanding, or weak, or (if) he is not able to dictate himself, let his guardian dictate with fairness; and call in to witness from among your men two witnesses; but if there are not two men, then one man and two women from among those whom you choose to be witnesses, so that if one of the two errs, the second of the two may remind the other; and the witnesses should not refuse when they are summoned; and be not averse to writing it (whether it is) small or large, with the time of its falling due; this is more equitable in the sight of Allah and assures greater accuracy in testimony, and the nearest (way) that you may not entertain doubts (afterwards), except when it is ready merchandise which you give and take among yourselves from hand to hand, then there is no blame on you in not writing it down; and have witnesses when you barter with one another, and let no harm be done to the scribe or to the witness; and if you do (it) then surely it will be a transgression in you, and be careful of (your duty) to Allah, Allah teaches you, and Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you contract a debt one upon another for a stated term, write it down, and let a writer write it down between you justly, and let not any writer refuse to write it down, as God has taught him; so let him write, and let the debtor dictate, and let him fear God his Lord and not diminish aught of it. And if the debtor be a fool, or weak, or unable to dictate himself, then let his guardian dictate justly. And call in to witness two witnesses, men; or if the two be not men, then one man and two women, such witnesses as you approve of, that if one of the two women errs the other will remind her; and let the witnesses not refuse, whenever they are summoned. And be not loth to write it down, whether it be small or great, with its term; that is more equitable in God's sight, more upright for testimony, and likelier that you will not be in doubt. Unless it be merchandise present that you give and take between you; then it shall be no fault in you if you do not write it down. And take witnesses when you are trafficking one with another. And let not either writer or witness be pressed; or if you do, that is ungodliness in you. And fear God; God teaches you, and God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye contract a debt for a fixed term, record it in writing. Let a scribe record it in writing between you in (terms of) equity. No scribe should refuse to write as Allah hath taught him, so let him write, and let him who incurreth the debt dictate, and let him observe his duty to Allah his Lord, and diminish naught thereof. But if he who oweth the debt is of low understanding, or weak, or unable himself to dictate, then let the guardian of his interests dictate in (terms of) equity. And call to witness, from among your men, two witnesses. And if two men be not (at hand) then a man and two women, of such as ye approve as witnesses, so that if the one erreth (through forgetfulness) the other will remember. And the witnesses must not refuse when they are summoned. Be not averse to writing down (the contract) whether it be small or great, with (record of) the term thereof. That is more equitable in the sight of Allah and more sure for testimony, and the best way of avoiding doubt between you; save only in the case when it is actual merchandise which ye transfer among yourselves from hand to hand. In that case it is no sin for you if ye write it not. And have witnesses when ye sell one to another, and let no harm be done to scribe or witness. If ye do (harm to them) lo! it is a sin in you. Observe your duty to Allah. Allah is teaching you. And Allah is knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you contract a debt for a stated term, put it down in writing; have a scribe write it down with fairness between you. No scribe should refuse to write: let him write as God has taught him, let the debtor dictate, and let him fear God, his Lord, and not diminish [the debt] at all. If the debtor is weak in mind or body, or unable to dictate, then in fairness let his guardian dictate for him. Call in two of your men as witnesses. But if two men cannot be found, then call one man and two women out of those you approve of as witnesses, so that if one of the two women should forget the other can remind her. Let the witnesses not refuse when they are summoned. Do not be disinclined to write down your debts, be they small or large, together with the date of payment. This is more just in the sight of God; it is more reliable as testimony, and more likely to prevent doubts arising between you, unless it be ready merchandise which you give or take from hand to hand, then it will not be held against you for not writing it down. Have witnesses present whenever you trade with one another, and let no harm be done to either scribe or witness, for if you did cause them harm, it would be a crime on your part. Be mindful of God; He teaches you: He has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when ye deal, one with anot her, in lending for a term named, write it down, and let a scribe write it down justly between you, and let not the scribe refuse to write according as Allah hath taught him. Let him write them, and let him who oweth dictate, and let him fear Allah, his Lord, and diminish not aught thereof. But if he who oweth be witless or infirm or unable himself to dictate, then let his guardian dictate justly. And call to witness two witnesses of your men, but if both be not men, then a man and two women of those ye agree upon as witnesses, so that if one of the twain err, the one thereof shall remind the other: and let not the witnesses refuse When they are called on And be not Weary of writing it down, be it small or big, with the term thereof. This is the most equitable in the sight of Allah and the most confirmatory of testimony and nearest that ye may not doubt, except when it be a ready merchandise that ye circulate between you, for then there Shall be no blame on you if ye write it not down. And call witnesses when ye bargain With one anot her; and let not the scribe eome to harm nor the witness; and if ye do, verily it will be wickedness in you. Fear Allah; and Allah teacheth you Knower; and Allah is of everything Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you contract a loan for a specified term, write it down. Let a writer write with honesty between you, and let not the writer refuse to write as Allah has taught him. So let him write, and let the one who incurs the debt dictate, and let him be wary of Allah, his Lord, and not diminish anything from it. But if the debtor be feeble-minded, or weak, or incapable of dictating himself, then let his guardian dictate with honesty, and take as witness two witnesses from your men, and if there are not two men, then a man and two women—from those whom you approve as witnesses—so that if one of the two defaults the other will remind her. The witnesses must not refuse when they are called, and do not consider it wearisome to write it down, whether it be a big or small sum, [as a loan lent] until its term. That is more just with Allah and more upright in respect to testimony, and the likeliest way to avoid doubt, unless it is an on-the-spot deal you transact between yourselves, in which case there is no sin upon you not to write it. Take witnesses when you make a deal, and let no harm be done to the writer or witness, and if you did that, it would be sinful of you. Be wary of Allah and Allah will teach you, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye deal with each other, in transactions involving future obligations in a fixed period of time, reduce them to writing Let a scribe write down faithfully as between the parties: let not the scribe refuse to write: as Allah Has taught him, so let him write. Let him who incurs the liability dictate, but let him fear His Lord Allah, and not diminish aught of what he owes. If they party liable is mentally deficient, or weak, or unable Himself to dictate, Let his guardian dictate faithfully, and get two witnesses, out of your own men, and if there are not two men, then a man and two women, such as ye choose, for witnesses, so that if one of them errs, the other can remind her. The witnesses should not refuse when they are called on (For evidence). Disdain not to reduce to writing (your contract) for a future period, whether it be small or big: it is juster in the sight of Allah, More suitable as evidence, and more convenient to prevent doubts among yourselves but if it be a transaction which ye carry out on the spot among yourselves, there is no blame on you if ye reduce it not to writing. But take witness whenever ye make a commercial contract; and let neither scribe nor witness suffer harm. If ye do (such harm), it would be wickedness in you. So fear Allah; For it is Good that teaches you. And Allah is well acquainted with all things. If ye are on a journey, and cannot find a scribe, a pledge with possession (may serve the purpose). And if one of you deposits a thing on trust with another, let the trustee (faithfully) discharge his trust, and let him Fear his Lord conceal not evidence; for whoever conceals it, - his heart is tainted with sin. And Allah knoweth all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you contract a debt for a fixed period, write it down. Let a scribe write it down in justice between you. Let not the scribe refuse to write as Allah has taught him, so let him write. Let him (the debtor) who incurs the liability dictate, and he must fear Allah, his Lord, and diminish not anything of what he owes. But if the debtor is of poor understanding, or weak, or is unable himself to dictate, then let his guardian dictate in justice. And get two witnesses out of your own men. And if there are not two men (available), then a man and two women, such as you agree for witnesses, so that if one of them (two women) errs, the other can remind her. And the witnesses should not refuse when they are called on (for evidence). You should not become weary to write it (your contract), whether it be small or big, for its fixed term, that is more just with Allah; more solid as evidence, and more convenient to prevent doubts among yourselves, save when it is a present trade which you carry out on the spot among yourselves, then there is no sin on you if you do not write it down. But take witnesses whenever you make a commercial contract. Let neither scribe nor witness suffer any harm, but if you do (such harm), it would be wickedness in you. So be afraid of Allah; and Allah teaches you. And Allah is the All-Knower of each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you contract a debt for a fixed period, put it in writing. Let a scribe write it down between you with fairness; no scribe shall refuse to write as Allah has taught him. Therefore, let him write; and let the debtor dictate, fearing Allah his Lord, and do not decrease anything of it. If the debtor is a fool, or weak, or unable to dictate himself, let his guardian dictate for him in fairness. Call to witness two witnesses of your men, if the two are not men, then a man and two women from the witnesses whom you approve; so that if one of the two errs, one of them will remind the other. Whenever witnesses are called upon they must not refuse, and do not be weary to write it down, be it small or large, together with its term. This is more just with Allah; it ensures accuracy in testifying and is the least of doubt. Unless it is present merchandise that you circulate between you; then no guilt shall be on you if you do not write it down and take witnesses when you are selling, and let no harm be done to either scribe or witness. If you do, that is a transgression in you. Fear Allah. Allah teaches you, and Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you incur debt among yourselves for a certain period of time, write it down. And have a scribe write in your presence, in all fairness. And let no scribe refuse to write, as God has taught him. So let him write, and let the debtor dictate. And let him fear God, his Lord, and diminish nothing from it. But if the debtor is mentally deficient, or weak, or unable to dictate, then let his guardian dictate with honesty. And call to witness two men from among you. If two men are not available, then one man and two women whose testimony is acceptable to all—if one of them fails to remember, the other would remind her. Witnesses must not refuse when called upon. And do not think it too trivial to write down, whether small or large, including the time of repayment. That is more equitable with God, and stronger as evidence, and more likely to prevent doubt—except in the case of a spot transaction between you—then there is no blame on you if you do not write it down. And let there be witnesses whenever you conclude a contract, and let no harm be done to either scribe or witness. If you do that, it is corruption on your part. And fear God. God teaches you. God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when you contract a debt for a specified term, write it down. And let a scribe write [it] between you in justice. Let no scribe refuse to write as Allah has taught him. So let him write and let the one who has the obligation dictate. And let him fear Allah, his Lord, and not leave anything out of it. But if the one who has the obligation is of limited understanding or weak or unable to dictate himself, then let his guardian dictate in justice. And bring to witness two witnesses from among your men. And if there are not two men [available], then a man and two women from those whom you accept as witnesses - so that if one of the women errs, then the other can remind her. And let not the witnesses refuse when they are called upon. And do not be [too] weary to write it, whether it is small or large, for its [specified] term. That is more just in the sight of Allah and stronger as evidence and more likely to prevent doubt between you, except when it is an immediate transaction which you conduct among yourselves. For [then] there is no blame upon you if you do not write it. And take witnesses when you conclude a contract. Let no scribe be harmed or any witness. For if you do so, indeed, it is [grave] disobedience in you. And fear Allah. And Allah teaches you. And Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:282] O you who believe, when you contract, when you are dealing with, a debt, such as in prepayment for (future) delivery of goods or a loan, one upon another for a stated, a known, term, write it down, as confirmation and security against any dispute; and let a writer write it, the contract of debt, down between you justly, accurately, not increasing or decreasing the amount or the terms; and let not any writer refuse to write it down, if he is requested for such a task, as God has taught him (the kāf of ka-mā, ‘as’, is semantically connected to the verb ya’ba, ‘refuse’), that is, just as He has given him the advantage of knowing how to write, he should not be niggardly in this respect; so let him write (repeated for emphasis), and let the debtor dictate, to the one writing the contract, for he is the one being witnessed, and must be fully aware of his obligations; and let him fear God his Lord, when dictating, and not diminish anything of it, of the debt due. And if the debtor be a fool, a squanderer, or weak, not up to dictating on account of old age or immaturity, or unable to dictate himself, on account of being dumb, or not knowing the language and so forth, then let his guardian, the one in charge of his affairs, be it a parent, an executor, a custodian or an interpreter, dictate justly. And summon to bear witness, the debt, two witnesses, men, mature Muslim free men; or if the two, witnesses, be not men, then one man and two women, to bear witness, such witnesses as you approve of, on account of their piety and probity; the number of women is because of the fact, so that if one of the two women errs, forgets the testimony, given their lesser astuteness and accuracy; the other, the one remembering, will remind her (read fa-tudhakkira or fa-tudhkira), the one that has forgotten — the ‘reminding’ clause is the reason [for the choice of two women], that is to say, so that she may be reminded if she errs or strays into error, because this [forgetfulness] is the cause of it (a variant reading [for an, ‘that’] has the conditional in, ‘if’, with [the verb inflected as] tudhakkiru, ‘she will remind’, making it a new sentence, the response to which [follows]); and let the witnesses not refuse, whenever (the mā of idhā mā, ‘whenever’, is extra) they are summoned, to bear witness and take responsibility for the testimony; and be not disdainful, lazy, to write it down, that which you have witnessed in truth (for this frequently occurred), be it, small or great, a little or much, with its term, that is, the date on which it is due (ilā ajlihi is a circumstantial qualifier referring to the [pronominal suffix] hā’ of taktubū-hu, ‘you write it down’); that, writing down, is more equitable, more just, in God’s sight, more upright for testimony, that is to say, [that is] more helpful in summoning witness, because it contains the reminder; and nearer, closer to attaining [the desired state] that you will not be in doubt, with regard to the amount and the due dates; unless it be, [that] there is, trade carried out there and then (tijāratun hādiratun: a variant reading has tijāratan hādiratan, in which case the nominal sentence is missing its subject, and must be the pronoun for tijāra, ‘trade’, that is, hiya, ‘it [fem. pronoun]’) that you give and take between you, without there being a timeframe, then you will not be at fault if you do not write it, the merchandise itself, down. And take witnesses, over it, when you are trading with one another, for this is a better means of preventing dispute. The provisions here are delegated (to the personal choice of the people involved). And let not either writer or witness, the creditor and the debtor, be pressed, to distorting [the agreement], being prevented from testimony or dictation; nor should the creditor press them by charging them with what is not suitable for the testimony or the dictation; and if you do, what is prohibited to you, that is sinfulness, a rebellion against obedience, and lack of truth, in you. And fear God, in what He commands and prohibits. God teaches you (wa-yu‘allimukumu Llāhu, is an implied circumstantial qualifier or it denotes the beginning of a new clause), what is in your best interests, and God knows all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "49 Allah then taught them what they ought to learn in their dealings, saying: (0 ye who believe!) in Allah and His Messenger (when ye contract a debt for a fixed term, record it) i.e. the debt (in writing. Let a scribe record it in writing between you) the indebted person and the creditor (in (terms of) equity) justice. (No scribe should refuse to write) the contract between the creditor and the debtor (as Allah hath taught him) how to write, (so let him write) the contract without addition or omission, (and let him who incurreth the debt dictate) i.e. the indebted person should explain to the scribe the debt he owes, (and let him observe his duty to Allah his Lord) let the indebted person fear his Lord, (and diminish naught thereof) and not diminish any amount of debt he owes upon dictation. (But if he who oweth the debt is of low understanding) is ignorant of dictation, (or weak) unable to dictate, (or unable himself to dictate) does not know how to dictate to the scribe, (then let the guardian of his interests dictate) the guardian of his wealth who is the creditor (in (terms of) equity) without any addition. (And call to witness) for your rights, (from among your men, two witnesses) from among your free, Muslim men who are of good character. (And if two men be not (at hand) then a man and two women, of such as ye approve as witnesses) from among people who are reliable in their witness, (so that if the one erreth (through forgetfulness)) so that if one of the women forgets (the other) who did not forget (will remind her. And the witnesses must not refuse) to give witness (when they are summoned) to court. (Be not averse) disinclined (to writing down) i.e. the debt (whether it be small or great, with (record of) the term thereof. That) i.e. that which I mentioned regarding the writing down of the debt (is more equitable) more correct and fairer (in the sight of Allah and more sure for testimony) clearer for the witness when he gives his testimony if he happens to forget, (and the best way of avoiding doubt between you) concerning the debt and the fixed term of its payment; (save only in the case when it is actual merchandise which you transfer among yourselves from hand to hand. In that case it is no sin) there is no harm (for you if ye write it not) the transaction. (And have witnesses when ye sell one to another) on credit, (and let no harm be done to scribe) by committing the transaction to writing (or witness) by giving his witness, that is, do not coerce them to do so. (If ye do (harm to them)) if you harm them, (lo! It is a sin in you. Observe your duty to Allah) fear Allah for causing such harm. (Allah is teaching you) what is best for you regarding your dealings. (And Allah is Knower of all things) what is good for you as well as other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { أَدْنَىٰ } معناه أَقربُ و: { أَلاَّ تَرْتَابُوۤاْ } معناه لا تَشُكُوا\n\n\n\n\nوقولهُ تعالى: { فَإِنَّهُ فُسُوقٌ بِكُمْ } معناه مَعْصِيةٌ بِكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } مقتضى إيمانكم المحافظة على الحدود خصوصاً { إِذَا تَدَايَنتُم بِدَيْنٍ } أي: يعطي بعضكم بعضاً مبلغاً، ويأخذه أن يؤديه له { إِلَىٰ أَجَلٍ مُّسَمًّى } مقدر معلوم بتقدير الأيام والشهور والأعوام لا بوقت الحصاد وقدوم الحاج وغير ذلك { فَٱكْتُبُوهُ } لئلا يقع بينكم العداوة البغضاء المؤدية إلى النزاع والمراء، المنافية للإيمان والتوحيد { وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌ بِٱلْعَدْلِ } على الوجه الذي وقع بلا زيادة ولا نقصان، والحاصل أن تكتب المراضاة التي جرت بينكم حين الإعطاء والأخذ بلا تفاوت حتى تتذكروا به لدى الحاجة { وَلاَ يَأْبَ } لا يمتنع { كَاتِبٌ أَنْ يَكْتُبَ كَمَا عَلَّمَهُ ٱللَّهُ } أي: لا يوجز إيجازاً مخلاً منقصاً، ولا يطنب إطناباً مملاً مزيداً؛ لئلا يؤدي إلى النزاع والمناكرة عند الأداء { فَلْيَكْتُبْ } الكاتب العادل\n\n\n\n\n{ وَلْيُمْلِلِ } على الكاتب المديون { ٱلَّذِي عَلَيْهِ ٱلْحَقُّ } لأنه المعترف بالأداء { وَلْيَتَّقِ ٱللَّهَ رَبَّهُ } حين الإملاء عن فوت شيء من الحقوق { وَلاَ } خصوصاً { يَبْخَسْ } لا ينقص { مِنْهُ شَيْئاً } هذا التخصيص بعدما دل عليه الكلام السابق؛ لزيادة التأكيد والاهتمام في الاجتناب عن حق الغير { فَإن كَانَ ٱلَّذِي عَلَيْهِ ٱلْحَقُّ سَفِيهاً } ناقص العقل من اهل التبذير { أَوْ ضَعِيفاً } في الرأي والقوة كالصبي والهرم { أَوْ لاَ يَسْتَطِيعُ } هو بنفسه { أَن يُمِلَّ هُوَ } لخرس أو لجهل باللغة { فَلْيُمْلِلْ } لأجله { وَلِيُّهُ } أي: من يولي أمره شرعاً { بِٱلْعَدْلِ } برعاية الجانبين بلا ازدياد ولا تبخيس\n\n\n\n\n{ وَ } مع ذلك { ٱسْتَشْهِدُواْ } على دينكم ومراضاتكم من الجانبين { شَهِيدَيْنِ } حاضرين في مجلس المراضاة { ِّن رِّجَالِكُمْ } لكمال عقلهم ودينهم { فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَٱمْرَأَتَانِ } أي: فعلكيم أن تستشهدوا بدل الرجلين برجل وامرأتين دفعاً للحرج، هذا مخصوص بالأموال دون الحدود والقصاص؛ لقلة عقلهن وضعف تأملهن { مِمَّن تَرْضَوْنَ } أنتم أيها العاملون { مِنَ ٱلشُّهَدَآءِ } الذين ثبت عندكم عدالتهم وديانتهم، وإنما خص هذا العدد لأجل { أَن تَضِلَّ } تنسى { إِحْدَاهُمَا } بمرور الزمان { فَتُذَكِّرَ إِحْدَاهُمَا } الذاكرة { ٱلأُخْرَىٰ } الناسية؛ لئلا يبطل حقوق المسلمين\n\n\n\n\n{ وَلاَ يَأْبَ } لا يمتنع { ٱلشُّهَدَآءُ إِذَا مَا دُعُواْ } لأداء الشهادة أو تحملها مع الاستشهاد والإشهاد { وَلاَ تَسْأَمُوۤاْ أَن تَكْتُبُوهُ } أي: الكتاب الشامل على مراضاتكم ومعاملاتكم المؤجلة { صَغِيراً } كان الحق { أَو كَبِيراً إِلَىٰ } وقت حلول { أَجَلِهِ } المسمى عند الأخذ { ذَلِكُمْ } أي: الكتاب على الوجه المذكور { أَقْسَطُ } أعدل معاملاتكم { عِندَ ٱللَّهِ وَأَقْومُ } أعون { لِلشَّهَٰدَةِ } أي: لأدائها { وَأَدْنَىٰ } أقربُ الطرق وأحفظُها في أن { أَلاَّ تَرْتَابُوۤاْ } فيما جرى بينكم من المعاملة نسيئة، فعليكم أن تحافظوا عليها ولا تجاوزوا عنها { إِلاَّ أَن تَكُونَ تِجَٰرَةً حَاضِرَةً تُدِيرُونَهَا } تداولونها { بَيْنَكُمْ } يداً بيدٍ { فَلَيْسَ عَلَيْكُمْ جُنَاحٌ } ذنب { أَلاَّ تَكْتُبُوهَا } لمبعدها من التنازع { وَأَشْهِدُوۤاْ } إن لم تكتبوا { إِذَا تَبَايَعْتُمْ } احتياطاً؛ إذ البشر لا يخلو من الضرر والإضرار { وَلاَ يُضَآرَّ كَاتِبٌ وَلاَ شَهِيدٌ } هذه الصيغة تحتمل البنائين وكلاهما مراد\n\n\nأمَّا بناء الفاعل، فلا بد أن يضرهم الكاتب المعاملين بترك الإجابة والحضور عند المملي، والزيادة والنقصان في المكتوب وغير ذلك، والشاهد المدعو إلى التحميل والأداء بترك الإجابة والتهاون والإنكار وغير ذلك\n\n\n\n\nأمَّا بناء المفعول، فلا بد ألاَّ يضر الكاتب بمنع أجرته واستعجاله عن مصالحه كذا الشاهد\n\n\n\n\n{ وَإِن تَفْعَلُواْ } أشياء مما نهي عنه { فَإِنَّهُ فُسُوقٌ بِكُمْ } خروج عن حدود الله لاحق به ضره { وَٱتَّقُواْ ٱللَّهَ } عن مخالفة حدوده وأحكامه { وَ } خصوصاً بعدما { يُعَلِّمُكُمُ ٱللَّهُ } المدبر لمصالحكم ما ينبغي لكم ويليق بحالكم { وَٱللَّهُ } المتجلي بصفة الجمال والجلال { بِكُلِّ شَيْءٍ } صدر عنكم { عَلِيمٌ } [البقرة: 282] يجازيكم على مقتضى علمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰ أَجَلٍ مُّسَمًّى فَٱكْتُبُوهُ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌ بِٱلْعَدْلِ وَلاَ يَأْبَ كَاتِبٌ أَنْ يَكْتُبَ كَمَا عَلَّمَهُ ٱللَّهُ فَلْيَكْتُبْ وَلْيُمْلِلِ ٱلَّذِي عَلَيْهِ ٱلْحَقُّ وَلْيَتَّقِ ٱللَّهَ رَبَّهُ وَلاَ يَبْخَسْ مِنْهُ شَيْئاً فَإن كَانَ ٱلَّذِي عَلَيْهِ ٱلْحَقُّ سَفِيهاً أَوْ ضَعِيفاً أَوْ لاَ يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُ بِٱلْعَدْلِ وَٱسْتَشْهِدُواْ شَهِيدَيْنِ مِّن رِّجَالِكُمْ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَٱمْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ ٱلشُّهَدَآءِ أَن تَضِلَّ إْحْدَاهُمَا فَتُذَكِّرَ إِحْدَاهُمَا ٱلأُخْرَىٰ\n\n\n }  يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا إذا تداينتم بدين } أي: داين بعضكم بعضاً في بيع أو سف، { إلى أجل مسمى } أي: معلوم بالأيام أو الأشهر، لا بالحصاد أو قدوم الحاج، ألا في السَّلمَ، { فاكتبوه } لأنه أوثق وأدفع للنزاع\n والجمهور: أن الأمر للاستحباب، { وليكتب بينكم كاتب بالعدل } لا يزيد ولا ينقص، ولا بد أن يكون عدلاً حتى يجيء مكتوبه موثوقاً به، { ولا يأب كاتب أن يكتب } أي: ولا يمتنع كاتب من الكتابة { كما علمه الله فليكتب } أي: فليكتب كما علمه الله من كتابه الوثائق، أو: لا يأب أن ينفع الناس بكتابته كما نفعه الله بتعليمها\n { وليملل الذي عليه الحق } أي: وليكن المُملي مَنْ عليه الحق لأنه المُقر للشهود، يقال: أملل وأملي، إذا ذكر ما عنده أو ما عليه، { وليتق الله ربه } أي: المملي أو الكاتب، { ولا يبخس منه شيئاً } أي: ولا ينقص من الحق الذي عليه شيئاً في الإملاء أو في الكتابة { فإن كان الذي عليه الحق سفيهاً }: ناقص العقل مُبذراً، { أو ضعيفاً } شيخاً مخبلاً، أو صبيّاً صغيراً، { أو لا يستطيع أن يمل هو } ، لخرس أو جهل باللغة، { فليملل } عنه { وليه بالعدل } ، من وَصِيٍّ أو وكيل، { واستشهدوا } على معاملتكم { شهيدين من رجالكم } المسلمين، { فإن لم يكونا رجلين } ، بأن تعذر إحضارهما، { فرجل وأمراتان } فأكثر، تقوم مقام رجلين { ممن ترضون من الشهداء } لعلمكم بِعَادالَتِهِمْ، وإنما شرط تعدد النساء لأجل { أن تضل إحداهما فتذكر إحداهما الأخرى } أي: إن ضلت إحداهما الشهادة، ونسيتها، ذكرتها الأخرى لأنها ناقصة عقل ودين\n ثم حذَّر الشهود من الامتناع عن تحمل الشهادة أو أدائها، فقال: {\n\n\n وَلاَ يَأْبَ ٱلشُّهَدَآءُ إِذَا مَا دُعُواْ وَلاَ تَسْأَمُوۤاْ أَن تَكْتُبُوهُ صَغِيراً أَو كَبِيراً إِلَىٰ أَجَلِهِ ذَلِكُمْ أَقْسَطُ عِندَ ٱللَّهِ وَأَقْومُ لِلشَّهَادَةِ وَأَدْنَىٰ أَلاَّ تَرْتَابُوۤاْ إِلاَّ أَن تَكُونَ تِجَارَةً حَاضِرَةً تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلاَّ تَكْتُبُوهَا وَأَشْهِدُوۤاْ إِذَا تَبَايَعْتُمْ وَلاَ يُضَآرَّ كَاتِبٌ وَلاَ شَهِيدٌ وَإِن تَفْعَلُواْ فَإِنَّهُ فُسُوقٌ بِكُمْ وَٱتَّقُواْ ٱللَّهَ وَيُعَلِّمُكُمُ ٱللَّهُ وَٱللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ }  قلت: السَّأَمُ هو: الملَلُ، و { لا يضار } يحتمل أن يكون مبنيّاً للفاعل، وأصله: يضارر بالكسر، أو للمفعول، فيكون الأصح بالفتح\n\n\nيقول الحقّ جلّ جلاله: ولا يمتنع { الشهداء } من تحمل الشهادة إذا دعوا إليها، حيث تعيَّنت عليهم، وسُموا شهداء باعتبار المآل، وإنما تتعين إذا لم يوجد غيرهم\n أو: من أدائها حيث لا ضرر، { ولا تسأموا أن تكتبوه } أي: ولا تملوا من كتابة الحق إذا تكرر { صغيراً } كان { أو كبيراً } ، فقيدوا ذلك { إلى أجله } ، { ذلكم أقسط عند الله } أي: ذلك الكتاب والتقييد للحقوق، أكثر قسطاً عند الله لأنه أدفع للنزاع وأحفظ للحقوق، { وأقوم للشهادة } أي: أثبتُ لها وأعون على أدائها، { وأدنى ألا ترتابوا } أي: وأقرب لعدم الريب والشك في جنس الدين وقَدْره وأجلَه، لأنه إذا كتب جنسه وقدره وأجله لم يبق لأحد شك في ذلك، { إلا أن تكون تجارة حاضرة } لا أجَل فيها، { تديرونها بينكم } أي: تتعاملون فيها نقداً، { فليس عليكم جُنَاحٌ ألا تكتبوها } لقلة النزاع فيها، { وأشهدوا إذا تبايعتم } مطلقاً بدين أو نقد لأنه أحوط، خوفاً من الإنكار، والأوامر في هذه الآية للاستحباب عند الأكثر\n { ولا يضار كاتب ولا شهيد } بالتحريف والتغيير في الكتابة والشهادة، على البناء للفاعل، أو: ولا يضارا بأن يُعْجلا عن مهم، أو يكلفا الأداء من شقة بعيدة، أو يمنع من أجرته، { وإن تفعلوا } ذلك الضرار وما نهيتهم عنه { فإنه فسوق بكم } أي: خروج بكم عن حد الاستقامة، { واتقوا الله } في مخالفة أمره ونهيه، { ويعلمكم الله } العلوم اللدنية { والله بكل شيء عليم } فلا يخفى عليه من اتقى الله ممن عصاه\n وكرر لفظ الجلالة في الجمل الثلاث، لاستقلالها، فإن الأُولى حثٌّ على التقوى والثانية وعدٌ بتعليم العلم، والثالثة تعظيم لشأنه، ولأنه أدخل في التعظيم من الكناية\n قاله البيضاوي\n وأدخل الواو في جوابه الأمر ليقتضي أن تعليمه سبحانه لأهل التقوى ليس هو مسبباً عن التقوى، بل هو بمحض الفضل والكرم، والتقوى إنما هي طريق موصل لذلك الكرم، لا سبب فيه \" جَلَّ حُكْمُ الأزل أن يُضَافَ إلى العلل \"\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}