{
  "chapter": "البقرة",
  "text": "كيف تكفرون بالله وكنتم اموتا فاحيكم ثم يميتكم ثم يحييكم ثم اليه ترجعون",
  "translations": [
    {
      "translation": "Then how can you disbelieve in God? He gave you life when you were dead. He will make you die again then bring you back to life: To Him then you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you adopt the attitude of disbelief towards Allah when the fact is that you were lifeless and He gave you life, and He will take away life from you and will again restore you to life: then you shall ultimately return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How dare you deny the existence of God Who gave you life when you initially had no life. He will cause you to die and bring you to life again. Then you will return to His Presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has made you disbelieve in Allah? Whereas you were dead and He gave you life; then He will give you death, then bring you to life again, and then it is to Him you will return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you disbelieve in Allah seeing that you were dead and He gave you life Then He will give you death, then again will bring you to life (on the Day of Resurrection) and then unto Him you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How do you deny Allah and you were dead and He gave you life? Again He will cause you to die and again bring you to life; then you shall be brought back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How do you disbelieve in God, seeing you were dead and He gave you life, then He shall make you dead, then He shall give you life, then unto Him you shall be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How disbelieve ye in Allah when ye were dead and He gave life to you! Then He will give you death, then life again, and then unto Him ye will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you disbelieve in God when you were dead [lifeless] and He gave you life? He will let you die once more, then bring you back to life again, whereupon you will be returned to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How will ye disbelieve in Allah whereas ye were lifeless and he quickened you; thereafter He will cause you to die, thereafter He will give you life, thereafter unto Him ye shall be returned!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you be unfaithful to Allah, [seeing that] you were lifeless and He gave you life, then He will make you die and then bring you to life, and then you will be brought back to Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can ye reject the faith in Allah?- seeing that ye were without life, and He gave you life; then will He cause you to die, and will again bring you to life; and again to Him will ye return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you disbelieve in Allah? Seeing that you were dead and He gave you life. Then He will give you death, then again will bring you to life (on the Day of Resurrection) and then unto Him you will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you disbelieve Allah? Did He not give you life when you were dead, and He will cause you to die and then restore you to life. Then you will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you deny God, when you were dead and He gave you life, then He will put you to death, then He will bring you to life, then to Him you will be returned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:28] How do you, people of Mecca, disbelieve in God, when you were dead, semen inside loins, and He gave you life, in the womb and in this world by breathing Spirit into you (the interrogative here is either intended to provoke amazement at their [persistent] unbelief despite the evidence established, or intended as a rebuke); then He shall make you dead, after your terms of life are completed, then He shall give you life, at the Resurrection, then to Him you shall be returned!, after resurrection, whereupon He shall requite you according to your deeds; and He states, as proof of the Resurrection, when they denied it:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How disbelieve you in Allah) how astonishing that you disbelieve in Allah (when you were dead) sperm drops in the loins of your fathers (and He gave life to you!) in the wombs of your mothers. (Then He will give you death) when your lifespan ends, (then life again) for the Resurrection, (and then unto Him ye will be returned) in the Hereafter whereupon He shall requite you for your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَيْفَ تَكْفُرُونَ } وتشركون { بِٱللَّهِ } الذي قدر وجودكم في علمه السابق أراد إيجادكم { وَكُنْتُمْ أَمْوَٰتاً فَأَحْيَٰكُمْ } أظهركم من العدم بمد ظله عليكم، وبعدما أظهركم أنعم عليكم ورباكم في النشأة الأولى بأنواع النعم؛ لتعرفوا المنعم وتشكروا له في مقابلتها { ثُمَّ } بعد تربيتكم في النعم { يُمِيتُكُمْ } يخرجكم من النشأة الأولى إظهاراً لقدرته وقهره { ثُمَّ يُحْيِيكُمْ } أيضاً في النشأة الأخرى لتجزى كل نفس بما كسبت في النشأة الأولى { ثُمَّ } بعدما قطعتم المنازل وطويتم المراتب والمراحل { إِلَيْهِ } لا إلى غيره من الأظلال { تُرْجَعُونَ } [البقرة: 28] إذ لا وجود للغير ليرجع إليه، فلا مرجع إلا هو ولا مآب بسواه، لا إله إلا هو، كل شيء هالك إلا وجهه، له الحكم وإليه ترجعون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كيف } حال لأنها وقعت قبل كلام تام\n يقول الحقّ جلّ جلاله: { كَيْفَ تَكْفُرُونَ بِالله } وتجحدون نعمه المتوالية، { و } الحالة أنكم { كُنتُمْ أَمْوَاتاً } نطفاً في الأرحام { فَأَحْيَاكُمْ } بنفخ الروح في أجسادكم، { ثُمَّ يُمِيتُكُمْ } عند انقضاء آجالكم، { ثُمَّ يُحْيِيكُمْ } عند البعث لحسابكم، ثم يسكنكم دار القرار، إما إلى الجنة وإما إلى النار\n فهذه الآثار دالّة على باهر قدرته وتمام حكمته، فقد وضح الحق وظهر،\n",
      "translations": []
    }
  ]
}