{
  "chapter": "البقرة",
  "text": "لله ما فى السموت وما فى الارض وان تبدوا۟ ما فى انفسكم او تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير",
  "translations": [
    {
      "translation": "To God belongs all that is in the heavens and the earth; and whether you reveal what is in your heart or conceal it, you will have to account for it to God who will pardon whom He please and punish whom He will, for God has the power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and the earth. \" Allah will call you to account for what is in your minds whether you disclose it or hide it. He, however, had full authority to pardon or punish anyone He pleases, for Allah has complete power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God belongs whatever is in the heavens and the earth. God will call you to account for all that you may reveal from your souls and all that you may conceal. God will forgive or punish whomever He wants. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah only belongs all whatever is in the heavens and all whatever is in the earth; and whether you disclose what is in your hearts or hide it, Allah will take account of it from you; so He will forgive whomever He wills and punish whomever He wills; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in yourselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and punishes whom He wills. And Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is in the earth is Allah's; and whether you manifest what is in your minds or hide it, Allah will call you to account according to it; then He will forgive whom He pleases and chastise whom He pleases, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavers and earth. Whether you publish what is in your hearts or hide it, God shall make reckoning with you for it. He will forgive whom He will, and chastise whom He will; God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah (belongeth) whatsoever is in the heavens and whatsoever is in the earth; and whether ye make known what is in your minds or hide it, Allah will bring you to account for it. He will forgive whom He will and He will punish whom He will. Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that the heavens and the earth contain belongs to God, whether you disclose what is in your minds or keep it hidden. God will bring you to account for it. He will forgive whom He will and punish whom He pleases: He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is whatsoever is in the heavens and Whatsoever is in the earth, and whether ye disclose that which is in your soul or conceal it, Allah will reckon with you therefor, then He will forgive whomsoever He will, and torment whomsoever He will, And Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and the earth. Whether you disclose what is in your hearts or hide it, Allah will bring you to account for it. Then He will forgive whomever He wishes and punish whomever He wishes, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongeth all that is in the heavens and on earth. Whether ye show what is in your minds or conceal it, Allah Calleth you to account for it. He forgiveth whom He pleaseth, and punisheth whom He pleaseth, for Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in your ownselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and punishes whom He wills. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and the earth. Whether you reveal what is in your hearts or hide it Allah will bring you to account for it. He will forgive whom He will and punish whom He will; He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs everything in the heavens and the earth. Whether you reveal what is within your selves, or conceal it, God will call you to account for it. He forgives whom He wills, and He punishes whom He wills. God is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and whatever is in the earth. Whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:284] To God belongs all that is in the heavens and the earth. Whether you disclose, manifest, what is in your hearts or hide it, of evil and resolve for it, God shall take you to account for it, informing you of it on the Day of Resurrection. Then He will forgive whom He will, to forgive, and chastise whom He will, to chastise (both verbs are apocopated [fa-yaghfir, ‘he will forgive’, wa-yu‘adhdhib, ‘he will chastise’] if taken as the responses to the conditional, in tubdū, ‘if you proclaim’; but they may also be read with a final nominative inflection [yaghfiru, yu‘adhdhibu] in which case, it would [constitute a new clause and] follow on from an implicit fahuwa, ‘then He’). And God has power over all things, including reckoning with you and requiting you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Allah (belongeth) whatsoever is in the heavens and whatsoever is in the earth) of created beings and marvels; He commands His servants with whatever He wills; (and whether ye make known what is in your minds) in your hearts; this refers to the discourse of the soul after the arousal of one's misgivings but before one divulges it (or hide it, Allah will bring you to account for it) Allah will requite you for it. The same applies to forgetfulness after one remembers, error after being right and coercion after exerting one's effort freely. (He will forgive whom He will) He will forgive the one who repents of all sins (and He will punish whom He will) He will punish the one who does not repent. (And Allah is Able to do all things) in terms of forgiveness and punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ للَّهِ } الواحد الأحد الحي، الحقيق بالحقية، القيوم المتفرد بالقيومية، الدائم الظاهر بالديمومية مظاهر { ما فِي ٱلسَّمَٰوٰتِ } من الأسماء الذاتية والصفات الفعلية { وَمَا فِي ٱلأَرْضِ } أي: الطبيعة العدمية القابلة لمظهرية آثار الصفات الذاتية، المحدثة المظهر للكائنات الكونية والكيانية، والواردات الغيبية والواضحات العينية { وَ } بعدما ظهر ما ظهر وما بطن { إِن تُبْدُواْ } تظهروا أيها الأظلال والعكوس { مَا فِيۤ أَنْفُسِكُمْ } من الأنانية والأصالة في الوجود والاستقلال بالآثار { أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ ٱللَّهُ } الجامع بجميع الأسماء، المحيط بجميع الأشياء، بل الأشياء كلها مستهلكة في وجوده، فانية في ذاته { فَيَغْفِرُ } يستر ذنب الأنانية ومعصية الغيرية { لِمَن يَشَآءُ } من عباده بفضله وجوده { وَيُعَذِّبُ مَن يَشَآءُ } بقهره وطرده إرادة واختياراً؛ إظهاراً لقدرته وقلعاً لشوكته { وَٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ } مما شاء ويشاء { قَدِيرٌ } [البقرة: 284] بالقدرة الأزلية الأبدية المتصرف مطلقاً في جميع ما كان ويكون، لا يعزب عن حضوره ذرة، ولا يشغله فترة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ { فيغفر } بالجزم، فعلى العطف على الجواب، ومن قرأ بالرفع فعلى الاستئناف، أي: فهو يغفرُ\n يقول الحقّ جلّ جلاله: { لله ما في السماوات وما في الأرض } خلقاً وملكاً وعبيداً، يتصرف فيهم كيف شاء يرحم من يشاء بفضله، ويعذب من يشاء بعدله، { وإن تبدوا } أي: تظهروا { ما في أنفسكم } من السوء والعزم عليه، { أو تخفوه } في قلوبكم، { يحاسبكم به الله } يوم القيامة { فيغفر لمن يشاء } مغفرته، { ويعذب من يشاء } تعذيبه، { والله على كل شيء قدير } لا يعجزه عذاب أحد ولا مغفرته\n وعبَّرالحق تعالى بالمحاسبة دون المؤاخذة، فلم يقل: يؤاخذكم به الله لأن المحاسبة أعم، فتصدق بتقرير الذنوب دون المؤاخذة بها، لقوله - عليه الصلاة والسلام:\n\n \" يدنو المؤمن من ربه حتى يضع كنفه عيه، فيقرره بذنوبه، فيقول: هل تعرف كذا؟ فيقول: يا رب، أعرف، فيوقفه على ذنبه ذنباً، ذنباً فيقول الله تعالى: أنا الذي سترتها عليك في الدنيا، وأنا أغفرها لك اليوم \" \n\nفلله الفضل والمنّة، وله الحمد والشكر\n الإشارة: { وإن تبدوا ما في أنفسكم } من الخواطر الردية والطوارق الشيطانية، أو تخفوه في قلوبكم، حتى يحول بينكم وبين شهود محبوبكم، { يحاسبكم به الله فيغفر لمن يشاء } فيمحو ظلمته من قلبه بإلهام التوبة والمبادرة إلى اليقظة، { ويعذب من يشاء } بتركه مع ظلمة تلك الأغيار، وخوضه في بحار تلك الأكدار، فما منع القلوب من مشاهدة الأنوار إلا اشتغالها بظلمة الأغيار، فرّغْ قلبك من الأغيار تملأه بالمعارف والأسرار، فإن أردت أن تكون عين العين، فامح من قلبك نقطة الغين، وهي نقطة السوى، ولله درّ القائل:\n\nواعلم أن الخواطر أربعة: ملكي ورباني ونفساني وشيطاني، فالملكي والرباني لا يأمران إلا بالخير، والنفساني والشيطاني لا يأمران إلا بالشر، وقد يأمران بالخير إذا كان فيه دسيسة إلى الشر، والفرق بين النفساني والشيطاني: أن الخاطر النفساني ثابت لا يزول بتعوذ ولا غيره، إلا بسابق العناية، بخلاف الشيطاني: فإنه يزول بذكر الله، ويرجع مع الغفلة عن الله\n والله تعالى أعلم\n ولمَّا نزل قوله تعالى: { وإن تبدوا ما في أنفسكم\n\n\n } الآية\n شق ذلك على الصحابة - رضي الله عنهم - فجاء الصدِّيقُ والفاروق وعبدُ الرحمن ومعاذ، وناسُ من الأنصار، فَجَثَوْا على الرُّكَب، وقالوا: يا رسول الله، ما نزلت علينا آيةٌ أشدُّ من هذه الآية وأنا إن أخذنا بما نُحَدِّثُ به أنفَسنا هَلَكْنَا! فقال النبيّ صلى الله عليه وسلم:\n\n \" هكذا نزلت \" \n\nفقالوا: كُلِّفنا من العمل ما لا نطيق، فقال - عليه الصلاة والسلام:\n\n \" فلعلكم تقولون كما قالت بنو إسرائيل: { سَمِعْنَا وَعَصَيْنَا } [البقرة: 93]، قولوا: { سَمِعْنَا وَأَطَعْنَا } [البقرة: 285] \" \n",
      "translations": []
    }
  ]
}