{
  "chapter": "البقرة",
  "text": "هو الذى خلق لكم ما فى الارض جميعا ثم استوى الى السماء فسوىهن سبع سموت وهو بكل شىء عليم",
  "translations": [
    {
      "translation": "He made for you all that lies within the earth, then turning to the firmament He proportioned several skies: He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created for you all that there is on the Earth; He then turned to the sky and ordered it into seven heavens. And He has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created everything on earth for you. Then, directing His order towards the realm above, He turned it into seven heavens. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created for you all that is in the earth; then He inclined towards the heaven, therefore fashioning it as proper seven heavens; and He knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created for you all that is on earth. Then He Istawa ila the heaven and made them seven heavens and He is the Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created for you all that is in the earth, and He directed Himself to the heaven, so He made them complete seven heavens, and He knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created for you all that is in the earth, then He lifted Himself to heaven and levelled them seven heavens; and He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created for you all that is in the earth. Then turned He to the heaven, and fashioned it as seven heavens. And He is knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created everything on the earth for you: then He turned towards heaven and fashioned it into the seven heavens. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who created for you all that is on the earth, thereafter He turned to the heaven, and formed them seven heavens. And He is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created for you all that is in the earth, then He turned to the heaven and fashioned it into seven heavens, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who hath created for you all things that are on earth; Moreover His design comprehended the heavens, for He gave order and perfection to the seven firmaments; and of all things He hath perfect knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created for you all that is on earth. Then He Istawa (rose over) towards the heaven and made them seven heavens and He is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created for you all that is in the earth, then, He willed to the heaven, and leveled them seven heavens. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created for you everything on earth, then turned to the heaven, and made them seven heavens. And He is aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created for you all of that which is on the earth. Then He directed Himself to the heaven, [His being above all creation], and made them seven heavens, and He is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:29] He it is Who created for you all that is in the earth, that is, the earth and all that is in it, so that you may benefit from and learn lessons from it; then, after creating the earth, He turned to, that is, He made His object, heaven and levelled them (fa-sawwāhunna: the pronoun [-hunna] refers to ‘heaven’, since, it [heaven] is implicit in the import of the sentence attributed to it [the pronoun]), that is to say, He made them thus, as [He says] in another verse, [fa-qadāhunna] so He determined them [Q. 41:12]) seven heavens and He has knowledge of all things, in their totality and in their individual detail, so do you not then think that the One who has the power to create this to begin with, which is much greater than what you are, also has the power to bring you back [after death]?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then proceeded to mention His blessings on them, saying (He it is Who created for you), made subservient for you (all that is in the earth) of beasts, plants and other things, as a blessing from Him. (Then turned He to the heaven) i.e. He turned to the creation of the heaven, (and fashioned it as seven heavens) positioning them vertically above the earth. (And He is Knower of all things) regarding the creation of the heavens and earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هُوَ ٱلَّذِي } جعلكم خلائف في الأرض وصوركم على صورته، وصيركم مظاهر جميع أوصافه وأسمائه و { خَلَقَ لَكُمْ } أي: قدر ودبر لكم { مَّا فِي ٱلأَرْضِ جَمِيعاً } ما في العالم السفلي من آثار الأسماء والصفات تتميماً لجسمانيتكم؛ لتتصرفوا فيها وتتنعموا بها متى شئتم { ثُمَّ } لما تم تقدير ما في العالم السفلي ترقى عنها و { ٱسْتَوَىٰ } توجه { إِلَى ٱلسَّمَآءِ } إلى تقدير جميع ما في العالم العلوي { فَسَوَّٰهُنَّ } فهيأهن { سَبْعَ سَمَٰوَٰتٍ } مطبقات مشتملات على ملائكةٍ ذوي علومٍ ومعاملاتٍ، وعلى كواكب ذوي آثارٍ كثيرةٍ كلها من مقتضيات أسمائه وصفاته { وَ } لا يخفى عليه شيء مما في العالمين؛ إذ { هُوَ بِكُلِّ شَيْءٍ عَلِيمٌ } البقرة: 29] لا يعزب عن عمله مثقال ذرة في الأرض ولا في السماء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { جميعاً } حال مؤكدة من { ما } ، و { ثم } للترتيب الذكري لا الخارجي لأن دحو الأرض مؤخر عن خلق السماء، إلا أن يكون العطف على معنى الجملة، والتقدير: هو الذي خلق لكم الأرض مشتملة على جميع منافعكم، ثم استوى إلى السماء فخلقهن سبعاً، ثم دحا الأرض وبسطها\n والتسوية: خلق الأشياء سالمة من العوج والخلل، و { سبع }: بدل من الضمير، أو بيان له، وجملة { وهو بكل شيء عليم } تعليل لما قبله\n أي: ولكونه عالماً بكنه الأشياء كلها خلق ما خلق على هذا النمط الأكمل والوجه الأنفع\n يقول الحقّ جلّ جلاله: { هُوَ الَّذِي خَلَقَ } لأجلكم { ما } استقر { فِي الأرْضِ جَمِيعاً } تنتفعون به في الظاهر قوتاً لأشباحكم، ودواء لأبدانكم، ومتعة لنفوسكم، وتنتفعون به في الباطن بالتفكر والاعتبار، وزيادة في إيمانكم وقوة لإيقانكم، ثم قصد { إلَى السَّمَاءِ } قصد إرادة، فخلقهن { سَبْعَ سَمَوَاتِ } مستوية تامة، ليس فيها تفاوت ولا خلل، تظلكم بِجِرْمِها، وتضي عليكم بشمسها وقمرها وكواكبها، وقد أحاط علمه بالأشياء كلها، فلذلك خلقها على هذا النمط الغريب والإتقان العجيب\n الإشارة: يا عبادي خلقتُ الأشياء كُلَّها من أجلكم، الأرض تُقلكم، والسماء تُظلكم، والجهات تَكْتَنِفُكُمْ والحيوانات تخدُمكم، والنباتات تنفعكم، وخلقتكم من أجلي، فكيف تميلون إلى غيري، وتنسَوْن إحساني وبرِّي؟!!! الأشياء كلها عبيدكم وأنتم عبيد الحضرة، \" أنت مع الأكوان ما لم تشهد المُكَوِّنَ، فإذا شهدتَ المكوِّنَ كانت الأكوانُ معك \"\n وفي بعض الكتب المنزلة يقول الله تعالى:\n\n \" يا عبدي إنما منحتك صفاتي لتعرفني بها، فإن ادعيتها لنفسك سلبتُك الولاية، ولم أسلبك صفاتي، يا عبدي: أنت صفتي وأنا صفتك، فارجع إليَّ أرجع إليك، يا عبدي: فيك للعلوم باب مفاتحه أنا، وفيك للجهل باب مفاتحه أنت، فاقصد أيّ البابين شئت، يا عبدي: قربي منك بقدر بعدك عن نفسك وبعدي عنك بقدر قربك من نفسك، فقد عرفتك الطريق، فاترك نفسك تصل إليَّ في خطرة واحدة، يا عبدي: كل ما جمعك علي فهو مني، وكل ما فرقك عني فهو منك، فجاهد نفسك تصل إليّ، وإني لغني عن العالمين، يا عبدي: إن منحتني نفسك رددتها إليك راضية مرضية، وإن تركتها عندك فهي أعظم بلية، فهي أعدى الأعادي إليك فجاهدها تَعُدْ بالفوائد إليك \"\n \n\nوفي بعض الآثار المروية عن الله تعالى:\n\n \" يا عبدي: أنا بُدُّك اللازم فالزم بُدَّك \"\n \n",
      "translations": []
    }
  ]
}