{
  "chapter": "البقرة",
  "text": "الذين يؤمنون بالغيب ويقيمون الصلوة ومما رزقنهم ينفقون",
  "translations": [
    {
      "translation": "Who believe in the Unknown and fulfil their devotional obligations, and spend in charity of what We have given them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in the unseen, establish the Salats and expend (in Our way) out of what We have bestowed on them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the pious who believe in the unseen, attend to prayer, give in charity part of what We have granted them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe without seeing (the hidden), and keep the (obligatory) prayer established, and spend in Our cause from what We have bestowed upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those Who have faith in the Ghayb and perform Salah, and spend out of what we have provided for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in the unseen and keep up prayer and spend out of what We have given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in the Unseen, and perform the prayer, and expend of that We have provided them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the Unseen, and establish worship, and spend of that We have bestowed upon them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in the unseen, and are steadfast in prayer, and spend out of what We have provided them with;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the Unseen, and establish prayer, and out of that wherewith We have provided them expend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in the Unseen, maintain the prayer, and spend out of what We have provided for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the Unseen, are steadfast in prayer, and spend out of what We have provided for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the Ghaib and perform As-Salat (Iqamat-as-Salat), and spend out of what we have provided for them [i.e. give Zakat, spend on themselves, their parents, their children, their wives, etc., and also give charity to the poor and also in Allah's Cause - Jihad, etc.].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the unseen and establish the (daily) prayer; who spend out of what We have provided them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in the unseen, and perform the prayers, and give from what We have provided for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in the unseen, establish prayer, and spend out of what We have provided for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:3] who believe in, that is, who accept the truth of, the Unseen, what is hidden from them of the Resurrection, Paradise and the Fire; and maintain the prayer, that is to say, who perform it giving it its proper due; and of what We have provided them, that is, of what we have bestowed upon them, expend, in obedience to God;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who believe in the unseen), that which is hidden from them such as Paradise, hell, the Bridge over hell, the Scale, the Resurrection, the Reckoning, etc. It is also said that this means: that they believe in the unseen which is revealed in the Qur'an and also in that which is not revealed therein. It is also said that the unseen is Allah Himself. (And establish worship), they perform to completion the five prescribed prayers, including the ablution that precedes them, the bowing and prostrations which are parts of them and also what is obligated in these prayers in terms of appointed timing. (And spend of that We have bestowed upon them), and of that which We have given them of wealth they give to charity. It is also said that this means: they give the poor-due (Zakat) from their wealth. The reference here is to Abu Bakr and his companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الذين يُؤمنونَ بالغَيبِ ويقيمُونَ الصلاةَ } أي: بما غاب عنهم الإيمان التقليديّ، أو التحقيقيّ العلميّ، فإنّ الإيمان قسمان: تقليديّ وتحقيقيّ\n والتحقيقيّ قسمان: استدلالي وكشفيّ، وكلاهما إمّا واقف على حدّ العلم والغيب، وإما غير واقف\n والأول هو الإيقان المسمّى علم اليقين\n والثاني: إمّا عيني، وهو المشاهدة المسمى عين اليقين، وإما حقيّ، وهو الشهود الذاتي المسمّى حق اليقين\n والقسمان الأخيران لا يدخلان تحت الإيمان بالغيب، والإيمان بالغيب يستلزم الأعمال القلبية التي هي التزكية، وهي تطهير القلب عن الميل إلى السعادات البدنية الخارجية، الشاغلة عن إحراز السعادة الباقية\n فإن السعادات ثلاث: قلبية، وبدنية، وما حول البدن\n فالقلبية هي المعارف، والحكم، والكمالات العلمية والعملية الخلقية\n والبدنية هي الصحة والقوّة واللّذات الجسمانية والشهوات الطبيعية\n وما حول البدن هي الأموال والأسباب، كما قال أمير المؤمنين عليه السلام: \" ألا وإنّ من النعم سعة المال، وأفضل من سعة المال صحة الجسد، وتقوى القلب \"\n ويجب الاحتراز عن الأوليين لإحراز الأخيرة المطلوبة بالزهد والعبادة\n فإقامة الصلاة ترك الراحات البدنية وإتعاب الآلات الجسدية، وهي أمّ العبادات التي إذا وجدت لم يتأخر عنها البواقي\n\n[العنكبوت، الآية: 45] إذ هي تحامل على البدن والنفس، ومشقة فادحة عليهما، وإنفاق المال هو الإعراض عن السعادة الخارجية المحبوبة إلى النفس المسمّى بالزهد، فإن الإنفاق ربما كان أشدّ عليها من بذل الروح للزوم الشحّ إياها، ولم يكتف بالقدر الواجب فقال:  { ومما رزقناهم ينفقون } ليعتاد القلب ترك الفضول المالية بالجود والسخاء وبذل المال، في وجوه المروّات، والهبات، والصدقات الغير الواجبة، فيوقي شحّ نفسه، وخصص الإنفاق بالبعض بإيراد من التبعيضية لئلا يقع في رذيلة التبذير ببذل القدر الضروري فيحرم فضيلة الجود الذي هو من باب التخلق بأخلاق الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nو { ٱلَّذِينَ يُؤْمِنُونَ } يوقنون ويذعنون بأسراره ومعارفه { بِٱلْغَيْبِ } أي: غيب الهوية الذي هو ينبوع بحر الحقيقة وإليه منتهى الكلم، وبعد ذلك يتوجهون بمقتضيات أحكامه نحوه، ويهدون إليه بسببه { وَيُقِيمُونَ } يديمون { ٱلصَّلٰوةَ } الميل بجميع الأعضاء والجوارح على وجه الخضوع والتذلل إلى جنابه؛ إذ هو المقصد للكل إجمالاً وتفصيلاً، ولكل عضو وجارحة تذلل خاص وله طريق مخصوص يناسبه، يرشدك إلى تفاصيل الطرق، فعله صلى الله عليه وسلم في صلاته على الوجه الذي وصل إلينا من الرواة المجتهدين - رضوان الله عليهم أجمعين - ولما تنبهوا له به بمتابعته ومالوا نحو جنابه بالميل الحقيقي بالكلية لم يبق لهم ميل إلى ما سواه من المزخرفات الفانية لذلك { وَممَّا رَزَقْنَاهُمْ } سقنا إليهم ليكون بقياً لحياتهم ومقوماً لمزاجهم { يُنْفِقُونَ } [البقرة: 3] في سبيلنا طلباً لمرضاتنا وهرباً عما يشغلهم عنا، فكيف إنفاق الفواضل؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: هذه الأوصاف تتضمن ثلاثة أعمال، الأول: عمل قلبي وهو الإيمان، والثاني: عمل بدني، وهو الصلاة، والثالث: عمل مالي، وهو الإنفاق في سبيل الله، وهذه الأعمال هي أساس التقوى التي تدور عليها\n أما العمل القلبي: فهو الإيمان أولاً، والمعرفة ثانياً، فما دام العبد محجوباً بشهود نفسه، محصوراً في الأكوان وفي هيكل ذاته فهو مؤمن بالغيب، يؤمن بوجود الحق تعالى، وبما أخبر به من أمور الغيب، يستدل بوجود أثره عليه، فإذا فني عن نفسه وتلطفت دائرة حسه، وخرجت فكرته عن دائرة الأكوان، أفضى إلى الشهود والعيان، فصار الغيب عنده شهادة، والملك ملكوتاً، والمستقبل حالاً، والآتي واقعاً، وقد قلت ذلك:\n\nوفي الحكم: \" لو أشرق نور اليقين في قلبك لرأيت الآخرة أقرب من أن ترحل إليها، ولرأيت بهجة الدنيا وكسوة الفناء ظاهرة عليها \" وقال في التنوير: ولو انْهَتَكَ حجاب الوهم لوقع العيان على فقد الأعيان، ولأشرق نور الإيقان فغطّى وجود الأكوان\n هـ\n وإنما اقتصر الحق تعالى على الإيمان بالغيب لأنه هو المكلف به إذ هو الذي يطيقه جلّ العباد، بخلاف المعرفة الخاصة فلا يطيقها إلا الخصوص، والله تعالى أعلم\n وأما العمل البدني: فهو إقامة الصلاة، والمراد بإقامتها إتقان شروطها وأركانها وخشوعها، وحفظ السر فيها، قال الشيخ أبو العباس المرسي رضي الله عنه: كل موضع ذكر فيه المصلّون في معرض المدح فإنما جاء لمن أقام الصلاة، إما بلفظ الإقامة، وإما بمعنى يرجع إليها، قال تعالى { الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقيمُونَ الصَّلاَةَ } ، وقال تعالى:\n\n[الإسرَاء: 78]،\n\n[الحَجّ: 35]، ولما ذكر المصلّين بالغفلة قال:\n\n[الماعون: 4، 5] ولم يقل: فويل للمقيمين الصلاة\n وأما العمل المالي فهو الإنفاق في سبيل الله واجباً أو مندوباً، وهو من أفضل القربات، يقول الله - تبارك وتعالى:\n\n \" يا ابنَ آدم أنفِقْ، أنفقْ عليك \" \n\n، وفي حديث آخر:\n\n \" أنفِقْ ولا تخَفْ مِنْ ذي العرشِ إقْلالاً \" \n\nوقال صلى الله عليه وسلم:\n\n \" إنّ فِي الجنَةِ غُرفاً يُرى ظَاهِرُهَا مِنْ باطنها وباطِنَها مِنْ ظَاهِرهَا \" \n\n، قيل: لِمَنْ هِي يا رسولَ الله؟ قال:\n\n \" لِمَنْ أطْعَمَ الطعَامَ، وأفْشَى، السلام، وصَلى باللَّيْلِ والناسُ نِيام \" \n\nوقال أيضاً صلى الله عليه وسلم:\n\n \" إن الله - عزّ وجلّ - ليُدْخلُ باللقمةِ مِن الخبز والقبضةِ مِن التمْر ومثله ممَّا ينتفع به المسكين ثلاثةً، الجنةَ: رَب البيتِ الآمرَ به، والزوجة تصلحه، والخادمَ الذي يناولهُ المسْكِين \" \n\nوقال أيضاً صلى الله عليه وسلم:\n\n \" إنّ الصدقةَ لتسُدُّ سَبعينَ باباً من السّوء \" \n\n \n\nوقال أيضاً صلى الله عليه وسلم:\n\n \" صنائِع المعْرُوف تقي مَصارعَ السُّوءِ، وصدقةُ السِّر تُطفِئ غَضَبَ الربِّ، وصِلةُ الرَّحِم تزيدُ في العمرِ \"\n \n\nالإشارة: يا من غرق في بحر الذات وتيار الصفات { ذلك الكتاب } الذي تسمع من أنوار ملكوتنا، وأسرار جبروتنا { لا ريب فيه } أنه من عندنا، فلا تسمعه من غيرها،\n\n[القيامة: 18]، فهو هاد لشهود ذاتنا، ومرشد للوصول إلى حضرتنا، لمن اتقى شهود غيرِنا، وغرق في بحر وحدتنا، الذي يؤمن بغيب غيبنا، وأسرار جبروتنا، التي لا تحيط بها العلوم، ولا تسمو إلى نهايتها الأفكار والفهوم، الذي جمع بين مشاهدة الربوبية، والقيام بوظائف العبودية، إظهاراً لسر الحكمة بعد التحقق بشهود القدرة، فهو على صلاته دائم، وقلبه في غيب الملكوت هائم، ينفق مما رزقه الله من أسرار العلوم ومخازن الفهوم، فهو دائماً ينفق من سعة علمه وأنوار فيضه، فلا جرم أنه على بينة من ربه\n ولمَّا ذكر الحق تعالى من آمن من العرب، ذكر من آمن من أهل الكتاب\n\n",
      "translations": []
    }
  ]
}