{
  "chapter": "البقرة",
  "text": "واذ قال ربك للملئكة انى جاعل فى الارض خليفة قالوا۟ اتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك قال انى اعلم ما لا تعلمون",
  "translations": [
    {
      "translation": "Remember, when your Lord said to the angels: \"I have to place a trustee on the earth,\" they said: \"Will You place one there who would create disorder and shed blood, while we intone Your litanies and sanctify Your name?\" And God said: \"I know what you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just recall the time when your Lord said to the angels, \"I am going to appoint a vicegerent on the Earth.\" They humbly enquired, \"Are you going to appoint such a one as will cause disorder and shed blood on the Earth? We are already engaged in hymning Your praise, and hallowing Your name\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord said to the angels, \"I am appointing someone as my deputy on earth,\" they said (almost protesting), \"Are you going to appoint one who will commit corruption and bloodshed therein, even though we (are the ones who) commemorate Your Name and glorify You?\" The Lord said, \"I know that which you do not know\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord said to the angels, “I am about to place My Caliph in the earth”; they said, “Will You place (as a caliph) one who will spread turmoil in it and shed blood? Whereas we glorify You with praise and proclaim Your Sanctity”; He said, “I know what you do not.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord said to the angels: \"Verily, I am going to place (mankind) generations after generations on earth.\" They said: \"Will You place therein those who will make mischief therein and shed blood, ـ while we glorify You with praises and thanks and sanctify You.\" He (Allah) said: \"I know that which you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord said to the angels, I am going to place in the earth a khalif, they said: What! wilt Thou place in it such as shall make mischief in it and shed blood, and we celebrate Thy praise and extol Thy holiness? He said: Surely I know what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thy Lord said to the angels, 'I am setting in the earth a viceroy.' They said, 'What, wilt Thou set therein one who will do corruption there, and shed blood, while We proclaim Thy praise and call Thee Holy?' He said, 'Assuredly I know that you know not.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thy Lord said unto the angels: Lo! I am about to place a viceroy in the earth, they said: Wilt thou place therein one who will do harm therein and will shed blood, while we, we hymn Thy praise and sanctify Thee? He said: Surely I know that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord said to the angels, \"I am putting a successor on earth,\" they said, \"Will You place someone there who will cause corruption on it and shed blood, while we glorify You with Your praise and extol Your holiness?\" [God] answered, \"Surely, I know that which you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thine Lord said unto the angels: verily I am going to place a vicegerent On the earth. They said: wilt Thou place therein one who will act corruptly therein and shed blood While we hallow Thine praise and glorify Thee! Allah said: verily I know that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord said to the angels, ‘Indeed I am going to set a viceroy on the earth,’ they said, ‘Will You set in it someone who will cause corruption in it and shed blood, while we celebrate Your praise and proclaim Your sanctity?’ He said, ‘Indeed I know what you do not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, thy Lord said to the angels: \"I will create a vicegerent on earth.\" They said: \"Wilt Thou place therein one who will make mischief therein and shed blood?- whilst we do celebrate Thy praises and glorify Thy holy (name)?\" He said: \"I know what ye know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord said to the angels: \"Verily, I am going to place (mankind) generations after generations on earth.\" They said: \"Will You place therein those who will make mischief therein and shed blood, - while we glorify You with praises and thanks (Exalted be You above all that they associate with You as partners) and sanctify You.\" He (Allah) said: \"I know that which you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord said to the angels: 'I am placing on the earth a caliph,' they replied: 'Will You put there who corrupts and sheds blood, when we exalt Your praises and sanctify You?' He said: 'I know what you do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord said to the angels, “I am placing a successor on earth.” They said, “Will You place in it someone who will cause corruption in it and shed blood, while we declare Your praises and sanctify You?” He said, “I know what you do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when your Lord said to the angels, \"Indeed, I will make upon the earth a successive authority.\" They said, \"Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?\" Allah said, \"Indeed, I know that which you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:30] And, mention, O Muhammad (s), when your Lord said to the angels, ‘I am appointing on earth a vicegerent’, who shall act as My deputy, by implementing My rulings therein — and this [vicegerent] was Adam; They said, ‘What, will You appoint therein one who will do corruption therein, through disobedience, and shed blood, spilling it through killing, just as the progeny of the jinn did, for they used to inhabit it, but when they became corrupted God sent down the angels against them and they were driven away to islands and into the mountains; while we glorify, continuously, You with praise, that is, “We say Glory and Praise be to You”, and sanctify You?’, that is, ‘We exalt You as transcendent above what does not befit You?; the lām [of laka, ‘You’] is extra, and the sentence [wa-nuqaddisu laka, ‘We sanctify You’] is a circumstantial qualifier, the import being, ‘thus, we are more entitled to be Your vicegerents’); He, exalted be He, said, ‘Assuredly, I know what you know not’, of the benefits of making Adam a vicegerent and of the fact that among his progeny will be the obedient and the transgressor, and justice will prevail between them. They said, ‘God will never create anything more noble in His eyes than us nor more knowledgeable, since we have been created before it and have seen what it has not seen. God then created Adam from the surface of the earth (adīm al-ard [adīm literally means ‘skin’]), taking a handful of all its colours and mixing it with different waters, then made him upright and breathed into him the Spirit and he thus became a living being with senses, after having been inanimate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah, Exalted is He, mentioned the story of the angels who were commanded to prostrate to Adam, saying: (And when your Lord said unto the angels) who were already on the earth: (Lo! I am about to place a vicegerent in the earth), I am creating a vicegerent from the earth, (they said: Wilt Thou place therein), will you create therein (one who will do harm therein) by committing sin (and will shed blood) through transgression, (while we, we hymn Thy praise), pray following Your command (and sanctify Thee) and mention you in a state of purity? (He said: Surely I know that) which shall ensue from this vicegerent (which you know not).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَنُقَدِّسُ لَكَ } والتَّقْدِيسُ: التَّطْهِيرُ\n ويقالُ: التَّقْدِيسُ: الصَّلاةُ\n\n\n\n\nوقولهُ تعالى: { نُسَبِّحُ بِحَمْدِكَ } معناه نُصلي لَكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذْ قالَ ربكَ للملائكةِ } إذ: إشارة إلى السرمد الذي هو من الأزل إلى الأبد، والقول هو إلقاء معنى تعلق مشيئة الله تعالى بإيجاد آدم في الذوات القدسية الجبروتية التي هي الملائكة المقرّبون والأرواح المجرّدة والملكوتية التي هي النفوس السماوية إذ كل ما يحدث في عالم الكون له صورة قبل التكوين في عالم الروح الذي هو عالم القضاء السابق، ثم في عالم القلب الذي هو قلب العالم المسمّى باللوح المحفوظ، ثم في عالم النفس أي: نفس العالم الذي هو لوح المحو والإثبات المعبر عنه بالسماء الدنيا في التنزيل كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما قدر لنوع الإنسان جميع ما في العالم العلوي والسفلي أشار إلى اصطفاء شخصٍ من هذا النوع وانتخابه من بين الأشخاص؛ ليكون مظهراً جامعاً لائقاً لأمر الخلافة والنيات، فقال مخاطباً لنبيه، مذكراً له، مستحضراً إياه بقوله: { وَإِذْ قَالَ رَبُّكَ } أي: استحضر أنت يا أكمل الرسل فذكر ممن تبعك وقت قول ربك { لِلْمَلَٰئِكَةِ } الذين هم مظاهر لطفه ومجالي جماله، لا يظهر عليهم أثر من آثار الجلال والقهر { إِنِّي } أريد أن أطالع ذاتي وألاحظ أسمائي وأوصافي على التفصيل، فأنا { جَاعِلٌ فِي ٱلأَرْضِ } أي: العالم السفلي { خَلِيفَةً } مرآة مجلوة عن صداء الإمكان ورين التعلق؛ لأتجلى منها بجميع أوصافي وأسمائي حتى تعتدل خليفتي بأسمائي أخلاق من عليها وتصلح أحوالهم، وإذا شاور معهم قالوا في الجواب على مقتضى علمهم { قَالُواْ } في الجواب على مقتضى علمهم من العالم السفلي الذي هو عالم الكون والفساد ومنزل الجدال والعناد: ما نرى في العالم السفلي إلا اللدد والعناد والمخاصمة المستمرة بين العباد والخروج من حدودك من سفك الدماء ونهب الأموال وسبي الذراري { أَ } ن سلم ونجوز لك أن { تَجْعَلُ } بعزتك وكبريائك مع أنا ننزهك عن جميع الرذائل خليفة لك نائباً عنك { فِيهَا } في الأرض { مَن يُفْسِدُ فِيهَا } بأنواع الفسادات { وَ } خصوصاً { يَسْفِكُ ٱلدِّمَآءَ } المحرمة، وليس في وسعنا هذا التسليم، ولا نرى هذا الأمر لائقاً بجلالك وعصمتك، وإن شئت بفضلك وجودك أن تصلح بينهم { وَ } تدبر أمرهم { نَحْنُ } أولى بإصلاحهم وتدبيرهم وحفظ حدودك الموضوعة فيهم؛ إذ { نُسَبِّحُ } نشتغل دائماً { بِحَمْدِكَ } وثنائك على آلائك ونعمائك { وَنُقَدِّسُ } به { لَكَ } أي: ننزه ذاتك عن جميع ما يشعر بالعلل والأعراض فنحن أولى بأمر الخلافة والنيابة منه { قَالَ } تعالى بلسان الجمع في جوابهم؛ إرشاداً لهم وامتناناً لآدم: { إِنِّيۤ أَعْلَمُ } من آدم الذي هو مظهر ذاتي وجميع أسمائي { مَا } أي: شيء من الجامعية { لاَ تَعْلَمُونَ } [البقرة: 30] أنتم لعدم جميعتكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nلمّا أراد الله تعالى عمارة الأرض، بعد أن عمَّر السماوات بالملائكة، أخبر الملائكة بما هو صانع من ذلك تنويهاً بآدم وتشريفاً لذريته، وتعيماً لعباده أمر المشاورة، فقال لهم: { إنِّي جَاعِلٌ فِي الأَرْضِ خَلِيفَةً } يخلفني في أرضي وتنفيذ أحكامي، { قَالُوا } على وجه الاستفهام، أو من الإدلال، إن كان من المقربين، بعد أن رأوا الجن قد أفسدوا وسفكوا الدماء: { أَتَجْعَلُ مَن يُفْسِدُ فِيهَا } ، وشأن الخليفة الإصلاح، { وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ } ، أي: نسبح ملتبسين بحمدك، { ونُقَدِّسُ لَكَ } ، أي: نطهر أنفسنا لأجلك، أو ننزهك عما لا يليق بجلال قدسك، فنحن أحق بالخلافة منهم\n قال الحقّ جلّ وعلا: { إنِّي أَعْلَمُ مَا لا تَعْلَمُونَ } فإني أعلم أنه يكون منهم رسل وأنبياء وأولياء، ومن يكون مثلكم أو أعظم منكم، ولما ألقى الخليل في النار ضجت الملائكة وقال: \" يا رب هذا خليلك يحرق بالنار \"\n فقال لهم: \" إن استغاث بكم فأغيثوه \"\n فلما رفع همَّتَه عنهم قال الحقّ تعالى: { ألم أقل لكم إني أعلم ما لا تعلمون }",
      "translations": []
    }
  ]
}