{
  "chapter": "البقرة",
  "text": "وعلم ءادم الاسماء كلها ثم عرضهم على الملئكة فقال انۢبـونى باسماء هؤلاء ان كنتم صدقين",
  "translations": [
    {
      "translation": "Then He gave Adam knowledge of the nature and reality of all things and everything, and set them before the angels and said: \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah replied, \"I know what you do not know.\" After this he taught Adam the names of all things. Then He set these before the angels and asked, \"Tell Me the names of these things, if you are right (in thinking that the appointment of a vicegerent will cause disorder)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam all the names. Then He introduced (some intelligent beings) to the angels, asking them to tell Him the names of these beings, if the angels were true to their claim (that they more deserved to be His deputies on earth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah the Supreme taught Adam all the names (of things), then presented them to the angels, saying, “Tell Me the names of these, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names (of everything), then He showed them to the angels and said, \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names, then presented them to the angels; then He said: Tell me the names of those if you are right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; then He presented them unto the angels and said, 'Now tell Me the names of these, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names, then showed them to the angels, saying: Inform Me of the names of these, if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam all the names, then He set them before the angels and said, \"Tell Me the names of these, if what you say be true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; thereafter He set them before the angles, and said declare unto Me the names of those if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the Names, all of them; then presented them to the angels and said, ‘Tell me the names of these, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names of all things; then He placed them before the angels, and said: \"Tell me the names of these if ye are right.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam all the names (of everything), then He showed them to the angels and said, \"Tell Me the names of these if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He taught Adam (father of humans) the names all of them and then presented them to the angels, saying: 'Tell Me the names of these, if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names, all of them; then he presented them to the angels, and said, “Tell Me the names of these, if you are sincere.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He taught Adam the names - all of them. Then He showed them to the angels and said, \"Inform Me of the names of these, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:31] And He taught Adam the names, that is, the names of things named, all of them, by placing knowledge of them into his heart; then He presented them, these names, the majority of which concerned intellectual beings, to the angels and said, to them in reproach, ‘Now tell Me, inform Me, the names of these, things named, if you speak truly’, in your claim that I would not create anything more knowledgeable than you, or that you are more deserving of this vicegerency; the response to the conditional sentence is intimated by what precedes it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He taught Adam all the names), the names of all his progeny, or the names of all the beasts and other things, including: a cooking pot, a plate and saucer, (then showed them) to prove that they were wrong (to the angels) who were commanded to prostrate, (saying: Inform Me of the names of these) created beings and descendents, (if ye are truthful) in your first claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ادعى سبحانه استحقاقه للنيابة ولياقته للخلافة، وأجاب عن شبههم التي أوردوها إجمالاً وأشار إلى تفصيل ما أجمل عليهم إرشاداً لهم على مرتبة الجمع، وتنبيهاً على جلالة قدر المظهر الجامع فقال: { وَعَلَّمَ ءَادَمَ } سبحانه؛ أي: ذكره { ٱلأَسْمَآءَ } التي أودعها في ذاته وأوجد بها ما في العالم من الآثار البديعة { كُلَّهَا } بحيث لا يبقى من الأوصاف المتقابلة والأسماء المتخالفة المتضادة شيء إلا ما استأثر به في غيبه { ثُمَّ عَرَضَهُمْ } الأسماء المودعة باعتبار مسمياتها وآثارها الظاهرة في الآفاق { عَلَى ٱلْمَلَٰئِكَةِ } الذين يدعون الأولوية في أمر الخلافة { فَقَالَ } تعالى لهم مخاطباً على سبيل الإسكات والتبكيت: { أَنْبِئُونِي } عن روية وبصيرة { بِأَسْمَآءِ هَـٰؤُلاۤءِ } المسميات، وبأسباب هؤلاء الآثار والمسببات { إِن كُنْتُمْ صَٰدِقِينَ } [البقرة: 31] في دعوى الأولوية والأحقية للنيابة، محقين في الاعتراض على آدم لا عن علم بحاله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وَجَّهَ الحق تعالى استحقاقه للخلافة وهو تشريفه بالعلم، فقال: { وَعَلَّمَ آدَمَ الأَسْمَاءَ كُلَّهَا } ، أي مسميات الأسماء بأن ألقى في رُوعه ما تحتاج إليه ذريته من اللغات والحروف، وخواص الأشياء ومنافعها، ثم عرض تلك المسميات على الملائكة، إظهاراً لعجزهم، وتشريفاً لآدم بالعلم\n { فقال }: أخبروني { بأَسْمَاءِ هَؤُلاءِ } المسيمات { إن كنتم صادقين } في ادعائكم استحقاق الخلافة، فلما عجزوا عن معرفة تلك الأسماء { قَالُوا سُبْحَانَكَ } أي: تنزيهاً لك عن العبث، { لا عِلْمَ لَنَا إلاَّ مَا عَلَّمْتَنَا إنَّكَ أَنتَ الْعَلِيمُ } بكل شيء، { الْحَكيمُ } لإتقانك كل شيء، وهذا اعتراف منهم بالقصود والعجز، وإشعار بأن سؤالهم كان استفهاماً وطلباً لتفسير ما أشكر عليهم، ولم يكن اعتراضاً\n يقول الحقّ جلّ جلاله: { يَا آدَمُ أَنْبِئْهُمْ بِأَسْمَائِهِم } ، وعيِّن لهم اسم كل مسمى، فلما أخبرهم بذلك بحيث قال مثلاً: هذا فرس وهذا جمل، وعين ذلك لهم، وظهرت ميزته عليهم بالعلم حتى استحق الخلافة، قال الحقّ تعالى: { أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلمُ غَيْبَ السَّمَوَاتِ وَالأَرْضِ } أي: ما غاب، وأعلم ما تظهرونه من قولكم: { أَتَجْعَلُ فِيهَا\n\n\n } الخ، وما تكتمونه من استحقاقكم الخلافة، وقولكم: لن يخلق الله تعالى أحداً أعلم منا لتقدمنا، والفضل لمن صدق لا لمن سبق\n قال البيضاوي: اعلم أن هذه الآيات تدل على شرف الإنسان، ومزية العلم وفضله على العبادة، وأنه شرط في الخلافة، بل العمدة فيها، وأن التعليم يصح إطلاقه عليه تعالى، وإن لم يصح إطلاق المعلم عليه لاختصاصه بمن يحترف به، وأن اللغات توقيفية - عملها الله بالوحي -، وأن آدم عليه السلام أفضل من هؤلاء الملائكة لأنه أعلم منهم، والأعلم أفضل لقوله تعالى:\n\n\n\n[الزُّمَر: 9]، وأن الله يعلم الأشياء قبل حدوثها\n هـ\n باختصار\n وقال في تفسير الملائكة: إنهم أجسام لطيفة قادرة على التشكل، وهي منقسمة على قسمين: قسم شأنهم الاستغراق في معرفة الحق والتنزه عن الاشتغال بغيره، - وهم العليِّون، والملائكة المقربون - وقسم يدبرون الأمر من السماء إلى الأرض على ما ثبت به القضاء وجرى به القلم الإلهي، وهم المدبرات أمراً، فمنهم سماوية، ومنه أرضية\n هـ\n مختصراً\n الإشارة: اعلم أن الروح القائمة بهذا الآدمي هي قطعة من الروح الأعظم التي هي المعاني القائمة بالأواني، وهي آدم الأكبر والأب الأدم، وفي ذلك يقول ابن الفارض:\n\nفلمّا أراد الحق تعالى أن يستخلف هذا الروح في هذه البشرية لتدبرها وتصرفها فيما أريد منها، قالت الملائكة بلسان حالها: كيف تجعل فيها من يفسد فيها بالميل إلى الحظوظ والشهوات، ويسفك الدماء بالغضب والحميات، ونحن نسبحك وننزهك عما لا يليق بك؟ رأت الملائكة ما يصدر من بعض الأرواح من الميل إلى الحضيض الأسفل، ولم تر ما يصدر في بعضها من التصفية والترقية، فقال لهم الحق تعالى: { إني أعلم ما لا تعلمون } فإن منها من تعرج إلى عرش الحضرة، وتعبدني بالفكرة والنظرة، وتستولي على الوجود بأسره، وتنكشف لها عند ذلك أسرار الذات وأنوار الصفات وأسماء المسميات",
      "translations": []
    }
  ]
}