{
  "chapter": "البقرة",
  "text": "قالوا۟ سبحنك لا علم لنا الا ما علمتنا انك انت العليم الحكيم",
  "translations": [
    {
      "translation": "And they said: \"Glory to You (O Lord), knowledge we have none except what You have given us, for You are all-knowing and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Glory be to You. You alone are free from defect. We possess only that much knowledge which You have given us. Indeed You alone are All-Knowing and All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels replied, \"You are glorious indeed! We do not know more than what You have taught us. You alone are All-knowing and All-wise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Purity is to You! We do not have any knowledge except what You have taught us! Indeed You only are the All Knowing, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (angels) said: \"Glory is to You, we have no knowledge except what you have taught us. Verily, You are the Knower, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Glory be to Thee! we have no knowledge but that which Thou hast taught us; surely Thou art the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Glory be to Thee! We know not save what Thou hast taught us. Surely Thou art the All-knowing, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Be glorified! We have no knowledge saving that which Thou hast taught us. Lo! Thou, only Thou, art the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Glory be to You; we have no knowledge except whatever You have taught us. You are the All Knowing, the All Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: hallowed be Thou no knowledge is our save that which Thou hast taught us, verily Thou! Thou art the Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Immaculate are You! We have no knowledge except what You have taught us. Indeed You are the All-knowing, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Glory to Thee, of knowledge We have none, save what Thou Hast taught us: In truth it is Thou Who art perfect in knowledge and wisdom.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (angels) said: \"Glory be to You, we have no knowledge except what you have taught us. Verily, it is You, the All-Knower, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exaltations to You,' they replied, 'we have no knowledge except that which You have taught us. You are indeed the Knowing, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Glory be to You! We have no knowledge except what You have taught us. It is you who are the Knowledgeable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Exalted are You; we have no knowledge except what You have taught us. Indeed, it is You who is the Knowing, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:32] They said, ‘Glory be to You!, exalting You above that any should object to You, We know not except what   You have taught us. Surely You are (innaka anta emphasises the [preceding suffixed pronoun] kāf) the Knower, Wise’, from whose knowledge and wisdom nothing escapes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Be glorified!), we repent to you of what we said (We have no knowledge saving that which Thou hast taught us), inspired us with. (Lo! Thou, only Thou, art the Knower) of us and of them (the Wise) regarding our matters and theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } مستوحشين من هذه الكلمات، معتذرين متذليين خائفين من عتابه تعالى، متذكرين عن سوء الأدب مع الله، مستحيين عن سؤالهم من فعله الذي لا يسأل عنه قائلين: { سُبْحَٰنَكَ } ننزهك من أن يعترض عليك ويسأل عن فعلك، ذلك الحكم في ملكوتك والتصرف في مقتضيات أسمائك، وإنما بسطنا معك الكلام لا لانبساطك بنا؛ إذ { لاَ عِلْمَ لَنَآ } منها { إِلاَّ مَا عَلَّمْتَنَآ } بقدر استعداداتنا وقابلياتنا { إِنَّكَ أَنْتَ ٱلْعَلِيمُ } بجميع الاستعدادات والقابليات { ٱلْحَكِيمُ } [البقرة: 32] بإقامته ما ينبغي لمن ينبغي بلا عللٍ واعتراضٍ\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فيقول الحق تعالى للملائكة: هل فيكم من كشف له عن هذا السر المكنون، والاسم المصون، فقالوا: { سُبْحَانَكَ لا عِلْمَ لَنَا إِلاَّ مَا عَلَّمْتَنَا } من علم الصفات دون أسرار الذات { إنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ } يقول الحق تعالى لروح العارف التي نفذت إلى بحر وحدة الذات وتيار الصفات: أنبئهم بما غاب عنهم من أسرار الجبروت، وأسماء الملكوت، فلما أعلمهم بما كوشف له من الأسرار، وانفق له من الأنوار، أقروا بشرف الآدمي، وسجدوا لطلعة آدم عليه السلام فقال الحق لهم: { أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ غَيْبَ السَّمَوَاتِ وَالأَرْضِ }؟ أي: ما غاب في سماء الأرواح من الأسرار وفي أرض النفوس من الأنوار، وأعلم ما تظهرونه من الانقياد، وما تكتمونه من الاعتقاد، والله تعالى أعلم\n ولما تبينّ شرف آدم عليه السلام وبان فضله أمرهم بالسجود له\n\n",
      "translations": []
    }
  ]
}