{
  "chapter": "البقرة",
  "text": "وقلنا يـادم اسكن انت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظلمين",
  "translations": [
    {
      "translation": "And We said to Adam: \"Both you and your spouse live in the Garden, eat freely to your fill wherever you like, but approach not this tree or you will become transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We said, \"O Adam, you and your wife, both dwell in the Garden and eat to your hearts' content where from you will, but do not go near this tree; otherwise you shall become transgressors\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told Adam to stay with his spouse (Eve) in the garden and enjoy the foods therein, but not to go near a certain tree lest he become one of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said, “O Adam! You and your wife dwell in this Garden, and eat freely from it wherever you please – but do not approach this tree for you will become of those who transgress.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: \"O Adam! Dwell you and your wife in the Paradise and eat both of you freely with pleasure and delight, of things therein wherever you will, but come not near this tree or you both will be of the Zalimin (wrongdoers). \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: O Adam! Dwell you and your wife in the garden and eat from it a plenteous (food) wherever you wish and do not approach this tree, for then you will be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said, 'Adam, dwell thou, and thy wife, in the Garden, and eat thereof easefully where you desire; but draw not nigh this tree, lest you be evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: O Adam! Dwell thou and thy wife in the Garden, and eat ye freely (of the fruits) thereof where ye will; but come not nigh this tree lest ye become wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"O Adam! live with your wife in Paradise and eat freely from it anywhere you may wish. Yet do not approach this tree lest you become wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: Adam! dwell thou and thine spouse in the Garden, and eat ye twain plenteously thereof as ye list, but approach not yonder tree, lest yet twain become of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, ‘O Adam, dwell with your mate in paradise and eat thereof freely whencesoever you wish, but do not approach this tree, lest you should be among the wrongdoers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: \"O Adam! dwell thou and thy wife in the Garden; and eat of the bountiful things therein as (where and when) ye will; but approach not this tree, or ye run into harm and transgression.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: \"O Adam! Dwell you and your wife in the Paradise and eat both of you freely with pleasure and delight of things therein as wherever you will, but come not near this tree or you both will be of the Zalimun (wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Adam We said: 'Dwell with your wife in Paradise and both eat of it as much as you wish and wherever you will. But neither of you should come close to this tree or else you shall both become transgressors'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, “O Adam, inhabit the Garden, you and your spouse, and eat from it freely as you please, but do not approach this tree, lest you become wrongdoers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said, \"O Adam, dwell, you and your wife, in Paradise and eat therefrom in [ease and] abundance from wherever you will. But do not approach this tree, lest you be among the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:35] And We said, ‘Adam, dwell (anta, ‘you’ [of ‘dwell you’] here reiterates the concealed pronoun [of the person of the verb uskun], so that it [wa-zawjuk] may be made a supplement to it); and your wife, Eve (Hawwā’) — who was created from his left rib — in the Garden, and eat thereof, of its food, easefully, of anything without restrictions, where you desire; but do not come near this tree, to eat from it, and this was wheat or a vine or something else, lest you be, become, evildoers’, that is, transgressors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah, Exalted is He, mentioned the story of Adam and Eve, saying: (And We said: Adam! Dwell thou and thy wife in the Garden) enter you and Eve into Paradise (and eat ye freely (of the fruits)) without restriction (thereof where ye will) and whenever you will; (but come not near this tree) but do not eat from this tree, the tree of knowledge, which includes all types and kinds (lest ye become of the wrong-doers), lest you harm yourselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَكُلاَ مِنْهَا رَغَداً } فالرَّغَدُ: الكثيرُ الواسِعُ\n ويقالُ: الرَّغَدُ: الذي لا حِسابَ عَلَيهمْ فيهِ\n\n\n\n\nوقولهُ تعالى: { وَلاَ تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ } قالَ زيدُ بن علي عليهما السَّلامُ: هي شَجرةُ الكَرْمِ\n وقال: في مَوضعٍ آخرَ هي السّنبلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } وبعد ما خلقنا آدم في الأرض خليفة وأنزلنا عنه قوادح القاحدين، وأمرمنا جميع خصمائه بسجوده وتكريمه، وامتثلوا بالمأمور جميعاً إلا إبليس، تركه للحكمة المذكورة آنفاً ولئلا يتكبر آدم ويتجه بسببه انقياد جميعهم كما تجبر كثير من أبنائه في الأرض بانقياد الشرذمة القليلة { قُلْنَا } له على سبيل الشفقة والنصيحة: { يَآءَادَمُ } المستخلف المختار، لازم العبودية إنما تحصل بامتثال أوامرنا واجتناب نواهينا، ومتى قبلت بحمل الامتثال والاجتناب { ٱسْكُنْ أَنْتَ } أيها الخليفة أصالة { وَزَوْجُكَ } تبعاً لك { ٱلْجَنَّةَ } التي هي دار السرور ومنزل الفراغ والحضور، ومقام الأنس من الرب الغفور { وَ } إذا سكنتما فيها { كُلاَ } تمتعاً { مِنْهَا } من جميع محظوظاتها ومستلذاتها الروحانية والجسمانية { رَغَداً } واسعاً بلا مقدار وعدد { حَيْثُ شِئْتُمَا } بلا مزاحمة أحد { وَلاَ تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ } المخصوصة المعينة حتى لا تخرجا من رق العبودية وإن قربتما { فَتَكُونَا مِنَ ٱلْظَّٰلِمِينَ } [البقرة: 35] الخارجين عن حدو الله بارتكاب المنهي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رغداً }:صفة لمصدر محذوف، أي: أكلا رغداً واسعاً، و { تكونا }: منصوب، جواب الأمر، أو معطوف على { تقرباً } ، و { أزلهما }: أوقعهما في الزلل بسبب الأكل، أو أذهبهما عن الجنة، ويدل عليه قراءة حمزة: \" فأزالهما \" وجملة { بعضكم لبعض عدو }: حالية، أي: متعادين\n يقول الحقّ جلّ جلاله: { وَقُلْنَا يَا آدَم } حين سجدت له الملائكة ودخل الجنة: { اسْكُنْ أَنتَ وَزَوْجُكَ } حواء { الجنة } ، وكانت خلقت من ضلعه الأيسر، { وَكُلا } من ثمار الجنة { حَيْثُ شِئْتُمَا وَلا تَقْرَبَا هَذِهِ الشَّجِرَةَ }: العنب أو التين أو الحنطة { فَتَكُونَا } إن أكلتما منها { مِنَ الظَّالِمِينَ } لنفسيكما\n فدخل إبليس خفية أو في فم الحية، فتكلم مع آدم عليه السلام فقال له آدمُ عليه السلام: ما أحسن هذه الحالة لو كان الخلود\n فحفظها إبليس، ووجد فيها مدخلاً من جهة الطمع، فقال له:\n\n[طه: 120] فدلّه على أكل الشجرة، وقال:\n\n[الأعرَاف: 20] عنها\n\n[الأعراف: 20] كراهية\n\n[الأعراف: 20، 21]",
      "translations": []
    }
  ]
}