{
  "chapter": "البقرة",
  "text": "فازلهما الشيطن عنها فاخرجهما مما كانا فيه وقلنا اهبطوا۟ بعضكم لبعض عدو ولكم فى الارض مستقر ومتع الى حين",
  "translations": [
    {
      "translation": "But Satan tempted them and had them banished from the (happy) state they were in. And We said: \"Go, one the antagonist of the other, and live on the earth for a time ordained, and fend for yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After a time Satan tempted them with that tree to disobey. Our Command and brought them out of the state they were in, and We decreed, \"Now, go down all of you from here; you are enemies of one another. Henceforth you shall dwell and provide for yourselves on the Earth for a specified period.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan made Adam and his spouse err and caused them to abandon the state in which they had been living. Then We said, \"Descend, you are each other's enemies! The earth will be a dwelling place for you and it will provide you with sustenance for an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the devil destabilised them in it and removed them from where they were – and We said, “Go down, one of you is an enemy to the other; and for a fixed time you shall stay on earth and feed in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Shaytan made them slip therefrom (the Paradise), and got them out from that in which they were. We said: \"Get you down, all, with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Shaitan made them both fall from it, and caused them to depart from that (state) in which they were; and We said: Get forth, some of you being the enemies of others, and there is for you in the earth an abode and a provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan caused them to slip therefrom and brought them out of that they were in; and We said, 'Get you all down, each of you an enemy of each; and in the earth a sojourn shall be yours, and enjoyment for a time.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to deflect therefrom and expelled them from the (happy) state in which they were; and We said: Fall down, one of you a foe unto the other! There shall be for you on earth a habitation and provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them both to slip through this and thus brought about the loss of their former state. We said, \"Go down from here as enemies to each other; and on earth you shall have your abode and your livelihood for a while!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Satan caused the twain to slip on account thereof, and drave them forth from that which the twain were in. And We said: get ye down, one of you an enemy unto anot her, and for you on the earth shall be a resting-place and enjoyment for a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan caused them to stumble from it, and he dislodged them from what [state] they were in; and We said, ‘Get down, being enemies of one another! On the earth shall be your abode and sustenance for a time.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did Satan make them slip from the (garden), and get them out of the state (of felicity) in which they had been. We said: \"Get ye down, all (ye people), with enmity between yourselves. On earth will be your dwelling-place and your means of livelihood - for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Shaitan (Satan) made them slip therefrom (the Paradise), and got them out from that in which they were. We said: \"Get you down, all, with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But satan made them slip therefrom and caused them to depart from that in which they had been. 'Go down,' We said, 'be enemies to each other. The earth will provide your dwelling place an enjoyment for a while'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to slip from it, and caused them to depart the state they were in. We said, “Go down, some of you enemies of one another. And you will have residence on earth, and enjoyment for a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, \"Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:36] Then Satan, Iblīs, caused them to slip, he caused them to be removed (fa-azallahumā: a variant reading has fa-azālahumā: he caused them to be away from it) therefrom, that is, from the Garden, when he said to them, ‘Shall I point you to the tree of eternity’ [cf. Q. 20:120], and swore to them by God that he was only giving good advice to them, and so they ate of it; and brought them out of what they were in, of bliss; and We said, ‘Go down, to earth, both of you and all those comprised by your seed; some of you, of your progeny, an enemy to the other, through your wronging one another; and in the earth a dwelling, a place of settlement, shall be yours, and enjoyment, of whatever of its vegetation you may enjoy, for a while’, [until] the time your terms [of life] are concluded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But the Devil caused them to deflect), caused them to slip (therefrom), from Paradise, (and expelled them from the state in which they were), from the comfort which they had enjoyed; (and We said) to Adam, Eve, the peacock and the serpent (Fall down) go down to the earth, (one of you a foe unto the other! There shall be for you on earth a habitation), a dwelling-place, (and a provision), a benefit and livelihood, (for a time) until the moment of death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { مَتَاعٌ إِلَىٰ حِينٍ } أَي إِلى وقتٍ، والمَتَاعُ: الزَّادُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولما استشعر إبليس التوصية والمعاهدة المذكورة المنبئة عن كمال العناية الإلهية بالنسبة إلى آدم، بادر إلى دفعها ورفضها، فوسوس لهما بأن ألقى في قلبهما الدغدغة في تخصيص هذه الشجرة المعنية بالنهي وأنساهما المعاهدة المذكورة في العبودية، وبالجملة: { فَأَزَلَّهُمَا } ألجأهما إلى ارتكاب الزلة بوسوسة { ٱلشَّيْطَانُ عَنْهَا } العدو لهما والرقيب معهما فتنادوا عنها عن الشجرة المنهية { فَأَخْرَجَهُمَا مِمَّا } أي: من الحضور الذي { كَانَا فِيهِ } أي: في دار السرور { وَ } بعدما ظهر زلتهما { قُلْنَا } لهما ولناصحهما: { ٱهْبِطُواْ } من دار السرور إلى دار الغرور، ومن دار الكرامة إلى دار الابتلاء والملائمة، وعيشوا فيها مع النزاع والخصومة؛ إذ { بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ } ينتهز الفرصة لمقته { وَ } بعد هبوطمم { لَكُمْ فِي ٱلأَرْضِ } التي هي محل التفرقة وموطن الفتن والمحن { مُسْتَقَرٌّ } موضع قرار { وَمَتَاعٌ } استمتاع لمزخرفاتها ومستلذاتها الغير القارة التي ألهاكم الشيطان بها عن النعيم الدائم { إِلَىٰ حِينٍ } [البقرة: 36] قيام الساعة التي هي الطامة الكبرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وأكلت حواء أولاً، ثم قالت له: قد أكلتُ ولم يضرني، ثم أكل آدم عليه السلام من جنس الشجرة، لا من عينها، متأوّلاً، فطار التاج واللباس، وأخرجهما { مما كانا فيه } من رغد العيش والعناء، وأهبطهما إلى الأرض، للتعب والعناء، ليكون خليفة على ما سبق به القضاء\n فقال لهم الحقّ تعالى: { اهْبطُوا } آدم وحواء وإبليس والحية، { بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِي الأَرْضِ } استقرار وتمتع { إلَى حِينٍ } وفاتكم، فتقدمون علي فيجازي المحسن بإحسانه، والمسيء بإساءته، { فَتَلَقَّى } أي أخذ { آدم من ربه كلمات } وهي:\n",
      "translations": []
    }
  ]
}