{
  "chapter": "البقرة",
  "text": "فتلقى ءادم من ربه كلمت فتاب عليه انه هو التواب الرحيم",
  "translations": [
    {
      "translation": "Then his Lord sent commands to Adam and turned towards him: Indeed He is compassionate and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that time Adam learnt appropriate words from his Lord and repented, and his Lord accepted his repentance, for He is very Relenting and very Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adam was inspired by some words (of prayer) through which he received forgiveness from his Lord, for He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam learnt from his Lord certain words (of revelation), therefore Allah accepted his repentance; indeed He only is the Most Acceptor of Repentance, the Most Merciful. (See Verse 7:23)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord Words. And his Lord pardoned him (accepted his repentance). Verily, He is the One Who forgives (accepts repentance), the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received (some) words from his Lord, so He turned to him mercifully; surely He is Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter Adam received certain words from his Lord, and He turned towards him; truly He turns, and is All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord words (of revelation), and He relented toward him. Lo! He is the relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received some words [of prayer] from his Lord and He accepted his repentance. He is the Forgiving One, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam learnt from his Lord certain Words, and He relented toward him, verily He! He is the Relentant, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received certain words from his Lord, and He turned to him clemently. Indeed He is the All-clement, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then learnt Adam from his Lord words of inspiration, and his Lord Turned towards him; for He is Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord Words. And his Lord pardoned him (accepted his repentance). Verily, He is the One Who forgives (accepts repentance), the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received Words from his Lord, and his Lord relented towards him. He is the Receiver of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received words from his Lord, so He relented towards him. He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:37] Thereafter Adam received certain words from his Lord, with which He inspired him (a variant reading [of Ādamu] has accusative Ādama and nominative kalimātu), meaning they [the words] came to him, and these were [those of] the verse Lord, we have wronged ourselves [Q. 7:23], with which he supplicated, and He relented to him, that is, He accepted his repentance; truly He is the Relenting, to His servants, the Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then Adam received from his Lord) Adam learnt from his Lord, and it is said that he was taught and inspired with (words) so that they became a way for him and his progeny to repentance, (and He relented towards him), He forgave him. (Indeed! He is the Relenting), the One Who overlooks misdeeds, (the Merciful) towards any that dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَتَلَقَّىٰ ءَادَمُ مِن رَّبِّهِ كَلِمَٰتٍ } أي قَبِلَها\n والكَلماتُ: قَولُهُما رَبَّنا ظَلَمنا أَنفُسَنا، وإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمنَا، لَنكوننَّ من الخَاسِرينَ\n\n\n\n\nوقولهُ تعالى: { إِنَّهُ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ } والتَوابُ: المُعينُ للعبادِ على التّوبةِ، والتَّوابُ من العِبادِ: الرَّاجعُ عن ذَنبهِ، التَّاركُ لَهُ، والنَّادِمُ على مَا تَابَ مِنهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما لم يكن زلة آدم من نفسه ومن مقتضى طبعه بل بسوسوة عدوه، أشفق عليه وتوجه نحوه وتطلف معه { فَتَلَقَّىٰ } استفاد { ءَادَمُ } المذنب العاصي { مِن رَّبِّهِ } المستخلف المستقبل عليه { كَلِمَٰتٍ } مشتملات على الرجوع والإنانية عما صدر عنه من زلة هي قوله:\n\n[الأعراف: 23] ولما تلقى آدم من ربه هذه الكلمات واستغفر بها، ورجع عما صدر { فَتَابَ } الله { عَلَيْهِ } أي: قبل توبته ورحم عليه { إِنَّهُ هُوَ ٱلتَّوَّابُ } الرجاع للمذنبين المنهمكين في العصيان بالإنابة إليه عن ظهر الجنان { ٱلرَّحِيمُ } [البقرة: 37] لهم عما صدر عنهم من المعاصي والآثام بلا معاتبة ولا انتقام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الأعرَاف: 23 } ، { فتاب } الحق تعالى عليه واجتباه لحضرته، فإنه توّاب كثير التوبة على عباده، رحيم بهم، أرحم من أبيهم وأمهم، اللهم ارحمنا رحمة تعصمنا بها عن رؤية السّوي، إنك على كل شيء قدير\n الإشارة: يقول الحقّ جلّ جلاله للروح، إذا كمل تهذيبها، وتمت تريبتُها: اسكن أنت وبشريتك التي تزوجتها - قال تعالى:\n",
      "translations": []
    }
  ]
}