{
  "chapter": "البقرة",
  "text": "قلنا اهبطوا۟ منها جميعا فاما ياتينكم منى هدى فمن تبع هداى فلا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "And We said to them: \"Go, all of you. When I send guidance, whoever follows it will neither have fear nor regret;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Now go down, all of you from here. Henceforth there shall come to you Guidance from Me now and again: whoever will follow it shall have neither fear nor sorrow\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We ordered them all to get out of the garden and told them that when Our guidance came to them, those who would follow it would have neither fear nor grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, “Go down from Paradise, all of you; then if some guidance comes to you from Me – so whoever follows My guidance, for such is neither fear nor any grief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: \"Get down all of you from this place (the Paradise), then whenever there comes to you Hudan (guidance) from Me, and whoever follows My guidance, there shall be no fear on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: Go forth from this (state) all; so surely there will come to you a guidance from Me, then whoever follows My guidance, no fear shall come upon them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, 'Get you down out of it, all together; yet there shall come to you guidance from Me, and whosoever follows My guidance, no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: Go down, all of you, from hence; but verily there cometh unto you from Me a guidance; and whoso followeth My guidance, there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Go down, all of you, from here: then when guidance comes to you from Me, anyone who follows My guidance will have no fear, nor will they grieve --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: get ye all down from hence, and if there cometh unto you a guidance from Me, then whosoever shall follow Mine guidance, -- no fear shall come on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, ‘Get down from it, all together! Yet, should any guidance come to you from Me, those who follow My guidance shall have no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: \"Get ye down all from here; and if, as is sure, there comes to you Guidance from me, whosoever follows My guidance, on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: \"Get down all of you from this place (the Paradise), then whenever there comes to you Guidance from Me, and whoever follows My Guidance, there shall be no fear on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go down, all together,' We said, 'so if a guidance shall come to you from Me, whosoever follows My guidance no fear shall be on them, neither shall they be saddened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, “Go down from it, all of you. Yet whenever guidance comes to you from Me, then whoever follows My guidance—they have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:38] We said, ‘Go down from it, from the Garden, all together (He has repeated this [phrase qulnā ihbitū] in order to supplement it with), yet (fa-immā: the nūn of the conditional particle in [‘if’] has been assimilated with the extra mā) there shall come to you from Me guidance, a Book and a prophet, and whoever follows My guidance, believing in me and performing deeds in obedience of Me, no fear shall befall them, neither shall they grieve, in the Hereafter, since they will be admitted into Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We said) to Adam, Eve, the serpent, the peacock and Satan: (Go down) from heaven, (all of you). Then Allah, Exalted is He, mentioned Adam's progeny, (from hence; but verily there cometh unto you), when and whenever it comes to you, (from Me a guidance), a scripture and an emissary; (whoso followeth My guidance) the scripture and the emissary, (there shall no fear come upon them) regarding any torment in the future, (neither shall they grieve) about what they have left behind them. It is also said that this means that no fear will come upon them perpetually and nor will they grieve perpetually; no fear will come upon them when death is slain and they will not grieve when hell is closed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قلنا اهْبِطوا منها جميعاً } كرر ذلك الأمر بالهبوط ليفيد أنه هو الذي أراد ذلك ولولا إرادته لما قدر إبليس على إغوائهم، لهذا أسند الإهباط إلى نفسه مجرداً عن التعليق بالسبب بعد إسناد إخراجهما إلى الشيطان، فهو قريب مما قال لنبيه:\n\n[الأنفال، الآية: 17] فتفطن منه سرّ قضائه وقدره وبين وجه حكمة الإهباط بتعقيبه بقوله: { فإما يأتينكم مني هُدى فمن تبع هداي فلا خوفٌ عليهم ولا هم يَحزَنُونَ } وإيراده بالفاء إذ لولا الهبوط لما أمكنهم من متابعة الهدى، ولما تميز السعيد والشقيّ، ولا حصل استحقاق الثواب والعقاب، ولبطل دار الجزاء من الجنة والنار، بل ما وجدت\n والهدى هو الشرع فمن تبعه أمن سوء العاقبة فلم يخف مما يأتي من العقاب والفناء، وتسلى عن الشهوات واللذات، فلم يحزن على ما فاته من حطام الدنيا ونعيمها لاكتحال بصيرته بنور المتابعة واهتدائه إلى ما لا يقاس بلذات الدنيا من الأذواق الروحانية، والفتوحات السريّة، والمشاهدات القلبية، والعلوم العقلية، والمواجيد النفسية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما تلقناه الكلمات التي تاب بها وقبلنا عنه توبته، أخرجناه من اليأس والقنوط وأطمعناه الرجوع إلى الجنة بأن: { قُلْنَا } له ولذريته المتفرعة عليه، منبهين عليهم طريق الرجوع { ٱهْبِطُواْ } الزموا مكان الهبوط، واستقروا عليها حال كونكم خارجين { مِنْهَا جَمِيعاً } ومن الجنة، وترقبوا دخولها بإذن منا { فَإِمَّا يَأْتِيَنَّكُم } أيها المترقبون { مِّنِّي } لا غيري { هُدًى } من وحي وإلهام، وهو علامة إذني ودليل رضاي برجوعكم { فَمَن تَبِعَ هُدَايَ } ومن رجع إلي به { فَلاَ خَوْفٌ عَلَيْهِمْ } في المراجعة إلى المقام الأصلي { وَلاَ هُمْ يَحْزَنُونَ } [البقرة: 38] بعد رجوعهم إليها بل كما بدأكم تعودون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إن }: شرط، و { ما } زيدت لتقوية الشرط، ولذلك دخلت نون التوكيد، وعبر بإن دون { إذا } ، مع تحقق مجيء الهدى لأنه غير واجب عقلاً، وجملة الشرط الثاني وجوابه، الشرط الأول، و { جميعاً } حال مؤكدة أي: اهبطوا أنتم أجمعون، ولذلك لا يقتضي اجماعهم على الهبوط في زمان واحد\n ولما أمر الحقّ جلا جلاله آدم أولاً بالهبوط من الجنة، جعل يبكي ويتضرّع ويقول: ألم تخلقني بيدك؟ ألم تسجد لي ملائكتك؟ ألم تدخلني جنتك؟ ثم ألهم الكلمات التي تلقاها من ربه، فتاب عليه ورحمه، فطمع آدم حين سمع من ربه قبول توبته في البقاء في الجنة، فقال له الحقّ جلّ جلاله: يا آدم لا يجاورني من عصاني، وقد سبقت كلمتي بهبوطك إلى الأرض لتكون خليفتي بذريتك، فكرّر عليه الأمر بالهبوط ثانياً\n فقال: { اهبطوا منها جميعا } أنتما بما اشتملتما عليه من ذريتكما\n فمهما { يَأتِيَنَّكُم مِنِّي هُدىً } أي: بيان وإرشاد إلى توحيدي ومعرفتي، على يد رسول أو نائب عنه، { فَمَن تَبعَ } ذلك الإرشاد، واهتدى إلى معرفتي وتوحيدي، وعمل بطاعتي وتكاليفي، { فَلا خَوْفٌ عَلَيْهِمْ } من لحُوق مكروه { وَلا هُمْ يَحْزَنُونَ } من فوات محبوب، لأني أَصرف عنهم جميع المكاره، وأجلب لهم المنافع، { والذين كفروا وكذبوا بآياتنا } الدالّة على قدرتنا المنزلة على رسلنا،\n",
      "translations": []
    }
  ]
}