{
  "chapter": "البقرة",
  "text": "والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "But those who deny and reject Our signs will belong to Hell, and there abide unchanged.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and whoever will refuse to accept it and defy Our Revelations they shall be doomed to the Fire wherein they shall remain for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who would deny the Truth and reject Our revelations would be the companions of the Fire in which they would live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and deny Our signs, are the people of fire (hell); they will remain in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) ـ such are the dwellers of the Fire. They shall abide therein forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who disbelieve in and reject My communications, they are the inmates of the fire, in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers who cry lies to Our signs, those shall be the inhabitants of the Fire, therein dwelling forever.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they who disbelieve, and deny Our revelations, such are rightful Peoples of the Fire. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who deny and reject Our signs shall be the inhabitants of the Fire; therein shall they abide forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and belie Our signs, --they, shall be fellows of the Fire; therein they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are faithless and deny Our signs, they shall be the inmates of the Fire and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Faith and belie Our Signs, they shall be companions of the Fire; they shall abide therein.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) such are the dwellers of the Fire, they shall abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our verses shall be the companions of the Fire, and there they shall live for ever'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who disbelieve and reject Our signs—these are the inmates of the Fire—wherein they will remain forever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:39]   As for the disbelievers who deny Our signs, Our Books, those shall be the inhabitants of the Fire, abiding therein’, enduring perpetually, neither perishing nor exiting therefrom.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But those who disbelieve, and deny our revelations), the scripture and the Emissary, (such are rightful owners of the Fire), the dwellers of hell. (They will abide therein forever), they will remain perpetually in hell: never to die or be released from it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والذينَ كَفَروا } أي: حجبوا عن الدين لكونه في مقابلة اتباع الهدى\n وإردافه بقوله: { وكَذبوا بِآياتِنا أُولئكَ أَصحابُ النارِ } أي: نار الحرمان { هم فيها خالدون * يا بَنِي إسرائيلَ اذكُروا نِعمتي التي أنعمتُ عليكم وأوفُوا بِعَهدي أُوفِ بعهدكم وإيايَ فارهبون } بنو إسرائيل هم أهل اللطف الإلهيّ، وأرباب نعمة الهداية والنبوة، دعاهم باللطف وتذكير النعمة السابقة، والعهد السالف المأخوذ منهم في التوراة بتوحيد الأفعال بعد العهد الأزليّ كما هو عادة الأحباب عند الجفاء\n\n\nوهذه الدعوة مخصوصة بتوحيد الصفات الذي هو رفع الحجاب الثاني، فهي أخص من الدعوة الأولى العامة لتذكير النعمة الدينية والعهد والتجلّي بصفة المنعم والوليّ، والتهديد على عدم إجابتها بالرهبة التي هي أخصّ من الخوف، فإن الخوف إنما يكون من العقاب، والرهبة من السخط والقهر، والإعراض والاحتجاب والخشية أخص منها لكونها مخصوصة باحتجاب الذات\n قال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ } لم يرتبقوا الرجوع، ونسوا ما هم عليه في الجنة ولم يلتفتوا إلى الهدى المؤتى، و { كَفَرواْ } به وأنكروا له { وَكَذَّبُواْ } رسلنا الذين أتوا إياهم { بِآيَٰتِنَآ } دلائلنا الدالة على صدقهم من المعجزات الظاهرة، والآثار الباهرة { أُولَـٰئِكَ } الهابطون الناسون والموطن الأصلي والمقام الحقيقي، المستبدلون عن الجنة بعرض هذا الأدنى، والكافرون بطريق الحق، والمكذبون بمن يهديهم { أَصْحَٰبُ ٱلنَّارِ } التي هي معدن البعد والخذلان، ومنزل الطرد والحرمان { هُمْ } بسبب نسيانهم وتكذيبهم { فِيهَا خَٰلِدُونَ } [البقرة: 39] إلى ما شاء الله\n\n\n\n\nربنا لا تزغ قلوبنا بعد إذ هديتنا، وهب لنا من لدنك رحمة، إنك أنت الوهاب\n\n\n\n\nثم لما بين سبحانه وتعالى طريق الهداية والضلال، ونبه على جزاء كل منهما إجمالاً، أشار إلى تفصيله وتوضيحه من قصص القرون الماضية والأمم السالفة، ليتيقن المؤمنين منها ومن جملتها قصة ندائه تعالى بني إسرائيل أولاد يعقوب إسرائيل الله، مخاطباً لهم أمر تذكرهم بالنعم التي أنعمها عليهم؛ ليكونوا من الشاكرين لنعمه، الموفين بعهده بقوله:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}