{
  "chapter": "البقرة",
  "text": "والذين يؤمنون بما انزل اليك وما انزل من قبلك وبالءاخرة هم يوقنون",
  "translations": [
    {
      "translation": "Who believe in what has been revealed to you and what was revealed to those before you, and are certain of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in the Book We have sent down to you (i.e. the Qur'an) and in the Books sent down before you, and firmly believe in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have faith in what has been revealed to you and others before you and have strong faith in the life hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in this (Qur’an) which has been sent down upon you, O beloved Prophet, (Mohammed – peace and blessings be upon him) and what was sent down before you; and are certain of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who have faith in what is revealed to you and in what was revealed before you, and in the Hereafter they are certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in that which has been revealed to you and that which was revealed before you and they are sure of the hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who believe in what has been sent down to thee and what has been sent down before thee, and have faith in the Hereafter;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in that which is revealed unto thee (Muhammad) and that which was revealed before thee, and are certain of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who believe in the revelation sent down to you and in what was sent before you, and firmly believe in the life to come --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in that which hath been sent down unto thee and that which hath been sent down before thee and of the Hereafter they are convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who believe in what has been sent down to you and what was sent down before you, and are certain of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in the Revelation sent to thee, and sent before thy time, and (in their hearts) have the assurance of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in (the Quran and the Sunnah) which has been sent down (revealed) to you (Muhammad Peace be upon him) and in [the Taurat (Torah) and the Injeel (Gospel), etc.] which were sent down before you and they believe with certainty in the Hereafter. (Resurrection, recompense of their good and bad deeds, Paradise and Hell, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who believe in that which has been sent down to you (Prophet Muhammad) and what has been sent down before you (to Prophets Jesus and Moses) and firmly believe in the Everlasting Life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in what was revealed to you, and in what was revealed before you, and are certain of the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:4] and who believe in what has been revealed to you, namely, the Qur’ān; and what was revealed before you, that is, the Torah, the Gospel and other [scriptures]; and of the Hereafter, they are certain, that is, they know [it is real].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who believe in that which is revealed unto thee (Muhammad)) of the Qur'an (and that which was revealed before you) of scriptures given to all the prophets, (and are certain of the Hereafter), they believe in resurrection after death and in the bliss of Paradise, referring here specifically to 'Abdullah Ibn Salam and his followers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والذين يؤمنون بما أنزل إليك وما أنزل من قبلك } أي: الإيمان التحقيقيّ الشامل للأقسام الثلاثة المستلزم للأعمال القلبية التي هي التحلية، وهي تفرّس القلب بالحكم والمعارف المنزّلة في الكتب الإلهية والعلوم المتعلقة بأحوال المعاد، وأمور الآخرة، وحقائق علم القدس\n ولهذا قال: { وبالآخرة هم يوقنون } وأهل الآخرة الذين ما جاوزوا حدّ التزكية، ولم يصلوا إلى التحلية التي هي ميراثها، لقوله عليه السلام:\n\n \" من عمل بما علم ورّثه الله علم ما لم يعلم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وٱلَّذِينَ يُؤْمِنُونَ } ينقادون ويمتثلون { بِمَآ أُنْزِلَ إِلَيْكَ } من الكتاب الجامع أسرار جميع ما أنزل من الكتاب السالفة على الوجه الأحسن الأبلغ، ومن السنن ومن الأخلاق الملهمة إليك { وَ } مع ذلك صريحاً يعتقدون { مَآ أُنْزِلَ مِن قَبْلِكَ } من الكتب المنزلة على الأنبياء الماضين مع الإيمان بجميع الكتب المنزلة، وإن كان كل كتاب متضمناً للإيمان بالنشأة الآخرة بل هو المقصود الأصلي من جميعها { وَبِٱلآخِرَةِ هُمْ يُوقِنُونَ } [البقرة: 4] أفردها بالذكر؛ اهتماماً بشأنها لكثرة المرتابين فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}