{
  "chapter": "البقرة",
  "text": "وءامنوا۟ بما انزلت مصدقا لما معكم ولا تكونوا۟ اول كافرۭ به ولا تشتروا۟ بـايتى ثمنا قليلا وايى فاتقون",
  "translations": [
    {
      "translation": "And believe in what I have sent down which verifies what is already with you; and do not be the first to deny it, nor part with it for little gain; and beware of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in the Book I have now sent down; as it confirms the Scriptures you already possess, be not the first to reject it; barter not away My Revelations for paltry worldly gain, and guard yourselves against My wrath\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in My revelations (Quran) that confirms what I revealed to you (about Prophet Muhammad in your Scripture). Do not be the first ones to deny it nor sell My revelations for a small price, but have fear of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And accept faith in what I have sent down (the Qur’an), which confirms what is with you (the Torah / Bible), and do not be the first to disbelieve in it – and do not exchange My verses for an abject – and fear Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I have sent down (this Qur'an), confirming that which is with you (the Tawrah and the Injil), and be not the first to disbelieve therein, and buy not with My verses (the Tawrah and the Injil) a small price (i.e. getting a small gain by selling My verses), and fear Me and Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I have revealed, verifying that which is with you, and be not the first to deny it, neither take a mean price in exchange for My communications; and Me, Me alone should you fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in that I have sent down, confirming that which is with you, and be not the first to disbelieve in it. And sell not My signs for a little price; and fear you Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in that which I reveal, confirming that which ye possess already (of the Scripture), and be not first to disbelieve therein, and part not with My revelations for a trifling price, and keep your duty unto Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in the message I have sent down which fulfils that [predictions about the last prophet in their Scripture] which you already possess and do not be foremost among those who deny its truth. Do not sell My revelations for a paltry price; fear Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in that which I have sent down confirming that which is with you, and be not the first to disbelieve therein, and barter not My revelations for a small price, and Me alone shall ye fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in that which I have sent down confirming that which is with you, and do not be the first ones to deny it, and do not sell My signs for a paltry gain, and be wary of Me [alone].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I reveal, confirming the revelation which is with you, and be not the first to reject Faith therein, nor sell My Signs for a small price; and fear Me, and Me alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I have sent down (this Quran), confirming that which is with you, [the Taurat (Torah) and the Injeel (Gospel)], and be not the first to disbelieve therein, and buy not with My Verses [the Taurat (Torah) and the Injeel (Gospel)] a small price (i.e. getting a small gain by selling My Verses), and fear Me and Me Alone. (Tafsir At-Tabari, Vol. I, Page 253).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I have sent down confirming what is with you, and do not be the first to disbelieve it. Do not sell My verses for a little price and fear Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I revealed, confirming what is with you; and do not be the first to deny it; and do not exchange My revelations for a small price; and be conscious of Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And believe in what I have sent down confirming that which is [already] with you, and be not the first to disbelieve in it. And do not exchange My signs for a small price, and fear [only] Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:41] And believe in what I have revealed, of the Qur’ān, confirming that which is with you, of the Torah, by its agreement with it, in respect to [affirmation of] God’s Oneness and prophethood; and be not the first to disbelieve in it, from among the People of the Scripture, for those who will come after you will depend on you and so you will bear their sins. And do not sell, exchange, My signs, those that relate to the description of Muhammad (s) in your Book; for a small price, for a trivial and temporary affair of this world; that is to say, do not suppress this for fear of losing what you hope to earn from lowly individuals among you; and fear Me, and none other in this matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And believe in that which I revealed) through the Archangel Gabriel, (confirming) the Oneness of Allah and the description and traits of Muhammad (pbuh) and some prescribed laws (that which ye possess already) of scripture, (and be not first to disbelieve therein) in Muhammad (pbuh) and the Qur'an (and part not with My revelations) by not revealing the description and traits of Muhammad (for a trifling price) in exchange for means of substance, (and keep your duty unto Me), fear Me regarding this Prophet (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } علامة وفائكم بعهدي هي الإيمان { آمِنُواْ } على وجه الإخلاص والإيقان { بِمَآ أَنزَلْتُ } من فضلي على كل واحدٍ من رسلي بالقرآن المنزل على الحضرة الختمية الخاتمية، المؤيد بالدلائل القاطعة والحجج الساطعة والمعجزات الباهرة، والآيات الظاهرة مع كونه { مُصَدِّقاً لِّمَا مَعَكُمْ } من الكتب المنزلة على الأنبياء الماضين، مشتملاً على ما فيها من الأحكام والقصص والمواعظ والحقائق مع لطائف أخر خلت عنها جميعها، وبعد ظهور المنزل به وادعاء من أنزل عليه الرسالة والإهداء { وَلاَ تَكُونُوۤاْ أَوَّلَ كَافِرٍ بِهِ } أي: لا تكونوا مبادرين على الكفر بالمهدي وما هدى به، بل كونوا أول من آمن به وصدق بما جاء به من عند ربه، فانتهزوا الفرصة للإيمان ولا تغفلوا عنه { وَ } بعد نزوله وظهوره { لاَ تَشْتَرُواْ } ولا تستبدلوا { بِآيَٰتِي } المنزلة على أنبيائي { ثَمَناً قَلِيلاً } من المزخرفات الفانية { وَ } إن عسر عليكم ترك هذا الاستبدالا لميل نفوسكم إليه بالطبع { إِيَّٰيَ } عند عروض ذلك { فَٱتَّقُونِ } [البقرة: 41] لأحفظكم عنه وأسهله عليكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}