{
  "chapter": "البقرة",
  "text": "ولا تلبسوا۟ الحق بالبطل وتكتموا۟ الحق وانتم تعلمون",
  "translations": [
    {
      "translation": "Do not confuse truth with falsehood, nor conceal the truth knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Confound not the Truth with falsehood nor conceal it knowingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not mix truth with falsehood and do not deliberately hide the truth\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not mix the truth with falsehood, nor purposely conceal the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mix not truth with falsehood, nor conceal the truth while you know (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not mix up the truth with the falsehood, nor hide the truth while you know (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not confound the truth with vanity, and do not conceal the truth wittingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Confound not truth with falsehood, nor knowingly conceal the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not mix truth with falsehood, or hide the truth when you know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And confound not the truth with falsehood, nor hide the truth while ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not mix the truth with falsehood, nor conceal the truth while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cover not Truth with falsehood, nor conceal the Truth when ye know (what it is).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mix not truth with falsehood, nor conceal the truth [i.e. Muhammad Peace be upon him is Allah's Messenger and his qualities are written in your Scriptures, the Taurat (Torah) and the Injeel (Gospel)] while you know (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not confound truth with falsehood, nor knowingly hide the truth while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not mix truth with falsehood, and do not conceal the truth while you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not mix the truth with falsehood or conceal the truth while you know [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:42] And do not obscure, confuse, the truth, that I have revealed to you, with falsehood, that you fabricate; and do not conceal the truth, the description of Muhammad (s), wittingly, that is, knowing it to be the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Confound not truth with falsehood), do not mix the Truth with falsehood, i.e. the description of the anti- Christ with the description of Muhammad (pbuh) (nor knowingly conceal the Truth), nor conceal the Truth while you know what is the Truth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَلْبِسُواْ ٱلْحَقَّ } الظاهر الثابت { بِٱلْبَٰطِلِ } الموهوم الزخرف للضعفاء الذين تمييز لهم { وَ } لا { تَكْتُمُواْ ٱلْحَقَّ } أيضاً في نفوسكم { وَأَنْتُمْ تَعْلَمُونَ } [البقرة: 42] حقيقته عقلاً وسمعاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وحذف مفعول { ارهبون } لرؤوس الآي وكذا قوله: { وإياي فاتقون } ، والرهبة: خوف مع تحرُّز، و { تكتموا }: معطوف على { تلبسوا } ، أو منصوب بأن مضمرة بعد النهي، و { أنتم تعلمون }: جملة حالية\n يقول الحقّ جلّ جلاله: { يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ } التي خصصتُكم بها، بأن فضلتكم على أهل زمانكم، وجعلت فيكم أنبياء ورسلاً، كلما انقرض نبيّ بعثت نبيّاً آخر، وجعلتكم ملوكاً وحكاماً على الناس، قبل أن تفسدوا في الأرض بقتل الأنبياء، فتكفروا بهذه النعم، فإن الإنسان حسود غيروٌ بالطبع، فإذا نظر إلى ما أنعم الله على غيره حمله الحسد والغيرة على السخط والكفران، وإذا نظر إلى ما أنعم الله به عليه حمله حب النعمة على الرضا والشكر، فاذكروا ما أنعمت به عليكم، وقيدوه بالشكر، { وَأَوْفُوا بِعَهْدِي } الذي عهدت إليكم، وهو أنكم إن أدركتم محمداً صلى الله عليه وسلم لتؤمنن به ولتنصرنه، ولتبينن صفته التي في كتابكم، ولا تكتمونها، { أُوفِ بِعَهْدِكُمْ } بأن أدخلكم جنتي، وأبيح لكم النظر إلى وجهي، وأحل عليكم رضواني في جملة عبادي، ولا ترهبوا أحداً غيري، فإنه لا فاعل غيري\n وبادروا إلى الإيمان { بِمَا أَنْزَلْتُ } على محمد رسولي، من كتابي، الذي هو مصدق { لِّمَا مَعَكُمْ } من التوراة، ومهيمن عليه، { وَلاَ تَكُونُوا أَوَّلَ } فريق { كَافِرِ بِهِ } ، فتبوؤوا بإثمكم وإثم من تبعكم، ولا تستبدلوا الإيمان الذي هو سبب الفوز في الدارين، بالعرضِ الفاني الذي تأخذونه من سفلتكم، فإنه ثمن قليل يعقبه عذاب جليل وخزي كبير\n ولا تخشوا أحداً سواي فإن النفع والضرر بيدي، ولا تخلطوا { الْحَقَّ } الذي هو ذكر محمد صلى الله عليه وسلم وصفته التي في كتابكم، { بِالْبَاطِلِ } الذي تريدونه تحريفاً وتأويلاً، { و } لا { تكتموا الحّقَّ } الذي عندكم، من ذكر محمد وصحة رسالته، { وَأَنتُمْ تَعْلَمُونَ } أنكم محرفون، ولابسون عناداً وحسداً، فيحل عليكم غضبي وعقابي،\n\n[طه: 81]\n فإذا حصلتم أصول الدين، وهو الإيمان، فاشتغلوا بفروعه، وهي الصلاة والزكاة وغيرهما، فأدوهما على منهاج المسلمين\n واجعلوا صلاتكم في جماعة المؤمنين فإنَّ صلاة الجماعة تُفضلُ غيرها بسبعٍ وعشرين درجة، مع سريان واقتباس الأنوار من الصالحين والأبرار، وبالله التوفيق\n الإشارة: إذا توجَّه الخطاب إلى طائفة مخصوصة، حمله أهل الفهم عن الله على عمومه لكل سامع، فإن الملك إذا عاتب قوماً بمحضر آخرين، كان المراد بذلك تحذير كل مَن يسمع، فكأن الحق جلّ جلاله يقول: يا بني آدم اذكروا نعمتي التي أنعمت عليكم، وتفكروا في أصولها وفروعها، واشكروني عليها بنسبتها إليَّ وحدي، فإنه لا منعم غيري، فمن شكرني شكرته، ومن فيض إحساني وبري مددته، ومن كفر نعمتي سلبته، وعن بابي طردته، وأوفوا بعهدي بالقيام بوظائف العبودية، أوف بعهدكم بأن أطلعكم على أسرار الربوبية\n\n\nأو: { أوفوا بعهدي } بالقيام برسوم الشريعة، { أوفِ بعهدكم } بالهداية إلى منار الطريقة، أو: { أوفوا بعهدي } بسلوك منهاج الطريقة، { أوفِ بعهدكم } بالإيصال إلى عين الحقيقة، أو: { أوفوا بعهدي } بالاستغراق في بحر الشهود، { أوفِ بعهدكم } بالترقي أبداً غلى الملك الودود، وخصّوني بالرهب والرغب، وتوجهوا إليّ في كل سؤال وطلب، أعطف عليكم بعنايتي وودي، وأمنحكم من عظيم إحساني ورفدي، { وآمنوا بما أنزلت } على قلوب أوليائي، ومن مواهب أسراري وآلائي، تصديقاً لما أتحفت به رسلي وأنبيائي، فكل ما ظهر على الأولياء فهو معجزة للأنبياء وتصديق لهم، ولا تبادروا بالإنكار على أوليائي، فتكونوا سبباً في طرد عبادي عن بابي، ولا يمنعكم حب الرئاسة والجاه عن الخضوع إلى أوليائي، ولا ترقبوا أحداً غيري، فإني أمنعكم من شهود سري\n { ولا تلبسوا الحق بالباطل } ، فتظهروا شعار الصالحين وتبطنوا أخلاق الفاسقين، تتزيوا بزي الأولياء، تفعلوا فعل الأغوياء، وإذا تحققتم بخصوصية أحد من عبادي، فلا تكتموها عن أهل محبتي وودادي، وأقيموا صلاة القلوب بالخضوع تحت مجاري الأقدار، وأدّوا زكاة النفوس بالذل والانكسار، وكونوا مع الخاشعين، { واركعوا مع الراكعين } ، أمنحكم معونتي ونصري، وأفيض عليكم من بحر إحساني وبري، أنا عند المنكسرة قلوبهم من أجلي\n\n",
      "translations": []
    }
  ]
}