{
  "chapter": "البقرة",
  "text": "واقيموا۟ الصلوة وءاتوا۟ الزكوة واركعوا۟ مع الركعين",
  "translations": [
    {
      "translation": "Be firm in devotion; give zakat (the due share of your wealth for the welfare of others), and bow with those who bow (before God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish the Salat, pay the Zakat and bow down before Me along with those who bow down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be steadfast in prayer, pay the religious tax (zakat) and bow down in worship with those who do the same.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep the (obligatory) prayer established, and pay the charity, and bow your heads with those who bow (in prayer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform As-Salah, and give Zakah, and bow down along with Ar-Raki`in.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And keep up prayer and pay the poor-rate and bow down with those who bow down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform the prayer, and pay the alms, and bow with those that bow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish worship, pay the poor-due, and bow your heads with those who bow (in worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Attend to your prayers, give the zakat [prescribed alms] and bow down with those who bow down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish prayer, and give the poor-rate, and bow down with those who bow down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And maintain the prayer, and give the zakat, and bow along with those who bow [in prayer].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be steadfast in prayer; practise regular charity; and bow down your heads with those who bow down (in worship).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perform As-Salat (Iqamat-as-Salat), and give Zakat, and Irka' (i.e. bow down or submit yourselves with obedience to Allah) along with Ar-Raki'un.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Establish your prayers, pay the obligatory charity, and bow with those who bow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And attend to your prayers, and practice regular charity, and kneel with those who kneel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And establish prayer and give zakah and bow with those who bow [in worship and obedience].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:43] And establish prayer, and pay the alms, and bow with those that bow, that is, pray with those who pray, Muhammad (s) and his Companions: this was revealed concerning their religious scholars, who used to say to their kin from among the Muslims, ‘Stay firm upon the religion of Muhammad (s), for it is the truth’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then proceeded to mention the necessity of observing the law once they had become believers, saying: (And establish prayer) fulfil completely the five prescribed prayers, (pay the poor-due), pay the poor-due from your wealth, (and bow your heads with those who bow), pray the five prescribed prayers in congregation with Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آمنتم بالله وكتبه المنزلة على رسله ذهبتم عما نهيتم { أَقِيمُواْ ٱلصَّلٰوةَ } أديموا الميل والتقرب إلى جنابه، وتوجهوا نحو بابه بجميع الأعضاء والجوارح، قاصدين فيه تخلية الظاهر والباطن عن الشواغل النفسية، والعوائق البدنية المانعة من الميل الحقيقي { وَآتُواْ ٱلزَّكَٰوةَ } المطهرة لنفوسهم عن العلائق الخارجية، والعوارض اللاحقة المثمرة لأنواع الأمراض في الباطن في البخل والحسد والحقد و غير ذلك { وَ } إن قصدتم التقرب والتوجه على الوجه الأتم الأكمل { ٱرْكَعُواْ } تذللوا وتضرعوا إليه سبحانه { مَعَ ٱلرَّٰكِعِينَ } [البقرة: 43] الذين خرجوا عن هوياتهم بالموت الإرادي، ووصلوا إلى ما وصلوا بل اتصلوا، لا مع الذين يراءون الناس، ويقولون بأفواههم ما ليس في قلوبهم، لذلك خاطبهم الحق سبحانه على سبيل التوبيخ، فقال:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}