{
  "chapter": "البقرة",
  "text": "اتامرون الناس بالبر وتنسون انفسكم وانتم تتلون الكتب افلا تعقلون",
  "translations": [
    {
      "translation": "Will you enjoin good deeds on the others and forget your own selves? You also read the Scriptures, why do you then not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you enjoin others to follow the Right Way, but forget it yourselves, though you read the Scriptures? Have you no sense at all?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you order people to do good deeds and forget to do them yourselves even though you read the Book? Why do you not think?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! You enjoin righteousness upon people while you forget (to practise it) yourselves, whereas you read the Book? Do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin you Al-Birr (piety and righteousness and every act of obedience to Allah) on the people and you forget (to practise it) yourselves, while you recite the Scripture (Tawrah)! Have you then no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! do you enjoin men to be good and neglect your own souls while you read the Book; have you then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you bid others to piety, and forget yourselves while you recite the Book? Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin ye righteousness upon mankind while ye yourselves forget (to practise it)? And ye are readers of the Scripture! Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you admonish others to do good and forget this yourselves? Yet you read the Book. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Command ye mankind to piety and forget yourselves, the while ye read the Book! Understand then ye not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you bid others to piety and forget yourselves, while you recite the Book? Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye enjoin right conduct on the people, and forget (To practise it) yourselves, and yet ye study the Scripture? Will ye not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin you Al-Birr (piety and righteousness and each and every act of obedience to Allah) on the people and you forget (to practise it) yourselves, while you recite the Scripture [the Taurat (Torah)]! Have you then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would you order righteousness on others and forget it yourselves? Yet you recite the Book, have you no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you command people to virtuous conduct, and forget yourselves, even though you read the Scripture? Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you order righteousness of the people and forget yourselves while you recite the Scripture? Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:44] Will you bid others to piety, to belief in Muhammad (s), and forget yourselves, neglecting yourselves and not bidding them to the same, while you recite the Book?, in which there is the threat of chastisement, if what you do contradicts what you say. Do you not understand? the evil nature of your actions, that you might then repent? (the sentence about ‘forgetting’ constitutes the [syntactical] locus of the interrogative of disavowal).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He mentioned the story of the Jewish leaders, saying: (Enjoin ye righteousness upon mankind), do you enjoin the Oneness of Allah and the following of Muhammad (pbuh) upon people of humble background (while ye yourself forget), while you yourself refrain from following him? (And you are readers of the Scripture!) to them. (Have ye then no sense?) do you not possess the common sense possessed by human beings?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أتأمرونَ الناسَ بالبِر } الذي هو الفعل الجميل الموجب لصفاء القلب، وزكاء النفس الزائد منها بالتنوّر { وتَنسَونَ أنفسكم } أفلا تفعلون ما ترتقون به من مقام تجلّي الأفعال إلى تجلّي الصفات { وأنتُم تَتْلُونَ } كتاب فطرتكم الذي يأمركم باتباع محمد في دينه السالك بكم سبيل التوحيد { أفلا تعقِلونَ } تعيير بالغ، وتهييج لحميتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَتَأْمُرُونَ } أيها المراءون المدعون لليقين والعرفان { ٱلنَّاسَ } على سبيل النص والتذكير { بِٱلْبِرِّ } المقرب إلى الله { وَتَنْسَوْنَ } أنتم { أَنْفُسَكُمْ } من امتثال ما قلتم { وَ } الحال أنكم { أَنْتُمْ تَتْلُونَ ٱلْكِتَٰبَ } المشتمل على الأوامر والنواهي، فحقكم أن تمتثلوا بها أولاً { أَ } تلتزمون تذكير الغير، وأنتم في الغفلة { فَلاَ تَعْقِلُونَ } [البقرة: 44] ثبيح صنيعكم هذا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: البر، بالكسر: يجمع وجوه الخير وأنواع الطاعات، والنسيانُ: الترك\n يقول الحقّ جلّ جلاله في توبيخ أخبار اليهود: كانوا إذا استرشدهم أحد من العرب دلّوه على الإسلام، وقالوا له: دين محمد حق، وهم يمتنعون منه، وقيل: كانوا يأمرون الناس بالصدقة وهم يبخلون، فقال لهم: كيف { تأمرون الناس بالبر } والإحسان، وتتركون { أَنفُسَكُمْ } في الكفر والعصيان، وأنتم تدرسون التوراة الصحيح، وتعلمون أن ذلك من أقبح القبيح؟، أفلا عقل لكم يزجركم عن هذه الخصلة الذميمة؟ فإن من شأن العقل التمييز بين القبيح والحسن والنافع والضار، فكل من تقدم لما فيه ضرره فلا عقل له\n الإشارة: كل مَن أشار إلى مقام لم يبلغْ قدمه إليه، فهذا التوبيخ متوجِّهُ إليه، وكل مَن ذكر غيره بعيب لم يتخلص منه، قيل له: أتأمر الناس بالبر وتنسى نفسك خالية منه، فلا يسلم من توبيخ هذه الآية من أهل التكذير إلا الفرد النادر من أهل الصفاء والوفاء\n وقال البيضاوي: المراد بها حثّ الواعظ على تزيكة النفس، والإقبال عليها بالتكميل لتُقَوم فيُقَيِّم، لا منع الفاسق عن الوعظ، فإن الإخلال بأحد الأمرين المأمور بهما لا يوجب الإخلال بالآخر\n فانظره\n وتأمل قول القائل:\n",
      "translations": []
    }
  ]
}