{
  "chapter": "البقرة",
  "text": "الذين يظنون انهم ملقوا۟ ربهم وانهم اليه رجعون",
  "translations": [
    {
      "translation": "Who are conscious that they have to meet their Lord, and to Him they have to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who realize that ultimately they shall meet their Lord and shall return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who are certain of their meeting with their Lord and their return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who know that they have to meet their Lord, and that it is to Him they are to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are those) who are certain that they are going to meet their Lord, and that unto Him they are going to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who know that they shall meet their Lord and that they shall return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who reckon that they shall meet their Lord and that unto Him they are returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who know that they will have to meet their Lord, and that unto Him they are returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who know for certain that they will meet their Lord, and that they will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who know that verily they are going to meet their Lord, and that verily unto Him they are going to return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who are certain that they will encounter their Lord and that they will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who bear in mind the certainty that they are to meet their Lord, and that they are to return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are those) who are certain that they are going to meet their Lord, and that unto Him they are going to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who reckon that they will meet their Lord and that to Him they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who know that they will meet their Lord, and that to Him they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are certain that they will meet their Lord and that they will return to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:46] who reckon, who are certain, that they shall meet their Lord, at the Resurrection, and that to Him they are returning, in the Hereafter, where He will reward them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "who know that they will have to meet their Lord) see Him, (and that unto Him they are returning) after they die.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ رَبِّهِمْ } فالظَّنُّ: اليَقينُ\n ويكونُ الظَّنُ شَكْاً، ويكونُ تُهمةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ } يرفعون رين الغيرية عن العين، ويسقطون شين الاثنينية عن البين { يَظُنُّونَ أَنَّهُم مُّلَـٰقُواْ رَبِّهِمْ } في هذه النشأة؛ لأنهم يعبدون إليه كأنهم يرونه { وَ } يعلمون يقيناً { أَنَّهُمْ إِلَيْهِ } لا إلى غيره؛ إذ لا وجود للغير { رَٰجِعُونَ } [البقرة: 46] عائدون صائرون في النشأة الأخرى، اللهم اجعلنا من متبعيهم ومحبيهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n الذين يتيقنون { إَنَّهُمْ مُّلاقُوا رَبِّهِمْ } فيتنعمون بالنظر إلى وجه الكريم، ويتيقنون أيضاً أنهم راجعون إلى ربهم بالبعث والحشر للثواب والعقاب، وإنما عبَّر الحق تعالى هنا بالظن في موضع اليقين إبقاء على المذنبين، وتوفراً على العاصين، الذين ليس لهم صفاء اليقين إذ لو ذكر اليقين صرفاً لخرجوا من الجملة، فسبحانه من رب حليم، وجواد كريم\n اللهم امنن علينا بصفاء المعرفة واليقين، حتى لا يختلج قلوبنا وَهْمٌ ولا ريب، يا رب العالمين\n الإشارة: يا من رام الدخول إلى حضرة الله، تذلل وتواضع لأولياء الله، وتجرّع الصبر في ذلك كي يدخلوك حضرة الله، كما قال القائل:\n",
      "translations": []
    }
  ]
}