{
  "chapter": "البقرة",
  "text": "واتقوا۟ يوما لا تجزى نفس عن نفس شيـا ولا يقبل منها شفعة ولا يؤخذ منها عدل ولا هم ينصرون",
  "translations": [
    {
      "translation": "Take heed of the day when no man will be useful to man in the least, when no intercession matter nor ransom avail, nor help reach them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against the Day when no one shall avail anyone anything; nor shall intercession be accepted from anyone; nor shall anyone be acquitted for any (amount of) ransom; nor shall the guilty ones be helped from any quarter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have fear of the day when every soul will be responsible for itself. No intercession or ransom will be accepted and no one will receive help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear the Day (of Resurrection) when no soul will be exchanged for another, nor will any intercession be accepted for the disbelievers, nor will they be set free in lieu of compensation nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day (of Judgement) when a person shall not avail another, nor will intercession be accepted from him, nor will compensation be taken from him, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be on your guard against a day when one soul shall not avail another in the least, neither shall intercession on its behalf be accepted, nor shall any compensation be taken from it, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and beware of a day when no soul for another shall give satisfaction, and no intercession shall be accepted from it, nor any counterpoise be taken, neither shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And guard yourselves against a day when no soul will in aught avail another, nor will intercession be accepted from it, nor will compensation be received from it, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Guard yourselves against the Day on which no soul shall in the least avail another, when neither intercession nor ransom shall be accepted from it nor shall help be given to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day whereon not in aught shall a soul satisfy for a soul, nor shall intercession be accepted thereof, shall compensation be received therefor, nor shall they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware of the day when no soul will compensate for another, neither any intercession shall be accepted from it, nor any ransom shall be received from it, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then guard yourselves against a day when one soul shall not avail another nor shall intercession be accepted for her, nor shall compensation be taken from her, nor shall anyone be helped (from outside).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day (of Judgement) when a person shall not avail another, nor will intercession be accepted from him nor will compensation be taken from him nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Guard yourselves against the Day when no soul can avail a thing to another, when neither intercession nor ransom shall be accepted from it, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beware of a Day when no soul will avail another in the least, nor will any intercession be accepted on its behalf, nor will any ransom be taken from it, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fear a Day when no soul will suffice for another soul at all, nor will intercession be accepted from it, nor will compensation be taken from it, nor will they be aided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:48] and fear, be scared of, the day when no soul for another shall give satisfaction, which is the Day of Resurrection, and no intercession shall be accepted (read either tuqbal or yuqbal) from it, that is, it is not the case that it has power to intercede, for it then to be accepted from it [or rejected, as God says], So now we have no intercessors [Q. 26:100]; nor any compensation, ransom, be taken, neither shall they be helped, to avoid God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And guard yourselves against a day), and if you do not believe and repent of Judaism, then fear the torment of a day (when no soul will in anything avail another), no unbelieving soul will avail another unbelieving soul, (nor will intercession be accepted from it) and no intercessor will be allowed to intercede, (nor will compensation be received from it) and no ransom accepted, (neither will they be helped) to avoid Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ذكرتم النعم وعرفتم المنعم المفضمل، لا تغتروا بفضلي ولطفي بل احذروا من انتقامي وقهري { وَٱتَّقُواْ يَوْماً } تحشرون إلي للجزاء، وفي ذلك اليوم { لاَّ تَجْزِي } لا تسقط { نَفْسٌ } مطيعة كانت أو عاصية { عَن نَّفْسٍ } عاصية { شَيْئاً } من جزائها وعذابها { وَ } أيضاً { لاَ يُقْبَلُ } فيها { مِنْهَا } من النفس العاصية { شَفَٰعَةٌ } من شافع صديق حميم { وَ } كذا { لاَ يُؤْخَذُ مِنْهَا عَدْلٌ } لتمهل مدة { وَلاَ هُمْ يُنْصَرُونَ } [البقرة: 48] فيه بالأعوان والأنصار، بل كل نفس رهينة بما كسبت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وخافوا { يَوْماً } لا تَقْضي فيه { نَفْسٌ عَن نَّفْسِ شَيْئًا } بحيث لا تجلِب لها نفعاً، ولا تدفع عنها ضرراً، ولا تقبل { مِنْهَا شَفَاعَةٌ } إن وقعت الشفاعة فيها، ولا يؤخذ منها فداء، إن أرادت الفداء عنها، ولا تنتصر في دفع العذاب، إن أرادت الانتصار بعشيرتها\n فانتفى عنها وجوه الامتناع من العذاب بأي وجه أمكن فإن الإنسان إذا أُخذ للنكال احتال على نفسه إما بالشفاعة، أو بالفداء إن لم تقبل الشفاعة فيه، أو بالانتصار بأقاربه، والآيةُ في الكفار، فلا حجةَ لمن ينفِي الشفاعة في عُصَاة المؤمنين، والله تعالى أعلم\n الإشارة: قد يتوجَّهُ العتاب إلى أهل الرئاسة والجاه، من العلماء والصالحين، وكل من خُصَّ بشرف أو خصوصية، فيقول لهم الحق تعالى: { اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ } بالعلم أو السيادة أو الصلاح، وبأن فضلتكم على أهل زمانكم، وخصصتكم من أبناء جنسكم فقد رُوِيَ: \" أنَّ العبد يُحاسب على جاهه كما يُحاسب على ماله \"\n فمن صرفه في طاعة الله، وتواضع لعباد الله، وسعى في حوائجهم، وأبلغ الجهد في قضاء مآربهم، كان ذلك شكراً لنعمة الجاه فقد رُوِيَ في الحديث:\n\n \" مَنْ سَعَى في حَاجَةِ أخيهِ المسْلِم، قُضِيتْ أو لَم تُقْضَ، غُفِر لَه ما تقدَم مِنْ ذنبه، وكُتب له براءتان: براءة من النار وبراءة من النفاق \"\n \n",
      "translations": []
    }
  ]
}