{
  "chapter": "البقرة",
  "text": "واذ نجينكم من ءال فرعون يسومونكم سوء العذاب يذبحون ابناءكم ويستحيون نساءكم وفى ذلكم بلاء من ربكم عظيم",
  "translations": [
    {
      "translation": "Remember, We saved you from the Pharaoh's people who wronged and oppressed you and slew your sons but spared your women: In this was a great favour from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall the time when We delivered you from the slavery of Pharaoh's people. They had inflicted a dreadful torment on you: they killed your sons and let your daughters live. And in this there was a hard trial for you from your your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Children of Israel, recall My favor) of saving you from the Pharaoh's people who afflicted you with the worst kind of cruelty, slaying your sons and sparing your women. Your suffering was indeed a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) When We rescued you from Firaun’s people, for they were inflicting you with a dreadful torment, slaying your sons and sparing your daughters; that was a tremendous trial from your Lord (or a great reward).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We delivered you from Fir`awn's (Pharaoh) people, who were afflicting you with a horrible torment, killing your sons and sparing your women, and therein was a mighty trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We delivered you from Firon's people, who subjected you to severe torment, killing your sons and sparing your women, and in this there was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We delivered you from the folk of Pharaoh who were visiting you with evil chastisement, slaughtering your sons, and sparing your women; and in that was a grievous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We did deliver you from Pharaoh's folk, who were afflicting you with dreadful torment, slaying your sons and sparing your women: that was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when We delivered you from Pharaoh's people, who subjected you to grievous torment, slaying your sons and sparing only your daughters,  surely in that there was a great trial for you from your Lord,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We delivered you from the house of Fir'awn imposing upon you evil torment, slaughtering your sons and letting your women live; and therein was a trial, from your Lord, Mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember] when We delivered you from Pharaoh’s clan who inflicted a terrible torment on you, and slaughtered your sons and spared your women, and in that there was a great test from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember, We delivered you from the people of Pharaoh: They set you hard tasks and punishments, slaughtered your sons and let your women-folk live; therein was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We delivered you from Fir'aun's (Pharaoh) people, who were afflicting you with a horrible torment, killing your sons and sparing your women, and therein was a mighty trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) how We saved you from Pharaoh's people who had oppressed you cruelly, slaying your sons and sparing your women. Surely, that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that We delivered you from the people of Pharaoh. They inflicted on you terrible persecution, killing your sons and sparing your women. Therein was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We saved your forefathers from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:49] And, remember, when We delivered you, your forefathers: the address here and henceforth directed to those living at the time of the our Prophet, is about how God blessed their forefathers, and is intended to remind them of God’s grace so that they might believe; from the folk of Pharaoh who were visiting you with, that is, making you taste, evil chastisement, of the worst kind (the sentence here is a circumstantial qualifier referring to the person of the pronoun [suffixed] in najjaynākum, ‘We delivered you’); slaughtering your, newly-born, sons: this is explaining what has just been said; and sparing, retaining, your women, [doing so] because of the saying of some of their priests that a child born among the Israelites shall bring about the end of your rule [Pharaoh]; and for you therein, chastisement or deliverance, was a tremendous trial, a test or a grace, from your Lord.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when We did deliver you from Pharaoh's folk), from Pharaoh and his people, (who were afflicting you with dreadful torment), and here Allah mentions the torment He sent on them: (slaying your sons) in their tender years (and sparing), using (your women) who were of age: (That was a tremendous trial from your Lord), a tremendous calamity from your Lord; and it is also said this means: a tremendous blessing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { يَسُومُونَكُمْ سُوۤءَ ٱلْعَذَابِ } أَي يَنَالونكم بِهِ\n والسُّوءُ: أَشدُ\n\n\n\n\nوقولهُ تعالى: { وَفِي ذَلِكُمْ بَلاۤءٌ مِّن رَّبِّكُمْ عَظِيمٌ } معناه اختبارٌ\n والبَلاءُ: يَكونُ شَراً، ويكونُ نِعمةً\n وهما ضدٌّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ نَجيناكم من آلِ فِرعونَ } ظاهره وتفسيره على ما يفهم من تذكير النعمة لتهييج المحبة وباطنه وتأويله { وإذ نجيناكم من آل فرعون } النفس الأمارة المحجوبة بأنانيتها المستعلية على ملك الوجود ومصر مدينة البدن التي استعبدت هي وقواها التي هي الوهم والخيال والتخلية والغضب والشهوة والقوى الروحانية التي هي أبناء صفوة الله يعقوب الروح والقوى الطبيعية البدنية من الحواس الظاهرة والقوى النباتية\n { يَسُومونَكم سُوءَ العَذَابِ } يكلفونكم المتاعب الصعبة والكدّ والأعمال الشاقّة في جمع المال وادّخاره بالحرص والأمل وترتيب الأقوات والملابس وغيرها مما يكدح فيه الحرّاص من أبناء الدنيا ويستعبدونكم في التفكر فيها والاهتمام بها وضبطها وتحصيل لذاتهم التي هي عذاب لمنعها إياكم عن لذاتكم\n { يذبحونَ أبناءَكُم } التي هي تلك القوى الروحانية عن العاقلة النظرية، والعاقلة العملية اللتين هما عينا القلب النظرية اليمنى والعملية اليسرى، والفهم الذي هو سمع القلب، والسرّ الذي هو قلب القلب، والفكر والذكر { ويستحيونَ نِساءَكم } القوى الطبيعية المذكورة بمنع الطائفة الأولى عن أفعالها الخاصة بالقهر والاستيلاء وحجبها عن حياة نور الروح ومددها وإقدار الطائفة الثانية عن أفعالها وتمكينها\n { وفي ذلِكُم } الإنجاء نعمة عظيمة { من ربكم } هي نعمة مطالعة صفات جلاله وجماله، أو في ذلكم التعذيب نقمة عظيمة من ربكم هي نقمة الاحتجاب والحرمان والبعد، إذ البلاء الذي هو الامتحان يحصل بهما\n قال الله تعالى:\n\n[الأعراف: 168]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ما أمرهم بتذكير النعم إجمالاً، وحذرهم عن جواء الكفران، أشار إلى مقدار النعم العظام التي خصصوا بها امتناناً عليهم، فقال: { وَإِذْ نَجَّيْنَٰكُم } أي: أذكروا وقت إنجائنا إياكم { مِّنْ آلِ فِرْعَوْنَ } الذين { يَسُومُونَكُمْ سُوۤءَ ٱلْعَذَابِ } بعلمونكم ويفضحونكم بسوء العذاب الذي لا عذاب أسوأ منه وهو أنهم { يُذَبِّحُونَ أَبْنَآءَكُمْ } لئلا يبقى ذكركم في الدنيا؛ إذ بالابن يذكر الأب ويحيا اسمه؛ لأنه سره { وَ } أشنع من ذلك أنهم { يَسْتَحْيُونَ نِسَآءَكُمْ } بناتكم ليلحق العار عليكم، بتزويجهم إياهن بلا نكاح ولا عار أشنع من ذلك، لذلك عد موت النبات من المكرمات { وَفِي ذَٰلِكُمْ } أي: واعلموا في المحن المشار إليها { بَلاۤءٌ } اختيار لكم { مِّن رَّبِّكُمْ عَظِيمٌ } [البقرة: 49] ليجزيكم بنعمة أعظم منها، وهو إنجاؤكم منهم واستيلاؤكم عليهم\n\n\n\n\nوبعدما ابتليناكم باحتمال الشدائد والمتاعب، ومقاساة الأحزان أردنا إنجاءكم من عذابهم وإهلاكهم بالمرة، فأمرناكم بالسير والفرار من العدو ففرتم ليلاً، فأصبحتم مصادفين البحر والعدو صادفكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ }: معمول لاذكروا، و { فرعون }: اسم لكل من ملك القبط، كما أن قيصر اسم لمن ملك الروم، وكسرى اسم لمن ملك الفرس، واسم { فرعون } الذي كان في زمن موسى عليه السلام: \" مصعب بن ريان \" ، وقيل: ابنه الوليد\n وسَام يسُوم: طلب وبغى، يقال: سامه خسفاً إذا أولاه ظلماً، وجملة { يسومونكم }: حال من { آل فرعون } ، وجملة { يذبحون }: بيان لها\n وسوء العذاب: أفظعه وأقبحه\n يقول الحقّ جلّ جلاله: يا بني إسرائيل اذكروا نعمة أخرى أنعمت بها على أسلافكم، وأنتم عالمون بها، وذلك حين أنجيناكم من عذاب فرعون ورهطه، يولونكم أقبحَ العذاب وأشنعَه، كانوا يستعبدون رجالكم ونساءكم في مشاق الخدمة والمهنة، ولمّا أخبره الكهان أنه سيخرج منكم ولد يُخَرِّب ملكه، جعل يذبح ذكوركم ويترك نساءكم، وفي ذلكم محنة { مِن رَّبِّكُمْ } وابتلاء { عَظِيمٌ } ، أو في ذلك الإنجاء اختبار من ربكم عظيم، فاذكروا هذه النعمة، وتحصنوا بالإيمان بمحمد صلى الله عليه وسلم من محنة أخرى، ولا ينفع حذرٌ من قدر،\n\n[الأحزَاب: 38]\n وبالله التوفيق\n الإشارة: لكل زمان فراعين وجبابرة يقطعون الناس عن الانقطاع إلى الله والدخول إلى حضرة الله،\n\n[الكهف: 104]، يقول الحقّ جلّ جلاله للذين تخلصوا منهم: اذكروا نعمتي التي أنعمت عليكم بها حيث أنجيتكم من فراعين زمنكم، { يسومونكم سوء العذاب } وهو البقاء في غم الحجاب، والانقطاع عن الأحباب، يقتلون ما ربيتم من اليقين في قلوبكم والمعرفة في أسراركم، ويستحيون شهواتكم وحظوظكم، { وفي ذلكم بلاء من ربكم عظيم }\n قال تعالى:\n",
      "translations": []
    }
  ]
}