{
  "chapter": "البقرة",
  "text": "او۟لئك على هدى من ربهم واو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "They have found the guidance of their Lord and will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such people are on the right way from their Lord and such are truly successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the pious who follow the guidance of their Lord and gain lasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who are on guidance from their Lord; and they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are on guidance from their Lord, and they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are on a right course from their Lord and these it is that shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those are upon guidance from their Lord, those are the ones who prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These depend on guidance from their Lord. These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they are the people who are rightly following their Lord and it is they who shall be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are on guidance from their Lord, and these they are the blissful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those follow their Lord’s guidance and it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are on (true) guidance, from their Lord, and it is these who will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are on (true) guidance from their Lord, and they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are guided by their Lord; these surely are the prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are upon guidance from their Lord. These are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are upon [right] guidance from their Lord, and it is those who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:5] Those, as described in the way mentioned, are upon guidance from their Lord, those are the ones that will prosper, that is, who will succeed in entering Paradise and be saved from the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These) who have these traits, (are on guidance from their Lord), they enjoy favour, mercy and clear exposition that has come down from their Lord, (and these are the successful ones), the ones who shall escape Allah's wrath and torment. It is also said that this refers to those who have apprehended and found what they were seeking and have escaped the evil of that from which they were fleeing, and these are the Companions of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَأُوْلَـٰئِكَ هُمُ ٱلْمُفْلِحُونَ } والمُفلحُ: المُصيبُ للخَيرِ الظَّافِرُ بِهِ\n والاسمُ الفَلاحُ، والفَلاَحُ: الخَيْرُ والفَلاحُ: التُّقَى، والمُفْلِحُ: المُتّقي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } أي: جزاء أولئك المؤمنون المتعقدون بجميع الكتب المنزلة على الرسل، والمؤمنون المذعنون بالنشأة الآخرة بل خاصة أنهم { عَلَىٰ هُدًى } عظيم { مِّن رَّبِّهِمْ } الذي رباهم بأنواع اللطف والكرم إلى أن يبلغوا إلى هذه المرتبة التي هي الاهتداء إلى جانب قدسه { وَ } مع ذلك الجزاء العظيم والنفع الجسيم { وَأُوْلَـٰئِكَ } السعداء { هُمُ ٱلْمُفْلِحُونَ } [البقرة: 5] الفائزون، الناجون عن مضائق الإمكان الواصلون إلى فضاء الوجوب، رزقنا الله الوصول إليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}