{
  "chapter": "البقرة",
  "text": "واذ ءاتينا موسى الكتب والفرقان لعلكم تهتدون",
  "translations": [
    {
      "translation": "Remember, We gave Moses the Book and Discernment of falsehood and truth, that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that (at that very time, when you were committing this gross iniquity) We gave Moses the Book and the criterion of right and wrong so that you might be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book and the criteria (of discerning right from wrong) so that perhaps you would be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave Moosa the Book (Taurat / Torah) and the criterion to judge right from wrong, so that you may attain guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We gave Musa the Scripture (the Tawrah) and the criterion (of right and wrong) so that you may be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave Musa the Book and the distinction that you might walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave to Moses the Book and the Salvation, that haply you should be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave unto Moses the Scripture and the criterion (of right and wrong), that ye might be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when We gave Moses the Scripture, and the criterion [to distinguish between right and wrong], so that you might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We vouchsafed unto Musa the Book and the distinction that haply ye may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave Moses the Book and the Criterion so that you might be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We gave Moses the Scripture and the Criterion (Between right and wrong): There was a chance for you to be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We gave Musa (Moses) the Scripture [the Taurat (Torah)] and the criterion (of right and wrong) so that you may be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We gave Moses the Book and the Criterion, so that you might be guided;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that We gave Moses the Scripture and the Criterion, so that you may be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We gave Moses the Scripture and criterion that perhaps you would be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:53] And when We gave to Moses the Scripture, the Torah, and the Criterion (wa’l-furqān is an explicative supplement [of Torah]), that is, the one that discriminates (faraqa) between truth and falsehood and between what is licit and illicit, so that you might be guided, by it away from error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We gave unto Moses the Scripture), the Torah, (and the Criterion) i.e. We showed in it the lawful and the unlawful, the commands and the prohibitions, as well as other things; it is also said that this means: triumph over Pharaoh, (that you might be led rightfully) guided to avoid error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَإِذْ آتَيْنَا مُوسَى ٱلْكِتَابَ وَٱلْفُرْقَانَ } أَي أَعْطَينَا\n والفُرْقَانُ: ما فرقَ بينَ الحقِّ والبَاطلِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذْ } بعدما أخلفتم الوعد قبل تمامها، وظلمتم باتخاذ العجل لم نهمل أمر موسى، ولم نخلف الوعد الذي وعدنا معه اذكروا { آتَيْنَا مُوسَى } إنجازاً لوعدنا { ٱلْكِتَابَ } الموعود، الجامع لأسرار الربوبية { وَٱلْفُرْقَانَ } الفارق بين الحق والباطل، وبين الضلالة والهداية { لَعَلَّكُمْ } تقتدرون له { تَهْتَدُونَ } [البقرة: 53] به إلى طريق التوحيد وتجاهدون فيه إلى أن تخلصوا عن الشواغل المانعة عنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}