{
  "chapter": "البقرة",
  "text": "واذ قال موسى لقومه يقوم انكم ظلمتم انفسكم باتخاذكم العجل فتوبوا۟ الى بارئكم فاقتلوا۟ انفسكم ذلكم خير لكم عند بارئكم فتاب عليكم انه هو التواب الرحيم",
  "translations": [
    {
      "translation": "Remember, Moses said: \"My people, by taking this calf you have done yourselves harm, so now turn to your Creator in repentance, and kill your pride, which is better with your Lord.\" And (the Lord) softened towards you, for He is all-forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that when Moses (returned with the Divine Gift, he) said to his people, \"O my people, you have wronged yourselves grievously by taking the calf for worship. Therefore, turn to your Creator. in penitence and slay the guilty ones among you. This is best for you in the sight of your Creator.\" At that time your Creator accepted your repentance because He is Relenting 'and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said to his people, \"My people, you have done wrong to yourselves by worshipping the calf. Seek pardon from your Lord and slay yourselves.\" He told them that it would be best for them in the sight of their Lord, Who would forgive them, for He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moosa said to his people, “O my people! You have wronged yourselves by taking the calf,* therefore turn in repentance to your Creator, therefore kill each other; this is better for you before your Creator”; He therefore accepted your repentance; indeed He only is the Most Acceptor of Repentance, the Most Merciful. (* as your deity for worship)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa said to his people: \"O my people! Verily, you have wronged yourselves by worshipping the calf. So turn in repentance to your Creator and kill yourselves (the innocent kill the wrongdoers among you), that will be better for you with your Creator.\" Then He accepted your repentance. Truly, He is the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa said to his people: O my people! you have surely been unjust to yourselves by taking the calf (for a god), therefore turn to your Creator (penitently), so kill your people, that is best for you with your Creator: so He turned to you (mercifully), for surely He is the Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his people, 'My people, you have done wrong against yourselves by your taking the Calf; now turn to your Creator and slay one another. That will be better for you in your Creator's sight, and He will turn to you; truly He turns, and is All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said unto his people: O my people! Ye have wronged yourselves by your choosing of the calf (for worship) so turn in penitence to your Creator, and kill (the guilty) yourselves. That will be best for you with your Creator and He will relent toward you. Lo! He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, \"O my people, you have indeed wronged yourselves by worshipping the calf; turn in repentance to your Creator and slay [the culprits] among you. That course is best for you in the sight of your Maker.\" He relented towards you. He is the Forgiving One, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Musa said unto his people: my people! verily ye have wronged your souls by your taking the calf, wherefore repent unto your Maker, and slay yourselves: that were best for you with your Maker. Then He relented toward you; verily He! He is the Relentant, the Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when Moses said to his people, ‘O my people! You have indeed wronged yourselves by taking up the Calf [for worship]. Now turn penitently to your Maker, and slay [the guilty among] your folks. That will be better for you with your Maker.’ Then He turned to you clemently. Indeed, He is the All-clement, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Moses said to his people: \"O my people! Ye have indeed wronged yourselves by your worship of the calf: So turn (in repentance) to your Maker, and slay yourselves (the wrong-doers); that will be better for you in the sight of your Maker.\" Then He turned towards you (in forgiveness): For He is Oft-Returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa (Moses) said to his people: \"O my people! Verily, you have wronged yourselves by worshipping the calf. So turn in repentance to your Creator and kill yourselves (the innocent kill the wrongdoers among you), that will be better for you with your Lord.\" Then He accepted your repentance. Truly, He is the One Who accepts repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when Moses said to his nation: 'My nation, you have harmed yourselves by taking the calf (to worship). So turn in repentance to your Creator and slay yourselves. That will be best for you with your Creator.' And He shall accept you. He is the Receiver of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall that Moses said to his people, “O my people, you have done wrong to yourselves by worshiping the calf. So repent to your Maker, and kill your egos. That would be better for you with your Maker.” So He turned to you in repentance. He is the Accepter of Repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when Moses said to his people, \"O my people, indeed you have wronged yourselves by your taking of the calf [for worship]. So repent to your Creator and kill yourselves. That is best for [all of] you in the sight of your Creator.\" Then He accepted your repentance; indeed, He is the Accepting of repentance, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:54] And when Moses said to his people, those who worshipped the calf, ‘My people, you have done wrong against yourselves by your taking the [golden] calf, for a god; now turn to your Creator, away from that worship [of the calf] and slay one another, that is, let the innocent of you slay the guilty; That, slaughter, will be better for you in your Creator’s sight’, who made it easier for you to accomplish this and sent down a dark cloud over you, so that none of you was able to see the other and show him mercy, such that almost   seventy thousand of you were killed; and He will turn to you [relenting], before your [turning in] repentance; truly He is the Relenting, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the story of Moses with his people, saying: (And when Moses said unto his people: my people! Ye have wronged yourselves) harmed yourselves (by your choosing of the calf) by worshipping the calf; and when Moses was then asked what to do, he said to them: (so turn in penitence to your Creator), again they asked him how to turn in penitence to Allah, and he said: (and kill (the guilty) among yourselves) let those who did not worship the calf kill those who worshipped it. (That) penitence and killing (will be best for you with your Creator and He will relent towards you) He will forgive you. (Lo! He is the Relenting) towards the penitent, (the Merciful) towards any that die repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَتُوبُوۤاْ إِلَىٰ بَارِئِكُمْ } أًي خَالِقِكُمْ\n\n\n\n\nوقولهُ تعالى: { فَٱقْتُلُوۤاْ أَنفُسَكُمْ }\n قالَ: فقاموا صَفين\n فَقتلَ بَعضُهُمْ بَعضاً، حتَّى قِيلَ لَهُمْ كُفُّوا، فكانَتْ شَهادةً للمقتُولينَ، وتوبةً للأَحياءِ مِنهُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ولما أنجزنا وعد موسى ورجع إلى قومه غضبان أسفاً اذكروا { إِذْ قَالَ مُوسَىٰ لِقَوْمِهِ } المؤمنين له والمعاهدين من بعد رجوعه عن الميقات والتورية: { يَٰقَوْمِ } الناقضون بعهدي، والمجاوزون لحدود الله { إِنَّكُمْ ظَلَمْتُمْ أَنْفُسَكُمْ بِٱتِّخَاذِكُمُ ٱلْعِجْلَ } إلهاً مستحقاً للعبودية { فَتُوبُوۤاْ } عن هذا الاعتقاد والاتخاذ، وارجعوا متذللين { إِلَىٰ بَارِئِكُمْ } الذي برأكم من المعدم ليبرأكم عن هذا الظلم، وإذا تبتم ورجعتم { فَٱقْتُلُوۤاْ أَنفُسَكُمْ } الأمارة بهذا الظلم، بأنوا الرياضات وترك المشتهيات والمستلذات، وقطع المألوفات وترك المستحسنات الملومين عليها بأنواع الملامات، حتى تكون مطمئنة بما فتنتم بها، راضية بجريان حكم القضاء، مرضية بالفناء بل فانية عن الفناء { ذَٰلِكُمْ } المشار إليه من الإنابة والرجوع وإبراء الذمة والإذلال بأنواع الرياضات والفناء المطلق أيضاً { خَيْرٌ لَّكُمْ عِنْدَ بَارِئِكُمْ } خالقكم الذي خلقكم للتوحيد والعرفان، وإذا تحقق إنابتكم وأخلاصكم فيها { فَتَابَ عَلَيْكُمْ } قبل توبتكم ورضي عنكم { إِنَّهُ هُوَ ٱلتَّوَّابُ } الرجاع للعباد إلى التوبة والإنابة { ٱلرَّحِيمُ } [البقرة: 54] لهم بقبول التوبة وإن عظمت زلتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: البارىء هو: المقدر للأشياء والمظهر لها\n يقول الحقّ جلّ جلاله: واذكروا يا بني إسرائيل حين { قال } موسى { لقومه } لما رجع من الطور، ووجدهم قد عبدوا العجل: { يَا قَوْم إنَّكُمْ ظَلَمْتُمْ أنفُسَكُم } وبخستموها { باتخاذكم العجل } إلاهكم، { فَتُوبُوا إلَى } خالقكم الذي صوركم في أحسن تقويم، { فَاقْتُلُوا أَنفُسَكُمْ } بهدم هذه البنية التي ركبتها في أحسن صورة، فبخستموها، ولم تعرفوا قدرها، فعبدتم أبلد الحيوان، الذي هو البقرة\n من لم يعرف حق النعمة فحقيق أن تُسترد منه\n فذلكم القتل والمبادرة إلى التوبة { خير لكم } عِندَ خالقكم، لأنه يفضي إلى الحياة الدائمة والبهجة السرمدية، فلما صعب عليكم القتل للشفقة على الأخ أو القريب، ألقينا عليكم ضبابة حتى أظلم المكان، فاقتتلتم من الغداة إلى العشي، فدعا موسى وهارون - عليهما السلام - بالكشف عنهم، فرفعت السحابة، وقد قُتل سبعون ألفاً، ففعلتم ذلك القتل، فتاب الحق تعالى عليكم، فقبل توبة مَن بقي منكم، وعفا عمت مات { إنه هو التواب الرحيم } أي: كثير التوفيق للتوبة، أو كثير قبولها، الرحيم بعباده المؤمنين\n الإشارة: ما قاله سيدنا موسى عليه السلام لقومه، يقال مثله لمن عبد هواه، وعكف على متابعة دنياه: يا من بخس نفسه بإرخاء العنان في متابعة هواها، حتى حرمها من مشاهدة جمال مولاها، تُب إلى ربك، وانتبه من غفلتك، واقتل نفسك بمخالفة هواها، فلعلها تحيا بمشاهدة مولاها، فما دامت النفس موجودة، وحظوظها لديها مشهودة، وآمالها ممدودة، كيف تطمع أن تدخل حضرة الله، وتتمتع بشهود جماله وسناه؟!\n\nوقال الحلاجُ في هذا المعنى:\n\nوقال أيضاً:\n\nوقال أيضاً:\n",
      "translations": []
    }
  ]
}