{
  "chapter": "البقرة",
  "text": "وظللنا عليكم الغمام وانزلنا عليكم المن والسلوى كلوا۟ من طيبت ما رزقنكم وما ظلمونا ولكن كانوا۟ انفسهم يظلمون",
  "translations": [
    {
      "translation": "And made the cloud spread shade over you, and sent for you manna and quails that you may eat of the good things We have made for you. No harm was done to Us, they only harmed themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember that) We caused the cloud to overshadow you and provided you with manna and salva for your food, saying, \"Eat of the clean and pure things We have bestowed upon you\" (In spite of this, your forefathers violated Our commands:) however, they did not harm Us but harmed only themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We provided you with shade from the clouds and sent down manna and quails as the best pure sustenance for you to eat. They (children of Israel) did not wrong Us but wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the clouds a canopy for you and sent down Manna and Salwa (birds) on you; “Eat of the pure things We have provided you”; they did not wrong Us in the least, but indeed they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shaded you with clouds and sent down on you Al-Manna and the quail, (saying): \"Eat of the good lawful things We have provided for you,\" (but they rebelled). And they did not wrong Us but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the clouds to give shade over you and We sent to you manna and quails: Eat of the good things that We have given you; and they did not do Us any harm, but they made their own souls suffer the loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We outspread the cloud to overshadow you, and We sent down manna and quails upon you: 'Eat of the good things wherewith We have provided you. And they worked no wrong upon Us, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused the white cloud to overshadow you and sent down on you the manna and the quails, (saying): Eat of the good things wherewith We have provided you - they wronged Us not, but they did wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We caused the clouds to provide shade for you and sent down for you manna and quails, saying, \"Eat the good things We have provided for you.\" Indeed, they did not wrong Us, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We overshadowed you with Clouds and We sent down unto you the Manna and the quails, saying: eat of the clean things, wherewith We have provided you. And they wronged Us not, but themselves they were wont to wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shaded you with clouds, and sent down to you manna and quails [saying]: ‘Eat of the good things We have provided for you.’ And they did not wrong Us, but they used to wrong [only] themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave you the shade of clouds and sent down to you Manna and quails, saying: \"Eat of the good things We have provided for you:\" (But they rebelled); to us they did no harm, but they harmed their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shaded you with clouds and sent down on you Al-Manna and the quails, (saying): \"Eat of the good lawful things We have provided for you,\" (but they rebelled). And they did not wrong Us but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We caused the clouds to cast their shadow over you and sent down for you manna and quails, (saying:) 'Eat of the good things We have provided you. 'Indeed, they did not harm Us, but they harmed themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shaded you with clouds, and We sent down to you manna and quails: “Eat of the good things We have provided for you.” They did not wrong Us, but they used to wrong their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shaded you with clouds and sent down to you manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not - but they were [only] wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:57] And We made the cloud overshadow you, that is, We sheltered you with fine clouds from the heat of the sun while you were in the wilderness; and We sent down, in them [the clouds], upon you manna and quails — which are [respectively, a type of citrus known as] turunjabīn and the quail — and We said: ‘Eat of the good things We have provided for you’, and do not store any of it away, but they were not grateful for this favour and stored the food, and so they were deprived of it; And they did not wrong Us, in this, but themselves they wronged, since the evil consequences [of this] befell them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We caused the white cloud to overshadow you) in the wilderness (and sent down on you honey and quails) also in the wilderness, (Eat of the good things) of the lawful things (wherewith We have provided you) that We have given you and do not keep any provision for future days. Yet they did save food for future days-(They wronged us not) by saving food, (but they did wrong themselves) they harmed themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ } معناهُ السَّحابُ الأَبيضُ\n وواحدُهَا غَمامةٌ [والجمعُ] غَماماتُ\n والسَّحابُ جمعُ سَحابةٍ، ويجوزُ سَحابات وسَحائب\n\n\n\n\nوقولهُ تعالى: { وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ } معناهُ جَعلنا لَكُم المَنَّ والسَّلوى\n ويقالُ المَنُّ: التَرْنْجَبِينُ\n والسَّلوى: السَمَّانُ\n ويقالُ طائرٌ يَشبهُهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا أيضاً إذ { ظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ } يوم لا ظل إلا ظله، وأنتم تائهنن في التيه في الصيف، بأن سار معكم حيث شئتم، ولا يزول ظله عنكم { وَ } مع ذلك أنعمناكم فيها بأعظم من ذلك بأن { أَنزَلْنَا عَلَيْكُمُ } من جانب السماء { ٱلْمَنَّ } التي الترنجبين لسكن حرارتكم { وَ } أنزلنا لغذائكم { ٱلسَّلْوَىٰ } وهو السماني، أو مثله في النزول من جانب السماء، وأبحنا لكم تناولهما، ولا تكفروا بها بأن قلنا لكم: { كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ } من خصائص النعم واشكروا لها { وَمَا ظَلَمُونَا } بمنع المنافع ورد الفوائد { وَلَـٰكِن كَانُوۤاْ أَنْفُسَهُمْ يَظْلِمُونَ } [البقرة: 57] من الفوائد العائدة لنفوسهم من ازدياد النعم في إدامة شكرنا، والتقرب إلينا في إقامة حدودنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الغّمّامّ }: السحاب الرقيق، و { المَنِّ } هنا: العسل، و { السَّلْوى } قيل: اللحم، والأصح: أنه اسم طائر كالسماني\n يقول الحقَ جلّ جلاله: في تذكير بني إسرائيل ما أنعم به عليهم في حال التيه: { و } قد { ظَلَّلْنا عَلَيْكُمْ الْغَمَامَ } يقيكم من الحر في أيام التيه، { وَأَنزَلْنَا عَلَيْكُمُ الْمَنَّ } وهو عسل كان ينزل على الشجر من الفجر إلى الطلوع، فيغرفون منه ما شاءوا، { و } أنزلنا عليكم { السلوى } ، وهو طير كانت تحشره الجنوب، فينزل عليهم، فياخذون منه ما شاءوا، ولا يمتنع منهم، فيذبحون ويأكلون لحماً طريّاً، فقلنا لهم: { كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَمَا ظَلَمُونَا } بمخالفتهم أمْرَ نبيهم وسوء أدبهم معه، حيث قالوا:\n\n[المَائدة: 24]، فعاقبهم بالتيه أربعين سنة، يتيهون في مقدار خمسة فراسخ أو ستة\n { وَلَكِن } ظلموا أنفسهم حيث أوقعوها في البلاء والمحنة\n رُوِيَ أنهم لما أُمروا بجهاد الجبارين، جبنوا وقالوا تلك المقالة، فدعا عليهم سيدنا موسى عليه السلم فوقعوا في التيه بين مصر والشام، فكانوا يمشون النهار فيبيتون حيث أصبحوا، ويمشون الليل فيصبحون حيث أمسوا، فقالوا لموسى عليه السلام: من لنا بالطعام؟ فأنزل الله عليهم المنّ والسلوى، قالوا: كيف بحر الشمس؟ فظلل عليهم الغمام، قالوا: بم نستصبح بالليل؟ فضرب لهم عمود نور في وسط محلتهم، قالوا: من لنا بالماء؟ فأمر موسى عليه السلام بضرب الحجر، فقالوا: من لنا باللباس؟ فأعطوا ألا يَبْلى لهم ثوب، ولا يَخْلَق، ولا يَدْرن، وأن ينمو بنمو صاحبه، وقيل: كساهم مثل الظفر،\n",
      "translations": []
    }
  ]
}