{
  "chapter": "البقرة",
  "text": "ان الذين كفروا۟ سواء عليهم ءانذرتهم ام لم تنذرهم لا يؤمنون",
  "translations": [
    {
      "translation": "As for those who deny, it is all the same if you warn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have rejected (these things), it is all the same to them whether you warn them or do not warn them: they are not going to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny your message will not believe whether you warn them or not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose fate is disbelief, whether you warn them or do not warn them – it is all one for them; they will not believe. (Because their hearts are sealed – see next verse).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, it is the same to them whether you warn them or do not warn them, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve, it being alike to them whether you warn them, or do not warn them, will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, alike it is to them whether thou hast warned them or hast not warned them, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the Disbelievers, Whether thou warn them or thou warn them not it is all one for them; they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who are bent on denying the truth, it makes no difference to them whether you warn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who have disbelieved, it is equal to them whether thou warnest them or warnest them not; they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, it is the same to them whether you warn them or do not warn them, they will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who reject Faith, it is the same to them whether thou warn them or do not warn them; they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, it is the same to them whether you (O Muhammad Peace be upon him) warn them or do not warn them, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, whether you forewarn them or not, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve—it is the same for them, whether you have warned them, or have not warned them—they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:6] As for the disbelievers, the likes of Abū Jahl, Abū Lahab and such; alike it is for them whether you have warned them or have not warned them, they do not believe, as God knows very well, so do not hope that they will believe (read a-andhartahum pronouncing both hamzas, or by not pronouncing the second, making it an alif instead, and inserting an alif between the one not pronounced and the other one, or leaving [this insertion]; al-indhār [‘warning’] is to give knowledge of something, and simultaneously instil an element of fear).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for the disbelievers) who remain firm in their disbelief, (whether thou warn them), instil fear into them by means of the Qur'an, (or thou warm them not) or you do not instil fear into them, (it is all one for them; they believe not), they do not want to believe. It is also said that they will not believe as it is in Allah's knowledge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الذين كفروا } - إلى قوله - { عظيم } هم الفريق الأول من الأشقياء الذين هم أهل القهر الإلهي لا ينجح فيهم الإنذار ولا سبيل إلى خلاصهم من النار، أولئك حقّت عليهم كلمة ربّك أنهم لا يؤمنون، وكذلك حقّت كلمة ربك على الذين كفروا أنهم أصحاب النار، سدّت عليهم الطرق، وأغلقت عليهم الأبواب، إذ القلب هو المشعر الإلهيّ الذي هو محلّ الإلهام، فحجبوا عنه بختمه\n والسمع والبصر هما المشعران الأنسيان، أي الظاهران اللذان هما بابا الفهم والاعتبار، فحرموا عن جدواهما لامتناع نفوذ المعنى فيهما إلى القلب، فلا سبيل لهم في الباطن إلى العلم الذوقيّ الكشفيّ ولا في الظاهر إلى العلم التعلميّ والكسبيّ، فحبسوا في سجون الظلمات، فما أعظم عذابهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه جرياً، بل على مقتضى سنته من تعقيب الوعد بالوعيد: { إِنَّ ٱلَّذِينَ كَفَرُواْ } ستروا الحق وأعرضوا عنه، وأظهروا الباطل وأصروا عليه عناداً واستكباراً، لا ينفعهم إنذارك وعدمه بل { سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لاَ يُؤْمِنُونَ } [البقرة: 6] بك وبكتابك؛ لأنهم هم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { سواء } خبر مقدم، و { أنذرتهم } مبتدأ لسبك همزة التسوية، أي: الإنذار وعدمه سواء في حق هؤلاء الكفرة، والجملة خبر إن، و { غشاوة } مبتدأ، والجار قبله خبره، والغشاوة: ما يغشى الشيء ويغطيه، كنى به عن مانع قهرهم عن الإيمان\n يقول الحقّ جلّ جلاله: يا محمد { إنَّ الَّذِينَ كَفَرُوا } بما أنزل إليك جهراً، وسبقت لهم مني الشقاوة سرّاً، لا ينفع فيهم الوعظ والإنذار، ولا البشارة والتذكار، فإنذارك وعدمه في حقهم سواء، لما سبق لهم مني الطرد والشقاء، فالتذكير في حقهم عناء، والغيبة عن أحوالهم راحة وهناء، لأني ختمتُ على قلوبهم بطابع الكفران، فلا يهتدون إلى إسلام ولا إيمان، ومنعت أسماعهم أن تصغي إلى الوعظ والتذكير، فلا ينجع فيهم تخويف ولا تحذير، وغشيت أبصارهم بظلمة الحجاب فلا يبصرون الحق والصواب، قد أعددتُهم لعذابي ونقمتي، وطردتهم عن ساحة رحمتي ونعمتي\n وإنما أمرتك بإنذارهم لإقامة الحجة عليهم، وإني وإن حكمت عليهم أنهم من أهل مخالفتي وعنادي فإني لا أظلم أحداً من خلقي وعبادي،\n\n[الأنعَام: 149]\n فما ظلمتُهم لأني بعثتُ الرسلَ مبشرين ومنذرين، ولكن ظلموا أنفسهم فكانوا هم الظالمين، فحكمتي اقتضيت الإنذار، وقدرتي اقتضت القهر والإجبار، فالواجب عليك أيها العبد أن تكون لك عينان: عين تنظر لحكمتي وشريعتي فتتأدب، وعينٌ تنظر لقدرتي وحقيقتي فتُسلم، وتكون بي الأمن والرّهْب، فلا تأمَنْ مَكْرِي وإن أمَّنتُك، ولا تيأس من حلمي وإن أبعدتك، فعلمي لا يحيط به محيط، إلا من هو بكل شيء محيط\n الإشارة: إن الذين أنكروا وجود الخصوصية، جحدوا أهل مشاهدة الربوبية من أهل التربية النبوية، لا ينفع فيهم الوعظ والتذكير، بما سبق لهم في علم الملك القدير، فسواء عليهم أأنذرتهم وبال القطيعة والحجاب، أم لم تنذرهم لعدم فتح الباب، قد ختم الله على قلوبهم بالعوائد والشهوات، أو حلاوة الزهد والطاعات، أو تحرير المسائل والمشكلات، وعلى سمع قلوبهم بالخواطر والغفلات، وجعل على أبصارهم غشاوة الحجاب، فلا يبصرون إلا المحسوسات، غائبون عن أسرار المعاني وأنوار التجليات، بخلاف قلوب العارفين، فإنها ترى من أسرار المعاني ما لا يُرى للناظرين، وفي ذلك يقول الشاعر:\n\nفسبحان من حجب العالمين بصلاحهم عن مصلحهم، وحجب العلماء بعلمهم عن معلومهم، واختصّ قوماً بنفوذ عزائمهم إلى مشاهدة ذات محبوبهم، فهم في رياض ملكوته يتنزهون، وفي بحار جبروته يسبحون،\n",
      "translations": []
    }
  ]
}