{
  "chapter": "البقرة",
  "text": "ثم توليتم منۢ بعد ذلك فلولا فضل الله عليكم ورحمته لكنتم من الخسرين",
  "translations": [
    {
      "translation": "But you went back (on your word), and but for the mercy and grace of God you were lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even after that you forsook the Covenant: nevertheless Allah did not withhold His grace and mercy from you; otherwise you would have been utterly ruined long before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again you turned away. Had God's Grace and His Mercy not existed in your favor, you would certainly have been lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that, you turned away; and were it not for the munificence of Allah and His mercy, you would be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that you turned away. Had it not been for the grace and mercy of Allah upon you, indeed you would have been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you turned back after that; so were it not for the grace of Allah and His mercy on you, you would certainly have been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you turned away thereafter, and but for the bounty and mercy of God towards you, you had been of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, even after that, ye turned away, and if it had not been for the grace of Allah and His mercy ye had been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet after that you turned away, and but for God's grace and mercy, you would have surely been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then ye turned away there after; so had not the grace of Allah been unto you and His mercy, ye had surely become of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again you turned away after that; and were it not for Allah’s grace on you and His mercy, you would have surely been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But ye turned back thereafter: Had it not been for the Grace and Mercy of Allah to you, ye had surely been among the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that you turned away. Had it not been for the Grace and Mercy of Allah upon you, indeed you would have been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet after that you turned away, but for the Grace of Allah and His Mercy you would have surely been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But after that you turned away. Were it not for God’s grace and mercy towards you, you would have been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you turned away after that. And if not for the favor of Allah upon you and His mercy, you would have been among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:64] Then you turned away thereafter, and but for God’s bounty and His mercy towards you, you would have been among the losers [there is no commentary on this verse].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, even after that, you turned away) you turned your back on the covenant, (and if it had not been for the grace of Allah upon you) by deferring His punishment (and His mercy) by sending Muhammad (pbuh) to you (you had been among the losers) you would have among the duped who are exposed to Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } لما أمهلناكم زماناً { تَوَلَّيْتُمْ } أعرضتم عن العهد { مِّن بَعْدِ } ما أزلنا عنكم { ذٰلِكَ } الخوف وأنتم في جبلتكم ظالمون، مجاوزون عن الحدود والعهود { فَلَوْلاَ فَضْلُ ٱللَّهِ } المحيط { عَلَيْكُمْ } بإرادة إيمانكم وإصلاحكم { وَرَحْمَتُهُ } الواسعة الشاملة لكم بإرسال الرسل وإنزال الكتب { لَكُنْتُم } في أنفسكم { مِّنَ ٱلْخَاسِرِينَ } [البقرة: 64] الذين خسروا أنفسهم وأهليهم يوم القيامة،\n\n[الزمر: 15]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}