{
  "chapter": "البقرة",
  "text": "فجعلنها نكلا لما بين يديها وما خلفها وموعظة للمتقين",
  "translations": [
    {
      "translation": "And whom We made an example for the people (of the day) and those after them, and warning for those who fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We made their end a warning to the people of their time and succeeding generations, and an admonition for God-fearing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order to set up an example for their contemporaries and coming generations and to make it a reminder for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made this incident (of that town) a warning to the surrounding towns (others of their time) and to succeeding generations, and a lesson for the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made this punishment an example for those in front of it and those behind it, and a lesson for Al-Muttaqin (the pious).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made them an example to those who witnessed it and those who came after it, and an admonition to those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made it a punishment exemplary for all the former times and for the latter, and an admonition to such as are godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made it an example to their own and to succeeding generations, and an admonition to the Allah-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made their fate an example to their own generation and to those who followed them and a lesson to those who fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made it a deterrent unto those of their day and those after them, and an exhortation unto the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made it an exemplary punishment for the present and the succeeding [generations], and an advice to the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made it an example to their own time and to their posterity, and a lesson to those who fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We made this punishment an example to their own and to succeeding generations and a lesson to those who are Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made it a punishment for the former times and for the latter, an exhortation to the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We made it a deterrent for their generation, and for subsequent generations, and a lesson for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made it a deterrent punishment for those who were present and those who succeeded [them] and a lesson for those who fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:66] And We made it, this punishment, an exemplary punishment, a lesson to dissuade others from doing what they did; for all the former times and for the latter, that is, for the people of that time or those that came later; and an admonition to such as who fear, God: these are singled out for mention here because they, in contrast to others, are the ones who benefit thereby.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We made it) turning them into apes (an example) we subjected them to a chastisement (to their own) for the sins they had committed before, (and) made them a lesson (to succeeding generations) in order that they do not follow their example (and admonition to the God-fearing) and a counsel and warning to those who fear Allah, i.e. Muhammad (pbuh) and his Companions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَجَعَلْنَاهَا نَكَالاً لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ } قالَ زيدُ بن علي عليهما السلامُ\n معنى لِما بينَ يَدَيهَا: هو السّورُ\n التي عملوا فِيها المعاصي فِي صيدِهم السَّمكَ\n ومعنى ما خَلَفَها لِمنْ كَانَ بعدهم مِنْ بَني إِسرائيل أَنْ لا يعملوا فيها بمثلِ أَعمالِ صَيادي السَّمكِ\n والموعظةُ للمتقين: لأمةِ محمدٍ (ص) أَنْ لا يُلحِدوا فِي حَرمِ الله تعالى\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَجَعَلْنَاهَا } أي: قصة مسخهم وشأنهم { نَكَالاً } عبرة { لِّمَا بَيْنَ يَدَيْهَا } من الحاضرين المشاهدين حالهم وقصتهم { وَمَا خَلْفَهَا } ممن يوجد بعد من المذكرين السامعين قصتهم وتاريخهم { وَمَوْعِظَةً } وتذكيراً { لِّلْمُتَّقِينَ } [البقرة: 66] الذين يحفظون نفوسهم دائماً عن أمثالها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}