{
  "chapter": "البقرة",
  "text": "واذ قال موسى لقومه ان الله يامركم ان تذبحوا۟ بقرة قالوا۟ اتتخذنا هزوا قال اعوذ بالله ان اكون من الجهلين",
  "translations": [
    {
      "translation": "Remember, when Moses said to his people: \"God demands that you sacrifice a cow,\" they said: \"Are you making fun of us?\" And he said: \"God forbid that I be of the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then call to mind the other event: when Moses said to his people, \"Allah commands you to sacrifice a cow,\" they replied, \"Do you mean to have a jest with us?\" He answered, \"I crave Allah's protection from behaving like ignorant people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, \"God commands you to sacrifice a cow,\" they asked, \"Are you mocking us?\" \"God forbid, how would I be so ignorant,\" said Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Moosa said to his people, “Allah commands you to sacrifice a cow”; they said, “Are you making fun of us?” He answered, “Allah forbid that I should be of the ignorant!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa said to his people: \"Verily, Allah commands you that you slaughter a cow.\" They said, \"Do you make fun of us\" He said, \"I take Allah's refuge from being among Al-Jahilin (the ignorant or the foolish).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa said to his people: Surely Allah commands you that you should sacrifice a cow; they said: Do you ridicule us? He said: I seek the protection of Allah from being one of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his people, 'God commands you to sacrifice a cow.' They said, 'Dost thou take us in mockery?' He said, 'I take refuge with God, lest I should be one of the ignorant.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said unto his people: Lo! Allah commandeth you that ye sacrifice a cow, they said: Dost thou make game of us? He answered: Allah forbid that I should be among the foolish!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, \"God commands you to sacrifice a heifer,\" they said, \"Are you making a mockery of us?\" He answered, \"God forbid that I should be so ignorant!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Musa said unto his people: verily Allah commandeth you that ye slaughter a cow. They said: makest thou a jest of us? He said take refuge with Allah that I should be of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his people, ‘Allah commands you to slaughter a cow,’ they said, ‘Are you mocking us?’ He said, ‘I seek Allah’s protection lest I should be one of the ignorant!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Moses said to his people: \"Allah commands that ye sacrifice a heifer.\" They said: \"Makest thou a laughing-stock of us?\" He said: \"Allah save me from being an ignorant (fool)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa (Moses) said to his people: \"Verily, Allah commands you that you slaughter a cow.\" They said, \"Do you make fun of us?\" He said, \"I take Allah's Refuge from being among Al-Jahilun (the ignorants or the foolish).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his nation: 'Allah commands you to slaughter a cow' they replied: 'Are you taking us in mockery' 'I seek protection with Allah lest I should be one of the ignorant' he said.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Moses said to his people, “God commands you to sacrifice a heifer.” They said, “Do you make a mockery of us?” He said, “God forbid that I should be so ignorant.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when Moses said to his people, \"Indeed, Allah commands you to slaughter a cow.\" They said, \"Do you take us in ridicule?\" He said, \"I seek refuge in Allah from being among the ignorant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:67] And, mention, when Moses said to his people, when one among them was killed and the killer was not known, and so they asked Moses to pray to God to reveal the killer, which he did; ‘God commands you to sacrifice a cow’. They said, ‘Do you take us in mockery?’, that is, making fun of us when you answer us like this? He said, ‘I take refuge with, I seek defence with, God lest I should be one of the ignorant’, one of   those who indulge in mockery.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the story of the cow, saying: (And when Moses said unto his people: Lo! Allah commandeth you that ye sacrifice a cow) any cow, (they said: Dost thou make game of us?) are you really mocking us? (He) Moses (answered: Allah forbid that I should be among the foolish!) God forbid that I ever mock the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذْ قال موسى لِقومِه إن الله يَأمركم أنْ تذبحوا بَقرةً } هي النفس الحيوانية، وذبحها قمع هواها الذي هو حياتها ومنعها عن أفعالها الخاصة بها بشفرة سكين الرياضة { قالوا أتتخذنا } مهزوّاً بنا، وتستخفنا لنطيعك ونتسخر لك كما جاء في حق فرعون: فاستخف قومه فأطاعوه\n { قال أعوذُ بالله أنْ أكونَ مِن الجاهلين } الاستخفاف والاستهزاء وطلب الترؤس هو فعل الجهال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن تبعك من المؤمنين من سوء معاملة بني إسرائيل مع موسى عليه السلام وقبح صنيعهم معه، ومجادلتهم بما جاء به من عند الله جهلاً وعناداً ليتنبهوا ويتفطنوا على أن الإيمان بنبي يوجب الانقياد والإطاعة له، وترك المراء والمجدالة معه والمحبة والإخلاص معه، وتفويض الأمور إليه وهو إلى الله؛ ليتم سر الربوبية والعبودية والنبوة والرسالة والتشريع والتكاليف والتوسل والتقرب والوصول، وذلك { إِذْ قَالَ مُوسَىٰ لِقَوْمِهِ } حين حدثت الفتنة العظيمة بينهم وهي: إنه كان فيهم رجل من صناديدهم له أموال وضياع وعقار كثيرة، وله ابن واحد وبنوا أعمام كثيرة، فطمعوا في أمواله فقتلوا ابنه ليرثوه، وطرحوه على الباب، فأصبحوا صائحين فزعين يطالبون القاتل، فأراد الله تفضيحهم وتشهيرهم، فأمر موسى بأن قال لهم: { إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَنْ تَذْبَحُواْ بَقَرَةً } فلما سمعوا قوله استبعدوه وتحيروا في أمرهم ومن غاية استبعادهم { قَالُوۤاْ } على طريق المعاتبة: { أَ } تعتقد أنت يا موسى الداعي للخلق إلى الحق { تَتَّخِذُنَا هُزُواً } أي: تأخذنا باستهزاء وسخرية ونحن محل استهزائك مع أنه لا يلي بك وبنا { قَالَ } موسى مستبعداً ومستعيذاً: { أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَاهِلِينَ } [البقرة: 67] المستهزئين بالناس، بل ما أتبع إلا ما يوحى إلي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الفارض: المسنة التي لا تلد، يقال: فرضت البقرة، تفرض فروضاً، إذا أسنت\n البكر: الصغير التي لم تلد، العوان: المتوسطة بين المسنة والصغيرة، والفاقع: الناصع الصفرة، يقال: أصفر فاقع، وأسود حالك، أي: شديد السواد، وأصل شية: وِشْيَة، كعدة، حذفت فاؤها وعوض عنها التاء، والوشي: الرقم\n يقول الحقّ جلّ جلاله: واذكروا يا بني إسرائيل حين { قال موسى لقومه } لما تخاصموا إليه في قتيل وجد في قرية ولم يدر قاتله، وذلك أن رجلاً فقيراً من بني إسرائيل قتل قريباً له كان موسراً ليرثه، ثم رماه في قرية أخرى، ثم ذهب يطلب دمه، فترافعوا إلى موسى عليه السلام فقال لهم بوحي: { إن الله يأمركم أن تذبحوا بقرة } ، وأبهم الأمر عليهم، { قَالُوا أَتَتَّخِذُونَا هُزُواً } أي: مهزوءاً بنا، حيث نسألك عن بيان القائل وأنت تأمرنا أن نذبح بقرة، وهذا من تعنتهم وسوء أدبهم\n { قَالَ أَعُوذُ بِاللَّهِ أَنْ أَكُونَ مِنَ الْجَاهِلِينَ } إذ لا يستهزئ بأمر الدين إلا الجاهل",
      "translations": []
    }
  ]
}