{
  "chapter": "البقرة",
  "text": "قالوا۟ ادع لنا ربك يبين لنا ما هى قال انه يقول انها بقرة لا فارض ولا بكر عوانۢ بين ذلك فافعلوا۟ ما تؤمرون",
  "translations": [
    {
      "translation": "Call on your Lord for us,\" they said, \"that He might inform us what kind she should be.\" \"Neither old nor young, says God, but of age in between,\" answered Moses. \"So do as you are bid.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they said, \"Please make a request to your Lord to give us some details of the cow.\" Moses answered, \"Allah says that the cow should neither be old nor immature but of middle age. Do, therefore, as you are bidden.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They demanded, \"Ask your Lord to describe the kind of cow He wants us to slaughter.\" Moses explained, \"It must be neither too old nor too young, thus do whatever you are commanded to do.\" Moses then told them to do as they were ordered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Pray to your Lord that He may describe the cow”; said Moosa, “He says that it is a cow neither old nor very young but between the two conditions; so do what you are commanded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us that He may make plain to us what it is!\" He said, \"He says, `Verily, it is a cow neither too old nor too young, but (it is) between the two conditions', so do what you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Call on your Lord for our sake to make it plain to us what she is. Musa said: He says, Surely she is a cow neither advanced in age nor too young, of middle age between that (and this); do therefore what you are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Pray to thy Lord for us, that He may make clear to us what she may be.' He said, 'He says she is a cow neither old, nor virgin, middling between the two; so do that you are bidden.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Pray for us unto thy Lord that He make clear to us what (cow) she is. (Moses) answered: Lo! He saith, Verily she is a cow neither with calf nor immature; (she is) between the two conditions; so do that which ye are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Ask your Lord to make it clear to us what sort of heifer she should be.\" He answered, \"God says she should be neither too old nor too young, but in between, so do as you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: supplicate for us unto thy Lord that He make manifest unto us whatever she should be. He said: verily He saith, she should be a cow neither old nor young, but middle-aged betwixt that; do then as ye are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Invoke your Lord for us that He may clarify for us what she may be.’ He said, ‘He says, she is a cow, neither old nor young, of a middle age. Now do what you are commanded.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Beseech on our behalf Thy Lord to make plain to us what (heifer) it is!\" He said; \"He says: The heifer should be neither too old nor too young, but of middling age. Now do what ye are commanded!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us that He may make plain to us what it is!\" He said, \"He says, 'Verily, it is a cow neither too old nor too young, but (it is) between the two conditions', so do what you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call on your Lord' they said, 'to make known to us what she shall be' He said: \"He says she is a cow neither old, nor virgin, middling between both.\" Therefore, do as you have been ordered'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Call upon your Lord to show us which one.” He said, “He says she is a heifer, neither too old, nor too young, but in between. So do what you are commanded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord to make clear to us what it is.\" [Moses] said, \"[Allah] says, 'It is a cow which is neither old nor virgin, but median between that,' so do what you are commanded.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:68] But when they realised that he was being serious, They said, ‘Pray to your Lord for us, that He may make clear to us what she may be’, its true nature, He, Moses, said, ‘He, God, says she is a cow neither old, nor virgin, that is, young, middling between the two, in terms of age; so do what you have been commanded’, by way of sacrificing it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they realised he was truthful, (They said: Pray for us unto your Lord That He make clear to us what she is) whether the cow is large or small. (Moses answered: Lo! He saith, Verily she is a cow neither old nor immature; (she is) between the two conditions) neither large nor small; (so do that which ye are commanded) and ask no further questions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { إِنَّهَا بَقَرَةٌ لاَّ فَارِضٌ وَلاَ بِكْرٌ عَوَانٌ } قالَ زيدُ بن علي عليهما السلامُ: الفارضُ: الكبيرةُ المُسنَّةُ\n والجمعُ الفَوارِضُ\n والبِكْرُ: الصَّغيرةُ\n وَعَوانٌ: لا صغيرةٌ ولا كبيرةٌ\n والجمعُ العُونُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قالوا ادْعُ لنَا ربك يُبين لنا ما هِيَ } أي: سل لنا ربّك ما هي { إنهَا بقرةٌ لا فارِضٌ } أي: غير مسنّة لزوال استعدادها ورسوخ اعتقادها وضراوتها بعاداتها كما قيل: الصوفيّ بعد الأربعين بارد\n { ولا بِكْرٌ } أي: فتيّة، لقصور استعدادها عما يراد منها وعسر احتمالها للرّياضة لغلبة القوى الطبيعية وقوتها فيها { عَوَانٌ } نصفة { بين } ما ذكر { صفراء } لأن لون الجسم أسود لعدم النورية فيه أصلاً، ولون النفس النباتية أخضر لظهور النورية فيها، وغلبة السواد عليها لعدم إدراكها، ولون القلب أبيض لتجرّده عن الجسم، وقوّة إدراكه، وكمال نوريته\n فلزم أن يكون لون النفس الحيوانية في الحيوانات العجم أحمر لتركب نورية إدراكها وسواد تعلقها بالجسم، إذ الحمرة لون بين البياض والسواد ومركب منهما، لكن السواد فيه أكثر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلما سمعوا استبراءه واستعاذته خافوا من الابتلاء فأوجس كلامهم خيفة في نفسه، لكونهم خائنين، واشتغلوا بتدبير الدفع، وشاوروا وأقر رأيهم على أن نووا في نفوسهم تلك البقرة المخصوصة المعلمة المعلومة عندهم بالشخص، وبعد ذلك سألوه عن تعيينه بأن { قَالُواْ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ } أكبير أم صغير؟ { قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لاَّ فَارِضٌ } كبير في السن { وَلاَ بِكْرٌ } صغير فيه بل { عَوَانٌ } متوسط { بَيْنَ ذٰلِكَ } الصغر والكبر استكمل النمو ولا تميل إلى الذبول، وإذا تحققتم { فَٱفْعَلُواْ مَا تُؤْمَرونَ } [البقرة: 68]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فلما رأوا جدَّه { قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لنَا مَا هِيَ } ، هل هي كبيرة أو صغيرة أو متوسطة؟ { قَالَ إِنَّهُ يَقُولُ إنَّهَا بَقَرَةٌ لاَّ فَارِضٌ } أي: كبيرة، { ولا بكر } أي: ولا صغير { عَوَانٌ } متوسطة بين ما ذكر من الصغر والكبر، { فَافْعَلُوا مَا تُؤْمَرُونَ } ، فإن الله يُبين لكم القاتل، { يَقِولُ إِنَّهَا بَقَرَةٌ صَفْرَاءٌ فَاقِعٌ لوْنُهَا } ناصع صفرتها { تَسُرُّ النَّاظِرِينَ } لسمنها وبهجة لونها، { قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ } ، فإن البقر الصفر كثير، وقد تشابه علينا أمرها؟ { قَالَ إِنَّهُ } تعالى يقول: إنها مسلمة من العمل ليست ذلولاً، أي: مذللة بالعمل لا { تُثِيرُ } أي: تقلب { الأرْضَ وَلا تَسْقِي الْحَرْثَ } بالسانية\n { مُسَلَّمَةٌ } من العيوب كلها، { لاَّ شِيَةَ فيهَا } أي: لا رقم فيها يخالف الصفرة\n فلما تبين لهم الأمر { قَالُوا الآنَ جِئْتَ بِالْحَقِّ } الواضح، فوجدوها عند شاب كان بيد أمه، قد استودعها له أبوه في غيضة، فاشتروها منه بملء جلدها ذهباً، أو بوزنها، { فذبحوها } ، وضربوا القتيل بجزء منها، فجلس وعروقه تسيل دماً، وقال: قتلني ابن عم لي، ثم رجع، { وَمَا كَادُوا يَفْعَلُونَ } لكثرة ترددهم، أو لفحش غلوها\n قال عليه الصلاة والسلام:\n",
      "translations": []
    }
  ]
}