{
  "chapter": "البقرة",
  "text": "قالوا۟ ادع لنا ربك يبين لنا ما لونها قال انه يقول انها بقرة صفراء فاقع لونها تسر النظرين",
  "translations": [
    {
      "translation": "Call on your Lord,\" they said, \"to tell us the colour of the cow.\" \"God says,\" answered Moses, \"a fawn coloured cow, rich yellow, well pleasing to the eye.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they further asked, \"Please request your Lord to make it clear to us of what colour she should be.\" Moses answered, \"He says that she should be of yellow colour, so deep and bright as to delight the beholders.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They further demanded Moses to ask the Lord what color the cow has to be. Moses answered, \"The Lord says that the cow must be yellow, a beautiful yellow\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Pray to your Lord that He may reveal its colour to us”; answered Moosa, “Indeed He says it is a yellow cow, of bright colour, pleasing to the beholders.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us to make plain to us its colour.\" He said, \"He says, `It is a yellow cow, bright in its colour, pleasing the beholders.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Call on your Lord for our sake to make it plain to us what her color is. Musa said: He says, Surely she is a yellow cow; her color is intensely yellow, giving delight to the beholders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Pray to thy Lord for us, that He make clear to us what her colour may be.' He said, 'He says she shall be a golden cow, bright her colour, gladdening the beholders.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Pray for us unto thy Lord that He make clear to us of what colour she is. (Moses) answered: Lo! He saith: Verily she is a yellow cow. Bright is her colour, gladdening beholders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call on your Lord for us, to show us what colour she should be.\" He answered, \"God says she should be a bright yellow heifer, pleasing to the eye.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: supplicate for us unto thy Lord that He make manifest unto us whatever her colour should be. He said: verily He saith, she should be a yellow cow the colour whereof is deepest, delighting the beholders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Invoke your Lord for us that He may clarify for us what her colour may be.’ He said, ‘He says, she is a cow that is yellow, of a bright hue, pleasing to the onlookers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Beseech on our behalf Thy Lord to make plain to us Her colour.\" He said: \"He says: A fawn-coloured heifer, pure and rich in tone, the admiration of beholders!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us to make plain to us its colour.\" He said, \"He says, 'It is a yellow cow, bright in its colour, pleasing to the beholders.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call on your Lord' they said, 'to make known to us what her color shall be' 'Your Lord says: \"The cow is yellow, a rich yellow pleasing to the onlookers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Call upon your Lord to show us what her color is.” He said, “He says she is a yellow heifer, bright in color, pleasing to the beholders.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord to show us what is her color.\" He said, \"He says, 'It is a yellow cow, bright in color - pleasing to the observers.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:69] They said, ‘Pray to your Lord for us, that He make clear to us what her colour may be’ He said, ‘He says she shall be a golden cow, bright in colour, that is, of a very intense yellow, gladdening to beholders: its beauty will please those that look at it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "12 (They said: Pray for us unto your Lord that He make clear to us of what colour she is) what colour the cow is. ((Moses) answered: Lo! He saith: Surely she is a yellow cow) her hoofs and horns are yellow while her body is black. (Bright is her colour) her colour is light, (gladdening beholders) pleasing those who look at her.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { صَفْرَآءُ فَاقِـعٌ لَّوْنُهَا } أَي سودٌ حتى ظِلفِها وقرنِها\n والصُّفرُ: السّودُ\n ومثله:\n\n[المرسلات: 33] أَي سودٌ\n وفَاقِعٌ لَونُها أَي صَافٍ لونُها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وفي الإنسان أصفر لغلبة نورية إدراكها بمجاورة القلب، إذ الصفرة حمرة عليها البياض { فاقعٌ لونها } لصفاء استعدادها وشعشعان شعاع نور القلب عليها { تسر الناظرينَ } لقوة نور استعدادها وتشعشعها والناظرون هم الكاملون المطلعون على الاستعدادات لوجوب محبتهم للمستعدّين المستبصرين وذوقهم بحضورهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ازداد خوفهم من الفضيحة بنزول الوحي متعاقبة زادوا في الاستفسار عن التعيين مكابرة وعناداً وتسويفاً حيث { قَالُواْ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا } من الألوان المتعارفة المشهورة حتى نذبحها { قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَآءُ فَاقِـعٌ } أصيل في الصفرة كأنه وضع اسم الصفرة بإزائها أولاً { لَّوْنُهَا } كلون ذهب { تَسُرُّ ٱلنَّاظِرِينَ } [البقرة: 69] والسرور عبارة عن الانبساط والانتعاش الحاصل للقلب عند الفراعنة عن جميع الشواغل، وفي تلك الحالة يتعجب عن كل ذرة بل عن نفسه، ويؤدي تعجبه إلى التحير، فإذا تحير غرق في بحر لا ساحل له ولا قعر، أدركنا يا دليل المتحيرين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}