{
  "chapter": "البقرة",
  "text": "ختم الله على قلوبهم وعلى سمعهم وعلى ابصرهم غشوة ولهم عذاب عظيم",
  "translations": [
    {
      "translation": "God has sealed their hearts and ears, and veiled their eyes. For them is great deprivation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sealed up their hearts and ears and a covering has fallen over their eyes, and they have incurred the severest punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts and hearing and their vision is veiled; a great punishment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has sealed their hearts and their ears, and on their eyes is a covering; and for them is a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and on their hearing, and on their eyes there is a covering. Theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and upon their hearing and there is a covering over their eyes, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has set a seal on their hearts and on their hearing, and on their eyes is a covering, and there awaits them a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath sealed their hearing and their hearts, and on their eyes there is a covering. Theirs will be an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has sealed their hearts and their ears, and over their eyes there is a covering. They will have a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath set a seal upon their hearts and upon their hearing, and over their sights is a covering; and unto them shall be a torment mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and their hearing, and there is a blindfold on their sight, and there is a great punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath set a seal on their hearts and on their hearing, and on their eyes is a veil; great is the penalty they (incur).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal on their hearts and on their hearings, (i.e. they are closed from accepting Allah's Guidance), and on their eyes there is a covering. Theirs will be a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and ears; their sight is dimmed and for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has set a seal on their hearts and on their hearing, and over their vision is a veil. They will have a severe torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:7] God has set a seal on their hearts, impressing on them and making certain that no good enters them; and on their hearing, [in which He has] deposited something so that they cannot profit from the truth they hear; and on their eyes is a covering, that is, a veil so that they do not see the truth; and for them there will be a mighty chastisement, that is, intense and everlasting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath sealed their hearts), stamped their hearts, (and their hearing, and on their eyes there is a covering), on their eyes there is a shield (and theirs will be an awful doom) an awful torment in the Hereafter. This refers in particular to the Jews Ka'b Ibn al-Ashraf, Huyayy Ibn Akhtab and Judayy Ibn Akhtab. It is also said that it refers to the idolaters of Mecca 'Utbah [Ibn Rabi'ah], Shaybah [Ibn Rabi'ah] and al-Walid [Ibn al-Mughirah].\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { عَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ } أي غِطاءٌ وسِترٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ خَتَمَ ٱللَّهُ } المحيط بذواتهم وأوصافهم وأفعالهم { عَلَىٰ قُلُوبِهمْ } لئلا يكونوا من أرباب المكاشفات { وَعَلَىٰ سَمْعِهِمْ } لئلا يكونوا من أصحاب المجاهدة { وَعَلَىٰ أَبْصَٰرِهِمْ } لئلا يكونوا من أرباب المشاهدة { غِشَاوَةٌ } ستر عظيم لا يمكنك رفعه بل { وَلَهُمْ عَذَابٌ عظِيمٌ } [البقرة: 7] هو عذاب الطرد والبعد؛ إذ لا عذاب أعظم منه، أولئك الأشقياء البعداء عن ساحة الحضور، هم الضالون في تيه الحرمان، الباقون في عظلمة الإمكان، أعاذنا الله من ذلك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}