{
  "chapter": "البقرة",
  "text": "قالوا۟ ادع لنا ربك يبين لنا ما هى ان البقر تشبه علينا وانا ان شاء الله لمهتدون",
  "translations": [
    {
      "translation": "Call on your Lord,\" they said, \"to name its variety, as cows be all alike to us. If God wills we shall be guided aright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again they said, \"Pray your Lord to specify for us the kind of cow that is required; for cows (of this type) look alike to us. We shall then find her, if God so wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We are confused about the cow, for to us all cows look alike. Ask your Lord to tell us exactly what the cow looks like, so that God willing, we shall have the right description.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Pray to your Lord that He may clearly describe the cow to us, we are really in a doubt as to which cow it is; and if Allah wills, we will attain guidance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us to make plain to us what it is. Verily, to us all cows are alike. And surely, if Allah wills, we will be guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Call on your Lord for our sake to make it plain to us what she is, for surely to us the cows are all alike, and if Allah please we shall surely be guided aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Pray to thy Lord for us, that He make clear to us what she may be; cows are much alike to us; and, if God will, we shall then be guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Pray for us unto thy Lord that He make clear to us what (cow) she is. Lo! cows are much alike to us; and Lo! if Allah wills, we may be led aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Ask your Lord to make it clear to us the exact type of heifer she should be, for to us all heifers look alike. If God wills, we shall be rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said supplicate for us unto thy Lord that He make manifest unto us whatever she should be, for verily the cow hath become dubious unto us and verily we, if God will, shall beguided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Invoke your Lord for us that He may clarify for us what she may be. Indeed all cows are much alike to us, and if Allah wishes we will surely be guided.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Beseech on our behalf Thy Lord to make plain to us what she is: To us are all heifers alike: We wish indeed for guidance, if Allah wills.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord for us to make plain to us what it is. Verily to us all cows are alike, And surely, if Allah wills, we will be guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Call on your Lord' they said, 'to make known to us which cow she shall be; to us cows look alike. If Allah wills, we shall be guided'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Call upon your Lord to show us which one; the heifers look alike to us; and God willing, we will be guided.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Call upon your Lord to make clear to us what it is. Indeed, [all] cows look alike to us. And indeed we, if Allah wills, will be guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:70] They said, ‘Pray to your Lord for us, that He make clear to us what she may be: does it graze freely or is it used in labour?; the cows (that is, the species described in the way mentioned), are all alike to us, because there are many of them and we have not been able to find the one sought after; and if God wills, we shall then be guided’ to it. In one hadīth [it is reported]: ‘Had they not uttered the proviso [inshā’a Llāh], it would never have been made clear to them’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: pray for us unto your Lord that He make clear to us what (cow) she is) whether she ploughs the soil or not. (Lo! Cows are much alike to us) we cannot distinguish much between cows; (and lo! If Allah wills, we may be led rightfully) to its fitting description; as it is said that this means: we may be led to the murder of 'Amil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ البقَرَ تشابه علينا } لكثرة البقر الموصوف بهذه الصفة، أي: كثرة أصناف المستعدّين وما كل مستعدّ طالباً\n كما قيل: ما كلّ طبع قابلاً ولا كل قابل طالباً، ولا كلّ طالب صابراً، ولا كلّ صابر واجداً\n { وإنّا إنْ شاء الله لمهتدون } إلى ذبح هذه البقرة\n وقولهم: إن شاء الله، دليل على استعدادهم لعلمهم بأن الأمور متعلقة بمشيئة الله، ميسّرة بتوفيقه\n ولهذا قال رسول الله صلى الله عليه وسلم:\n\n \" لو لم يستثنوا لما ظفروا بها أبد الدهر \"\n \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما جزموا الإلجاء وقطعوا النظر عن الخلاص، كابروا وعنادوا أيضاً مبالغين فيها حيث { قَالُواْ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ } أي: ما هويتها وهيئتها الشخصية المعينة، وقل: { إِنَّ ٱلبَقَرَ } المأمور به { تَشَابَهَ عَلَيْنَا } واستوصفناه منك وصفتها بالصفات المشتركة العامة { وَإِنَّآ إِن شَآءَ ٱللَّهُ } تعيينه وتشخيصه لنا { لَمُهْتَدُونَ } [البقرة: 70] بذبحها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}