{
  "chapter": "البقرة",
  "text": "قال انه يقول انها بقرة لا ذلول تثير الارض ولا تسقى الحرث مسلمة لا شية فيها قالوا۟ الـن جئت بالحق فذبحوها وما كادوا۟ يفعلون",
  "translations": [
    {
      "translation": "And Moses said: \"He says it's a cow unyoked, nor worn out by ploughing or watering the fields, one in good shape with no mark or blemish.\" \"Now have you brought us the truth,\" they said; and then, after wavering, they sacrificed the cow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses answered, \"Allah says that she should be a cow which has not been yoked nor has ploughed the land nor watered the fields; which is sound and whole, without belemish. \" Then they cried out, \"Now you have given an accurate description. \" Then they sacrificed her but they did not appear to be doing this willingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said, \"The Lord says that it must not have even tilled the soil nor irrigated the fields and it must be free of blemishes and flaws.\" They said, \"Now you have given us the right description.\" After almost failing to find it, they slaughtered the cow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “He says, ‘She is a cow not made to work, neither ploughing the soil nor watering the fields; flawless and spotless’; they said, “You have now conveyed the proper fact”; so they sacrificed it, but seemed not to be sacrificing it (with sincerity).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Musa) said, \"He says, `It is a cow neither trained to till the soil nor water the fields, sound, having no blemish in it.' \" They said, \"Now you have brought the truth.\" So they slaughtered it though they were near to not doing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Musa said: He says, Surely she is a cow not made submissive that she should plough the land, nor does she irrigate the tilth; sound, without a blemish in her. They said: Now you have brought the truth; so they sacrificed her, though they had not the mind to do (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'He says she shall be a cow not broken to plough the earth or to water the tillage, one kept secure, with no blemish on her.' They said, 'Now thou hast brought the truth'; and therefore they sacrificed her, a thing they had scarcely done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) answered: Lo! He saith: Verily she is a cow unyoked; she plougheth not the soil nor watereth the tilth; whole and without mark. They said: Now thou bringest the truth. So they sacrificed her, though almost they did not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses answered, \"Your Lord says, she should be a heifer which has not been yoked to plough the land or water the fields, a heifer free from any blemish.\" \"Now you have told us the truth,\" they answered, and they sacrificed it, though they would rather not have done it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: verily He saith, verify she should be a cow unyoked, not broken to till the ground or to water the field, whole, and without blemish in her. They said: now hast thou brought the truth. Then they slaughtered her, and they were wellnigh not doing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘He says, She is a cow not broken to till the earth or water the tillage, sound and without blemish.’ They said, ‘Now have you come up with the truth!’ And they slaughtered it, though they were about not to do it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"He says: A heifer not trained to till the soil or water the fields; sound and without blemish.\" They said: \"Now hast thou brought the truth.\" Then they offered her in sacrifice, but not with good-will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa (Moses)] said, \"He says, 'It is a cow neither trained to till the soil nor water the fields, sound, having no other colour except bright yellow.' \" They said, \"Now you have brought the truth.\" So they slaughtered it though they were near to not doing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied: 'He says: \"She is a cow, neither worn out plowing the earth nor watering the field, one kept secure free from any blemish.' 'Now you have brought us the truth' they answered. And they slaughtered her, after they had been reluctant to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “He says she is a heifer, neither yoked to plow the earth, nor to irrigate the field; sound without blemish.” They said, “Now you have brought the truth.” So they slew her; though they almost did not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"He says, 'It is a cow neither trained to plow the earth nor to irrigate the field, one free from fault with no spot upon her.' \" They said, \"Now you have come with the truth.\" So they slaughtered her, but they could hardly do it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:71] He said, ‘He says she shall be a cow not broken, not subdued for labour, that is, to plough the earth, churning its soil for sowing (tuthīr al-ard: the clause describes the word dhalūl, and constitutes part of the negation); or to water the tillage, that is, the land prepared for sowing; one safe, from faults and the effects of toil; with no blemish, of a colour other than her own, on her’. They said, ‘Now you have brought the truth’, that is, [now] you have explained it clearly; they thus sought it out and found it with a boy very dutiful towards his mother, and they eventually purchased it for the equivalent of its weight in gold; and so they sacrificed her, even though they very nearly did not, on account of its excessive cost. In a hadīth [it is stated that], ‘Had they sacrificed any cow, it would have sufficed them, but they made it difficult for themselves and so God made it difficult for them’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Moses) answered: Lo! He saith: Surely she is a cow unyoked) unfettered; (she plougheth not the soil) she is not subjugated for the ploughing of the soil (nor watereth the tilth) nor for carrying water to irrigate it; (whole) free from any blemish (and without mark) spots or flecks of white. (They said: now thou bringest the Truth) now we know the cow's right description. They looked for it and bought her in exchange for her weight in gold. (So they sacrificed her, though almost they did not) i.e. initially; as it is said because the cow was hugely expensive.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولُه تعالى: { وَلاَ تَسْقِي ٱلْحَرْثَ مُسَلَّمَةٌ لاَّ شِيَةَ فِيهَا } أَي لا لَونَ سِوى لون جَميعِ جلْدِهَا\n وجمعهُ شِياتُ\n والمُسَلَّمَةُ: التي لاَ عَيبَ فِيها\n\n\n\n\nوقولهُ تعالى: { فَذَبَحُوهَا } فالذَّبحُ كانَ فِيهم، والنَّحرُ فِي أُمةِ محمدٍ (ص)\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا ذَلولٌ } غير مذللة، منقادة لأمر الشرع { تثيرُ } أرض الاستعداد بالأعمال الصالحة والعبادات { ولا تسقي } حرث المعارف والحكم التي فيها بالقوّة باستقاء ماء العلوم الكسبية والأفكار الثاقبة، لعدم احتياج مثل هذه البقرة إلى الذبح { مُسلمةٌ } سلمها أهلها لترعى، غير مسوسة برسوم وعادات وشرائع وآداب { لا شِيةَ فيها } أي: لم يرسخ فيها اعتقاد ومذهب لعدم صلاحيتها للذبح\n { جِئتَ بالحقِ } الثابت في بيان المستعد المشتاق، الطالب للكمال { فذبحوها وما كادوا يَفعلون } لكثرة سؤالاتهم ومبالغاتهم وتعمقهم في البحث والتفتيش عن حالها، وفضول كلامهم في بيانها التي تدلّ على عدم انقياد النفس بالسرعة، وإبائها للرياضة، وغلبة الفضول عليها، وتعذر مطلوبهم، وتأخرهم عنه بسبب ذلك\n\n\nولهذا قال رسول الله صلى الله عليه وسلم:\n\n \" لو اعترضوا أدنى بقرة فذبحوها لكفتهم، ولكن شدّدوا فشدّد الله عليهم \" \n\n، أي: لو لم يكن منهم كثرة فضول البحث والسؤال لما عزّ عليهم مطلوبهم لقوّة قبولهم وإرادتهم، فكان سلس القياد، سهل الانقياد\n ونهى صلى الله عليه وسلم عن كثرة السؤال، وقال:\n\n \" إنما هلك من كان قبلكم بكثرة السؤال \" \n\nقال الله تعالى:\n\n[المائدة، الآية: 101]\n وقيل في قصتها: إنّ شيخاً من بني إسرائيل نتجت له عجلة على هذه الصفة، وكان له ابن طفل، فجاء بها إلى عجوز وقال: إنها لهذا الطفل، سلميها في مرعاها عساها تنفعه إذا بلغ\n فلما وقعت هذه الواقعة وسعى بنو إسرائيل في طلب البقرة أربعين سنة سمعت العجوز بها، فأخبرت ابنها بما فعل أبوه وقد ترعرع، فجاء إلى المرعى فوجدها، فأتى بها فساوموه في شرائها ومنعته العجوز عن بيعها حتى اشتروها بملء مسكها ذهباً\n فالشيخ هو الروح، والعجوز الطبيعة الجسمانية، وابنه الطفل هو العقل الذي هو نتيجة الروح، والشابّ المقتول هو القلب\n سلّم شيخ الروح عجل النفس إلى عجوز الطبع ليرعى في مرعى اللذت الطبيعية حتى يكبر عسى طفل العقل أن ينتفع بها وقت البلوغ في انتزاع المعقولات من محسوساتها واستعمال الفكر الذي هو من قواها في اكتساب العلوم العقلية\n وهو الذي جاء بها من المرعى وسعي بني إسرائيل أربعين سنة إشارة إلى السير إلى الله بالأعمال والآداب والتخلق بالأخلاق، إلى أوان البلوغ الحقيقي، وتجرّد القلب، كما قال الله تعالى:\n\n[الأحقاف، الآية: 15]\n ومساومتهم إياها في شرائها إشارة غلى طلب القوى الروحانية المنوّرة بنور الهداية الشرعية والإرادة، وانتزاعها من العقل المشوب بالوهم، واستعباد العقل إياها بالمعقولات القياسية، وتسخيرها بالفكريات، وحجبها عن نور الهداية الشرعية بالقياسات العقلية، وعدم تحليتها بالشرعيات\n وهذا هو الموجب لتشدّدهم في السؤال وتأخرهم وتباطئهم في الامتثال\n ومنع العجوز إياه هو ممانعة الطبع في الانقياد للشرع، وموافقة العقل إياه في ذلك لرعاية العقل جانب الطبع في مصالح المعاش وترفيهه إياه، وترخيصه والتوسيع عليه أكثر من الشرع\n وبيعها بملء مسكها ذهباً إشارة إلى تحليها بعد الذبح والسلخ بالعلوم النافعة الشرعية والعقلية الخلقية والأحكام الفرعية الدينية، واشتمال صورتها عليها التي توافق العقل والطبع وتنفعهما باستعمالهما إياها في تحصيل مصالح المعاش والمباغي الطبيعية والمطالب العقلية العملية بإذن الشرع من الوجه الحلال والتصرّف المباح وأنواع الرخص في جميع التمتعات بعد حصول الكمال وتمام السلوك\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لاَّ ذَلُولٌ } عجف مهزول بسبب أنها { تُثِيرُ ٱلأَرْضَ } تقلبها للزراعة { وَلاَ } ذلول بسبب ذلتها إنها { تَسْقِي ٱلْحَرْثَ } بالدلو والسقاية بل { مُسَلَّمَةٌ } من صغرها عن أمثال هذه المذلات { لاَّ شِيَةَ فِيهَا } لا علامة في أعضائها من ضرب العود والسوط وغيرها، بل تأكل وتمشي هوناً بلا مصرف ومراع، ولما بالغوا في الاستفسار إلى أن بلغوا ما نووا في نفوسهم ألزموا وأفحموا و { قَالُواْ ٱلآنَ جِئْتَ بِٱلْحَقِّ } الثابت الكائن في الواقع وفي نيتنا واعتقادنا\n\n\n\n\nحكي أن شيخاً صالحاً من صلحائهم كانت له هذه العجلة المتصفة بهذه الصفات، فذهب بها إلى \" أيلة \" فأودعها عند الله وقال: اللهم إني استودعتها عندك لولدي حتى يكبر، ثم مات الشيخ وكانت تلك البقرة في حمى الله وحفظه حتى كبر الولد وحدثت تلك الفتنة فيما بينهم، فأمر الله بذبح تلك البقرة على سبيل الإلجاء، فاشتروها بملء مسكها ذهباً { فَذَبَحُوهَا } ملجئين مكرهين { وَ } لولا إلجاؤها إياهم وإكراهنا لهم { مَا كَادُواْ يَفْعَلُونَ } [البقرة: 71] لخوف الفضيحة وغلاء الثمن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}