{
  "chapter": "البقرة",
  "text": "واذ قتلتم نفسا فادرتم فيها والله مخرج ما كنتم تكتمون",
  "translations": [
    {
      "translation": "Remember when you killed a man and blamed each other for the deed, God brought to light what you concealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You should also recall to mind another incident: You slew a man and began to dispute about the murder and accuse one another of it, but Allah had decreed that what you were trying to hide should be disclosed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you murdered someone, each one of you tried to accuse others of being guilty. However, God made public what you were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you slew a man and were therefore accusing each other concerning it; and Allah wanted to expose what you were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you killed a man and disagreed among yourselves as to the crime. But Allah brought forth that which you were Taktumun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you killed a man, then you disagreed with respect to that, and Allah was to bring forth that which you were going to hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you killed a living soul, and disputed thereon -- and God disclosed what you were hiding --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when ye slew a man and disagreed concerning it and Allah brought forth that which ye were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when you [Israelites] killed someone and started to blame one another, God brought to light what you concealed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time ye slew a person, then quarrelled among yourselves respecting it, and Allah was to bring out that which ye were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you killed a soul, and accused one another about it—and Allah was to expose what you were concealing—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember ye slew a man and fell into a dispute among yourselves as to the crime: But Allah was to bring forth what ye did hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when you killed a man and fell into dispute among yourselves as to the crime. But Allah brought forth that which you were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you slew a soul and then fell out with one another concerning it, Allah made known what you concealed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when you killed a person, and disputed in the matter; but God was to expose what you were hiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when you slew a man and disputed over it, but Allah was to bring out that which you were concealing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:72] And when you killed a living soul, and disputed thereon (iddāra’tum: the tā’ [of the root-form itdāra’tum] has been assimilated with the dāl) — and God disclosed what you were hiding (this is a parenthetical statement; the story begins here [with wa-idh qataltum nafsan, ‘and when you killed a soul’… and continues in the following]):\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the murdered person, saying: (And (remember) when ye slew a man) 'Amil (and disagreed concerning it) concerning his murder (and Allah brought forth that which ye were hiding) thus demonstrating what you hid with regard to his murder.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَإِذْ قَتَلْتُمْ نَفْساً فَٱدَّارَأْتُمْ فِيهَا } أَي اختَلفتم فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذ قتلتم نفساً فادّارءْْتُم فيها } إشارة إلى بيان سبب الأمر بذبح البقرة، وهو أنه كان شيخ موسر من بني إسرائيل وله ابن شاب فقتله ابنا عمه، أو بنو عمه، طمعاً في ميراث أبيه وطرحوه بين أسباط بني إسرائيل على الطريق، فتدافعوا في قتله، فورد الأمر بذبح البقرة وضربه ببعضها ليحيا فيخبر بالقاتل\n فالشابّ هو القلب الذي هو ابن الروح الموسر بأموال المعارف والحكم، وقتله منعه عن حياته الحقيقية وإزالة العشق الحقيقي الذي هو حياته عنه باستيلاء قوّتي الشهوة والغضب اللذين هما ابنا عمه النفس الحيوانية أو جميع قواها عليه، إذ الروح والنفس أخوان باعتبار فيضانهما وولادتهما من أب هو العقل الفعال المسمّى { روح القدس } على قياس ما ورد في الحديث:\n\n \" أكرموا عمتكم النخلة، فإنها خلقت من بقية طين آدم \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تفعلونه وأنتم تعلمون أن سبب نزوله تفضيحكم وإظهار ما كتمتم في نفوسكم { إِذْ قَتَلْتُمْ نَفْساً } بغير حق { فَٱدَّارَأْتُمْ } وتدافعتم { فِيهَا } أي: في شأنها بأن أسقط كل منكم قتلها عن ذمته وسترتم أمرها وهدرتم دمه { وَٱللَّهُ } المحيط بسرائركم وضمائركم { مُخْرِجٌ } مظهر { مَّا كُنْتُمْ تَكْتُمُونَ } [البقرة: 72] في نفوسكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: حق هذه الآية أن تتقدم قبل قوله:\n\n[البَقَرَة: 67] وإنما أخَّرها الحق تعالى ليتوجه العتاب إليهم مرتين على ترك المسارعة لامتثال أمر نبيهم، وعلى قتل النفس، ولو قدمها لكانت قصة واحدة بتوبيخ واحد\n يقول الحقّ جلّ جلاله: { و } اذكروا { إِذْ قَتَلْتُمْ نَفْساً } حرصاً على الدنيا { فَادَّارَأْتُمْ } أي: تدافعتم في شأنها، كل قرية تدفع عنها، { والله } تعالى { مُخْرِجٌ } ومبين { مَّا كُنتُمْ تَكْتُمُونَ } من القتل، ومن قتله، { فَقُلْنَا }: اضربوا القتيل أو قبره { بِبَعْضِهَا } قيل: اللسان، وقيل القلب، وقيل: الفخد أو الذنب، فضربوه فحيى، وأخبر بقاتله كما تقدم، { كَذَلِكَ } أي: كما أحيا هذا القتيل، { يُحْيِي الله الموتى } من قبورها { وَيُرِيكُمْ آيَاتِهِ } الدالّة على قدرته، { لَعَلَّكُمْ تَعْقِلُونَ } فتعلمون أن من قدر على إحياء نفس واحد يقدر على إحياء الأنفس كلها\n واستدلت المالكية بالقصة على التدمية الحمراء، وهي قبول قول القتيل قبل موته بأن فلاناً قتله، وفيه نظر لأن هذا حيى بعد موته فلا يتطرقه الكذب، واستدلت أيضاً على حرمان القتل من الإرث، وفيه نظر لأن هذه شريعة من قبلنا يتطرقها النسخ، لكن ثبت في الحديث أنه لا يرث\n والله تعالى أعلم\n الإشارة: إذا أمر الشيخ المريدين بذبح نفوسهم بخرق عوائدها، فمن تردد منهم في فعل ما تموت به نفسه، كان ذلك دليلاً على قلة صدقه وضعف نهايته، ومن بادر منها إلى قتلها دلّ على صدقه وفلاحه ونجح نهايته، فإذا ماتت النفس بالكلية حييت روحه بالمعرفة والمشاهدة الدائمة، فلا موت بعدها أبداً، قال تعالى:\n\n[الدّخَان: 56]، وأما الموت الطبيعي فإنما هو انتقال من مقام إلى مقام، ومن وطن ضيق إلى وطن واسع، وأنشدوا:\n\nقلت: والسيف الذي يُجْهز على النفس ويسرع قتلها هو الذل والفقر، فمن ذلّ نفسه بين أبناء جنسه، وخرق عوائد نفسه، وزهد في الدنيا، ماتت نفسه في طرفة عين، وحيِيَتْ روحه، وظفر بِقُرَّةِ العين، وهي معرفة مولاه، والغيبة عما سواه\n وكمال الوقت في ذبح النفس أن تكون متوسطة بين الصغر والكبر، فإن الصغيرة جدّاً لا يؤمن عليها الرجوع، والكبيرة جدّاً قد يصعب عليها النزوع، كاملة الأوصاف بحسن الزهد والعفاف، تسر الناظرين لبهجة منظرها وحسن طلعتها، وكذلك من كان من أهل الشهود والنظرة، تَسْحَرُ مشاهدة القلوب، ويسوقها بسرعة إلى حضرة علام الغيوب، لما أقيم به من مشاهدته الملكوت، حتى إن من لاحظه تناسى أحوال البشرية، واستولت عيله أنوار الروحانية، وغابت في ذكر الحبيب عن البعيد والقريب، كما في الحديث:\n\n \" أولياُء اللَّهِ مَنْ إذا رُؤوا ذُكر الله \" \n",
      "translations": []
    }
  ]
}