{
  "chapter": "البقرة",
  "text": "فقلنا اضربوه ببعضها كذلك يحى الله الموتى ويريكم ءايته لعلكم تعقلون",
  "translations": [
    {
      "translation": "We had pronounced already: \"Slay (the murderer) for (taking a life).\" Thus God preserves life from death and shows you His signs that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We commanded, \"Strike the corpse of the murdered man with a part of the sacrificed cow. See how Allah brings the dead to life and shows you His Signs, so that you may understand\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Strike the person slain with some part of the cow.\" That is how God brings the dead to life and shows you His miracles so that you might have understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore said, “Strike the dead man with a part of the sacrificed cow”; this is how Allah will bring the dead to life, and shows you His signs so that you may understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said: \"Strike him (the dead man) with a piece of it (the cow).\" Thus Allah brings the dead to life and shows you His Ayat (proofs, evidences, etc.) so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said: Strike the (dead body) with part of the (Sacrificed cow), thus Allah brings the dead to life, and He shows you His signs so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so We said, 'Smite him with part of it'; even so God brings to life the dead, and He shows you His signs, that haply you may have understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We said: Smite him with some of it. Thus Allah bringeth the dead to life and showeth you His portents so that ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, \"Strike [the corpse] with a part of it.\" Thus God restores the dead to life and shows you His signs, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore We said: smite him with part of her. Thus will Allah quicken the dead and He sheweth you His signs that haply ye may under stand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, ‘Strike him with a piece of it:’ thus does Allah revive the dead, and He shows you His signs so that you may exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said: \"Strike the (body) with a piece of the (heifer).\" Thus Allah bringeth the dead to life and showeth you His Signs: Perchance ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We said: \"Strike him (the dead man) with a piece of it (the cow).\" Thus Allah brings the dead to life and shows you His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said: 'Strike him with a piece of it' Like this, Allah restores the dead to life and shows you His signs in order that you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We said, “Strike him with part of it.” Thus God brings the dead to life; and He shows you His signs, that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, We said, \"Strike the slain man with part of it.\" Thus does Allah bring the dead to life, and He shows you His signs that you might reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:73] so We said, ‘Smite him, the slain man, with part of it’, and so when he was struck with its tongue or its tail, he came back to life and said, ‘So-and-so killed me’, and after pointing out two of his cousins, he died; the two [killers] were denied the inheritance and were later killed. God says: even so, is the revival, for, God brings to life the dead, and He shows you His signs, the proofs of His power, so that you might understand, [that you might] reflect and realise that the One capable of reviving a single soul is also capable of reviving a multitude of souls, and then believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We said: Smite him) the murdered person (with some of it) with an organ of the cow; and it is also said: with its tail or tongue. (Thus) just as He brought 'Amil back to life (Allah bringeth the dead to life) for the Resurrection (and showeth you His portents) bringing the dead to life (so that ye may understand) in order that you may believe in resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ٱضْرِبُوهُ بِبَعْضِهَا } قالَ زَيدُ بن علي عليهما السلامُ: بالعَظمِ الذي يلي الغُضْروف\n وقالَ عليُ بن الحسين عليهما السلامُ بفخذِهَا أو بذَنبِهَا\n\n\n\n\nوقوله تعالى: { يُرِيكُمْ آيَاتِهِ } معناهُ يُعلمُكُمْ بِعَلامَاتِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَقُلْنَا } لكم بعد تدارئكم وتدافعكم وذبحكم البقرة المأمورة { ٱضْرِبُوهُ } أي: المقتول { بِبَعْضِهَا } أي: ببعض البقرة أيُّ بعض كان، فضربوه فحيي بإذن الله، فأخبر بقاتله، ففضحوا وارتفعت المدارأة { كَذَلِكَ } أي: مثل إحياء هذه المقتول بلا سبب تقتضيه عقولكم وترتضيه نفوسكم { يُحْيِي ٱللَّهُ } القادر على ما يشاء جميع { ٱلْمَوْتَىٰ } في يوم الحشر والجزاء بلا أسباب ووسائل اقتضتها عقول العقلاء؛ إذ عنده الإبداء عين الإعادة والإعادة عين الإبداء، بل الكل في مشيئته على السواء { وَيُرِيكُمْ } ظهوره من { آيَاتِهِ } الدالة على تحقيق وقوعه { لَعَلَّكُمْ تَعْقِلُونَ } [البقرة: 73] رجاء أن تتفكروا ووتفطنوا منها إليه وتؤمنوا بجميع المعتقدات الشرعية الدنيوية والأخروية\n\n\n\n\nوصدقوها على وجه التعبد والانقياد وبلا مراء ومجادلة مع من أوتي بها من الرسل والأنبياء، ولا يتيسر لكم هذه المرتبة إلا بعد ذبحكم بقرة النفس الأمارة المسلطة بالوقة التامة عليكم، المتلونة بالألوان المسرة لنفوسكم وطباعكم، المسلمة الممتنعة من التكاليف الشرعية من الأوامر والنواهي، وضربكم بها على النفس المطمئنة المقهورة المقتولة ظلماً لتصير حية بالحياة الأبدية، باقية بالبقاء السرمدي، فتخبركم وتذكركم عن صنائع أمارتكم الظالمة المتجاوزة عن الحدود، خلصنا الله من شرورها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}