{
  "chapter": "البقرة",
  "text": "ثم قست قلوبكم منۢ بعد ذلك فهى كالحجارة او اشد قسوة وان من الحجارة لما يتفجر منه الانهر وان منها لما يشقق فيخرج منه الماء وان منها لما يهبط من خشية الله وما الله بغفل عما تعملون",
  "translations": [
    {
      "translation": "Yet, in spite of this, your hearts only hardened like rocks or even harder, but among rocks are those from which rivers flow; and there are also those which split open and water gushes forth; as well as those that roll down for fear of God. And God is not negligent of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But even after seeing these Signs your hearts hardened and became as hard as rocks; nay, even harder than rocks. For there are some rocks out of which springs gush forth, and others which split open, and water issues out of them; then there are some which tumble down for fear of Allah. And Allah is not unaware of what you are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, your hearts turned as hard as rocks or even harder for some rocks give way to the streams to flow. Water comes out of some rocks when they are torn apart and others tumble down in awe before God. God does not ignore what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after it, your hearts hardened – so they are like rocks, or even harder; for there are some rocks that rivers gush forth from them; and some that water flows from them when they split asunder; and there are rocks that fall down for the fear of Allah; and Allah is not unaware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that your hearts were hardened and became as stones or even worse in hardness. And indeed, there are stones out of which rivers gush forth, and indeed, there are of them (stones) which split asunder so that water flows from them, and indeed, there are of them (stones) which fall down for fear of Allah. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts hardened after that, so that they were like rocks, rather worse in hardness; and surely there are some rocks from which streams burst forth, and surely there are some of them which split asunder so water issues out of them, and surely there are some of them which fall down for fear of Allah, and Allah is not at all heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts became hardened thereafter and are like stones, or even yet harder; for there are stones from which rivers come gushing, and others split, so that water issues from them, and others crash down in the fear of God. And God is not heedless of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, even after that, your hearts were hardened and became as rocks, or worse than rocks, for hardness. For indeed there are rocks from out which rivers gush, and indeed there are rocks which split asunder so that water floweth from them. And indeed there are rocks which fall down for the fear of Allah. Allah is not unaware of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts became as hard as rock or even harder: for, there are rocks from which streams gush forth; and, there are some that cleave asunder and water flows out from them, while others fall down for fear of God. God is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts hardened thereafter, so they are as stones or stronger in hardness: and verily of stones there are some from which gush forth rivers, and verily there are of them some that cleave asunder and water issueth therefrom, and verily there are of them some that fall down in awe of Allah: and Allah is not neglectful of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts hardened after that; so they are like stones, or even harder. For there are some stones from which streams gush forth, and there are some of them that split, and water issues from them, and there are some that fall for the fear of Allah. And Allah is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thenceforth were your hearts hardened: They became like a rock and even worse in hardness. For among rocks there are some from which rivers gush forth; others there are which when split asunder send forth water; and others which sink for fear of Allah. And Allah is not unmindful of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after that, your hearts were hardened and became as stones or even worse in hardness. And indeed, there are stones out of which rivers gush forth, and indeed, there are of them (stones) which split asunder so that water flows from them, and indeed, there are of them (stones) which fall down for fear of Allah. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet after that your hearts became as hard as rock or even harder. Indeed among the stones are those from which rivers burst. And others split so that water issues from them; and others crash down through fear of Allah. Allah is not inattentive of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after that your hearts hardened. They were as rocks, or even harder. For there are some rocks from which rivers gush out, and others that splinter and water comes out from them, and others that sink in awe of God. God is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your hearts became hardened after that, being like stones or even harder. For indeed, there are stones from which rivers burst forth, and there are some of them that split open and water comes out, and there are some of them that fall down for fear of Allah. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:74] Then your hearts became hardened, O you Jews, they [your hearts] became stiffened against acceptance of the truth, thereafter, that is, after what is mentioned of the bringing back to life of the slain man and the other signs before this; and they are like stones, in their hardness, or even yet harder, than these; for there   are stones from which rivers come gushing, and others split (yashshaqqaq: the initial tā’ [of the root-form yatashaqqaq] has been assimilated with the shīn), so that water issues from them; and others come down, from on high, in fear of God, while your hearts are unmoved, unstirred and not humbled; And God is not heedless of what you do, but instead, He gives you respite until your time comes (ta‘malūna, ‘you do’: a variant reading has ya‘malūna, ‘they do’, indicating a shift to the third person address).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, even after that) after bringing 'Amil back to life and informing you about his murderer, (your hearts were hardened) dry and barren (and became as rocks, or worse than rock, for hardness. For indeed there are rocks from out which rivers gush, and indeed there are some which split asunder so that water floweth from them. And indeed there are some which fall down) from the top of mountains to the bottom (for the fear of Allah) but your hearts are not moved by fear of Allah. (Allah is not unaware of) will not leave unpunished (what ye do) of transgressions; and it is said the meaning is: what you hide of transgression.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { ثُمَّ قَسَتْ قُلُوبُكُمْ مِّن بَعْدِ ذٰلِكَ } معناهُ جَفَّتْ، فَصارتْ جَافِيةً صَلبةً\n من بَعدِ ذَلِكَ: من بَعْدِمَا آراهم الآيةَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ثم قسَتْ قُلوبُكم } أي: بعد تطاول الأمد، وتراخي مدّة الفترة، وتتابع التلوينات، وتوالي النزغات، قست قلوبكم بكثرة مباشرة الأمور واللذات البدنية، وملابسة الصفات النفسانية { فهي كالحجارةِ } من عدم تأثرها بالنقش العلميّ { أو } شيء { أشد قسوةً } منها، كالحديد مثلاً\n ثم بين أنّ الحجارة ألين منها بأنّ حالها منحصر في الوجوه الثلاثة المذكورة، فأفاد أن القلوب أربعة: قلب تنوّر بالنور الإلهيّ منطمساً فيه، واستغرق في البحر العلميّ منغمساً فيه، فانفجرت منه أنهار العلم، فمن شرب منها يحيا أبداً كقلوب أهل الله السابقين وهو المشار إليه بقوله تعالى: { وإنّ منَ الحجارةِ لَمَا يتفجّرُ منه الأنهارُ } وقلب ارتوى من العلم، فحفظ ووعى، فانتفع به الناس، كقلوب العلماء الراسخين وهو المشار إليه بقوله: { وإن مِنها لمَا يَشققُ فيخرُجُ منه المَاءُ } وقلب خشع وانقاد واستسلم وأطاع، كقلوب العباد والزهّاد من المسلمين، وهو المشار إليه بقوله: { وإنّ منها لمَا يَهبطُ من خَشيةِ الله } وأدنى أحوال حاله هو الهبوط من خشية الله، أي: الانقياد لما أمر الله من الميل إلى المركز بالسلاسة\n وبقي قلب لم يتأثر قطّ بالعلم ولم يتلين بالخوف آبياً للهدى، متكبراً، ممتلئاً بالهوى، متمرّداً، فلا يوجد من الجواهر ما يشبهه لقبول جميعها ما أمر الله به، فكيف بالحديد الذي يلين لما يراد منه؟ قال النبي عليه السلام:\n\n \" مثل ما بعثني الله به من الهدى والعلم كمثل الغيث الكثير، أصاب أرضاً فكانت طائفة منها طيبة قبلت الماء وأنبتت الكلأ والعشب الكثير، وكانت منها طائفة أخاذات أمسكت الماء، فنفع الله بها الناس فشربوا وسقوا وزرعوا، وأصاب منها طائفة أخرى إنما هي قيعان لا تمسك ماء ولا تنبت كلأ\n فذلك مثل من فقه في الدين فعلم وعلّم، ومثل من لم يرفع بذلك رأساً ولم يقبل هدى الله الذي أرسلت به \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ قَسَتْ } بالقساوة الأصلية { قُلُوبُكُمْ } المتكبرة المتحجرة الصلبة البليدة { مِّن بَعْدِ ذٰلِكَ } الإحياء الملين للقلوب الخائفة الوجلة عن خشية الله، وإذا لم تلن قلوبكم ولم يؤثر فيها { فَهِيَ } في الصلابة والقساوة { كَٱلْحِجَارَةِ } التي لا تقبل النقر والأثر أصلاً { أَوْ أَشَدُّ قَسْوَةً } أي: بل قلوبكم أشد صلابة من الحجارة، فإن من الحجارة ما يتأثر بالخير وقلوبك لا تتأثر أصلاً { وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلأَنْهَارُ } ويتأثر منها، وقلوبكم لا تتأثر بأنهار المعارف المتشعبة عن بحر الذات الجارية على جداول ألسنة الأنبياء صلوات الله عليهم { وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ } يتأثر بالشقوق في نفسها بتخليل بحر الدهور ومن مؤثر خارجي وإذا تشقق { فَيَخْرُجُ مِنْهُ ٱلْمَآءُ } ويدخل فيه الماء، وقلوبكم لا تتأثر لا بنفسها ولا بالمؤثر الخارجي { وَإِنَّ مِنْهَا لَمَا يَهْبِطُ } ينزل من أعلى الجبل { مِنْ خَشْيَةِ ٱللَّهِ } الناشئة عن ظهور الآيات مثل المطر الهاطل والريح العاصف والزلزلة القالعة وغير ذلك من الآيات الظاهرة في الآفاق، لا تتأثر بالآيات الباهرة النازلة عليكم ترغيباً وترهيباً\n\n\n\n\nهذا تقريع وتوبيخ لهم على أبلغ وجه وآكده، وحث على المؤمنين وتحذير لهم من ربكم أمثالها بأنهم مع قابليتهم على التأثر لا يقبلون الأثر النافع لهم في الدارين، والحجارة مع صلابتها وعدم قابليتها تتأثر فهم أسوأ حالاً وأشد قساوة وصلابة منها، ومع ذلك يخادعون الله في الأمر بالستر والإخفاء، ويظنون غفلته { وَمَا ٱللَّهُ } المظهر لهم، المحيط بجميع مخايلهم وحيلهم { بِغَافِلٍ عَمَّا تَعْمَلُونَ } [البقرة: 74] ولو طرفة ولمحة وخطرة\n\n\n\n\nثم لما ذكر سبحانه امتنانه على بني إسرائيل وإنعامه إياهم بأنواع النعم، وذكر أيضاً ظلمهم وعداونهم وكفرانهم نعمه، أراد أن ينبه على المؤمنين المحمديين المتمنين إيمان اليهود وانقيادهم على رسول الله صلى الله عليه وسلم ومؤاخاتهم مع المؤمنين بأن متمناكم وملتمسكم محال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: القسوة والقساوة: هي الصلابة واليبوسة، كالشقوة والشقاوة، يقال حجر قاس، أي: يابس\n قال الشاعر:\n\nو { أو } للإضراب، أو بمعنى الواو، أو للتنويع، فبعضها كالحجارة وبعضها أشد\n يقول الحقّ جلّ جلاله: { ثُمَّ قَسَتْ قُلُوبُكُم } يا معشر اليهود، ويبست فلم تلن ولم تخضع، مع ما رأت من الآيات كانفجار الحجر بالماء في التيه، وإنزال المنّ والسلوى، وتظليل الغمام، وإحياء الميت وغير ذلك\n قال الكلبي: أنكروا بعد ما رأوا ذلك، وقالوا: ما قتلنا، فما كانوا قد أعمى قلباً، ولا أشد تكذيباً منهم لنبيهم عند ذلك فقلوبهم كالحجارة، بل أشد، أو إن شَبَّهْتم قلوبهم بالحجارة أصبتم، وبما هو أشد أصبتم، بل في الحجارة فضل عليها في اللين، فإن منها ما تتفجر { مِنْهُ الأنْهَارُ } الكبار، ومنها ما تشقق { فَيَخْرُجُ مِنْهُ } العيون الجارية، ومنها ما تهبط من رأس الجبل { مِنْ خَشْيَةِ اللَّهِ }\n وفي بعض الأخبار: \" كل حجر تَرَدَّى من رَأسِ جبلٍ فهو من خشية الله \" ، وقلوبكم يا معشر اليهود لا تلين ولا تخشع ولا تأتي بخير، نسأل الله السلامة بمنَّه وكرمه\n الإشارة: كل مَن أساء الأدب مع أستاذه، أو خرج عن دائرته إلى غيره، قسا قلبه، وذهب حاله ولُبه، فإن رجع قريباً واستدرك ما فات، لان قلبه ونهض حاله، وإلا وقع في مهاوي القطيعة، ولم يأت منه شيء، وللقلب القاسي علامات: منها جمود العين، وطول الأمل، وعدم الحزن على ما فاته من الطاعات وما صدر منه من السيئات، وعدم الفرح بما يصدر منه من الطاعات، فإن المؤمن تسره حسناته وتسيئه سيئاته، ودواؤه: صحبة الفقراء الذاكرين الخاشعين، والجلوس بين يدي العارفين الكاملين، وتعاهد الصيام، والصلاة بالليل والناس نيام، والتضرّع إلى الحيّ القيوم الذي لا ينام، وللشافعي رضي الله الله عنه:\n\nقوله تعالى:\n\n[البَقَرَة: 74] كذلك القلوب القاسية إذا لانت بالإنابة إلى ربها، والرجوع عن مألوفاتها، تتفجر منها أنهار العلوم، وتشقق منها أسرار الحِكَم، ومنها من تذوب من هيبة المتجلي لها، فتندك جبالها، وتزلزل أرض نفوسها، كما قال القائل:\n",
      "translations": []
    }
  ]
}