{
  "chapter": "البقرة",
  "text": "واذا لقوا۟ الذين ءامنوا۟ قالوا۟ ءامنا واذا خلا بعضهم الى بعض قالوا۟ اتحدثونهم بما فتح الله عليكم ليحاجوكم به عند ربكم افلا تعقلون",
  "translations": [
    {
      "translation": "For when they meet the faithful, they say: \"We believe;\" but when among themselves, they say: \"Why do you tell them what the Lord has revealed to you? They will only dispute it in the presence of your Lord. Have you no sense indeed?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe in Muhammad, they say, \"We also believe in him.\" But when they meet one another in private, they say, \"Have you got no sense that you disclose to them those things which Allah has revealed to you so that they might bring them as a proof against you before your Lord?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On meeting the believers, they would declare belief but to each other they would say, \"How would you (against your own interests) tell them (believers) about what God has revealed to you (in the Bible of the truthfulness of the Prophet Muhammad)? They will present it as evidence to prove you wrong before your Lord. Do you not realize it?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet the believers, they say, “We believe”; but when they are in isolation with one another they say, “You clarify to the believers from what Allah has disclosed to you, so that they may evidence it against you before your Lord? So have you no sense?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they (Jews) meet those who believe (Muslims), they say, \"We believe,\" but when they meet one another in private, they say, \"Shall you (Jews) tell them (Muslims) what Allah has revealed to you that they (Muslims) may argue with you (Jews) about it before your Lord\" Have you (Jews) then no understanding\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe they say: We believe, and when they are alone one with another they say: Do you talk to them of what Allah has disclosed to you that they may contend with you by this before your Lord? Do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say 'We believe'; and when they go privily one to another, they say, 'Do you speak to them of what God has revealed to you, that they may thereby dispute with you before your Lord? Have you no understanding?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they fall in with those who believe, they say: We believe. But when they go apart one with another they say: Prate ye to them of that which Allah hath disclosed to you that they may contend with you before your Lord concerning it? Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet the faithful, they say, \"We are believers.\" But when alone, they say to each other, \"Must you tell them what God has revealed to us? They will only use it to argue against you before your Lord! Have you no sense?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe they say: we believe; and when some of them are alone with some others they say speak ye unto them of that which God hath opened unto you so that they may argue therewith against you before your Lord? understand then ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet the faithful, they say, ‘We believe,’ and when they are alone with one another, they say, ‘Do you recount to them what Allah has revealed to you, so that they may argue with you therewith before your Lord? Do you not exercise your reason?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! when they meet the men of Faith, they say: \"We believe\": But when they meet each other in private, they say: \"Shall you tell them what Allah hath revealed to you, that they may engage you in argument about it before your Lord?\"- Do ye not understand (their aim)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they (Jews) meet those who believe (Muslims), they say, \"We believe\", but when they meet one another in private, they say, \"Shall you (Jews) tell them (Muslims) what Allah has revealed to you [Jews, about the description and the qualities of Prophet Muhammad Peace be upon him, that which are written in the Taurat (Torah)], that they (Muslims) may argue with you (Jews) about it before your Lord?\" Have you (Jews) then no understanding?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they meet those who believe, they say: 'We are believers' But when alone, they say to their other (chiefs). 'Do you tell to them what Allah has revealed to you so that they will dispute with you concerning it with your Lord? Have you no sense'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they come across those who believe, they say, “We believe,” but when they come together privately, they say, “Will you inform them of what God has disclosed to you, so that they might dispute with you concerning it before your Lord?” Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they meet those who believe, they say, \"We have believed\"; but when they are alone with one another, they say, \"Do you talk to them about what Allah has revealed to you so they can argue with you about it before your Lord?\" Then will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:76] And when they, the hypocrites from among the Jews, meet those who believe, they say, ‘We believe’, that Muhammad (s) is a prophet and that he is the one of whom we have been given good tidings in our Book; but when they go in private one to another, they, their leaders the ones not involved in the hypocrisy, say, to those hypocrites: ‘Do you speak to them, the believers, of what God has disclosed to you, that is, what He has made known to you of Muhammad’s (s) description in the Torah, so that they may thereby dispute (the lām of li-yuhājjūkum, ‘that they may dispute with you’, is the lām of ‘becoming’) with you before your Lord?, in the Hereafter and hold the proof against you for not following him [Muhammad (s)], despite your knowledge of his sincerity? Have you no understanding?’ of the fact that they will contend with you if you speak to them in this way? So beware.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the hypocrites of the people of the Book, and it is also said that the reference here is to the lowly from among the people of the Book, saying: (And when they fall with those who believe) Abu Bakr and his companions, (they say: We believe) in your Prophet, and his description and traits are mentioned in our Book. (But when they go apart one with another) when these lowly people return to their 13 leaders (they say) the leaders say to the lowly: (Prate ye to them) i.e. Muhammad and his Companions (of that which Allah hath disclosed to you) about that which Allah has shown you regarding the description and traits of Muhammad in your Book (so that they may contend with you) argue against you (before your Lord concerning it? Have ye then no sense?) do you not have any common sense?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { قَالُوۤاْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ بما مَنَّ الله عليكم؛ فيحتجوا عليكم بهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } منهم من آمن وصدق ظاهراً لمصلحة دنيوية وهو على خباثته الأصلية ودنائته الجبلية، بل أخبث منها بحيث { إِذَا لَقُواْ ٱلَّذِينَ آمَنُواْ } وأخلصوا في إيمانهم { قَالُوۤاْ آمَنَّا } برسولكم الذي هو الرسول الموعود في التوراة يقيناً، وصدقنا جمع ما جاء به من عند ربه { وَإِذَا خَلاَ بَعْضُهُمْ إِلَىٰ بَعْضٍ } أي: المنافقين مع المصرين { قَالُوۤاْ } أي: كل من الفريقين للآخر عند المشاورة وبث الشكوى: أترون أمر هذا الرجل كيف يعلو ويرتقي وما هو إلا النبي المؤيد الموعود في كتابنا؟ أي شيء تعلمون يا معاشر اليهود؟ { أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ } في كتابكم من وصفه { لِيُحَآجُّوكُم بِهِ } ويغلبوا عليكم ويتقربوا { عِنْدَ رَبِّكُمْ } فالعار كل العار، أم تحرفون الكتاب ولا تسلمونه غيرة وحمية؟ { أَفَلاَ تَعْقِلُونَ } [البقرة: 76] تتفكرون وتتأملون أيها المتيدنون بدين الآباء في أمر هذا الرجل؟ هكذا جرى حالتهم دائماً بأن قالوا بأمثال هذه الهذيانات إلى أن تتفرقوا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}