{
  "chapter": "البقرة",
  "text": "ومنهم اميون لا يعلمون الكتب الا امانى وان هم الا يظنون",
  "translations": [
    {
      "translation": "Among them are heathens who know nothing of the Book but only what they wish to believe, and are only lost in fantasies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there are among them some un-lettered people who have no knowledge of the Book but depend upon empty hopes and are guided by mere conjecture and guess-work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them are illiterate and have no knowledge of the Book except for what they know from legends and fantasy. They are only relying on conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are the unlearned that do not know anything of the Book except to recite something therefrom or parts of their own fabrications; they are in absolute illusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are among them (Jews) `Ummyyun (unlettered) people, who know not the Book, but they trust upon Amani (false desires) and they but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are among them illiterates who know not the Book but only lies, and they do but conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some there are of them that are common folk not knowing the Book, but only fancies and mere conjectures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are unlettered folk who know the Scripture not except from hearsay. They but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are among them unlettered people who have no real knowledge of the Scriptures, knowing only their own wishful thinking and following only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are unlettered ones who know not the Book but vain desires; and they do but conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are the illiterate who know nothing of the Book except hearsay, and they only make conjectures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are among them illiterates, who know not the Book, but (see therein their own) desires, and they do nothing but conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are among them (Jews) unlettered people, who know not the Book, but they trust upon false desires and they but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them are common (people) and do not know the Book, but only wishful thoughts, and they are only doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are uneducated who know the Scripture only through hearsay, and they only speculate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are unlettered ones who do not know the Scripture except in wishful thinking, but they are only assuming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:78] And there are some of them, the Jews, that are illiterate, unlettered, not knowing the Scripture, the Torah, but only desires, lies which were handed down to them by their leaders and which they relied upon; and, in their rejection of the prophethood of the Prophet and fabrications of other matters, they have, mere conjectures, and no firm knowledge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Among them are unlettered folk who know not the scripture) they do not know how to read or write it (except from hearsay) except the unfounded things they hear. (They but guess) their talk is all surmise based on what they heard from their leaders.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَمِنْهُمْ أُمِّيُّونَ لاَ يَعْلَمُونَ ٱلْكِتَابَ إِلاَّ أَمَانِيَّ } قالَ زيدُ بن علي عليهما السلام: معناهُ إِنَّما هُم أَمثالُ البَهائِمِ لا يَعْلَمونُ شَيئاً إِلاَّ أَنْ يَتَمنوا على الله تعالى الباطلَ، وما لَيسَ لَهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذا حال علمائهم وأحبارهم { وَمِنْهُمْ أُمِّيُّونَ لاَ يَعْلَمُونَ } لا يعقلون ولا يفهمون { ٱلْكِتَابَ } والإنزال والإرسال والدين والإيمان وجميع التكاليف الشرعية؛ لعدم ذكائهم وتفظنهم في الأمور الدينية الاعتقادية، بل ما يأخذونه { إِلاَّ أَمَانِيَّ } كسائر الأماني الدنيوية؛ تقليداً لرؤسائهم ورهبانهم { وَإِنْ هُمْ } ما هم في أنفسهم من الممترين في المعتقدات { إِلاَّ } أنهم { يَظُنُّونَ } [البقرة: 78] ظناً بليغاً في تمييز علمائهم المحرفين للكتاب، وبسبب هذا الظن لم يؤمنوا نبينا صلى الله عليه وسلم، ولما صار المحرفون ضالين في أنفسهم مضلين لغيرهم، استحقوا أشد العذاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}