{
  "chapter": "البقرة",
  "text": "فويل للذين يكتبون الكتب بايديهم ثم يقولون هذا من عند الله ليشتروا۟ به ثمنا قليلا فويل لهم مما كتبت ايديهم وويل لهم مما يكسبون",
  "translations": [
    {
      "translation": "But woe to them who fake the Scriptures and say: \"This is from God,\" so that they might earn some profit thereby; and woe to them for what they fake, and woe to them for what they earn from it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to their learned people, who write the law with their own hands and then say to the people, \"This is from Allah,\" so that they might gain some paltry worldly end. (They do not see that) this writing of their hands will bring woe to them and what they gain thereby will lead to their ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to those who write the Book themselves and say, \"This is from God,\" so that they may sell it for a small price! Woe unto them for what they have done and for what they have gained!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore woe is to those who write the Book with their hands; and they then claim, “This is from Allah” in order to gain an abject (worldly) price for it; therefore woe to them for what their hands have written, and woe to them for what they earn with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then woe to those who write the book with their own hands and then say, \"This is from Allah,\" to purchase with it a little price! Woe to them for what their hands have written and woe to them for that they earn thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, then, to those who write the book with their hands and then say: This is from Allah, so that they may take for it a small price; therefore woe to them for what their hands have written and woe to them for what they earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to those who write the Book with their hands, then say, 'This is from God,' that they may sell it for a little price; so woe to them for what their hands have written, and woe to them for their earnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore woe be unto those who write the Scripture with their hands and then say, \"This is from Allah,\" that they may purchase a small gain therewith. Woe unto them for that their hands have written, and woe unto them for that they earn thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to those who write the scripture with their own hands, and then declare, \"This is from God,\" in order to sell it for a paltry price. Woe to them because of what their own hands have written, and woe to them for what they have earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe then unto those who write out the Book with their hands and say thereafter: this is from God, that they may barter it for a small price. Woe then unto them for that which thei hands had written; and woe unto them for that which they earn therwith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to them who write the Book with their hands and then say, ‘This is from Allah,’ that they may sell it for a paltry gain. So woe to them for what their hands have written, and woe to them for what they earn!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then woe to those who write the Book with their own hands, and then say:\"This is from Allah,\" to traffic with it for miserable price!- Woe to them for what their hands do write, and for the gain they make thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then woe to those who write the Book with their own hands and then say, \"This is from Allah,\" to purchase with it a little price! Woe to them for what their hands have written and woe to them for that they earn thereby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to those who write the Book with their own hands and then say: 'This is from Allah' in order to gain a small price for it. So woe to them for what their hands have written, and woe to them for their earnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to those who write the Scripture with their own hands, and then say, “This is from God,” that they may exchange it for a little price. Woe to them for what their hands have written, and woe to them for what they earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to those who write the \"scripture\" with their own hands, then say, \"This is from Allah,\" in order to exchange it for a small price. Woe to them for what their hands have written and woe to them for what they earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:79] So woe, a severe chastisement, to those who write the Scripture with their hands, that is, fabricating it themselves, then say, ‘This is from God’ that they may sell it for a small price, of this world: these are the Jews, the ones that altered the description of the Prophet in the Torah, as well as the ‘stoning’ verse, and other details, and rewrote them in a way different from that in which they were revealed. So woe to them for what their hands have written, of fabrications, and woe to them for their earnings, by way of bribery (rishan, plural of rishwa).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore woe) severe punishment, and it is said this means: a valley in hell (be unto those who write the Scripture with their hands) change the description and traits of Muhammad (pbuh) in the Book (and then say, \"This is) in the Book that has come (from Allah\", that they may purchase) through changing and altering it (a small gain therewith) a small gain in terms of means of subsistence and surplus of property. (Woe unto them) theirs is a severe punishment (for what their hands have written) have altered (and woe unto them) and theirs is a severe punishment (for what they earn thereby) of unlawful earnings and bribes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَابَ بِأَيْدِيهِمْ } قالَ زيدُ بن علي عليهما السلامُ: فالوَيلُ وادٍ في جهنمَ مِنْ قَيحٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَوَيْلٌ } حرمان عن لذة الوصول بعدما قرب الحصول أو طرد، وتبعيد عن ذروة الوجوب إلى حضيض الإنكار، أو عود وترجيع لهم في الحرية إلى الرقية الأبدية في النشأة الأخرى { لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَابَ بِأَيْدِيهِمْ } بعد تحريفهم بآرائهم السخيفة { ثُمَّ يَقُولُونَ } لسلفتهم وجهلتهم ترويجاً للمحرف { هَـٰذَا } ما نزل { مِنْ عِنْدِ ٱللَّهِ } وإنما قالوا ذلك { لِيَشْتَرُواْ بِهِ } نبسبته إلى { ثَمَناً قَلِيلاً } على وجه التحف والهدايا من الضعفاء الذين يظنونهم عقلاء أمناء في أمور الدين كما يفعل مشايخ زماننا، أنصفهم الله مع من يتردد إليهم من عوام المؤمنين\n\n\n\n\nثم لما كانت الويل عبارة عن نهاية مراتب القهر والجلال، وغاية البعد عن مراتب اللطف والجمال كرره مراراً وفصله تحذيراً للخائنين المستوحشين عن طرده وإبعاده فقال: { فَوَيْلٌ لَّهُمْ مِّمَّا كَتَبَتْ أَيْدِيهِمْ } من المحرفات الباطلة { وَوَيْلٌ لَّهُمْ مِّمَّا يَكْسِبُونَ } [البقرة: 79] من القبوحات والمعاملات الخبيثة\n\n\n\n\nومن جملة هذياناتهم مع ضعفائهم أنهم لما ظهر فيما بينهم واشتهر ما نزل في التوراة: إن الذين اتخذوا العجل ألهاً يدخلون النار، اضطرب الضعفاء من هذا الكلام، وضاق المحرفون من اضطرابهم أن يميلوا إلى الإسلام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ويل }: كلمة يستعملها كل واقع في هلكة، وأصلها العذاب والهلكة، وهو في الأصل مصدر لا فعل له، وسوغ الابتداء به الدعاء، وقال أبو سعيد الخدري عن النبيّ صلى الله عليه وسلم:\n\n \" الويلُ وادٍ في جَهنَّم \" \n\n[لو سيرت فيه جبال الدنيا لانماعت]\n يقول الحقّ جلّ جلاله: { فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ } تحريفاً لكتاب الله، { وَيقُولُونَ هَذَا مِنْ عند الله } خوفاً من أن تزول رئاستهم، وينقطع عنهم ما كانوا يأخذونه من سفلتهم، نزلت في أحبار اليهود لما قدم النبيّ صلى الله عليه وسلم المدينة، خافوا أن تزول رئاستهم، فاحتالوا في تعويق اليهود عن الإسلام، وكانت صفة النبي صلى الله عليه وسلم \" حسن الوجه، حسن الشعر، أكحل العينين، ربعة \" ، فغيروها، وكتبوا: طوالاً، أزرق، سبط الشعر، { فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ } ، ويأخذون من سفلتهم، فهو وإن كان كثيراً في الحسن فهو، بالنسبة إلى ما استوجبوه من العذاب الأليم، قليل\n الإشارة: ينزجر بهذه الآية صنفان: أحدهما: علماء الأحكام، إذا أفتوا بغير المشهور، رغبة فيما يقبضون على الفتوى من الحطام الفاني، وكذلك القضاة إذا حكموا بالهوى، رغبة فيما يقبضون من الرشا، أو يحصلونه من الجاه، { فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ } الثاني: أهل الرئاسة والجاه من أولاد الصالحين وغيرهم، فإنهم إذا رأوا أحداً قام بولاية أو نسة خافوا على زوال رئاستهم، فيحتالون على الناس بالتعويق عن الدخول في طريقته، فيكتبون في ذلك سفسطات وترهات، يُنفِّرون الناس عن اتباع الحق،\n",
      "translations": []
    }
  ]
}