{
  "chapter": "البقرة",
  "text": "ومن الناس من يقول ءامنا بالله وباليوم الءاخر وما هم بمؤمنين",
  "translations": [
    {
      "translation": "And there are some who, though they say: \"We believe in God and the Last Day,\" (in reality) do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there are some who say, \"We believe in Allah and the Last Day\", whereas they do not believe at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some people say, \"We believe in God and the Day of Judgment,\" but they are not true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the people are some* that say, “We believe in Allah and the Last Day**” whereas they are not believers! (* The hypocrites ** the Day of Resurrection)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind, there are some who say: \"We believe in Allah and the Last Day\" while in fact they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are some people who say: We believe in Allah and the last day; and they are not at all believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some men there are who say, 'We believe in God and the Last Day'; but they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who say: We believe in Allah and the Last Day, when they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some who say, \"We believe in God and the Last Day,\" yet they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind are some who say: we believe in Allah and in the Last Day: whereas they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who say, ‘We have faith in Allah and the Last Day,’ but they have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the people there are some who say: \"We believe in Allah and the Last Day;\" but they do not (really) believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of mankind, there are some (hypocrites) who say: \"We believe in Allah and the Last Day\" while in fact they believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some people who say: 'We believe in Allah and the Last Day,'yet they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the people are those who say, “We believe in God and in the Last Day,” but they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:8] The following was revealed concerning the hypocrites: and some people there are who say, ‘We believe in God and the Last Day’, that is, in the Day of Resurrection because it is the very last day; but they are not believers (the [plural] import of man [in man yaqūl, ‘who says’] is taken into account here, as expressed by a pronoun [hum] that expresses this [plural] meaning).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of mankind are some who say: We believe in Allah), i.e. in the open and we are genuine in our belief, (and the last Day) and we believe in resurrection after death whereupon our deeds shall be requited, (when they believe not) i.e. secretly nor are they genuine in their belief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { ومن الناس من يقول آمنا } هم الفريق الثاني من الأشقياء، سُلِبَ عنهم الإيمان مع ادّعائهم له بقولهم { آمنا بالله } لأنّ محلّ الإيمان هو القلب لا اللسان\n\n\n[الحجرات، الآية: 14]\n ومعنى قولهم: { آمنا بالله وباليوم الآخرِ } ادّعاء على التوحيد والمعاد اللذين هما أصل الدين- وأساسه أي لسنا من المشركين المحجوبين عن الحق ولا من أهل الكتاب المحجوزين عن الدين والمعاد، لأن اعتقاد أهل الكتاب في باب المعاد ليس مطابقاً للحق\n واعلم أن الكفر هو الاحتجاب، والحجاب إما عن الحق كما للمشركين وإمّا عن الدين كما لأهل الكتاب، والمحجوب عن الحق محجوب عن الدين الذي هو طريق الوصول إليه ضرورة، وأما المحجوب عن الدين فقد لا يحجب عن الحق، فهؤلاء ادّعوا رفع الحجابين معاً فكذبوا بسلب الإيمان عن ذواتهم، أي ليسوا بمؤمنين ما داموا إياهم يخادعون\n والمخادعة استعمال الخدع من الجانبين، وهو إظهار الخير واستبطان الشرّ\n ومخادعة الله مخادعة رسوله صلى الله عليه وسلم لقوله:\n\n[النساء، الآية: 80]، وقوله تعالى:\n\n[الأنفال، الآية: 17] ولأنه حبيبه\n وقد ورد في الحديث:\n\n \" لا يزال العبد يتقرّب إليّ بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي به يسمع، وبصره الذي به يبصر، ولسانه الذي به يتكلم، ويده التي بها يبطش، ورجله التي بها يمشي \" \n\nفخداعهم لله وللمؤمنين إظهار الإيمان والمحبة، واستبطان الكفر والعداوة، وخداع الله والمؤمنين إياهم مسالمتهم وإجراء أحكام الإسلام عليهم بحقن الدماء وحصن الأموال وغير ذلك، وادّخار العذاب الأليم والمآل الوخيم، وسوء المغبة لهم وخزيهم في الدنيا لافتضاحهم بإخباره تعالى وبالوحي عن حالهم لكن الفرق بين الخداعين أنّ خداعهم لا ينجح إلا في أنفسهم بإهلاكها وتحسيرها وإيراثها الوبال والنكال بازدياد الظلمة والكفر والنفاق واجتماع أسباب الهلكة والبعد والشقاء عليها، وخداع الله يؤثر فيهم أبلغ تأثير ويوبقهم أشدّ إيباق، كقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلنَّاسِ } الذين نسوا العهود السابقة التي عهدوا في الفطرة الأصلية { مَن يَقُولُ } قولاً لا يوافق اعتقادهم، وهو أنهم يقولون تلبيساً ونفاقاً: { آمَنَّا } أذعنا { بِٱللَّهِ } أي: الذي أنزل علينا الكتاب وإنك الرسول { وَ } وأيقنا { بِٱلْيَوْمِ ٱلآخِرِ } الموعود بجزاء الأعمال { وَ } الحال أنهم { مَا هُم بِمُؤْمِنِينَ } [البقرة: 8] موقنين بهما في بواطنهم، بل غرضهم من هذا التلبيس في زعمهم الفاسد أنهم:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من } موصوفة مبتدأ، والخبر مقدم، أي: ومن الناس ناس يقولون كذا، والمخادعة: إظهار خلاف ما يخفي من المكروه، وأصل الخدع: الإخفاء، ومنه المخدع للبيت الذي يخبأ فيه المتاع",
      "translations": []
    }
  ]
}