{
  "chapter": "البقرة",
  "text": "وقالوا۟ لن تمسنا النار الا اياما معدودة قل اتخذتم عند الله عهدا فلن يخلف الله عهده ام تقولون على الله ما لا تعلمون",
  "translations": [
    {
      "translation": "Yet they say: \"The Fire will not touch us for more than a few days.\" Say.. \"Have you so received a promise from God?\" \"Then surely God will not withdraw His pledge. Or do you impute things to God of which you have no knowledge at all?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say, \"The fire of Hell is not going to touch us, and even if it does at all, it will be only for a few days\". Say, \"Have you obtained a promise from Allah which He would not break? Or, do you attribute to Allah things you do not know? Why will not the fire of Hell touch you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"Hell fire will never harm us except for just a few days.\" (Muhammad), ask them, \"Have you made such agreements with God Who never breaks any of His agreements or you just ascribe to Him that which you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “The fire will not touch us except for a certain number of days”; say, “Have you taken a covenant from Allah – then Allah will certainly not break His covenant – or do you say something concerning Allah what you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews) say, \"The Fire shall not touch us but for a few numbered days.\" Say (O Muhammad to them): \"Have you taken a covenant from Allah, so that Allah will not break His covenant Or is it that you say of Allah what you know not\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Fire shall not touch us but for a few days. Say: Have you received a promise from Allah, then Allah will not fail to perform His promise, or do you speak against Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'The Fire shall not touch us save a number of days.' Say: 'Have you taken with God a covenant? God will not fail in His covenant; or say you things against God of which you know nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: The Fire (of punishment) will not touch us save for a certain number of days. Say: Have ye received a covenant from Allah - truly Allah will not break His covenant - or tell ye concerning Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"The Fire is not going to touch us, and [even if it does], it will only be for a few days!\" Say [to them], \"Have you received a promise from God, for God never breaks His promise, or do you attribute something to God which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Fire shall touch us not save for a few numbered days. Say thou: have ye taken a covenant with Allah, so that Allah shall not fail His covenant? or fabricate ye against Allah that which ye know not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘The Fire shall not touch us except for a number of days.’ Say, ‘Have you taken a promise from Allah? If so, Allah will never break His promise. Do you ascribe to Allah what you do not know?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"The Fire shall not touch us but for a few numbered days:\" Say: \"Have ye taken a promise from Allah, for He never breaks His promise? or is it that ye say of Allah what ye do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (Jews) say, \"The Fire (i.e. Hell-fire on the Day of Resurrection) shall not touch us but for a few numbered days.\" Say (O Muhammad Peace be upon him to them): \"Have you taken a covenant from Allah, so that Allah will not break His Covenant? Or is it that you say of Allah what you know not?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'The Fire will never touch us except for a number of days' Say: 'Did Allah make you such a promise for Allah never breaks His promise or do you say about Allah what you do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “The Fire will not touch us except for a number of days.” Say, “Have you received a promise from God—God never breaks His promise—or are you saying about God what you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Never will the Fire touch us, except for a few days.\" Say, \"Have you taken a covenant with Allah? For Allah will never break His covenant. Or do you say about Allah that which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:80] And they say, when the Prophet promised them the Fire, ‘the Fire shall not touch us, that is, afflict us, save a number of days’, only a short time of forty days: the same length of time their forefathers worshipped the calf, after which time it [the Fire] will cease. Say, to them Muhammad (s): ‘Have you taken with God a covenant?, a pledge from Him to this? God will not fail in His covenant, in this matter, or — nay — say you against God what you do not know? (a’ttakhadhtum: the conjunctive hamza has been omitted on account of the interrogative hamza sufficing).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the Jews: (Hellfire will not touch us save for a certain number of days) only for 40 days, the number of days in which our forefathers worshipped the calf. (Say) Muhammad: (Have ye received a covenant from Allah) for what you are saying-(truly Allah will not break His covenant) if indeed you have a covenant with Allah-(or tell ye) or do you indeed tell (concerning Allah that which ye know not?) that which you know does not exist in your Book?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَقَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلاَّ أَيَّاماً مَّعْدُودَةً } معناهُ أربعونَ يوماً، قَدْرَ ما عَبَدوا العِجلَ\n\n\n\n\nوقولهُ تعالى: { قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْداً } مَعناهُ وعدٌ وميثاقٌ\n والجمعُ: العهودُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالُواْ } لهم تسكيناً وتسلية: لا تخافوا ولا تضطربوا { لَن تَمَسَّنَا ٱلنَّارُ إِلاَّ أَيَّاماً } قلائل { مَّعْدُودَةً } أربعين يوماً مقدار زمان عبادة العجل وأقل من ذلك { قُلْ } لهم يا أكمل الرسل توبيخاً وتقريعاً: أأنتم { أَتَّخَذْتُمْ } وأخذتم { عِندَ ٱللَّهِ عَهْداً } بألاَّ يمسكم النار إلا أياماً معدودة { فَلَنْ يُخْلِفَ ٱللَّهُ عَهْدَهُ } إن ثبت، فنحن أيضاً من المصدقين المؤمنين { أَمْ تَقُولُونَ عَلَى ٱللَّهِ } افتراء { مَا لاَ تَعْلَمُونَ } [البقرة: 80] ثبوته عنده فيجازيكم بما افتريتم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}