{
  "chapter": "البقرة",
  "text": "بلى من كسب سيئة واحطت به خطيـته فاو۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "Why, they who have earned the wages of sin and are enclosed in error, are people of Hell, where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever earns evil and becomes engrossed in sin shall be doomed to Hell and abide therein for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no doubt that evil doers who are engulfed in sins are the companions of hell fire wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, why not?* The one who earns evil and his sin surrounds him; he is from the people of fire (hell); they will remain in it forever. (You will remain in the fire forever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes! Whosoever earns evil and his sin has surrounded him, they are dwellers of the Fire (i.e. Hell); they will dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! whoever earns evil and his sins beset him on every side, these are the inmates of the fire; in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not so; whoso earns evil, and is encompassed by his transgression -- those are the inhabitants of the Fire; there they shall dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but whosoever hath done evil and his sin surroundeth him; such are rightful owners of the Fire; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, those who do evil and are encompassed by their misdeeds, shall be the inmates of the Fire. Therein they shall abide forever,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Yea! whosoever earnoth vice and his sin hath encompassed him, those shall be the fellows of the Fire, as abiders therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly whoever commits misdeeds and is besieged by his iniquity—such shall be the inmates of the Fire, and they will remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, those who seek gain in evil, and are girt round by their sins,- they are companions of the Fire: Therein shall they abide (For ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes! Whosoever earns evil and his sin has surrounded him, they are dwellers of the Fire (i.e. Hell); they will dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, he who earns evil and becomes engrossed in his sin, they are the people of the Fire; in it they shall remain for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, whoever commits misdeeds, and becomes besieged by his iniquities—these are the inmates of the Fire, wherein they will dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, whoever earns evil and his sin has encompassed him - those are the companions of the Fire; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:81] Not so, it will touch you and you will abide therein; whoever earns evil, through associating another with God, and is encompassed by his transgression, in the singular and the plural, that is to say, it overcomes him and encircles him totally, for, he has died an idolater — those are the inhabitants of the Fire, therein abiding (khālidūn: this [plural noun] takes account of the [plural] import of man, ‘whoever’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay) here Allah answers the Jews, (but whoever hath done evil) ascribes partners to Allah (and his sins surround him) and dies ascribing partners to Allah; (such are) those who have these attributes (rightful owners of the Fire) the dwellers of hell; (they will abide therein forever) perpetually, they will neither die nor leave it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيـۤئَتُهُ } معناهُ مَنْ ماتَ بذنبِهِ ولم يَتبْ منهُ\n ويقالُ السّيئةُ: الشِّركُ\n والخَطِيئةُ: الكَبائرُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلَىٰ } أي: بلى الأمر الحق المحقق الكلي الثابت عهده وجرى عليه سنته أن { مَن كَسَبَ سَيِّئَةً } مشغلة مبعدة عن الحق { وَ } مع ذلك { أَحَاطَتْ } شملت واحتوت { بِهِ خَطِيـۤئَتُهُ } خطاياه كلها إلى سيئة مبعدة { فَأُوْلَـۤئِكَ } البعداء عن طريق الحق { أَصْحَابُ ٱلنَّارِ } نار البعد والخذلان لا ينجون ولا يخرجون منها أصلاً بل { هُمْ فِيهَا خَالِدُونَ } [البقرة: 81] دائمون لها ما شاء الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بلى }: حرف جواب كنعم، والفرق بينهما أن { بلى } لا يقع إلا في جواب النفي ويصير إثباتاً، تقول: ألم يأت زيد؟ فتقول: بلى\n أي: أتى، ومثله: { قالوا لن تمسنا النار } فقال تعالى: { بلى } أي تمسكم، بخلاف نعم فإنها لتقرير ما قبلها نفياً أو إثباتاً، فإذا قيل: ألم يأت زيد؟ فقلت: نعم، أي لم يأت، وإذا قيل: هل أتى زيد فقلت: نعم، أي أتى\nوقد نظم ذلك بعضهم فقال:\n\nيقول الحقّ جلّ جلاله: { وَقَالُوا } أي: بنو إسرائيل في أمانيهم الباطلة: { لَن تَمَسَّنَا النَّارُ إلاَّ أَيَّاماً مَّعْدُودَةً } أربعين يوماً مقدار عبادة العجل، ثم يخلفنا فيها المسلمون\n قال الحقّ جلّ جلاله: { قُلْ } لهم يا محمد: { أَتَّخَذْتُمْ } بذلك عهداً عند الله { فَلَن يُخْلِفَ اللّهُ عَهْدَهُ أَمْ تَقُولُونَ عَلَى اللّهِ مَا لا تَعْلَمُونَ } - { بَلَى } تمسكم النار وتخلدون فيها لأن { مَن كَسَبَ سَيِّئَةً } أي: كفراً ومات عليه، { وَأَحَاطَتْ بِهِ خَطِيئَتُهُ } أي: أحدقت به، واستولت عليه، { فأوْلَئِكَ أَصْحَابَ النَّارِ هُمْ فِيهَا خَالِدُونَ } - { والذين آمنوا } بما نزل على محمد صلى الله عليه وسلم { وعلموا } بشريعته المطهرة الأعمال { الصالحات }  { أُوْلَئِكَ أَصْحَابُ الجنة هُمْ فِيهَا خَالدُونَ } هذه عادته تعالى إذا ذكر فريقاً شفع بضده ترغيباً وترهيباً وبالله التوفيق\n الإشارة: اعلم أن كثيراً من الناس يعتمدون على صحبة الأولياء، ويُطلقون عنان أنفسهم في المعاصي والشهوات، ويقولون: سمعنا من سيدي فلان يقول: مَن رآنا لا تمسه النار\n وهذا غلط وغرور، وقد قال - عليه الصلاة والسلام - لابنته:\n\n \" يا فاطمةَ بنتَ مُحمَّد، لا أُغْنِي عَنْكِ مِنَ اللّهِ شيئاً، اشترِيِ نفسك من الله \" \n\nوقال للذي قال: ادع الله أن أكون رفيقك في الجنة فقال له:\n\n \" أعِنِّي عَلَى نَفْسِكَ بكَثْرةِ السُّجُود \" \n\nنعم، هذا المقالة: إن صدرت من ولي متمكن مع الله فهي حق، لكن بشرط العمل ممن رآه بالمأمورات وترك المحرمات، فإن المأمول من فضل الله، ببركة أوليائه، أن يتقبل الله منه أحسن ما عمل، ويتجاوز عن سيئاته، فإن الأولياء المتمكنين اتخذوا عند الله عهداً فلن يخلف الله عهده وهو أن من تعلق بهم وتمسك بالشريعة شفعوا فيه\n والغالب على مَن صَحِبَ أولياء الله المتمكنين - الحفظ وعدم الإصرار، فمن كان كذلك لا تمسه النار، وفي الحديث:\n\n \" إذَا أحَبَّ اللّهُ عَبْداً لَمْ يضرُّه ذَنْب \" \n",
      "translations": []
    }
  ]
}