{
  "chapter": "البقرة",
  "text": "واذ اخذنا ميثق بنى اسرءيل لا تعبدون الا الله وبالولدين احسانا وذى القربى واليتمى والمسكين وقولوا۟ للناس حسنا واقيموا۟ الصلوة وءاتوا۟ الزكوة ثم توليتم الا قليلا منكم وانتم معرضون",
  "translations": [
    {
      "translation": "Remember, when We made a covenant with the people of Israel and said: \"Worship no one but God, and be good to your parents and your kin, and to orphans and the needy, and speak of goodness to men; observe your devotional obligations, and give zakat (the due share of your wealth for the welfare of others),\" you went back (on your word), except only a few, and paid no heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that We made a solemn covenant with the children of Israel to this effect: worship none save Allah: be good to your parents, to your relatives, to the orphans and to the helpless; speak aright with the people: establish the Salat and pay the Zakat. But with the exception of a few, you all slid back from it and are paying no heed to it even now.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the children of Israel that they should not worship anyone except Me, that they should serve their parents, relatives, orphans, and the destitute, that they should speak righteous words to people, and that they should be steadfast in their prayers and pay the religious tax. But soon after you made this covenant, all but a few of you broke it heedlessly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took a covenant from the Descendants of Israel that, “Do not worship anyone except Allah; and be good to parents, relatives, orphans and the needy, and speak kindly to people and keep the prayer established and pay the charity”; thereafter you retracted, except some of you; and you are those who turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took a covenant from the Children of Israel, (saying): Worship none but Allah (alone) and be dutiful and good to parents, and to kindred, and to orphans and (the poor), and speak good to people and perform As-Salah and give Zakah. Then you slid back, except a few of you, while you are backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with the children of Israel: You shall not serve any but Allah and (you shall do) good to (your) parents, and to the near of kin and to the orphans and the needy, and you shall speak to men good words and keep up prayer and pay the poor-rate. Then you turned back except a few of you and (now too) you turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took compact with the Children of Israel: 'You shall not serve any save God; and to be good to parents, and the near kinsman, and to orphans, and to the needy; and speak good to men, and perform the prayer, and pay the alms.' Then you turned away, all but a few of you, swerving aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We made a covenant with the Children of Israel, (saying): Worship none save Allah (only), and be good to parents and to kindred and to orphans and the needy, and speak kindly to mankind; and establish worship and pay the poor-due. Then, after that, ye slid back, save a few of you, being averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when We made a covenant with the Children of Israel, \"Worship none but God and be good to your parents and to relatives and orphans and the needy. And speak kindly to people. Attend to your prayers and pay the zakat [prescribed alms].\" But with the exception of a few, you turned away [in aversion] and paid no heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We took a bond with the Children of Israel saying: worship not any god save Allah, and unto parents show kindness, and also unto the kindred and the orphans and the poor, and speak kindly unto mankind, and establish prayer and give the poor rate. Then ye turned away, save a few of you, and ye are backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We took a pledge from the Children of Israel, [saying]: ‘Worship no one but Allah, do good to your parents, relatives, orphans, and the needy, speak kindly to people, maintain the prayer, and give the zakat,’ you turned away, except a few of you, and you were disregardful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We took a covenant from the Children of Israel (to this effect): Worship none but Allah; treat with kindness your parents and kindred, and orphans and those in need; speak fair to the people; be steadfast in prayer; and practise regular charity. Then did ye turn back, except a few among you, and ye backslide (even now).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took a covenant from the Children of Israel, (saying): Worship none but Allah (Alone) and be dutiful and good to parents, and to kindred, and to orphans and Al-Masakin (the poor), [Tafsir At-Tabari, Vol. 10, Page 158 (Verse 9:60)] and speak good to people [i.e. enjoin righteousness and forbid evil, and say the truth about Muhammad Peace be upon him], and perform As-Salat (Iqamat-as-Salat), and give Zakat. Then you slid back, except a few of you, while you are backsliders. (Tafsir Al-Qurtubi, Vol. 2, Page 392).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when We made a covenant with the Children of Israel, you shall worship none except Allah. Show kindness to your parents, to kinsmen, to the orphans, and to the needy, and speak of goodness to people. Establish your prayers and pay the obligatory charity. But, except for a few, you all turned your backs and gave no heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the Children of Israel: “Worship none but God; and be good to parents, and relatives, and orphans, and the needy; and speak nicely to people; and pray regularly, and give alms.” Then you turned away, except for a few of you, recanting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We took the covenant from the Children of Israel, [enjoining upon them], \"Do not worship except Allah; and to parents do good and to relatives, orphans, and the needy. And speak to people good [words] and establish prayer and give zakah.\" Then you turned away, except a few of you, and you were refusing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:83] And, mention, when We made a covenant with the Children of Israel, in the Torah, where We said: ‘You shall not worship (a variant reading [for lā ta‘budūna] has [third person plural] lā ya‘budūn [‘they shall not worship’]) any other than God (lā ta‘budūna illā Llāha is a predicate denoting a prohibition; one may also read lā ta‘budū [Worship you not]); and to be good, and righteous, to parents, and the near of kin: here kinship is adjoined to parents; and to orphans, and to the needy; and speak well, [good] words, to men, commanding good and forbidding evil, being truthful with regard to the status of Muhammad (s), and being kind to them [sc. orphans and the needy] (a variant reading [for hasanan] has husnan, the verbal noun, used as a hyperbolic description); and observe prayer and pay the alms’, which you actually accepted, but, then you turned away, refusing to fulfil these [obligations] (here the second person address is used, but their forefathers are [still] meant); all but a few of you, rejecting it, like your forefathers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions His covenant with the Children of Israel, saying: (And when We made a covenant with the Children of Israel: Worship none save Allah) declare Him as the only true God and do not ascribe any partner to Him, (and be good to parents) be dutiful to them (and to kindred) and keep contact with relatives (and to orphans) and be kind to orphans (and the needy) and generous to the needy, (and speak kindly to mankind) say the Truth regarding Muhammad (pbuh); (and establish prayer) perfect the five daily prayers (and pay the poor-due) and give from your wealth what is due to the poor. (Then, after that, ye slid back) you turned back on this covenant, (save a few of you) from amongst your forefathers; as it is said that this refers to 'Abdullah Ibn Salam and his companions, (being averse) denying and leaving it aside. 14\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل للمؤمنين أيضاً قصة { إِذْ أَخَذْنَا مِيثَاقَ بَنِيۤ إِسْرَائِيلَ } أي: العهد الوثيق من بني إسرائيل المفرطين في بعض العهود والمواثيق، بأن قلنا لهم: { لاَ تَعْبُدُونَ } أي: لا تتوجهون ولا تتقربون { إِلاَّ ٱللَّهَ } الذي أظهركم من العدم ورتبكم ورباكم بأنواع اللطف والكرم، لكي تعرفون { وَ } لا تفعلون ولا تعاملون { بِٱلْوَالِدَيْنِ } المربيين لكم باستخلاف الله إياهما إلا { إِحْسَاناً } محسنين معهما بخفض جناح الذل وبذل المال وخدمة البدن { وَ } مع ذلك كذا مع { ذِي ٱلْقُرْبَىٰ } المنتمين إليهما بواسطتهما { وَ } لا يقهرون { الْيَتَامَىٰ } الأطفال الذي لا متعهد لهم من الوالدين، بل تحسنون لهم وتتعطفون معهم { وَ } كذا مع { ٱلْمَسَاكِينِ } الذين لا يمكنهم الكسب لعدم مساعدة إلا أنهم بالجملة { وَقُولُواْ لِلنَّاسِ } أي: لجميع الأجانب المستغنين عن جميع الأمداد { حُسْناً } قولاً حسناً هيناً ليناً مبيناً عن المحبة والوداد\n\n\n\n\n{ وَ } لما أمرناهم ونهيناهم بما يتعلق بمبدئهم ومعاشهم أمرناهم أيضاً بما يتعلق بمعادهم ورجوعهم إلينا، فقلنا لهم { أَقِيمُواْ } أديموا { ٱلصَّلاَةَ } التي هي معراجكم الحقيقي إلى ذروة التوحيد { وَ } العروج إليها لا يتحقق إلا بترك العلائق وطرح الشواغل لذلك { آتُواْ ٱلزَّكَاةَ } المطهرة المزيلة عن نفوسكم محبة الغير والسوى، بل محبة نفوسكم الشاغلة عن الوصول إلى شرف اللقاء { ثُمَّ } لما اشتغلتم بالأمر والنواهي نقضتم العهود بأن { تَوَلَّيْتُمْ } أعرضتم عنها، ونبذتموها وراء ظهوركم { إِلاَّ قَلِيلاً مِّنْكُمْ } وهم الذين ذكرهم الله في قوله:\n\n[البقرة: 62] { وَأَنْتُمْ } قوم { مُّعْرِضُونَ } [البقرة: 83] شأنكم الإعراض عن الحق مستمرمين عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لا تعبدون }: خبر في معنى النهي، كقوله تعالى:\n",
      "translations": []
    }
  ]
}