{
  "chapter": "البقرة",
  "text": "واذ اخذنا ميثقكم لا تسفكون دماءكم ولا تخرجون انفسكم من ديركم ثم اقررتم وانتم تشهدون",
  "translations": [
    {
      "translation": "And remember, when We made a covenant with you whereby you agreed you will neither shed blood among you nor turn your people out of their homes, you promised, and are witness to it too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember also that We made another solemn covenant with you: you shall not shed blood among yourselves nor expel one another from your homes. And you confirmed it and you are a witness to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with you that you should not shed each other's blood or expel each other from your homeland. You accepted and bore witness to this covenant,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took a covenant from you that, “Do not shed the blood of your own people nor turn out your own people from your colonies”; you then acknowledged it and you are witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant (saying): Shed not the blood of your (people), nor turn out your own people from their dwellings. Then, (this) you ratified and (to this) you bore witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with you: You shall not shed your blood and you shall not turn your people out of your cities; then you gave a promise while you witnessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took compact with you: 'You shall not shed your own blood, neither expel your own from your habitations'; then you confirmed it and yourselves bore witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made with you a covenant (saying): Shed not the blood of your people nor turn (a party of) your people out of your dwellings. Then ye ratified (Our covenant) and ye were witnesses (thereto).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made a covenant with you, We said, \"You shall not shed each other's blood, nor turn your people out of their homes.\" You consented to this and bore witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We took a bond with you: saying: ye shall not shed your blood, nor drive one anot her from your homes; then ye ratified it and ye Were witnesses\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took a pledge from you, [saying]: ‘You shall not shed your [own people’s] blood, and you shall not expel your folks from your homes,’ you pledged, and you testify [to this pledge of your ancestors].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We took your covenant (to this effect): Shed no blood amongst you, nor turn out your own people from your homes: and this ye solemnly ratified, and to this ye can bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant (saying): Shed not the blood of your people, nor turn out your own people from their dwellings. Then, (this) you ratified and (to this) you bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with you, that you shall not shed your blood or turn yourselves out of your dwellings, to this you consented and bore witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a covenant with you: “You shall not shed the blood of your own, nor shall you evict your own from your homes.” You agreed, and were all witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We took your covenant, [saying], \"Do not shed each other's blood or evict one another from your homes.\" Then you acknowledged [this] while you were witnessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:84] And when We made a covenant with you, and We said: ‘You shall not shed your own blood, spilling it by slaying one another; neither expel your own from your habitations’: let no one of you expel the other from his house; then you confirmed it, that is, you accepted this covenant, and you bore witness, upon your own souls.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We made with you a covenant) in the Book: (shed not the blood of your people) do not kill one another (nor turn your people) i.e. one another (out of your dwellings) from your homes, meaning: the Banu Qurayzah and Banu'l-Nadir. (Then ye ratified (Our covenant)) you agreed to it (and ye were witnesses (thereto)) while knowing what you were doing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { لاَ تَسْفِكُونَ دِمَآءَكُمْ } معناهُ لا تُهْرِقُونَها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا تكونون معرضين، اذكروا قبح صنيعكم وقت { إِذْ أَخَذْنَا مِيثَاقَكُمْ } بأن { لاَ تَسْفِكُونَ دِمَآءَكُمْ } أي: لا يسفك بعضكم دم بعض بلا موجب شرعي { وَلاَ تُخْرِجُونَ أَنْفُسَكُمْ مِّن دِيَارِكُمْ } أي: لا يخرج بعضكم بعضاً من دياره تعدياً وظلماً { ثُمَّ أَقْرَرْتُمْ } طوعاً، واعترفتم رغبة بهذا العهد { وَأَنْتُمْ } بأجمعكم { تَشْهَدُونَ } [البقرة: 84] تحضرون، وكلكم متفقون عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}