{
  "chapter": "البقرة",
  "text": "ثم انتم هؤلاء تقتلون انفسكم وتخرجون فريقا منكم من ديرهم تظهرون عليهم بالاثم والعدون وان ياتوكم اسرى تفدوهم وهو محرم عليكم اخراجهم افتؤمنون ببعض الكتب وتكفرون ببعض فما جزاء من يفعل ذلك منكم الا خزى فى الحيوة الدنيا ويوم القيمة يردون الى اشد العذاب وما الله بغفل عما تعملون",
  "translations": [
    {
      "translation": "But you still kill one another, and you turn a section of your people from their homes, assisting one another against them with guilt and oppression. Yet when they are brought to you as captives you ransom them, although forbidden it was to drive them away. Do you, then, believe a part of the Book and reject a part? There is no other award for them who so act but disgrace in the world, and on the Day of Judgement the severest of punishment; for God is not heedless of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But inspite of this, you are killing your brethren and driving them out from their homes and making unjust and aggressive alliances against one another. And when they come to you as captives, you trade on their ransoms whereas their expulsion itself was unlawful for you. Do you then believe in one part of the Scriptures and disbelieve in the other? What other punishment do such people from among you deserve except an ignominious life in this world and the most grievous doom on the Day of Resurrection? Allah is not unaware of what you are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet you murdered each other and forced a number of your people out of their homeland, helping each other to commit sin and to be hostile to one another. When you had expelled people from their homeland and later they had been made captives (of other people), you then paid their ransom (thinking that it was a righteous deed). God forbade you to expel these people in the first place. Do you believe in one part of the Book and not in the other? Those who behave in this way shall reap disgrace in this world and severe punishment on the Day of Resurrection. God is not unaware of things that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it is you who began slaying each other and you drive out a group of your people from their homeland – providing support against them (to their opponents) through sin and injustice; and if they come to you as captives you redeem them, whereas their expulsion itself is forbidden to you; so do you believe in some of Allah’s commands and disbelieve in some? So what is the reward of those who do so, except disgrace in this world? And on the Day of Resurrection they will be assigned to the most grievous punishment; and Allah is not unaware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this, it is you who kill one another and drive out a party of you from their homes, assist (their enemies) against them, in sin and transgression. And if they come to you as captives, you ransom them, although their expulsion was forbidden to you. Then do you believe in a part of the Book and reject the rest Then what is the recompense of those who do so among you, except disgrace in the life of this world, and on the Day of Resurrection they shall be consigned to the most grievous torment. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet you it is who slay your people and turn a party from among you out of their homes, backing each other up against them unlawfully and exceeding the limits; and if they should come to you, as captives you would ransom them-- while their very turning out was unlawful for you. Do you then believe in a part of the Book and disbelieve in the other? What then is the re ward of such among you as do this but disgrace in the life of this world, and on the day of resurrection they shall be sent back to the most grievous chastisement, and Allah is not at all heedless of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there you are killing one another, and expelling a party of you from their habitations, conspiring against them in sin and enmity; and if they come to you as captives, you ransom them; yet their expulsion was forbidden you. What, do you believe in part of the Book, and disbelieve in part? What shall be the recompense of those of you who do that, but degradation in the present life, and on the Day of Resurrection to be returned unto the most terrible of chastisement? And God is not heedless of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet ye it is who slay each other and drive out a party of your people from their homes, supporting one another against them by sin and transgression? - and if they came to you as captives ye would ransom them, whereas their expulsion was itself unlawful for you - Believe ye in part of the Scripture and disbelieve ye in part thereof? And what is the reward of those who do so save ignominy in the life of the world, and on the Day of Resurrection they will be consigned to the most grievous doom. For Allah is not unaware of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet, here you are, slaying one another and driving some of your own people from their homelands, aiding one another against them, committing sin and aggression; but if they came to you as captives, you would ransom them. Surely their very expulsion was unlawful for you. Do you believe in one part of the Book and deny another part of it? Those of you who act thus shall be rewarded with disgrace in this world and with a severe punishment on the Day of Resurrection. God is never unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter it is ye the very ones who slay each other and drive a party of you from their homes, and back up against them with guilt and iniquity; and if they come unto you as captives, ye ransom them, whereas forbidden unto you was their driving away itself. Believe ye then in part of the Book and disbelieve in part? What, then, is to be the meed of those of you who do that, save humiliation in the life of the world? And on the Day of Judgement they shall be brought back to the severest torment, and Allah is not neglectful of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there you were, killing your folks and expelling a part of your folks from their homes, backing one another against them in sin and aggression! And if they came to you as captives, you would ransom them, though their expulsion itself was forbidden you. What! Do you believe in part of the Book and deny another part? So what is the requital of those of you who do that except disgrace in the life of this world? And on the Day of Resurrection, they shall be consigned to the severest punishment. And Allah is not oblivious of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this it is ye, the same people, who slay among yourselves, and banish a party of you from their homes; assist (Their enemies) against them, in guilt and rancour; and if they come to you as captives, ye ransom them, though it was not lawful for you to banish them. Then is it only a part of the Book that ye believe in, and do ye reject the rest? but what is the reward for those among you who behave like this but disgrace in this life?- and on the Day of Judgment they shall be consigned to the most grievous penalty. For Allah is not unmindful of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this, it is you who kill one another and drive out a party of you from their homes, assist (their enemies) against them, in sin and transgression. And if they come to you as captives, you ransom them, although their expulsion was forbidden to you. Then do you believe in a part of the Scripture and reject the rest? Then what is the recompense of those who do so among you, except disgrace in the life of this world, and on the Day of Resurrection they shall be consigned to the most grievous torment. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet there you are, slaying your ownselves, and turning a number of them out of their dwellings, and helping each other against them with sin and aggression. Although, should they come to you as captives, you would ransom them. Surely, their expulsion was unlawful. Do you then believe in a part of the Book and disbelieve another! What shall be the recompense of those of you who do that, but degradation in the worldly life, and on the Day of Resurrection to be returned to the most terrible punishment. Allah is not inattentive of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But here you are, killing your own, and expelling a group of your own from their homes—conspiring against them in wrongdoing and hostility. And if they come to you as captives, you ransom them, although it was forbidden to you. Is it that you believe in part of the Scripture, and disbelieve in part? What is the reward for those among you who do that but humiliation in this life? And on the Day of Resurrection, they will be assigned to the most severe torment. God is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, you are those [same ones who are] killing one another and evicting a party of your people from their homes, cooperating against them in sin and aggression. And if they come to you as captives, you ransom them, although their eviction was forbidden to you. So do you believe in part of the Scripture and disbelieve in part? Then what is the recompense for those who do that among you except disgrace in worldly life; and on the Day of Resurrection they will be sent back to the severest of punishment. And Allah is not unaware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:85] Then there you are killing one another, and expelling a party of you from their habitations, conspiring (tazzāharūna: the original ta’ has been assimilated with the zā’; a variant reading has it without [the assimilation, that is, tazāharūna]), assisting one another, against them in sin, in disobedience, and enmity, injustice, and if they come to you as captives (a variant reading [for usārā] has asrā), you ransom them (a variant reading [for tafdūhum] has tufādūhum), that is to say, you deliver them from captivity with money etc., and this [ransoming] was one of the things to which they were pledged; yet their expulsion was forbidden you (muharramun ‘alaykum ikhrājuhum is semantically connected to wa-tukhrijūna, ‘and expelling’, and the statement that comes in between is parenthetical, that is, [expulsion was forbidden you] in the same way that non-ransoming was forbidden you). Qurayza had allied themselves with the Aws, and the Nadīr with the Khazraj, but every member of an alliance would fight against a fellow ally, thus destroying each other’s homes and expelling one another, taking prisoners and then ransoming them. When they were asked: ‘Why do you fight them and then pay their ransom?’, they would reply, ‘Because we have been commanded to ransom’; and they would be asked, ‘So, why do you fight them then?’, to which they would say, ‘For fear that our allies be humiliated’; God, exalted, says: What, do you believe in part of the Book, that is, the part about ransom, and disbelieve in part?, namely, the part about renouncing fighting, expulsion and assistance [against one another]; What shall be the requital of those of you who do that, but degradation, disgrace and ignominy, in the life of this world: they were disgraced when Qurayza were slewn and the Nadīr were expelled to Syria, and ordered to pay the jizya; and on the Day of Resurrection to be returned to the most terrible of chastisement? And God is not heedless of what you do (ta‘malūna, or read ya‘malūna, ‘they do’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Yet ye it is who slay each other and drive out a party of your people from their homes, supporting one another against them by sin) contravention (and transgression) offence-(and if they came to you as captives) captives who belong to your religion (ye would ransom them) free them by paying a ransom to the enemy (-whereas their expulsion was itself unlawful for you) whereas their expulsion and killing were unlawful in the first place. (Believe ye in part of the Scripture) the part that stipulates freeing your captives from the enemy (and disbelieve ye in part thereof?) and leave the captives of your friends without ransoming them. It is also said that this verse means: do you believe in those parts of the scripture that suit your whim and disbelieve in those parts that do not? (And what is the reward of those who do so save ignominy in the life of the world) by being killed or captured as slaves, (and on the Day of Resurrection they will be consigned to the most grievous doom. For Allah is not unaware) He is not reducing your punishment because (of what ye do) in terms of transgression; and it is also said: because of what they concealed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ثم أنتُم هؤلاءِ } الساقطون عن الفطرة، المحتجبون عن نور الاستعداد الأصليّ { تَقْتلون أنْفُسَكم } بغوايتكم ومتابعتكم للهوى { وتُخْرجون فَرِيقاً منكُم من دِيَارهم } أوطانهم القديمة الأصلية، بإغوائهم وإضلالهم وتحريضهم على ارتكاب المعاصي واتباع الهوى { تَظَاهرون عليهم } تتعاونون عليهم { بالإثْمِ } بارتكاب الفواحش والمعاصي ليروكم فيتبعوكم فيها { والعدوانِ } والاستطالة على الناس ليتعدّى إليهم ظلمكم، وإلزامكم إياهم رذائل القوّتين البهيمية والسبعية وتحريضكم لهم عليها، وتزيينكم لهم إياها كما هو عادة ملاحدة المسلمين من أهل الإباحة المدّعين للتوحيد\n { وإن يأتُوكم أسَارى } في قيد تبعات ارتكبوها وشين أفعالهم القبيحة، أخذتكم الندامة وعيرتهم عقولهم وعقول أبناء جنسهم بما لحقهم من العار والشنار { تُفادُوهم } بكلمات الحكمة والموعظة والنصيحة الدالة على أنّ اللذات المستعلية هي: العقلية والروحية وعاقبة اتباع الهوى والنفس والشيطان وخيمة، ومشاركة البهائم والهوامّ في أفعالها مذمومة رديئة، فيتيقظوا بها ويتخلصوا من قيد الهوى سويعة كما نشاهد من حال علوج مدّعي التوحيد والمعرفة والحكمة وأتباعهم في زماننا هذا\n { أَفَتُؤمنون بِبَعض الكِتاب } أي: كتاب العقل والشرع قولاً وإقراراً، فتقرون به وتصدّقونه وهو أنّ اتباع الهوى والنفس مذموم، موجب للوبال والهلاك والخسران { وتَكْفرون بِبعض } فعلاً وعملاً فلا تنتهون عما نهاكم عنه، وهو إباحتهم واستحلالهم للمحرّمات والمنهيات { فما جَزاء من يَفعل ذلك مِنكم إلا خِزْيٌ } افتضاح وذلة { في الحياة الدنيا ويوم القيامة } أي: حال المفارقة التي هي القيامة الصغرى { يُرَدون إلى أشد العذابِ } الذي هو تعذيبهم بالهيئات المظلمة الراسخة في نفوسهم واختراقهم بنيرانها أو مسخهم عن صورهم بالكلية، وتضاعف البليّة { وما الله بِغَافل } عن أعمالكم، أحصاها وضبطها في أنفسكم وكتبها عليكم، كما قال تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ أَنْتُمْ هَـٰؤُلاۤءِ } الخبيثون الدنيئون، نقضتم العهد بعد توكيده بأن { تَقْتُلُونَ أَنْفُسَكُمْ } بعضكم نفس بعض بغير حق { وَتُخْرِجُونَ } أي: يخرج بعضكم { فَرِيقاً } بعضاً { مِّنْكُمْ مِّن دِيَارِهِمْ } المألوفة إجلاء وظلماً وأنتم بأجمعكم { تَظَاهَرُونَ } تعينون { عَلَيْهِمْ } على المخرجين الظالمين { بِٱلإِثْمِ } أي: الخصلة الفاحشة { وَالْعُدْوَانِ }  أي: الظلم المتجاوز عن الحد { وَ } من جملة عهودكم أيضاً: { إِن يَأتُوكُمْ } أي: يأتي بعضكم بعضاً { أُسَارَىٰ } موثقين في يد العدو { تُفَادُوهُمْ } تعطوهم فديتهم وتنقذوهم من عدوهم تبرعاً، فلا ينقضون هذا العهد مع أنه غير محرم عليك ترك فدائهم وينقضون العهد الوثيق المتعلق بالقتل والإخراج { وَ } الحال أنه { هُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ } وقتلهم\n\n\n{ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَابِ } وتوفون بعض العهد الثابت في الكتاب، وهو عهد الفدية { وَتَكْفُرُونَ بِبَعْضٍ } وهو عهد عدم القتل والإجلاء مع أنه لا تفاوت بين العهود المنزلة من عند الله { فَمَا جَزَآءُ مَن يَفْعَلُ ذٰلِكَ مِنكُمْ } التفرقة بين عهود الله المنزلة في كتابه عتوّاً واستكباراً { إِلاَّ خِزْيٌ } ذل يستكره جميع الناس { فِي ٱلْحَيَاةِ ٱلدُّنْيَا وَيَوْمَ ٱلْقِيَامَةِ } القائمة للعدل والجزاء { يُرَدُّونَ } هؤلاء الناقضون لعهد الله { إِلَىٰ أَشَدِّ ٱلّعَذَابِ } وهو قعر بحر الإمكان الذي لا نجاة لأحد منه { وَمَا ٱللَّهُ } المستوي على عروش الذرات الكائنة في العالم رطبها ويابسها، شهادتها وغيبها { بِغَافِلٍ } مشغول بشيء يشغله { عَمَّا تَعْمَلُونَ } [البقرة: 85] أنتم بل شأنكم وحالكم وأعمالكم كلها عنده مكشوف معلوم له سبحانه بالعلم الحضوري، بحيث لا يشذ عن حيطة علمه شيء فيها أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ثُمَّ أَنتُمْ هَؤُلاء }  { أَنتُمْ }: مبتدأ، و { هَؤُلاء }: خبر، و { تَقْتُلُون }: حال، كقولك: أنت ذلك الرجل الذي فعلت كذا وكذا، أو { هَؤُلاءِ }: بدل، و { تَقْتُلُونَ }: خبر أو منادي، أي: يا هؤلاء، أو منصوب على الاختصاص، والْعُدْوَانِ: الإفراط في الظلم، و { أُسَارَى } حالٌ، جميع أسير، ويجمع على أًسرى، وقرئ به أي: مأسورين: و { هُوَ } ضمير الشأن، و { مُحَرَّمٌ } خبر، و { إِخْرَاجُهُمْ } مبتدأ مؤخر، أو ضمير الإخراج فيكون مبتدأ، و { مُحَرَّمٌ } خبره، و { إِخْرَاجُهُمْ } بدل من الضمير، وهذه الجملة متصلة بقوله: { وتخرجون فريقاً منكم من ديارهم تظاهرون عليهم بالإثم والعدوان } ، وما قبلها اعتراض\n يقول الحقّ جلّ جلاله: { و } اذكروا أيضاً { إِذْ أَخْذْنَا ميثَاقَكُمْ } وقلنا لكم: { لا تَسْفِكُونَ دِمَاءَكُمْ } أي: لا يسفك بعضكم دم بعض، { وَلا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ } أي: لا يخرج أحدكم أخاه من داره ويجليه عنها، وجعلهم الحق نفساً واحدة، وذلك هو في الحقيقة، وفي ذلك يقول الشاعر:\n\n{ ثُمَّ أَقْرَرْتُمْ } بهذا العهد والتزمتموه لأنفسكم { وَأَنْتُمْ تَشْهَدُونَ } على أنفسكم بذلك، { ثُمَّ أَنتُمْ } يا { هَؤُلاءِ } اليهود { تَقْتُلُونَ أَنفُسَكُمْ } أي: يقتل بعضكم بعضاً، { وَتُخْرِجُونَ فَرِيقاً مِّنكُم مِّن دِيَارِهِمْ } إجلاءً عنها، تتغالبون { عَلَيْهِم } بالظلم والطغيان، { وَإِن يَأتُوكُمْ } مأسورين تفدوهم بمالكم، وذلك الإخراج محرم عليكم\n وحاصل الآية: أن الله تعالى أخذ على بني إسرائيل العهد في التوراة ألا يقتل بعضهم بعضاً، ولا يخرج بعضهم بعضاً من ديارهم، وأيّما عبدٍ أو أمَةٍ وجدتموه من بني إسرائيل أسيراً فاشتروه بما كان من ثمنه واعتقوه، فكانت قريظة حلفاء الأوس، والنضير حلفاء الخزرج، وكانوا يقتتلون في الحرب فيُعين بنو قريظة حلفاءهم الأوس، فيقاتلون بني النضير في قتالهم مع الخزرج، فإذا غلبوا خربوا ديارهم وأخرجوهم منها، فإذا أسر رجل من الفريقين جمعوا له حتى يفدوه، فعيرتهم العرب، فقالوا: تقاتلونهم وتفدونهم؟! فيقولون: قد أمرنا أن نفديهم وحُرم علينا قتالهم، قالوا: فلم تقاتلونهم؟ فقالوا: إنا نسْتحي أن يُذَل حلفاؤنا، فوبخهم الله على ذلك، فقال: { أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَاب } وهو الفداء { وَتَكْفُرُونَ بِبَعْضٍ } وهو القتل والإخراج؟ { فَمَا جَزَاءُ مَن يَفْعَلُ ذَلِكَ مِنكُمْ إلاَّ خِزْيٌ } أي: ذل وهوان { فِي الْحَيَاةِ الدُّنْيَا } ، وهو السبي والقتل لبني قريظة، والجلاء والإخراج من الوطن لبني النضير، أو الذل والجزية للفريقين إلى يوم القيامة، { وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إلَى أَشَدِّ الْعَذَابِ }\n وليس ما أصابهم تكفيراً لذنوبهم، بل نقمة وغضباً عليهم، { وَمَا اللَّهُ بِغَافلٍ عَمَّا تَعْمَلُونَ }\n الإشارة: الناس على قسمين: قوم ضعفاء تمسكوا بظاهر الشريعة ولم ينفذوا إلى باطنها، ولم يقدروا على قتل نفوسهم، ولا على الخروج من وطن عوائدهم، فيقول لهم الحق جلّ جلاله: لا تسفكوا دماءكم في محبتي لأنكم لا تقدرون على ذلك، ولا تخرجون أنفسكم من دياركم في سياحة قلوبكم، فقد أقررتم بعجزكم وضعفكم، ويقول للأقوياء: ثم أنتم يا هؤلاء تقتلون أنفسكم في طلب معرفتي، وتخرجون فريقاً منكم من ديار عوائدهم في طلب مرضاتي، تتعاونوا على نفوسكم بالقهر والغلبة، وكذلك ورد في بعض الأخبار: أول ما يقول الله للعبد: اطلب العافية والجنة والأعمال وغير ذلك، فإن قال: لا، ما أريد إلا أنت، قال له: من دخل في هذا معي فإنما يدخل بإسقاط الحظوظ، ورفع الحدث، وإثبات القدم، وذلك يوجب العدم وأنشدوا:\n\n\n\nويقول أيضاً للأقوياء الذين قتلوا أنفسهم وخرجوا عن عوائدهم: وإن يأتوكم أسارة في أيدي نفوسهم وعوائدهم، أو في طلب الدنيا وشهواتها، تفدوهم من أسرهم، وتفكوهم من قيودهم، وتدخلوهم في حضرة مولاهم، وفي بعض الآثار: طالب الدنيا أسير، وطالب الآخرة أجير، وطالب الحق أمير هـ\n والأمير هو الذي يفك الأسارى من أيدي العدو، لأجل ما ملكه الله من القوة والاستعداد، فإذا انفك العبد من هواه، دخل في حضرة مولاه، فمن رام إخراجه منها بعد دخوله يقال له: وهو محرم عليكم إخراجهم، فكيف تؤمنون بظاهر الشريعة وتنكرون علم الطريقة، وأنوار الحقيقة؟ فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا وهو الحرص والطمع، والخوف والجزع وطول الأمل، وعدم النهوض إلى العمل، { ويوم القيامة يردون إلى أشد العذاب } ، وهو غم الحجاب وسوء الحساب، { وما الله بغافل عما يعملون }\n\n",
      "translations": []
    }
  ]
}