{
  "chapter": "البقرة",
  "text": "ولقد ءاتينا موسى الكتب وقفينا منۢ بعده بالرسل وءاتينا عيسى ابن مريم البينت وايدنه بروح القدس افكلما جاءكم رسولۢ بما لا تهوى انفسكم استكبرتم ففريقا كذبتم وفريقا تقتلون",
  "translations": [
    {
      "translation": "Remember We gave Moses the Book and sent after him many an apostle; and to Jesus, son of Mary, We gave clear evidence of the truth, reinforcing him with divine grace. Even so, when a messenger brought to you what did not suit your mood you turned haughty, and called some imposters and some others you slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave Moses the Book and sent after him a train of Messengers in succession. Then We sent Jesus, son of Mary, with clear Signs and supported him with the Holy Spirit. Then how is it that whenever a Messenger came to you wish that which did not suit your lusts, you grew rebellious against him, and repudiated some and slew others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave the Book to Moses and made the Messengers follow in his path. To Jesus, the son of Mary, We gave the miracles and supported him by the Holy Spirit. Why do you arrogantly belie some Messengers and murder others whenever they have brought you messages that you dislike?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We gave Moosa (Moses) the Book and subsequent to him, sent Noble Messengers one after another – and We gave Eisa (Jesus), the son of Maryam (Mary), clear proofs and supported him with the Holy Spirit; so when a Noble Messenger from Allah comes to you bringing what you yourselves do not desire, you grow arrogant; so you disbelieve in a group of the Prophets and another group of Prophets you slay!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We gave Musa the Book and followed him up with a succession of Messengers. And We gave `Isa, the son of Maryam, clear signs and supported him with Ruh-il-Qudus. Is it that whenever there came to you a Messenger with what you yourselves desired not, you grew arrogant Some you disbelieved and some you killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly We gave Musa the Book and We sent apostles after him one after another; and We gave Isa, the son of Marium, clear arguments and strengthened him with the holy spirit, What! whenever then an apostle came to you with that which your souls did not desire, you were insolent so you called some liars and some you slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We gave to Moses the Book, and after him sent succeeding Messengers; and We gave Jesus son of Mary the clear signs, and confirmed him with the Holy Spirit; and whensoever there came to you a Messenger with that your souls had not desire for, did you become arrogant, and some cry lies to, and some slay?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We gave unto Moses the Scripture and We caused a train of messengers to follow after him, and We gave unto Jesus, son of Mary, clear proofs (of Allah's sovereignty), and We supported him with the Holy spirit. Is it ever so, that, when there cometh unto you a messenger (from Allah) with that which ye yourselves desire not, ye grow arrogant, and some ye disbelieve and some ye slay?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave the Book and sent a succession of messengers after him. We gave Jesus, son of Mary, clear signs and strengthened him with the Holy Spirit. But, whenever a messenger came to you with something which you did not desire, you grew arrogant, calling some liars and slaying others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We vouchsafed unto Musa the Book and We followed him up by the apostles after him, and unto 'lsa, son of Maryam, We vouchsafed evidences and aided him with the Holy Spirit. Then so often as there came unto you an apostle with that which your souls desired not, ye waxed stiff necked; and some ye belied and some ye slew?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, We gave Moses the Book and followed him with the apostles, and We gave Jesus, the son of Mary, manifest proofs and confirmed him with the Holy Spirit. Is it not that whenever an apostle brought you that which was not to your liking, you would act arrogantly; so you would impugn a group [of them], and slay a[nother] group?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book and followed him up with a succession of messengers; We gave Jesus the son of Mary Clear (Signs) and strengthened him with the holy spirit. Is it that whenever there comes to you a messenger with what ye yourselves desire not, ye are puffed up with pride?- Some ye called impostors, and others ye slay!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We gave Musa (Moses) the Book and followed him up with a succession of Messengers. And We gave 'Iesa (Jesus), the son of Maryam (Mary), clear signs and supported him with Ruh-ul-Qudus [Jibrael (Gabriel)]. Is it that whenever there came to you a Messenger with what you yourselves desired not, you grew arrogant? Some, you disbelieved and some, you killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Moses We gave the Book and after him We sent other Messengers. We gave (Prophet) Jesus, the son of Mary, veritable signs, and supported him with the Spirit of Purity (Gabriel). Will you then become proud whenever any Messenger comes to you with that which does not suit your fancies, and you belied some (Prophet Jesus) and killed others!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Scripture, and sent a succession of messengers after him. And We gave Jesus son of Mary the clear proofs, and We supported him with the Holy Spirit. Is it that whenever a messenger comes to you with anything your souls do not desire, you grew arrogant, calling some impostors, and killing others?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did certainly give Moses the Torah and followed up after him with messengers. And We gave Jesus, the son of Mary, clear proofs and supported him with the Pure Spirit. But is it [not] that every time a messenger came to you, [O Children of Israel], with what your souls did not desire, you were arrogant? And a party [of messengers] you denied and another party you killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:87] And We gave Moses the Scripture, the Torah, and after him We sent successive messengers, that is, We sent them one after another, and We gave Jesus son of Mary the clear proofs, that is, the miracles of bringing the dead back to life and healing the blind and the leper, and We confirmed him, We strengthened him, with the Holy Spirit (the expression rūh al-qudus is an example of annexing [in a genitive construction] the noun described to the adjective [qualifying it], in other words, al-rūh al-muqaddasa), that is, Gabriel, [so described] on account of his [Jesus’s] sanctity; he would accompany him [Jesus] wherever he went; still you refuse to be upright, and whenever there came to you a messenger, with what your souls did not desire, [did not] like, in the way of truth, you became arrogant, you disdained to follow him (istakbartum, ‘you became arrogant’, is the response to the particle kullamā, ‘whenever’, and constitutes the interrogative, and is meant as a rebuke); and some, of them, you called liars, such as Jesus, and some you slay?, such as Zachariah and John (the present tenses [of these verbs] are used to narrate the past events [as though they were events in the present], in other words, ‘[and some] you slew’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And surely, We gave unto Moses the Scripture) the Torah (and We caused a train of messengers to follow after him) to come after him in succession, (and We gave unto Jesus son of Mary clear proofs) commands, prohibitions, wondrous things and signs, (and We supported him) strengthened and helped him (with the holy Spirit) with Gabriel, the purified. (Is it ever so, that, when there cometh unto you) group of Jews (a messenger with that which ye yourselves desire not) which does not agree with your hearts and religion, (ye grow arrogant) you disdain believing in him. (And some ye disbelieve) you disbelieve in a group of them, namely Muhammad and Jesus, Allah bless them and give them peace (and some ye slay?) and some you killed, namely, John the Baptist and Zachariah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَقَفَّيْنَا مِن بَعْدِهِ بِٱلرُّسُلِ } معناهُ أَتْبَعْنَا\n\n\n\n\nوقولهُ تعالى: { وَأَيَّدْنَاهُ بِرُوحِ ٱلْقُدُسِ }\n قالَ زيدُ بن علي عليهما السلام معناهُ قوينا\n يقالُ رجلٌ ذو أَيدٍ، وذوو ايدٍ\n ومن ذَلِكَ قولهُ تعالى:\n\n[الذاريات: 47] وروحُ القُدسِ: جبريل عليهِ السلامُ، والقُدُس: الله عزَّ وجلَّ\n ويقالُ القُدُسُ: الملائكةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواذكر يا أكمل الرسل للمؤمنين أيضاً من قبح صنائعهم ليعتبروا: { وَلَقَدْ آتَيْنَا مُوسَىٰ } المبعوث إليهم { ٱلْكِتَابَ } أي: التوراة المشتملة على مصالحهم الدنيوية والأخروية فكذبوه، ولم يلتفتوا إلى كتابه { وَ } بعدما قضى وانقرض موسى { قَفَّيْنَا } أي: عقبناه { مِن بَعْدِهِ بِٱلرُّسُلِ } المرسلة إليهم، أولي الدعوات والآيات والمعجزات، فكذبوهم أيضاً ولم يلتفتوا بما جاءوا به { وَ } بعد ذلك بزمان { آتَيْنَا } أيضاً { عِيسَى } المبعوث إليهم { ٱبْنَ مَرْيَمَ ٱلْبَيِّنَاتِ } الواضحات المبينات لأمر معاشهم ومعادهم { وَ } مع ذلك { أَيَّدْنَاهُ } أي: خصصناه وقويناه { بِرُوحِ ٱلْقُدُسِ } بالروح المقدس عن رذائل الإمكان، فكذبوه أيضاً، فأرادوا قتله ولم يظفروا عليه، ألم تكونوا أنتم أيها الناقضون للعهود والمواثيق { أَفَكُلَّمَا جَآءَكُمْ رَسُولٌ } من الرسل من عند ربكم لإصلاح حالكم { بِمَا لاَ تَهْوَىٰ } تحب وترضى { أَنْفُسُكُمْ } اشتغلتم بما جاءوا به بل { ٱسْتَكْبَرْتُمْ } عليهم واستحقرتموهم { فَفَرِيقاً كَذَّبْتُمْ } كموسى وعيسى عليهما السلام { وَفَرِيقاً تَقْتُلُونَ } [البقرة: 87] كزكريا ويحيى - عليهما السلام - والقوم الذين شأنهم هذا كيف يرجى منهم الفلاح والفوز بالنجاح\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قفينا }: أتبعنا، و { عيسى } عجمي معدول عن أيشوع في لغة السريانية، وهو غير منصرف للعلمية والعجمة، و { مريم }: بمعنى الخادم، ووزنه: مَفْعَل لا فعيل، و { أيدناه } أي: قويناه ونصرناه، و { روح القدس } هنا جبريل عليه السلام أي: الروح المقدسة - من إضافة الموصوف إلى الصفة، سمي به لطهارته من كدر الحس\n يقول الحقّ جلّ جلاله: { وَلَقَدْ آتَيْنَا مُوسَى } التوراة، فما قمتم بحقها ولا عملتم بما فيها، واتبعنا بعده الرسل كلما مات رسول بعثنا بعده آخر اعتنا بكم، { وَآتَيْنَا عيِسَى ابْنَ مَرْيَمَ } المعجزات الواضحات كإحياء الموتى، وإبراء الأكمة والأبرص، والإخبار بالمغيبات، والإنجيل، { وَأَيَّدْنَاهُ } بجبريل عليه السلام كان يسير معه حيث سار، ورفعه إلى السماء حين أردتم يا معشر اليهود قتله، { أَفَكُلَّمَا جَاءَكُمْ رَسُولٌ بِمَا لا تَهْوَى أنفُسُكُمُ } من مشاق الطاعات وترك الحظوظ والشهوات، { اسْتَكْبَرْتُمْ } وامتنعتم من الإيمان به { فَفَرِيقاً } منهم كذبتموه كعيسى وسليمان ومحمد - عليهم السلام -، { وَفَرِيقاً } تقتلونه كزكريا ويحيى - عليهما السلام -؟ قال القشيري: أصْغَوْا إلى الداعين بسمع الهوى، فصار معبودهم صفاتهم وهواهم\n هـ\n الإشارة: كل ما قاله الحق جلّ جلاله لبني إسرائيل في فحوى الخطاب يقوله لهذه الأمة في سرّ الخطاب، فلقد آتانا الكتاب، وبيَّن فيه الرشد والصواب، وقفَّى بعد إنزاله بعلماء أتقياء، وأولياء أصفياء، يحكمون بحكمه، ويهدون بهديه، فإذا أمروا بالزهد في الدنيا وترك الحظوظ والهوى رفضوهم وكذبوهم، وربما كفَّروهم وقتلوهم، واستكبروا عن الأذعان لهم والانقياد لقولهم، ففريقاً كذبوا وفريقاً يقتلون\n وفي الحديث قال صلى الله عليه وسلم:\n\n \" لَتَتَّبِعُنّ سُنَنَ مَنْ قَبلكمُ شِبراً بشِبرٍ وذَراعاً بذراعٍ، حتى لَو دَخلُوا جُحْرَ لدَخَلْتُموه، فقالوا: مَن يا رسول الله اليهودُ والنصارى؟ قالَ: نعم\n\n\n ومَنْ إذن؟ \" \n",
      "translations": []
    }
  ]
}