{
  "chapter": "البقرة",
  "text": "وقالوا۟ قلوبنا غلفۢ بل لعنهم الله بكفرهم فقليلا ما يؤمنون",
  "translations": [
    {
      "translation": "And they say: \"Our hearts are enfolded in covers.\" In fact God has cursed them for their unbelief; and only a little do they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Our hearts are secure.\" Nay, the fact is that Allah has cursed them for their disbelief; so they are little disposed to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said that their hearts cannot understand (what you, Muhammad, say). God has condemned them for their denial of the Truth. There are a very few of them who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews said, “Our hearts are covered”; in fact Allah has cursed them because of their disbelief, so only a few of them accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Our hearts are Ghulf.\" Nay, Allah has cursed them for their disbelief, so little is that which they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Our hearts are covered. Nay, Allah has cursed them on account of their unbelief; so little it is that they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'Our hearts are uncircumcised.' Nay, but God has cursed them for their unbelief; little will they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Our hearts are hardened. Nay, but Allah hath cursed them for their unbelief. Little is that which they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Our hearts are impenetrably wrapped [against whatever you say],\" but God has rejected them for their denial; they have but little faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: our hearts are uncircumcised. Nay! Allah hath cursed them because of their infidelity: little wherefore it is they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘Our hearts are uncircumcised.’ Rather, Allah has cursed them for their unfaith, so few of them have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Our hearts are the wrappings (which preserve Allah's Word: we need no more).\" Nay, Allah's curse is on them for their blasphemy: Little is it they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Our hearts are wrapped (i.e. do not hear or understand Allah's Word).\" Nay, Allah has cursed them for their disbelief, so little is that which they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'Our hearts are covered' But Allah has cursed them for their disbelief. Little is that they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Our hearts are sealed.” Rather, God has cursed them for their ingratitude. They have little faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, \"Our hearts are wrapped.\" But, [in fact], Allah has cursed them for their disbelief, so little is it that they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:88] And they say, to the Prophet mockingly: ‘Our hearts are encased’ (ghulf is the plural of aghlaf), that is to say, wrapped up in covers and cannot comprehend what you say; God, exalted be He, says: Nay (bal introduces the rebuttal), but God has cursed them, removed them far from His mercy and degraded them when they rejected [the messengers], for their unbelief, which is not the result of anything defective in their hearts; and little will they believe (fa-qalīlan mā yu’minūn: the mā here is extra, emphasising the ‘littleness’ involved): that is, their belief is minimal.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the Jews: (Our hearts are hardened) vis-a-vis what you say, Muhammad, i.e. our hearts are capable of absorbing any knowledge, but they prove incapable of comprehending your knowledge or what you say. (Nay) this is a reply to them, (but Allah hath cursed them) sealed their hearts (for their disbelief) as a punishment for their disbelief. (Little is that which they believe) they believe neither much nor a little; it is also said that this means: they do not believe in what you say at all.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { قُلُوبُنَا غُلْفٌ } معناهُ مُغطَّىً عليها\n واحدُها أَغلفٌ\n\n\n\n\nوقولهُ تعالى:\n\n[فصلت: 5] معناهُ أَغطيةٌ\n واحدُهَا كِنٌ\n\n\n\n\nوقولهُ تعالى: { لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ } قالَ زيدُ بن علي عليهما السلامُ معناهُ باعَدهم الله تعالى مِنْ رَحمتِهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية عداوتهم معك يا أكمل الرسل ومع من بايعك من المؤمنين أنهم { قَالُواْ } حين دعوتكم إياهم إلى الإيمان والتصديق بالإسلام: لا نفقة حديثكم ولا نفهم كلامكم؛ إذ { قُلُوبُنَا } التي هي وعاء الإيمان والإذعان { غُلْفٌ } مغلوف مغشاة بالأغطية الكثيفة لا يصل إليها دعوتكم وإخباركم قل لهم يا أكمل الرسل: لا غطاء ولا غشاوة إلا عنادكم وحديثكم وحسدكم على ظهور دين الإسلام وبغيكم عليه مع جزمكم بحقيته عقلاً ونقلاً { بَل } قل لهم نيابة عنا: { لَّعَنَهُمُ ٱللَّهُ } أي: طردهم وبعدهم باسمه المنتقم { بِكُفْرِهِمْ } أي: بسبب كفرهم المذكور في جبلتهم، لكونهم مقهروين تحت اسم المضل المذل، وإذا كانوا من مقتضيات اسم المضل { فَقَلِيلاً مَّا } نزراً يسيراً منهم { يُؤْمِنُونَ } [البقرة: 88] يهتدون بطريق التوحيد إيفاء لحق الفطرة الأصلية التي فطر الناس عليها، وهم الذين ذكرهم سبحانه في قوله:\n\n[البقرة: 62] وبالجملة فلا يجرى منهم الإيمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { غُلف }: جمع ألف، كأحمر وحُمْر، وأصفر وصُفْر، وهو الذي عليه غشاوة، أي: هي في غلاف فلا تفقه ما تقول، بمنزلة الأغلف، وهو غير المختون، وقيل: أصله { غُلُف } بضم اللام، وبه قرأ ابن محيصن\n فيكون جمع غلاف، كحجاب وحجب، وكتاب وكتب، ومعناه، قلوبنا أوعية لكل علم فلا نحتاج إلى علمك وكتابك\n و { قليلاً } صفة لمحذوف أي: فإيماناً قليلاً، أو عدداً قليلاً يؤمنون، أو ظرف لأنه من صفة الأحيان، والعامل فيه ما يليه، و { ما } لتأكيد القلة، أي: في قليل من الأحيان يؤمنون، أو حال من الواو في { يؤمنون } أي: فيؤمنون في حال قلتهم\n يقول الحقّ جلّ جلاله: قالت اليهود استهزاء بما تدعوهم إليه: { قُلُوبُنَا } مغلفة ومغشاة فلا نفقه ما تقول، أو أوعية للعلوم فلا تحتاج إلى علمك، قال الله تعالى: { بل } لا غطاء على قلوبهم حساً، بل هي على الفطرة لكن { لعنهم الله } وطردهم وخذلهم بسبب { كُفْرِهِمْ } فأبطل استعدادها للعلم، { فَقَلِيلاً مَّا يُؤْمِنُونَ } أي: فإيماناً قليلاً يؤمنون كإيمانهم ببعض الكتاب، أو فلا يؤمن إلا قليل منهم كعبد الله بن سلام وأصحابه، والله تعالى أعلم\n الإشارة: إذا أمر الدعاة إلى الله أهل الدنيا بذبح النفوس وحط الرؤوس ودفع الفلوس، ليتأهلوا به لدخول حضرة القدوس، أو أمروهم بخرق العوائد، لتخرق لهم العوائد، أنفوا وعنفوا وقالوا: قلوبنا في أكنة مما تدعونا إليه، فيقال لهم: بل سبق لكم من الله البعد والحرمان، فأنكرتم أسباب الشهود والعيان، لكن مَن سبقت له من الله العناية، وهبَّ عليه نسيم الهداية، فلا تضره الجناية، فقد يلتحق بالخصوص، وإن كان من أعظم اللصوص، وهو قليل بالنسبة إلى من جاهد نفسه في طلب السبيل،\n",
      "translations": []
    }
  ]
}