{
  "chapter": "البقرة",
  "text": "يخدعون الله والذين ءامنوا۟ وما يخدعون الا انفسهم وما يشعرون",
  "translations": [
    {
      "translation": "They (try to) deceive God and those who believe, yet deceive none but themselves although they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thus try to deceive Allah and the Believers, but they succeed in deceiving none except themselves and they realize it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deceive God and the believers. However, they have deceived no one but themselves, a fact of which they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish to deceive Allah and the believers; and in fact they deceive none except themselves and they do not have any understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They try to deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire to deceive Allah and those who believe, and they deceive only themselves and they do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would trick God and the believers, and only themselves they deceive, and they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think to beguile Allah and those who believe, and they beguile none save themselves; but they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive God and the believers, but they only deceive themselves, though they do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would deceive Allah and those who believe, whereas they deceive not save themselves, and they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive Allah and those who have faith, yet they deceive no one but themselves, but they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would they deceive Allah and those who believe, but they only deceive themselves, and realise (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (think to) deceive Allah and those who believe, while they only deceive themselves, and perceive (it) not!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive Allah and those who believe, but they deceive none except themselves, though they do not sense it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to deceive God and those who believe, but they deceive none but themselves, though they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:9] They would deceive God and the believers, by manifesting the opposite of the unbelief they hide, so that they can avoid His rulings in this world; and only themselves they deceive (yukhādi‘ūn), for the evil consequences of their deception will rebound upon them, as they are disgraced in this world when God makes known to His Prophet what they are hiding, and they will be punished in the Hereafter; and they are not aware, and they do not know that they are actually deceiving themselves (mukhāda‘a [although a third verbal form, from khāda‘a] actually denotes a one-way action, such as [when one says] ‘āqabtu al-lissa, ‘I punished the thief’ [using the third verbal form ‘āqaba]; the mention of ‘God’ in [this statement] is for [rhetorical] effect; a variant reading [for wa-mā yukhādi‘ūna] has wa-mā yakhda‘ūna).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They try to deceive Allah) contravene against Him and denying Him in secret. It is also said that this means that they were so daring with Allah to the extent that they thought they had deceived Him; (and those who believe), Abu Bakr and all the Companions of Muhammad Allah bless him and give him peace; (and they deceive) lie to (none save themselves; but they perceive not), they do not know that Allah informs His Prophet about that which lies secret in their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُخَادِعُونَ ٱللَّهَ } المحيط بجميع أحوالهم مخادعتهم مع آحاد الناس، تعالى عن ذلك { وَ } يخادعون الموحدين { ٱلَّذِينَ آمَنُوا } بإحاطة الله بتوفيقه وإلهامه؛ حفظاً لدمائهم وأموالهم منهم { وَ } هم { مَا يَخْدَعُونَ } بهذا الخداع { إِلاَّ أَنْفُسَهُم } لأن الله ومن هو في حمايته أجل من أن ينخدع منهم، فهم بهذا الخداع ما يخدعون إلا أنفسهم { وَمَا يَشْعُرُونَ } [البقرة: 9] بخداعهم؛ لأن:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: الفساد لأن المنافقين يفسدون إيمانهم بما يُخْفُون، وجملة { وما يشعرون } حالية، أي: غير شاعرين، والشعور: التفطن، وفعله من باب كَرُمَ ونَصَرَ\n وليت شعري: أي: ليت فطنتي تدرك هذا، وجملة { في قلوبهم مرض } تعليلية للمخادعة، والمرض: الضعف والفتور، وهو هنا مرض القلوب بالشك والنفاق\n والعياذ بالله\n يقول الحقّ جلّ جلاله: { وَمِنَ النَّاسِ } مَن هم مغموص عليهم بالنفاق كبعض اليهود والمنافقين، يقولون بألسنتهم ما ليس في قلوبهم، يقولون: { آمَنَّا بِاللَّهِ وبِاليَومِ الآخِر } وما هُم في عداد المؤمنين، { يُخَادِعُونَ } بزعمهم { اللَّهَ وّالَّذينَ آمَنُوا } بما يظهرون من الإيمان، { وَمَا يَخْدَعُونَ } في الحقيقة { إلاَّ أَنفُسَهُمْ } لأن وبال خداعهم راجع إليهم، { وَمَا يَشْعُرُونَ } أن خداعهم وبال عليهم، وإنما حصلت لهم هذه المخادعة لأن { في قُلُوبِهِم } مرضاً من الشك والحسد، فقلوبهم مذبذبة، وأنفسهم مغمومة، { فَزَادَهُمُ اللَّهُ مَرَضاً } على مرضهم بما ينزل عليهم من الآيات التي تفضحهم، { وَلَهُمْ } في الآخرة - إذا قدموا على الله - { عَذَابٌ } موجع بسبب تكذيبهم رسول الله أو كذبهم على الله\n هذا مُضَمَّنُ الآية\n افتتح الحق - جلّ جلاله - بذكر الذين أخلصوا دينهم لله وواطأت فيه قلوبهم ألسنتهم، ثم ثنى بالكافرين الذين محضوا الكفر ظاهراً وباطناً، ثم ثلث بالمنافقين الذين آمنوا بأفواههم ولم تؤمن قلوبهم، وهم أخبث الكفرة لأنهم خلطوا بالكفر استهزاء وخداعاً، ولذلك كانوا في الدرك الأسفل من النار\n الإشارة: ومن الناس مَن يترامى بالدعوى على الخصوصية، ويدعي تحقيق مشاهدة الربوبية، وهو في الدرك الأسفل من العمومية، يظهر خلوص الإيمان وتحقيق العرفان، وهو في أودية الشكوك والخواطر حيران، وفي فيافي القطيعة والفَرْقِ ظمآن، لسانه منطلق بالدعوى، وقلبه خارب من الهدي، يخادع الله بالرضا عن عيوبه ومساوئه، ويخادع المسلمين بتزيين ظاهره، وباطنه معمور بحظوظه ومهاويه، يتزيى بِزِيِّ العارفين ويتعامل معاملة الجاهلين، ويصدق عليه قول القائل:\n",
      "translations": []
    }
  ]
}