{
  "chapter": "البقرة",
  "text": "بئسما اشتروا۟ به انفسهم ان يكفروا۟ بما انزل الله بغيا ان ينزل الله من فضله على من يشاء من عباده فباءو بغضب على غضب وللكفرين عذاب مهين",
  "translations": [
    {
      "translation": "They bartered their lives ill denying the revelation of God out of spite that God should bestow His grace among His votaries on whomsoever He will, and thus earned wrath upon wrath. The punishment for disbelievers is ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What a mean thing it is with which they delude their minds. They reject the Guidance which Allah has sent down merely because of their grudge why Allah has in His bounty sent it to whom He chose from amongst His servants. They have thus incurred wrath after wrath, and for such disbelievers there is a disgraceful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is that for which they have sold their souls: They have refused to accept God's revelations in rebellion against the servant of God whom He has, by His Grace, chosen to grant His message. They have brought upon themselves God's wrath in addition to the wrath that they had incurred upon themselves for their previous sins. The disbelievers will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How abject is the price for which they exchange their lives that they should disbelieve in what Allah has sent down, jealous that Allah should reveal of His grace to whomever He wills of His bondmen! So they deserved wrath upon wrath; and for the disbelievers is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How bad is that for which they have sold their own selves, that they should disbelieve in that which Allah has revealed (the Qur'an), grudging that Allah should reveal of His grace unto whom He wills of His servants. So they have drawn on themselves wrath upon wrath. And for the disbelievers, there is disgracing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is that for which they have sold their souls-- that they should deny what Allah has revealed, out of envy that Allah should send down of His grace on whomsoever of His servants He pleases; so they have made themselves deserving of wrath upon wrath, and there is a disgraceful punishment for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the thing they have sold themselves for, disbelieving in that which God sent down, grudging that God should send down of His bounty on whomsoever He will of His servants, and they were laden with anger upon anger; and for unbelievers awaits a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is that for which they sell their souls: that they should disbelieve in that which Allah hath revealed, grudging that Allah should reveal of His bounty unto whom He will of His slaves. They have incurred anger upon anger. For disbelievers is a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they have sold their souls for is evil: to the denial of God's own revelation, grudging that He should reveal His bounty to whom He chooses from among His servants! They have incurred wrath upon wrath. Humiliating punishment awaits those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vile is that for which they have bartered their souls, that they should disbelieve that which Allah hath sent down, out of envy that Allah should reveal, out of His grace, unto whosoever of His bond men He listeth. Wherefore they have drawn upon themselves wrath upon wrath, and unto the infidel shall be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is that for which they have sold their souls, by defying what Allah has sent down, out of envy that Allah should bestow His grace on any of His servants that He wishes. Thus, they earned wrath upon wrath, and there is a humiliating punishment for the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Miserable is the price for which they have sold their souls, in that they deny (the revelation) which Allah has sent down, in insolent envy that Allah of His Grace should send it to any of His servants He pleases: Thus have they drawn on themselves Wrath upon Wrath. And humiliating is the punishment of those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How bad is that for which they have sold their ownselves, that they should disbelieve in that which Allah has revealed (the Quran), grudging that Allah should reveal of His Grace unto whom He will of His slaves. So they have drawn on themselves wrath upon wrath. And for the disbelievers, there is disgracing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is that for which they have bartered away their souls, that they disbelieve what Allah has sent down, grudging that Allah should send down from His bounty to whom He chooses from His worshipers! They have incurred wrath over wrath. For the unbelievers there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Miserable is what they sold their souls for—rejecting what God has revealed, out of resentment that God would send down His grace upon whomever He chooses from among His servants. Thus they incurred wrath upon wrath. And there is a demeaning punishment for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How wretched is that for which they sold themselves - that they would disbelieve in what Allah has revealed through [their] outrage that Allah would send down His favor upon whom He wills from among His servants. So they returned having [earned] wrath upon wrath. And for the disbelievers is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:90] Evil is that for which they sell their souls, that is, their share of the reward [in the Hereafter] (bi’samā, ‘evil is that [for] which’: mā here is an indefinite particle, representing ‘a thing’, and constitutes a specification qualifying the subject of [the verb] bi’s, ‘evil is’, the very thing being singled out for criticism); that they disbelieve in that, Qur’ān, which God has revealed, grudging (baghyan here is an object denoting reason for yakfurū, ‘they disbelieve’), that is, out of envy, that God should reveal (read either yunzil or yunazzil) of His bounty, the Inspiration, to whomever He will of His servants, to deliver the Message; and they were laden, they returned, with anger, from God for their disbelief in what He has revealed (the indefinite form, bighadabin, ‘with anger’, is used to emphasise the awesomeness [of the ‘anger’]), upon anger, which they deserved formerly, when they neglected the Torah and disbelieved in Jesus; and for the disbelievers there shall be a humiliating chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Evil is that which they sold their souls: that they should disbelieve in that which Allah hath revealed) the Book and the Messenger, (grudging) resentfully envious (that Allah should reveal of His bounty) that out of His bounty, Allah sent Gabriel with the Book and prophethood (unto whom He will of His bondmen) meaning Muhammad. (They have incurred anger upon anger) they deserved curse upon curse. (For disbelievers is a shameful doom) through which they shall be humiliated; and it is said: theirs is a severe punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍ } معناهُ بكفرٍ على كفرِهِمْ قالَ زيدٌ بن علي عليهما السلامُ: كفرُهُمْ بعيسى عَليهِ السَّلامُ، وكفرُهُمْ بمحمدٍ صَلى الله عليهِ وآلهِ وسلم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما ذكر سبحانه ذمائم أخلاقهم وقبائح أفعالهم، أراد أن يذكر كلاماً مطلقاً على وجه العظة والنصيحة في ضمن تعبيره وتقريعهم، ليتذكر به المؤمنون فقال: { بِئْسَمَا ٱشْتَرَوْاْ بِهِ أَنْفُسَهُمْ } بما باعوا واستبدلوا به أنفسهم معارف نفوسهم أو شهدوها أو وصولها { أَن يَكْفُرُواْ } أن يكذبوا من غاية خبائثهم وعنادهم { بِمَآ أنَزَلَ ٱللَّهُ } على من هو أهل وقابل له؛ ليهدي به من ضل عن طريق الحق مع جزمهم أيضاً بحقيته بلا شبهة ظهرت لهم، بل إنما يكفرون { بَغْياً } وحسداً على { أَن يُنَزِّلُ ٱللَّهُ } المستجمع المستحصر للقابليات والاستعدادات { مِن } محض { فَضْلِهِ } ولطفه بلا علة وغرض { عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِ } يختار ويريد من عباده الخلص، وهم الذين ارتفعت هوياتهم وتلاشت ماهياتهم واضمحلت وفنيت تعيناتهم، وصاروا ما صاروا لا إله إلا هو، ولما كفروا بالله وحدسوا لأنبيائه وبخلوا عن خزائن فضله { فَبَآءُو } رجعوا مقاربين { بِغَضَبٍ } عظيم من الله المنتقم عن جريمتهم { عَلَىٰ غَضَبٍ } عظيم إلى ما شاء الله الظهور باسم المنتقم، وقل يا أكمل الرسل للمؤمنين: { وَلِلْكَافِرِينَ } المستهينين بكتاب الله ودينه ونبيه { عَذَابٌ مُّهِينٌ } [البقرة: 90] لهم في الدنيا والآخرة، إهانتهم في الدنيا ضرب الذلة والمسكنة والجزية والصغار، وفي الآخرة حرمانهم عن الكمال الإنساني الذي يتوقع منهم، ولا عذاب أشد من ذلك\n\n\n\n\nربنا اصرف عنا عذابك وقنا من سخطك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: بئس ونعم: فعلان جامدان مختصان بالدخول على ما يدل على العموم، إما نكرة، فتنصب على التمييز المفسر للضمير الفاعل، أو معروف بأل الجنسية، فيرتفع على الفاعلية، تقول: بئس رجلاً زيدٌ، وبئس الرجل زيد، ويذكر بعد ذلك المخصوص: إما خبر عن مبتدأ مضمر، أو مبتدأ والخبر مقدم\n وإنما اخْتُصَّتَا بالدخول على ما يدل على العموم لأن { نعم } مستوفية لجميع المدح، و { بئس } مستوفية لجميع الذم\n فإذا قلت: نعم الرجل زيد، فكأنك قلت: استحق زيدٌ المدحَ الذي يكون في سائر جنسه، وكذلك تقول في بئس\n و { ما } المتصلة ببئس ونعم: نكرة منصوبة على التمييز، أي: بئس شيئاً اشتروا به أنفسهم، وهو كفرهم، أو معرفة تامة مرفوعة على الفاعل، أي: بئس الشيء شيء اشتروا به أنفسهم\n و { اشتروا } هنا بمعنى باعوا، كشَروا على خلاف الأصل، وقد يمكن ان يبقى على أصله، على ما يأتي في بيان المعنى",
      "translations": []
    }
  ]
}