{
  "chapter": "البقرة",
  "text": "واذا قيل لهم ءامنوا۟ بما انزل الله قالوا۟ نؤمن بما انزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون انۢبياء الله من قبل ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "And when it is said to them: \"believe in what God has sent down,\" they say: \"We believe what was sent to us, and do not believe what has come thereafter,\" although it affirms the truth they possess already. Say: \"Why have you then been slaying God's apostles as of old, if you do believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Believe in that which Allah has sent down,\" they say, \"We believe only in that which has been sent to us\", and reject everything else, though it is the Truth and confirms what is with them. Well, ask them, \"If you sincerely believed in what was sent down to you, why did you kill the Messengers of Allah (who were sent to you from amongst yourselves)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told to believe n God's revelations, they reply, \"We believe only in what God has revealed to us,\" but they disbelieve His other true revelations, even though these revelations confirms their own (original) Scripture. (Muhammad) ask them, \"Why did you murder God's Prophets if you were true believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe in what Allah has sent down\", they say, “We believe in what was sent down to us, and disbelieve in the rest” – whereas it is the Truth confirming what they possess! Say (to them, O dear Prophet Mohammed – peace and blessings be upon him), “Why did you then martyr the earlier Prophets, if you believed in your Book?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them (the Jews), \"Believe in what Allah has sent down,\" they say, \"We believe in what was sent down to us.\" And they disbelieve in that which came after it, while it is the truth confirming what is with them. Say (O Muhammad to them): \"Why then have you killed the Prophets of Allah aforetime, if you indeed have been believers\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, Believe in what Allah has revealed, they say: We believe in that which was revealed to us; and they deny what is besides that, while it is the truth verifying that which they have. Say: Why then did you kill Allah's Prophets before if you were indeed believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they were told, 'Believe in that God has sent down,' they said, 'We believe in what was sent down on us'; and they disbelieve in what is beyond that, yet it is the truth confirming what is with them. Say: 'Why then were you slaying the Prophets of God in former time, if you were believers?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Believe in that which Allah hath revealed, they say: We believe in that which was revealed unto us. And they disbelieve in that which cometh after it, though it is the truth confirming that which they possess. Say (unto them, O Muhammad): Why then slew ye the prophets of Allah aforetime, if ye are (indeed) believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Believe in what God has revealed,\" they say, \"We believe in what was revealed to us,\" while they deny the truth in what has been sent down after that, even though it is the Truth, confirming that which they already have. Say, \"Why did you kill God's prophets in the past, if you were true believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them believe in that which Allah hath sent down now, they say: we believe in that which hath been sent down unto Us. And they disbelieve in that which is besides that while it is the truth, confirming that which is with them. Say thou: wherefore then slew ye Allah's prophets afore, a if ye have been believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, ‘Believe in what Allah has sent down,’ they say, ‘We believe in what was sent down to us,’ and they disbelieve what is besides it, though it is the truth confirming what is with them. Say, ‘Then why would you kill the prophets of Allah formerly, should you be faithful?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them, \"Believe in what Allah Hath sent down, \"they say, \"We believe in what was sent down to us:\" yet they reject all besides, even if it be Truth confirming what is with them. Say: \"Why then have ye slain the prophets of Allah in times gone by, if ye did indeed believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them (the Jews), \"Believe in what Allah has sent down,\" they say, \"We believe in what was sent down to us.\" And they disbelieve in that which came after it, while it is the truth confirming what is with them. Say (O Muhammad Peace be upon him to them): \"Why then have you killed the Prophets of Allah aforetime, if you indeed have been believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Believe in what Allah has sent down' they reply: 'We believe in what was sent down to us' But they disbelieve in what is sent after it, although it is the truth, confirming their own Book. Say: 'Why, before did you kill the Prophets of Allah, if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Believe in what God has revealed,” they say, “We believe in what was revealed to us,” and they reject anything beyond that, although it is the truth which confirms what they have. Say, “Why did you kill God’s prophets before, if you were believers?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Believe in what Allah has revealed,\" they say, \"We believe [only] in what was revealed to us.\" And they disbelieve in what came after it, while it is the truth confirming that which is with them. Say, \"Then why did you kill the prophets of Allah before, if you are [indeed] believers?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:91] And when it was said to them, ‘Believe in what God has revealed, that is, the Qur’ān and other [Books], they said, ‘We believe in what was revealed to us’, that is, the Torah; and (wā, here indicates a circumstantial   qualifier) they disbelieve in what is beyond that, what is other than that or what came afterwards, such as the Qur’ān; yet it is the truth (wa-huwa’l-haqqu is a circumstantial qualifier) confirming (musaddiqan, a second circumstantial qualifier for emphasis) what is with them. Say, to them: ‘Why then were you slaying the prophets of God formerly, if you were believers?’ in the Torah and in it you were forbidden to kill them: this address, concerning what their forefathers did, is directed towards those present at the time of our Prophet, on account of their approval of it [that is, of what the forefathers had done].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto them) i.e. the Jews: (Believe in that which Allah hath revealed) meaning: the Qur'an, (they say: We believe in that which was revealed unto us) i.e. the Torah. (And they disbelieve in that which cometh after it) other than the Torah, (though it is the Truth) i.e. the Qur'an is the Truth (confirming) affirming the Oneness of Allah (that which they possess) of the Book. They said: \"0 Muhammad! Our forefathers were believers\". (Say) Muhammad!: (Why then slew ye the Prophets of Allah before, if ye are (indeed) believers?) if your claims are truthful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية استنكافهم واستكبارهم { إِذَا قِيلَ لَهُمْ } كلاماً صادقاً يقبله كل العقول { آمِنُواْ بِمَا أَنْزَلَ اللَّهُ } في الواقع مطلقاً { قَالُواْ } في الجواب حاصرين: بل { نُؤْمِنُ بِمَآ أُنْزِلَ عَلَيْنَا } فقط، ولا تم الإنزال لغيرنا { وَ } لا يقتصرون عليه بل { يَكْفُرونَ بِمَا وَرَآءَهُ وَ } إن كان { هُوَ ٱلْحَقُّ } المطابق للواقع في نفسه وهم يعلمون حقيته، وإن كان { مُصَدِّقاً لِّمَا مَعَهُمْ } من الكتاب، والحسد والعناد الراسخين في نفوسهم وطباعهم ومبالغتهم في العناد والإصرار على تكذيب هذا الكتاب مع أن الإيمان بأحد المتصدقين المتوافقين يوجب الإيمان بالآخر، يدل على ألاَّ إيمان لهم بالتوارة أيضاً، بل هم كافرون بها لدلالة أفعالهم وأعمالهم على الكفر بها وإن أنكروه { قُلْ } لهم إلزاماً يا أكمل الرسل: { فَلِمَ تَقْتُلُونَ } أيها المدينون بدين اليهود المؤمنون المصدقون بالتوراة { أَنْبِيَآءَ ٱللَّهِ } الحاملين لها العاملين بها { مِن قَبْلُ إِن كُنْتُمْ } صادقين في أنكم { مُّؤْمِنِينَ } [البقرة: 91] بها فثبت أنكم لستم مؤمنين بها حينئذ لتخلفكم عن مقتضاه وتكذيبكم من أنزل عليه، وإن أنكروه اذكر له:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { بغيا } مفعول من اجله ليكفروا، و { يكفرون } حال من الفاعل في { قالوا } ، و { وراء } في الأصل: مصدر جُعل ظرفاً، ويضاف إلى الفاعل ويراد به ما يتوارى به وهو خلفه، وإلى المفعول فيراد به ما يواريه وهو قدامه، ولذلك عد من الأضداد، قاله البيضاوي\n يقول الحقّ جلّ جلاله: في شأن اليهود: بئس شيئاً باعوا به حظ أنفسهم، وهو كفرهم بما أنزر الله، أو { بئسما اشتروا به أنفسهم } بحسب ظنهم، فإنهم ظنوا أنهم خلّصوا أنفسهم من العذاب بما فعلوا، وهو كفرهم بما أنزل الله على محمد نبيه صلى الله عليه وسلم بغياً وحسداً أن يكون النبيّ من غيرهم، فانقلبوا { بِغَضَبِ عَلَى غَضَبٍ } للكفر والحسد لمن هو أفضل الخلق، أو لكفرهم بمحمد - عليه الصلاة والسلام - بعد عيسى عليه السلام، أو لتضييعهم التوراة، وكفرهم بمحمد صلى الله عليه وسلم، { وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ } أي: يذلهم ويخزيهم في الدنيا والآخرة، بخلاف عذاب العاصي فإنه كفارة لذنوبه\n { وَإِذَا قِيلَ } لهؤلاء اليهود: { آمِنُوا بِمَا أَنزَلَ اللّهُ } على محمد صلى الله عليه وسلم { قَالُوا نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا } من التوراة، وهم { يَكْفُرُونَ بِمَا ورَاءَهُ } أي: بما سواه، وهو القرآن، حال كونه { مُصَدِّقاً لِّمَا مَعَهُمْ } من التوراة ومهيمناً عليه\n { قُلْ } لهم يا محمد: { فَلِمَ تَقْتُلُونَ أَنْبِيَاءَ اللّهِ مِن قَبْل } هذا الزمان، وهو محرم عليكم في التوراة، { إِن كُنتُم مُؤْمِنِينَ } به؟ فهذا يبطل دعواكم الإيمان بالتوراة إذ الإيمان بالكتاب يقتضي العمل به، وإلاَّ كان دعوى، وإن فعله أسلافكم فأنتم راضون به وعازمون عليه\n الإشارة: اعلم أن قاعدة تفسير أهل الإشارة هي أن كل عتاب توجه لمن ترك طريق الإيمان، وأنكر على أهله يتوجه مثله لمن ترك طريق مقام الإحسان، وأنكر على أهله\n\n\nوكل وعيد توعد به أهل الكفران يتوعد به مَن ترك السلوك لمقام الإحسان، غير أن عذاب أهل الكفر حسي بدني، وعذاب أهل الحجاب معنوي قلبي\n فنقول فيمن رضي بعيبه وأقام على مرض قلبه وأنكر الأطباء ووجود أهل التربية، بئسما اشتروا به أنفسهم، وهو كفرهم بما أنزل الله من الخصوصية على قلوب أوليائه بغياً وحسداً، أو جهلاً وسوء ظن، أن ينزل الله من فضله على من يشاء من عباده، فباؤوا بغضب الحجاب على غضب البعد والارتياب، أو بغضب سقم القلوب على غضب الإصرار على المساوئ والعيوب\n من لم يتغلغل في علمنا هذا مات مصراً على الكبائر وهو لا يشعر كما قال الشاذلي رضي الله عنه، ولا يصح التغلغل فيه إلا بصحبة أهله\n وللكافرين بالخصوصية عذاب الطمع وسجن الأكوان، وهما شجرة الذل والهوان\n وإذا قيل لهم: آمنوا بما أنزل الله من أسرار الحقيقة وأنوار الطريقة، قالوا: نؤمن بما أنزل علينا من ظواهر الشريعة، ويكفرون بما وراءه من أسرار الحقيقة، ككشف أسرار الذات وأنوار الصفات، وهو - أي: علم الحقيقة - الحق لأنه خالص لب الشريعة، ولله در صاحب المباحث الأصلية حيث قال:\n\nوقال أيضاً:\n\nوكان الشيخ عز الدين بن عبد السلام يقول: هل ثَمَّ شيءٌ غيرُ ما فهمناه من الكتاب والسنة؟، كان يقول ذلك إذا قيل له: إن الشيخ الشاذلي فاض اليوم بعلوم وأسرار، فلا التقى بالشيخ وأخذ بيده، قال: أي والله\n\n\n ما قعد على قواعد الشريعة التي لا تنهدم إلا الصوفية\n ويقال لمن ادعى التمسك بالشريعة وأنكر ما وراءها: فلم تشتغل بجمع الدنيا واحتكارها وتخاف من الفقر، وتهتم بأمر الرزق وتجزع من المصائب، والشريعة تنادي عليك بذم ذلك كله إن كنت مؤمناً؟!! وبالله التوفيق\n\n",
      "translations": []
    }
  ]
}