{
  "chapter": "البقرة",
  "text": "ولقد جاءكم موسى بالبينت ثم اتخذتم العجل منۢ بعده وانتم ظلمون",
  "translations": [
    {
      "translation": "Although Moses had come to you with evidence of the truth, you chose the calf in his absence, and you transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(More than that:) Moses came to you with clear Signs, yet no sooner was he away from you than you transgressed and took the calf for worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) brought you certain miracles. Not very long after, you began worshipping the calf which was nothing but senseless cruelty to yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Moosa came to you with clear signs, and after it you worshipped the calf – and you were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Musa came to you with clear proofs, yet you worshipped the calf after he left, and you were Zalimun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly Musa came to you with clear arguments, then you took the calf (for a god) in his absence and you were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses came to you with the clear signs, then you took to yourselves the Calf after him and you were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses came unto you with clear proofs (of Allah's Sovereignty), yet, while he was away, ye chose the calf (for worship) and ye were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses came to you with clear signs, but in his absence you worshipped the calf and became wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly Musa came unto you with evidence, then ye betook the calf after him, and ye were wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Moses brought you manifest proofs, but then you took up the Calf in his absence and you were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There came to you Moses with clear (Signs); yet ye worshipped the calf (Even) after that, and ye did behave wrongfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Musa (Moses) came to you with clear proofs, yet you worshipped the calf after he left, and you were Zalimun (polytheists and wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses came to you with clear signs, then you took to yourselves the calf after him and you were harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses came to you with clear proofs, yet you adopted the calf in his absence, and you were in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses had certainly brought you clear proofs. Then you took the calf [in worship] after that, while you were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:92] And Moses came to you with clear proofs, miracles, such as the staff, his hand, and the parting of the sea; then you took to yourselves the calf, as a god, after him, after he had gone to the appointment, and you were evildoers, for taking it [in worship].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Moses came unto you with clear proofs) with commands, prohibitions and signs (yet while he was away ye chose the calf) you worshipped the calf (and ye were wrong-doers) unbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَقَدْ جَآءَكُمْ مُّوسَىٰ بِٱلْبَيِّنَاتِ } الواضحات المبينات في التوراة المبينات لطريق التوحيد والإيمان، فكذبتم موسى عليه السلام على جميع بيناته بالمرة { ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ } ألهاً { مِن بَعْدِهِ } أي من بعد ما ذهب موسى إلى الطور للفوائد الأخر المتعلقة لتكميلكم { وَأَنْتُمْ } قوم { ظَالِمُونَ } [البقرة: 92] شأنكم العدول عن طريق الحق ومنهج الصواب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}