{
  "chapter": "البقرة",
  "text": "واذ اخذنا ميثقكم ورفعنا فوقكم الطور خذوا۟ ما ءاتينكم بقوة واسمعوا۟ قالوا۟ سمعنا وعصينا واشربوا۟ فى قلوبهم العجل بكفرهم قل بئسما يامركم به ايمنكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Remember when We took your pledge and exalted you on the Mount (saying:) \"Hold fast to what We have given you, firmly, and pay heed,\" you said: \"We have heard and will not obey.\" (The image of) the calf had sunk deep into their hearts on account of unbelief. Say: \"Vile is your belief if you are believers indeed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall also to mind the Covenant We made with you while We raised the Tur over you: `Follow strictly the precepts We are giving you and give ear to Our Commandments.' Your forefathers replied, \"We have heard but we will not obey.\" They were so prone to unbelief that they cherished the calf in their hearts. Tell them (O Muhammad). \"If indeed you are believers, yours is a strange Faith that enjoins you to do such evil things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Children of Israel) when We made a covenant with you, raised Mount Tur (Sinai) above you, and told you to receive devotedly what We had revealed to you and to listen to it, you said that you had listened but you disobeyed. They denied the truth and became totally devoted and full of love for the calf. (Muhammad) tell these people, \"If, in fact, you are true believers, then what your faith commands you to do is evil.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when We made a covenant with you and raised the Mount Tur (Sinai) above you; “Accept and hold fast to what We give you, and listen”; they said, “We hear and we disobey”; and the calf was still embedded in their hearts because of their disbelief; say (O dear Prophet Mohammed – peace and blessings be upon him), “What an evil command is what your faith orders you, if you are believers!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant and We raised above you the Mount (saying), \"Hold firmly to what We have given you and hear (Our Word).\" They said, \"We have heard and disobeyed.\" And their hearts absorbed (the worship of) the calf because of their disbelief. Say: \"Worst indeed is that which your faith enjoins on you if you are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made a covenant with you and raised the mountain over you: Take hold of what We have given you with firmness and be obedient. They said: We hear and disobey. And they were made to imbibe (the love of) the calf into their hearts on account of their unbelief. Say: Evil is that which your belief bids you if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took compact with you, and raised over you the Mount: 'Take forcefully what We have given you and give ear.' They said, 'We hear, and rebel'; and they were made to drink the Calf in their hearts for their unbelief. Say: 'Evil is the thing your faith bids you to, if you are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We made with you a covenant and caused the Mount to tower above you, (saying): Hold fast by that which We have given you, and hear (Our Word), they said: We hear and we rebel. And (worship of) the calf was made to sink into their hearts because of their rejection (of the covenant). Say (unto them): Evil is that which your belief enjoineth on you, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made a covenant with you and raised the mountain above you saying, \"Hold firmly to what We have given you and listen,\" you said, \"We hear, but we disobey,\" and their hearts were filled with the love of the calf, because of their refusal to acknowledge the truth. Say, \"Evil is that to which your faith enjoins you if you are indeed believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We took your bond and raised over you the Tur, saying: hold fast to that which We have vouchsafed unto you and hearken. They said: we hear and we disobey. And into their hearts the calf was made to sink because of their infidelity. Say thou: vile is that which your belief commandeth you, if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We took covenant with you and raised the Mount above you, [declaring], ‘Hold on with power to what We have given you, and do listen!’ They said, ‘We hear, and disobey,’ and their hearts had been imbued with [the love of] the Calf, due to their unfaith. Say, ‘Evil is that to which your faith prompts you, should you be faithful!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We took your covenant and We raised above you (the towering height) of Mount (Sinai): (Saying): \"Hold firmly to what We have given you, and hearken (to the Law)\": They said:\" We hear, and we disobey:\" And they had to drink into their hearts (of the taint) of the calf because of their Faithlessness. Say: \"Vile indeed are the behests of your Faith if ye have any faith!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We took your covenant and We raised above you the Mount (saying), \"Hold firmly to what We have given you and hear (Our Word). They said, \"We have heard and disobeyed.\" And their hearts absorbed (the worship of) the calf because of their disbelief. Say: \"Worst indeed is that which your faith enjoins on you if you are believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We made a covenant with you and raised the Mount above you (saying): 'Take what We have given you forcefully and hear' they replied: 'We hear, but disobey' For their disbelief, they were made to drink the calf into their very hearts. Say: 'Evil is your belief that orders you to (worship the calf), if you are indeed believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a covenant with you, and raised the Mount above you: “Take what We have given you firmly, and listen.” They said, “We hear and disobey.” And their hearts became filled with the love of the calf because of their disbelief. Say, “Wretched is what your faith commands you to do, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall] when We took your covenant and raised over you the mount, [saying], \"Take what We have given you with determination and listen.\" They said [instead], \"We hear and disobey.\" And their hearts absorbed [the worship of] the calf because of their disbelief. Say, \"How wretched is that which your faith enjoins upon you, if you should be believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:93] And when We made a covenant with you, to act according to what is in the Torah, and raised over you the Mount, to drop it on you, when you had refused to accept it; We said, ‘Take forcefully, seriously and with effort, what We have given you, and listen’, to what you have been commanded, and be prepared to accept it, They said, ‘We hear, your words, and disobey’, your command; and they were made to drink the calf in their hearts, that is to say, the love of it [the golden calf] intoxicated their hearts in the way that wine does, on account of their unbelief. Say, to them: ‘Evil is that, thing, which your belief, in the Torah, enjoins on you, [in the way of] the worship of the [golden] calf, if you are believers’, in it, as you claim; meaning, you are not believers, for faith does not command that you worship the calf — their forefathers are meant here. Likewise, you do not believe in the Torah, because you have denied [the prophethood of] Muhammad (s), whereas faith in it does not command you to reject him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We made with you a covenant) when we took your consent (and caused the Mount to tower above you) extracted it, elevated it and fixed it above your heads: (Hold fast by that which We have given you) be diligent and earnest with what We have given you of the Book, (and hear) obey what you have been commanded, (they said: We hear and rebel) it is as if they were saying: if it were not for the mountain we would have heard your saying and disobeyed your command. (And (worship of) the calf was made to sink into their hearts) their love of worshipping the calf sank into their hearts (because of their rejection) as a punishment for their disbelief. (Say (unto them)) Muhammad! If love of worshipping the calf is equal in your eyes to love of your Creator, then: (Evil is that which your belief enjoineth on you) the worship of the calf enjoins on you, (if ye are believers) if you are truthful that your forefathers were believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَأُشْرِبُواْ فِي قُلُوبِهِمُ ٱلْعِجْلَ } قالَ زَيدُ بن علي عليهما السلامُ\n معناهُ سُقوا حُبَّ العِجْلِ، حتى غلبَ ذَلِكَ عليهم، وخلصَ إِلى قلوبِهِمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن أردت يا أكمل الرسل زيادة إلزامهم وإسكاتهم، اذكر لهم نيابة عنا وقت { إِذْ أَخَذْنَا } منكم أيها الناقضون لعهودنا والمنكرون لكتابنا { مِيثَاقَكُمْ } الذي واثقكم معنا ثم استثقلتموه وتركتموه { وَ } ألجأناكم على إيفائه بأن { رَفَعْنَا فَوْقَكُمُ ٱلطُّورَ } معلقاً وقلنا لكم استعلاءً وتجبراً { خُذُواْ } وامتثلوا { مَآ ءَاتَيْنَٰكُم } على نبيكم من الأوامر والنواهي { بِقُوَّةٍ } جدٍ واجتهادٍ { وَٱسْمَعُواْ } من المعارف والحقائق بسمع الرضا ونية الكشف { قَالُواْ } ظاهراً: { سَمِعْنَا } ما أمرتنا به { وَ } قالوا خفية: { عَصَيْنَا } عن الامتثال بها { وَ } سبب عصيانهم أنهم لدناءتهم وسخافة طبعهم { أُشْرِبُواْ } تداخلوا وتجبلوا وتطيبوا { فِي قُلُوبِهِمُ } التي هي محل الإيمان والتوحيد منازل العرفان واليقين { ٱلْعِجْلَ } أي: محبة العجل المسترذل والمستقبح المستحدث من حليهم ما هي إلا { بِكُفْرِهِمْ } بالله وبكتبه ورسله وحصرهم ظهرو الحق في مظهر مخصوص، ومع ذلك يدعون الإيمان بموسى { قُلْ } لهم يا أكمل الرسل تقريعاً لهم على وجه التعريض: { بِئْسَمَا يَأْمُرُكُمْ بِهِ إِيمَانُكُمْ } من إنكار كتب الله وتكذيب رسلهم وقتلهم بغير حق واعتقادهم الشريك لله { إِنْ كُنْتُمْ } صادقين في كونكم { مُّؤْمِنِينَ } [البقرة: 93]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}