{
  "chapter": "البقرة",
  "text": "قل ان كانت لكم الدار الءاخرة عند الله خالصة من دون الناس فتمنوا۟ الموت ان كنتم صدقين",
  "translations": [
    {
      "translation": "Tell them: \"If you think you alone will abide with God to the exclusion of the rest of Mankind, in the mansions of the world to come, then wish for death if what you say is true.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"If the abode of the Hereafter with Allah is exclusively reserved for you and not for the rest of mankind, then you should long for death, if you arc sincere in your claim.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"If your claim is true that the home with God in the everlasting life hereafter is for you alone, you should have a longing for death\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “If the abode of the Hereafter in the sight of Allah is for you alone and none else, then long for death if you are truthful!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to (them): \"If the abode of the Hereafter with Allah is indeed for you especially and not for others of mankind, then long for death if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If the future abode with Allah is specially for you to the exclusion of the people, then invoke death if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the Last Abode with God is yours exclusively, and not for other people, then long for death -- if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them): If the abode of the Hereafter in the providence of Allah is indeed for you alone and not for others of mankind (as ye pretend), then long for death (for ye must long for death) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If God's abode of the Hereafter is for you alone, to the exclusion of all others, then wish for death, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if for you alone is the abode of the Hereafter with Allah to the exclusion of mankind, then wish for death if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If the abode of the Hereafter were exclusively for you with Allah, and not for other people, then long for death, should you be truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If the last Home, with Allah, be for you specially, and not for anyone else, then seek ye for death, if ye are sincere.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to (them): \"If the home of the Hereafter with Allah is indeed for you specially and not for others, of mankind, then long for death if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If the abode of the Everlasting Life is with Allah for you especially, to the exclusion of all other people, then long for death if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If the Final Home with God is yours alone, to the exclusion of all other people, then wish for death if you are sincere.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"If the home of the Hereafter with Allah is for you alone and not the [other] people, then wish for death, if you should be truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:94] Say, to them: ‘If the Abode of the Hereafter, that is, Paradise, with God is purely yours, that is, exclusively, and not for other people, as you allege, then long for death — if you speak truly’ (here both conditionals are connected to the verb tamannū, ‘long for’, so that the first is dependent upon the second, in other words, ‘If you speak truly when you claim that it is yours, then you will naturally incline to what is yours, and since the path to it is death, long for it [death]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say (unto them): If the abode of the Hereafter) i.e. Paradise (in the providence of Allah is indeed for you alone) specifically for you alone (and not for others of mankind) and not for the believers in Muhammad and his Companions ((as you pretend), then long for death (for ye must long for death)) ask for death (if ye are truthful) in your claim.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما اشتهر بين الناس قولهم: لن يدخل الجنة إلا من كان هوداً، وامتنع كثير من الناس القاصدين دين الإسلام وتغمم ضعفاء المسلمين أيضاً من هذا الكلام، أشار سبحانه إلى دفعه مخاطباً لرسوله معكم: { قُلْ } لهم نيابة عنا يا أكمل الرسل: { إِن كَانَتْ } محصورة مسلمة { لَكُمُ ٱلدَّارُ ٱلآخِرَةُ عِندَ ٱللَّهِ } التي هي منازل الشهداء والسعداء ومقام العرفاء والأمناء { خَالِصَةً } خاصة مخصوصة { مِّن دُونِ } شركة { ٱلنَّاسِ } المنسوبين إلى الأديان الأخر { فَتَمَنَّوُاْ } عن صميم القلب ومحض الرغبة { ٱلْمَوْتَ } المقرب لكم إليها والموصل إلى لذائذها، كما ينتمناه خلص المؤمنين بوحدانية الله في أكثر أوقاتهم\n\n\n\n\nقال المرتضى كرم الله وجهه: \" لابن أبي طالب أشوق إلى الموت من الطفل بثدي أمه \" ، وقال أيضاً: \" لا أبالي سقطت على الموت أو سقط الموت عليَّ \" ، وقال أيضاً:\n\nوقال عمار رضي الله عنه حين استشهد: \" الآن ألقى الأحبة محمداً وصحبه \" وأنتم أيضاً تمنون الموت المقرب { إِن كُنْتُمْ صَادِقِينَ } [البقرة: 94] في دعواكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خالصة } خبر كان، و { عند } متعلق بكان على الأصح\n يقول الحقّ جلّ جلاله: { قل } يا محمد لبني إسرائيل الذين ادعوا أن الجنة خاصة بهم: { إن كانت لكم الدار الآخرة عند الله } أي: في غيبه، { خالصة } لكم { من دون } سائر { الناس } ، أو من دون المسلمين، { فتمنوا الموت إن كنتم صادقين } في اختصاصكم بهم، فإن العبد إذا تحقق أنه صائر إليها اشتاق إلى الموت الذي يوصل إليها، كما قال عمار رضي الله عنه عند موته:\n\nوقال حذيفة رضي الله عنه حين احتضر: جَاءَ حَبِيبٌ عَلَى فَاقَة، لاَ أَفْلَحَ مَنْ نَدِم\n أي: على التمني، أو على الدنيا",
      "translations": []
    }
  ]
}