{
  "chapter": "البقرة",
  "text": "ولن يتمنوه ابدۢا بما قدمت ايديهم والله عليمۢ بالظلمين",
  "translations": [
    {
      "translation": "But they will surely not wish for death because of what they had done in the past; and God knows the sinners well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe it that they will never wish for it, for (they are fully aware of the consequences of) what they have sent before them for the Hereafter. And Allah knows well the mentality of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they can never have a longing for death because of what they have done. God knows the unjust well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will never long for it, because of the evil deeds they have done in the past; and Allah knows the unjust, very well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never long for it because of what their hands have sent before them (i.e. what they have done). And Allah is Aware of the Zalimin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will never invoke it on account of what their hands have sent before, and Allah knows the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never long for it, because of that their hands have forwarded; God knows the evildoers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never long for it, because of that which their own hands have sent before them. Allah is aware of evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never wish for death, because of what their own hands have sent on before them; God is fully aware of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will by no means ever wish for it, because of that which their hands have sent on before; and Allah is the Knower of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will not long for it ever because of what their hands have sent ahead, and Allah knows best the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never seek for death, on account of the (sins) which their hands have sent on before them. and Allah is well-acquainted with the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never long for it because of what their hands have sent before them (i.e. what they have done). And Allah is All-Aware of the Zalimun (polytheists and wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never long for it (death), because of what their hands forwarded; and Allah knows the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never wish for it, because of what their hands have forwarded. God is aware of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they will never wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:95] But they will never long for it, because of that which their own hands have sent before them, as a result of their rejection of the Prophet (s), the consequence of their mendacity. God knows the evildoers, the disbelievers and He will requite them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But they will never long for it) they will never ask for death, (because of that which their own hands have sent before them) because of what they themselves have done in the religion of Judaism. (And Allah is Aware of evil-doers) i.e. the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { لَنْ يَتَمَنَّوْهُ أَبَداً بِمَا قَدَّمَتْ } كسبت { أَيْدِيهِمْ } أنفسهم من الحرص وطول الأمل والاستلذاذ باللذات الحسية والوهمية من الجاه والمنزل والمكانة بين الناس، والاستكبار عليهم، ألا تراهم يتوجهون ويرجعون إلى الله عند نزول البلاء المشعر بتعجيل الموت المقرب استكشافاً، وإذا كشف ولو على ما هم عليه مدبرين؟! { وَٱللَّهُ } المحيط بسرائرهم وضمائرهم { عَلِيمٌ بِٱلظَّالِمينَ } [البقرة: 95] القائلين بأفواههم ما ليس في قلوبهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ولن يتمنوه أبداً } بسبب { ما قدمت أيديهم } من الكفر والعصيان، فما تمناه أحد منهم قط، قال ابن عباس: لو أن اليهود تمنوا الموت لماتوا ورأوا مقاعدهم في النار\n وقال في الأحياء: دعا - عليه الصلاة والسلام - اليهود إلى تمني الموت، وأخبرهم بأنهم لا يتمنونه، فحيل بينهم وبين النطق بذلك\n وذكر غيره: أن بعضهم تمناه، فما جاءت العشاء حتى أخذته الذّبحة في حلقه فمات\n { والله عليم بالظالمين } ، فيه تهديد لهم وتنبيه على أنهم ظالمون في دعوى ما ليس لهم، ونفيه عمن هو لهم\n الإشارة: في هذه الآية ميزان صحيح توزن به الأعمال والأحوال ويتميز به المدعون من الأبطال، فكل عمل يهدمه الموت فهو مدخول، وكل حال يهزمه الموت فهو معلول، وكل من فرّ من الموت، فهو في دعواه المحبة كذاب، فمن ادعى الخصوصية على الناس يختبر بهذه الآية\n والناس في حب البقاء في الدنيا على أربعة أقسام: رجل أحب البقاء في الدنيا لاغتنام لَذَّاته ونيل شهواته، قد طرح أخراه، وأكبَّ على دنياه، واتخذ إلهه هواه، فأصمه ذلك وأعماه، إن ذُكر له الموت فرّ عنه وشرد، وإن وعِظَ أنِف وعَنَدَ، عمره ينقص، وحرصه يزيد، وجسمه يبلى، وأمله جديد، وحتفه قريب، ومطلبه بعيد، فهذا إن لم تكن له عناية أزلية، وسابقة أولية فيمسك عليه الإيمان، ويختم له بالإسلام، وإلا فقد هلك\n ورجل قد أزيل عن عينه قذاها، وأبصر نفسه وهواها، وزجرها ونهاها، قد شمر ليتلافى ما فات، ونظر فيما هو آت، وتأهب لحلول الممات، والانتقال إلى محلة الأموات، ومع هذا فإنه يكره الموت أن يشاهد وقائعه، أو يرى طلائعه، وليس يكره الموت لذاته، ولا لأنه هَادِمْ لَذَّاتِهِ، لكنه يخاف أن يقطعه عن الاستعداد ليوم المعاد، ويكره أن تطوى صحيفةِ عَمَلِهِ قبل بلوغ أمله، وأن يبادر بأجله قبل صلاح خلله، فهو يريد البقاء في هذه الدار لقضاء هذه الأوطار، فهذا ما أفضل حياته: وأطيب مماته! لا يدخل تحت قوله صلى الله عليه وسلم:\n\n\n\n \" مَنْ كَرِهَ لِقَاءَ اللّهِ كره اللّهُ لِقَاءَه \"\n \n\nورجل آخر قد عرف الله تعالى بأسمائه الحسنى، وصفاته العليا، وشهد ما شهد من كمال الربوبية، وجمال حضرة الألوهية، فملأت عينه وقلبه، وأطاشت عقله ولبّه، فهو يحن إلى ذلك المشهد، ويستعجل إنجاز ذلك الموعد، قد علم أن الحياة الدنيوية حجابٌ بينه وبين محبوبة، وسترٌ مُسدل بينه وبين مطلوبه، فهذا من المحبين العشاق، قد حنّ إلى الوصال والتلاق، أحب لقاء الله فأحب الله لقاءه، فما أحسن حياته ولقاءه! ورجل آخر قد شهد ما شاهد ذلك، وربما زاد على ما هنالك، لكنه فوّض الأمر إلى خالقه، وسلّم الأمر لبارئه، فلم يرض إلا ما رضي له، ولم يرد إلا ما أريد به، وما اختار إلا ما حكم به فيه، إن أبقاه في هذه الدار أبقاه، وإن أخذه فهو بغيته ومناه، فهذا من العارفين المقربين\n جعلنا الله منهم بمنِّه وكرمه\n آمين\n\n",
      "translations": []
    }
  ]
}