{
  "chapter": "البقرة",
  "text": "ولتجدنهم احرص الناس على حيوة ومن الذين اشركوا۟ يود احدهم لو يعمر الف سنة وما هو بمزحزحه من العذاب ان يعمر والله بصيرۢ بما يعملون",
  "translations": [
    {
      "translation": "You will see they are covetous of life more than other men, even more than those who practise idolatry. Each one of them desires to live a thousand years, although longevity will never save them from punishment, for God sees all they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will find that, of all mankind, they are the greediest for life, nay, they are even greedier than the mushriks. Each one of them longs to have a life Of a thousand years, but a long life can, by no means, remove them away from the scourge, for Allah is watching whatever they are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, you will find them the greediest of all men, even more than the pagans, for life. They would each gladly live for a thousand years, but such a long life would not save them from the torment. God sees what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will surely find them the greediest among mankind for life; and (likewise) among the polytheists (idolaters); each one of them yearns to live a thousand years; and the grant of such age will not distance him from the punishment; and Allah is seeing their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you will find them (the Jews) the greediest of mankind for life and (even greedier) than those who ascribe partners to Allah. One of them wishes that he could be given a life of a thousand years. But the grant of such life will not save him even a little from (due) punishment. And Allah is Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will most certainly find them the greediest of men for life (greedier) than even those who are polytheists; every one of them loves that he should be granted a life of a thousand years, and his being granted a long life will in no way remove him further off from the chastisement, and Allah sees what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thou shalt find them the eagerest of men for life. And of the idolaters; there is one of them wishes if he might be spared a thousand years, yet his being spared alive shall not remove him from the chastisement. God sees the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou wilt find them greediest of mankind for life and (greedier) than the idolaters. (Each) one of them would like to be allowed to live a thousand years. And to live (a thousand years) would be no means remove him from the doom. Allah is Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will find them clinging to life more eagerly than any other people, even the polytheists. Any of them would wish to be given a life of a thousand years, though even such a long life would not save them from [Our] punishment; and God sees all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely thou wilt find them the greediest of men after life, even greedier than those who associate. Each one of them would fain life for a thousand years, and this will not save him from the torment, even if he hath lived so long. And Allah is the Beholder of that which they work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, you will find them the greediest for life, of all people even the idolaters. Each of them is eager to live a thousand years, though it would not deliver him from the punishment, were he to live [that long]. And Allah watches what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wilt indeed find them, of all people, most greedy of life,-even more than the idolaters: Each one of them wishes He could be given a life of a thousand years: But the grant of such life will not save him from (due) punishment. For Allah sees well all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you will find them (the Jews) the greediest of mankind for life and (even greedier) than those who - ascribe partners to Allah (and do not believe in Resurrection - Magians, pagans, and idolaters, etc.). Everyone of them wishes that he could be given a life of a thousand years. But the grant of such life will not save him even a little from (due) punishment. And Allah is All-Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, you will find them more eager than other people for this life. And (more than) those who disbelieve. Each one of them wishes to live a thousand years. But his prolonged life will surely not remove him from the punishment. Allah is the Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will find them, of all mankind, the most eager for life, even more than the polytheists. Every one of them wishes he could live a thousand years; but to be granted a long life will not nudge him from the punishment. God is Seeing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will surely find them the most greedy of people for life - [even] more than those who associate others with Allah. One of them wishes that he could be granted life a thousand years, but it would not remove him in the least from the [coming] punishment that he should be granted life. And Allah is Seeing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:96] And you shall find them (the lām of la-tajidannahum is for oaths) the people most covetous of life, and, more covetous of it than, the idolaters, who reject the [idea of the] Resurrection, for the former know that their journey’s end will be the Fire, while the idolaters do not believe even in this; any one of them would love, wishes, that he might be given life for a thousand years (law yu‘ammar, ‘[if only] he might be given life’: the particle law, ‘if only’, relates to the verbal noun and functions with the sense of an, ‘that’, and together with its relative clause explains the [implicit] verbal noun in the object of the verb yawaddu, ‘he would love’); yet, any one of them, his being given life (an yu‘ammara, ‘that he should be given life’, constitutes the subject of the verb muzahzihihi, ‘that it should budge him’ [this verb comes later], as though it were ta‘mīruhu, ‘the giving of life to him’) shall not budge, remove, him from the chastisement, of the Fire. God sees what they do (ya‘malūna may be alternatively read ta‘malūna, ‘you do’), and will requite them. [‘Abd Allāh] Ibn Sūryā asked the Prophet (s), or ‘Umar [b. al-Khattāb], about which angel brings down the revelation, and he replied that it was Gabriel; he [Ibn Sūryā] then said, ‘He is our enemy, because he brings chastisement with him; had it been Michael, we would have believed in him, because he brings fertility and security.’ Then, the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thou) Muhammad! (wilt find them) the Jews (greediest of mankind for any life) to remain in this world (and (greedier) than the idolaters) even greedier than the Arab idolaters. ((Each) one of them would like) would hope (to be allowed to live a thousand years. And to live (that long) would by no means remove him) save him (from the doom) if he were to live a thousand years. (And Allah is Seer of what they do) of contraventions, rebellion and what they conceal about the description and traits of Muhammad (pbuh). 16\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ ٱلْعَذَابِ } أَي بِمُبعِدِهِ مِنْ العَذَابِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله يا أكمل الرسل، إن فتشت عن أحوالهم واستكشفت عن ضمائرهم { لَتَجِدَنَّهُمْ } أي: اليهود وجداناً صادقاً { أَحْرَصَ ٱلنَّاسِ عَلَىٰ حَيَاةٍ } دائمةٍ مستمرةٍ من نوع الإنسان عموماً وخصوصاً { وَمِنَ ٱلَّذِينَ أَشْرَكُواْ } واعتقدوا ألاَّ حياة إلا في دار الدنيا، بل { يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ } ليزيد عليه ألفاً آخر، وهكذا { وَ } الحال أنه بهذه المحبة { مَا هُوَ بِمُزَحْزِحِهِ } بمبعد نفسه { مِنَ ٱلْعَذَابِ أَن يُعَمَّرَ } إلى غاية ما يتمناه ويحب، بل ما زاد إلا عذاباً فوق العذاب { وَٱللَّهُ } المجازي لهم أعمالهم { بَصِيرٌ بِمَا يَعْمَلُونَ } [البقرة: 96] أي: بجميع أعمالهم في جميع أعمارهم بحيث لا يعزب عن علمه شيء منها\n\n\n\n\nلم لما ظهر الإسلام وترقى أمره وارتفع قدره واشتهر إنزال القرآن الناسخ لجميع الأديان اضطرب اليهود ووقعوا فيما وقعوا، سألوا رسول الله صلى الله عليه وسلم عمن أنزل عليه من الملائكة، فقال صلى الله عليه وسلم: أخونا جبريل - صلوات الرحمن عليه - قالوا: هو عدونا القديم، ليس هذا أول ظهوره بالعداوة، بل ظهر علينا بالعداوة من قبل مراراً، وهو بصدد نسخ ديننا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}