{
  "chapter": "البقرة",
  "text": "قل من كان عدوا لجبريل فانه نزله على قلبك باذن الله مصدقا لما بين يديه وهدى وبشرى للمؤمنين",
  "translations": [
    {
      "translation": "Say: \"Whosoever is the enemy of Gabriel who revealed the word of God to you by the dispensation of God, reaffirming what had been revealed before, and is a guidance and good news for those who believe, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"Whoever is enemy to Gabriel, should understand that he has, by Allah's command, revealed to your heart the Qur'an which confirms what was revealed before it, and brings Guidance and glad tidings to the Believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell the people, whoever is an enemy to Gabriel who has delivered the Book to your heart as a guide and as joyful news to the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “Whoever is an enemy to Jibreel (Gabriel)” – for it is he who has brought down this Qu’ran to your heart by Allah’s command, confirming the Books before it, and a guidance and glad tidings to Muslims. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): \"Whoever is an enemy to Jibril (Gabriel) (let him die in his fury), for indeed he has brought it (this Qur'an) down to your heart by Allah's permission, confirming what came before it (i.e. the Tawrah and the Injil) and guidance and glad tidings for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Whoever is the enemy of Jibreel-- for surely he revealed it to your heart by Allah's command, verifying that which is before it and guidance and good news for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Whosoever is an enemy to Gabriel -- he it was that brought it down upon thy heart by the leave of God, confirming what was before it, and for a guidance and good tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad, to mankind): Who is an enemy to Gabriel! For he it is who hath revealed (this Scripture) to thy heart by Allah's leave, confirming that which was (revealed) before it, and a guidance and glad tidings to believers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Anyone who is an enemy of Gabriel, who by God's leave has brought down to your heart [the Quran] fulfilling that [predictions about the last prophet in the earlier revelations] which precedes it, and is a guidance and good news for the faithful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: whosoever is an enemy unto Jibril, ----then verily he it is Who hath brought down this Revelation, by Allah's command, to thine heart, confirming that which went before, and a guidance and glad tidings unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Whoever is an enemy of Gabriel [should know that] it is he who has brought it down on your heart with the will of Allah, confirming what has been [revealed] before it and as a guidance and good news for the faithful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Whoever is an enemy to Gabriel-for he brings down the (revelation) to thy heart by Allah's will, a confirmation of what went before, and guidance and glad tidings for those who believe,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad Peace be upon him): \"Whoever is an enemy to Jibrael (Gabriel) (let him die in his fury), for indeed he has brought it (this Quran) down to your heart by Allah's Permission, confirming what came before it [i.e. the Taurat (Torah) and the Injeel (Gospel)] and guidance and glad tidings for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Whoever is an enemy of Gabriel, indeed, he has brought it down by the permission of Allah to your heart, confirming what was before it and a guidance and glad tidings to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Whoever is hostile to Gabriel—it is he who revealed it to your heart by God’s leave, confirming what preceded it, and guidance and good news for the believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Whoever is an enemy to Gabriel - it is [none but] he who has brought the Qur'an down upon your heart, [O Muhammad], by permission of Allah, confirming that which was before it and as guidance and good tidings for the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:97] Say, to them: ‘Whoever is an enemy to Gabriel, let him die in exasperation — he it was that brought it, the Qur’ān, down upon your heart by the leave, by the command, of God, confirming what was before it, of scriptures, a guidance, from error, and good tidings, of Paradise, for the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah, Exalted is He, revealed the following verse about the saying of one of the Jews, 'Abdullah Ibn Suriyyah, that Gabriel was the enemy of the Jews, saying: (Say) Muhammad!: (Who is an enemy to Gabriel!) is automatically an enemy to Allah. (For he it is who hath revealed to your heart) sent Gabriel to you with the Qur'an (by Allah's leave) by Allah's command, (confirming) affirming the Oneness of Allah (that which was before it) of the Book, (and a guidance) from error (and glad tiding) good news (to believers) that Paradise will be theirs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهُ تعالى: { قُلْ مَن كَانَ عَدُوّاً لِّجِبْرِيلَ } فجبرُ: عبدٌ وإيلٌ: هو الله تعالى: مِثلُ عبدُ الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقال سبحانه وتعالى مخاطباً لنبيه: { قُلْ } يا أكمل الرسل { مَن كَانَ عَدُوّاً لِّجِبْرِيلَ } أي: لمن يدعي عداوة أمايننا جبرائيل بواسطة إنزال القرآن، أولئك لا وجه لاتخاذكم جبرائيل عدواً { فَإِنَّهُ } إنما { نَزَّلَهُ } أي: القرآن { عَلَىٰ قَلْبِكَ } يا أكمل الرسل الذي هو وعاء الإيمان والإسلام ومهبط الوحي والإلهام { بِإِذْنِ ٱللَّهِ } المنزل إلقاء إليه، وأمره إياه بتنزيل لا من عند نفسه حتى يتخذوه عدواً، وإن اتخذوه عدواً فاتخذوا الله المنزل عدواً مع أنه لا وجه للعداوة أصالاً؛ لكون المنزل عيه { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ } من الكتب المنزلة { وَهُدًى } يهتدي به إلى طريق الإيمان والتوحيد { وَبُشْرَىٰ } بالنعيم الدائم الباقي { لِلْمُؤْمِنِينَ } [البقرة: 97] المهتدين به، جعلنا الله ممن اقتضى أثرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من } شرطية وجوابها محذوف، أي: فليمت غيظاً، أو { فإنه نزله } على معنى: مَن عادى منهم جبريل فقد خلع ريقة الإنصاف، أو كفر بما معه من الكتاب لأنه نزل بكتاب مصدقاً لما قبله من الكتب، وجبريل فيه ثماني لغات، أربع قرئ بهن\n وهي: جَبْرَئِيل كسلسبيل\n وجَبْرَئِل كجحْمرش، وجَبْريل – بفتح الجيم – بلا همز، وجِبْرِيل بكسرها، وأربع شواذ: جِبْرَالُ، وجَبْرَائِيل، وجَبْرِائل، وجَبْرين بالنون، ومعناه: عبد الله\n وفي ميكائيل أربع لغات: مكيائيل ممدود، وميكائل مقصور، وميكئل مهموز مقصور، وميكال على وزن ميعاد\n يقول الحقّ جلّ جلاله: في الرد على اليهود، كابن صُوريا وغيره، حيث قالوا للنبيّ صلى الله عليه وسلم: من الذي يأتيك بالوحي؟ فقال:\n\n \" جبريل \" \n\n، فقالوا: ذلك عدونا من الملائكة لأنه ينزل بالشدة والعذاب، ولو كان ميكائيل لاتبعناك لأنه ينزل بالخصب والسلم، فقال تعالى: { مَن كَانَ عَدُوّاً لِّجِبْريلَ } فليمت غيظاً، فإنه هو الذي نزَّل القرآن { عَلَى قَلْبِكَ بإِذْنِ اللّهِ مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ } من الكتب، وهداية { وَبُشْرَى لِلْمُؤْمِنِينَ } ، فإن كان ينزل بالشدة والعذاب على الكافرين، فإنه ينزل بالهداية والبشارة على المؤمنين\n ومن كان عدواً لجبريل فإنه عدو لله، إذ هو رسوله للأنبياء، وصفيه من الملائكة، وعدو أيضاً لميكائيل فإنه وزيره، وللرسل أيضاً فإنه سفيرهم، و { مَن كَانَ عَدُوّاً للّهِ وَمَلائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ } فإن الله عدو له",
      "translations": []
    }
  ]
}