{
  "chapter": "البقرة",
  "text": "من كان عدوا لله وملئكته ورسله وجبريل وميكىل فان الله عدو للكفرين",
  "translations": [
    {
      "translation": "Whosoever is the enemy of God and His angels and apostles, and of Gabriel and Michael, then God is the enemy of such unbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If their enmity to Gabriel is due to this, let them understand that) whoever is enemy to Allah, His Angels, His Messengers, Gabriel and Michael, Allah is enemy to such disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and as a confirmation of (original) Scripture and whoever is the enemy of God, His angels, His Messenger, Gabriel and Michael, should know that God is the enemy of those who hide the Truth..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Whoever is an enemy to Allah, and His angels and His Noble Messengers, and Jibreel and Mikaeel (Michael) -, then (know that), Allah is an enemy of the disbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is an enemy to Allah, His Angels, His Messengers, Jibril and Mika'il, then verily, Allah is an enemy to the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is the enemy of Allah and His angels and His apostles and Jibreel and Meekaeel, so surely Allah is the enemy of the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is an enemy to God and His angels and His Messengers, and Gabriel, and Michael - surely God is an enemy to the unbelievers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is an enemy to Allah, and His angels and His messengers, and Gabriel and Michael! Then, lo! Allah (Himself) is an enemy to the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whoever is an enemy of God, His angels, or His messengers, or of Gabriel or Michael, will surely find that God too is the enemy of those who deny the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever is an enemy unto Allah and His angels and His apostles and Jibril and Mikail, then verily Allah is an enemy unto the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say,] ‘Whoever is an enemy of Allah, His angels and His apostles and Gabriel and Michael, [let him know that] Allah is the enemy of the faithless.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is an enemy to Allah and His angels and messengers, to Gabriel and Michael,- Lo! Allah is an enemy to those who reject Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is an enemy to Allah, His Angels, His Messengers, Jibrael (Gabriel) and Mikael (Michael), then verily, Allah is an enemy to the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is an enemy of Allah, His Angels, His Messengers, Gabriel, and Michael indeed Allah is the enemy of the unbelievers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is hostile to God, and His angels, and His messengers, and Gabriel, and Michael—God is hostile to the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever is an enemy to Allah and His angels and His messengers and Gabriel and Michael - then indeed, Allah is an enemy to the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:98] Whoever is an enemy to God and His angels and His messengers, and Gabriel (read Jibrīl or Jabrīl, Jibra’il or Jabra’il, Jibra’īl or Jabra’īl), and Michael (Mīkāl, also read Mīkā’īl, or Mīkā’il; a supplement to malā’ikatihi, ‘His angels’, an example of the specific being supplemented to the collective) — then surely God is an enemy to the disbelievers’ (He says ‘to the disbelievers’ instead of ‘to them’ in order to point out their status).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who is an enemy to Allah, and His angels and His Messengers, and Gabriel and Michael! Then, Lo! Allah (Himself) is an enemy to disbelievers) to the Jews, just as Gabriel, Michael and all the believers are enemies of the Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم أيضاً يا أكمل الرسل: { مَن كَانَ عَدُوّاً للَّهِ } ينقض عهوده، وعدم الامتثال بأوامره والاجتناب عن نواهيه { وَمَلاۤئِكَتِهِ } بنسبتهم إلى أشيائهم منزوهون عنها { وَرُسُلِهِ } بالتكذيب والقتل والاستهزاء والإهانة، وخصوصاً من الملائكة { وَجِبْرِيلَ وَمِيكَٰلَ } كلا الأمينين عند الله بنسبة الخيانة والعداوة إليهما فهو كافر بالله بثبوت واحدٍ منهما { فَإِنَّ ٱللَّهَ عَدُوٌّ لِّلْكَافِرِينَ } [البقرة: 98] بكفرهم وإصرارهم وعنادهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وعطف جبريل وميكائيل من عطف الخاص على العام لزيادة شرفهما، ووضع الظاهر موضع الضمير في قوله: { عَدُوٌّ لِّلْكَافِرينَ } ولم يقل: لهم، تسجيلاً عليهم بالكفر، وبيان أن الله إنما عاداهم لكفرهم، وأن عداوة الملائكة والرسل كفر، عصمنا الله من موارد الردى، آمين\n الإشارة: إذا كانت معاداة الملائكة والرسل هي معاداة الله، فكذلك معاداةُ أوليائه هي معاداة الله أيضاً، ولذلك قال تعالى:\n\n \" مَنْ عَادَى لِي وَليّاً فقد آذنني بالحَرْب \" \n\nفالبعض هو الكل، ويؤخذ بالمفهوم أن محبة الملائكة والرسل هي محبة الله\n وكذلك محبة أولياء الله هي محبة الله، وكذلك أيضاً محبة عباد الله هي محبة الله، ومعاداتهم معاداة الله\n \" الخَلقُ عِيَالُ الله، وأحبُّ الخَلقِ إلى اللّهِ أنفعهُمْ لِعيَاله \"\n وكل مَن ادعى أنه يحب الله وفي قلبه عداوة لمسلم فهو كاذب، وكل مَن ادعى أنه يعرف الله وفي قلبه إنكار على مخلوق فهو في دعواه أيضاً كاذب، فالواجب على العبد أن يُحب جميع العباد، من كان طائعاً فظاهر، ومَن كان عاصياً أحب له التوبة والإنابة، ومَن كان كافراً أحب له الإسلام والهداية، ولا يكره من العبد إلا فعله، ولله دَر القائل:\n",
      "translations": []
    }
  ]
}