{
  "chapter": "البقرة",
  "text": "ولقد انزلنا اليك ءايتۭ بينت وما يكفر بها الا الفسقون",
  "translations": [
    {
      "translation": "We have sent clear signs to you, such as none can deny except those who transgress the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you Revelations that clearly expound the Truth, and none but the disobedient reject them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad) We have given you enlightening authority. Only the wicked sinners deny it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down to you clear signs; and none will disbelieve in them except the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have sent down to you manifest Ayat and none disbelieve in them but Fasiqun (those who rebel against Allah's command).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have revealed to you clear communications and none disbelieve in them except the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent down unto thee signs, clear signs, and none disbelieves in them except the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have revealed unto thee clear tokens, and only miscreants will disbelieve in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down clear signs to you and no one will reject them except the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have sent down Unto thee evident signs, and none shall disbelieve therein save the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly sent down manifest signs to you, and no one denies them except transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to thee Manifest Signs (ayat); and none reject them but those who are perverse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have sent down to you manifest Ayat (these Verses of the Quran which inform in detail about the news of the Jews and their secret intentions, etc.), and none disbelieve in them but Fasiqun (those who rebel against Allah's Command).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you clear verses, none will disbelieve them except the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed to you clear signs, and none rejects them except the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly revealed to you verses [which are] clear proofs, and no one would deny them except the defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[2:99] And We have revealed to you, O Muhammad (s), clear proofs, lucid [ones] (bayyinātin, ‘clear proofs’, is a circumstantial qualifier; this was in response to Ibn Sūryā saying to the Prophet (s), ‘You have not brought us anything’); and none disbelieves in them except the wicked, these have disbelieved in them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily We have revealed unto thee) sent you Gabriel with (clear tokens) with manifest signs expounding commands and prohibitions, (and only miscreants) the unbelievers and the Jews (will disbelieve in them) will deny the signs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة كفرهم وعنادهم أنهم { لَقَدْ أَنْزَلْنَآ } من غاية لطفنا وجودنا { إِلَيْكَ } يا من وسعت مظهريته جميع أوصافنا وأخلاقنا { آيَاتٍ } دلائل { بَيِّنَاتٍ } واضحات لطريق المعرفة والإيمان والتوحيد والإيقان فكفروا بها وكذبوها { وَمَا يَكْفُرُ بِهَآ } مع وضوحها وجلائها { إِلاَّ ٱلْفَاسِقُونَ } [البقرة: 99] الخارجون عن ربتة العبودية؛ لعدم الانقياد بالكتاب والنبي بل بالإنزال بل بالمنزل ألم يكونوا فاسقين دائماً؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}