{
  "chapter": "آل عمران",
  "text": "ان الذين كفروا۟ لن تغنى عنهم امولهم ولا اولدهم من الله شيـا واو۟لئك هم وقود النار",
  "translations": [
    {
      "translation": "As for those who deny, neither their wealth nor their children will help them in the least against God. They shall be but faggots for (the fire of) Hell,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, neither their wealth nor their offspring will avail them at all against Allah, and it is they who will be the fuel of the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wealth and children of the unbelievers will never serve them as a substitute for their belief in God. Such people will be the fuel for the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed for those who disbelieve, neither their wealth nor their offspring will help to save them in the least from Allah; and it is they who are fuel for the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, neither their properties nor their offspring will avail them whatsoever against Allah; and it is they who will be fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve, surely neither their wealth nor their children shall avail them in the least against Allah, and these it is who are the fuel of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the unbelievers, their riches will not avail them, neither their children, aught against God; those -- they shall be fuel for the Fire\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On that Day) neither the riches nor the progeny of those who disbelieve will aught avail them with Allah. They will be fuel for Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny the truth, their wealth and children will not help them against God. They will be fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve-neither their riches nor their offspring shall avail them aught with Allah. and these! they shall be the fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the faithless, neither their wealth nor their children shall avail them anything against Allah; it is they who will be fuel for the Fire;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Faith,- neither their possessions nor their (numerous) progeny will avail them aught against Allah: They are themselves but fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, neither their properties nor their offspring will avail them whatsoever against Allah; and it is they who will be fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, neither their riches nor their children shall save them from Allah. They shall become the fuel of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, neither their wealth nor their children will avail them anything against God. These will be fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all. And it is they who are fuel for the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:10] As for the disbelievers, neither their riches nor their children will avail, will protect, them against God, that is, [against] His chastisement; those — they shall be fuel for the Fire, [they shall constitute] what the Fire will be fuelled by (read waqūd [as opposed to wuqūd], ‘fuel’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((On that day) neither the riches) the abundance of riches (nor the progeny) nor the abundance of progeny (of those who disbelieve) i.e. Ka'b Ibn al-Ashraf and his fellow companions; and it is also said that this refers to Abu Jahl and his companions (will aught avail them with Allah) will not avail them anything from Allah's torment. (They will be fuel for fire) they are the firewood of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُم مِّنَ ٱللَّهِ شَيْئاً } معناه من عِنْدِ الله شيئاً\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ كَفَرُواْ } بالله، وأعرضوا عن كتبه ورسله وأصروا عليه اغترارً بمزخرفاتهم الباطلة من الأموال والأولاد { لَن تُغْنِيَ } وترفع { عَنْهُمْ } في النشأة الأخرى { أَمْوَالُهُمْ وَلاَ أَوْلاَدُهُم مِّنَ } غضب { ٱللَّهِ شَيْئاً وَأُولَـٰئِكَ } المصرون المعاندون فيها { هُمْ وَقُودُ ٱلنَّارِ } [آل عمران: 10] أي: أجسامهم وقود نار الحسرة و الخذلان دأبهم وديدنتهم في النشأة الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}