{
  "chapter": "آل عمران",
  "text": "قل للذين كفروا۟ ستغلبون وتحشرون الى جهنم وبئس المهاد",
  "translations": [
    {
      "translation": "So tell the disbelievers: \"You will surely be subdued and driven to Hell: How bad a preparation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell those who disbelieved: 'You shall soon be overpowered and mustered to Hell - and that is an evil resting place!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell the unbelievers that they will soon be defeated and driven into Hell, a terrible dwelling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him) to the disbelievers, “Very soon you shall be overcome and driven towards hell; and that is a wretched resting-place.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve: \"You will be defeated and gathered together to Hell, and worst indeed is that place of rest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve: You shall be vanquished, and driven together to hell; and evil is the resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the unbelievers: 'You shall be overthrown, and mustered into Gehenna -- an evil cradling!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad) unto those who disbelieve: Ye shall be overcome and gathered unto Hell, an evil resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who deny the truth, \"You shall be overcome and driven into Hell -- an evil resting place!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou unto those who disbelieve: anon shall ye be overcome, and gathered unto Hell--an evil couch!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the faithless, ‘You shall be overcome and mustered toward hell, and it is an evil resting place.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who reject Faith: \"Soon will ye be vanquished and gathered together to Hell,-an evil bed indeed (to lie on)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW) to those who disbelieve: \"You will be defeated and gathered together to Hell, and worst indeed is that place to rest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve: 'You shall be overcome and gathered into Gehenna (Hell), an evil cradling'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve, “You will be defeated, and rounded up into Hell—an awful resting-place.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who disbelieve, \"You will be overcome and gathered together to Hell, and wretched is the resting place.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:12] When the Prophet (s) enjoined the Jews to enter into Islam, after his return from Badr, they said, ‘Do not fool yourself just because you killed a few men of Quraysh, inexperienced and knowing nothing about fighting’, whereupon the following was revealed: Say, O Muhammad (s), to the disbelievers, from among the Jews, ‘You shall be vanquished (sa-tughlabūn, or [read] sa-yughlabūn, ‘they shall be vanquished’), in this world, through being killed or taken captive and made to pay the jizya (which actually took place), and mustered, ([read] in both ways [wa-tuhsharūna, ‘you will be mustered’, or wa-yuhsharūna, ‘they will be mustered’]), in the Hereafter, to Hell, which you shall enter — an evil cradling!’, [an evil] resting place.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad! (unto those who disbelieve) the unbelievers of Mecca: (Ye shall be overcome) You shall be killed on the Day of Badr (and gathered unto hell) on the Day of Judgement, (an evil resting place) an evil place and outcome.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل نيابة عنا { لِّلَّذِينَ كَفَرُواْ } بك وبكتابك إخباراً لهم عما سيجري عليهم: { سَتُغْلَبُونَ } بقهر الله وغضبه في يوم الجزاء { وَتُحْشَرُونَ } بين يدي الله، وتحاسبون عنده سبحانه عما جرى عليهم في النشأة الأولى، وبعد ذلك تساقون { إِلَىٰ جَهَنَّمَ } البعد والخذلان مطرودين مهانين { وَبِئْسَ ٱلْمِهَادُ } [آل عمران: 12] ما مهدوا فيها بما اقترفته نفوسهم من الاستكبار على الأنبياء والإصرار على ما هم عليه من الكفر والضلالة، بعد ظهور آيات الإيمان وعلامات الهدى؛ إذ:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: لمَّا رجع رسول الله صلى الله عليه وسلم من غزوة بدر غالباً منصوراً بالغنائم والأسارى، جمع اليهود في سوق بني قينقاع، وقال لهم: يا معشر اليهود، اتقوا الله وأسلموا، فإنكم تعلمون أني رسول الله حقّاً، واحذوا أن يُنزل الله بكم من نقمته ما أنزل على قريش يوم بدر، فقالوا: يا محمد، لا يَغُرَّنَّكَ أنك لقيت أغماراً لا علم له علم لهم بالحرب، لئن قاتلتنا لتعلَمنَّ أنَّا نحن الناس\n فأنزل الله فيهم هذه الآية\n يقول الحقّ جلّ جلاله: { قل } يا محمد { للذين كفروا } من بني إسرائيل، أو مطلقاً: { ستغلبون } إن قاتلتم المسلمين، { وتحشرون } بعد الموت والهزيمة { إلى جهنم وبئس المهاد } ما مهدتم لأنفسكم من العذاب، وقد صدق وعده بقتل قريظة، وإجلاء بني النضير، وفتح خيبر، وضرب الجزية على من عداهم، فقد غُلِبوا أينما ثُقفوا، وحشروا إلى جهنم، إلا من أسلم منهم",
      "translations": []
    }
  ]
}