{
  "chapter": "آل عمران",
  "text": "قد كان لكم ءاية فى فئتين التقتا فئة تقتل فى سبيل الله واخرى كافرة يرونهم مثليهم راى العين والله يؤيد بنصره من يشاء ان فى ذلك لعبرة لاو۟لى الابصر",
  "translations": [
    {
      "translation": "There was a token for you in the two armies which clashed (in the battle of Badr), one fighting for God, the other of unbelievers who saw with their own eyes the faithful to be two times as many as they, for God reinforces with His help whomsoever He will. In this is a lesson for those who have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have already come across an instructive sign in the two hosts that encountered each other in battle (at Badr): one host fighting in the way of Allah, and the other that of unbelievers. They saw with their own eyes that one host was twice the number of the other. But (the result of the battle has proved that) Allah succours with His victory whomsoever He wills. In this there is surely a lesson for all who have eyes to see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, certainly, is evidence (of the existence of God) for you in the case of the two armies. One of them fought for the cause of God. The other were disbelievers. The disbelievers appeared to be twice the size of the believers. However, God supports through His help whomever He wants. It is a good lesson for the people of true vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was a sign for you in the two groups that clashed; one army fighting in Allah's cause, against the other of disbelievers, whom they (the Muslims) saw with their eyes, as twice their own number; and Allah strengthens with His help whomever He wills; indeed in this is a lesson for the intelligent, to be learnt by observing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has already been a sign for you in the two armies that met. One was fighting in the cause of Allah, and as for the other, in disbelief. They saw them with their own eyes twice their number. And Allah supports with His aid whom He wills. Verily, in this is a lesson for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there was a sign for you in the two hosts (which) met together in encounter; one party fighting in the way of Allah and the other unbelieving, whom they saw twice as many as themselves with the sight of the eye and Allah strengthens with His aid whom He pleases; most surely there is a lesson in this for those who have sight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has already been a sign for you in the two companies that encountered, one company fighting in the way of God and another unbelieving; they saw them twice the like of them, as the eye sees, but God confirms with His help whom He will. Surely in that is a lesson for men possessed of eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a token for you in two hosts which met: one army fighting in the way of Allah, and another disbelieving, whom they saw as twice their number, clearly, with their very eyes. Thus Allah strengtheneth with His succour whom He will. Lo! herein verily is a lesson for those who have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a sign for you in the two groups which met face to face [at Badr], one party fighting for the cause of God and the other made up of those who deny the truth. The faithful saw with their own eyes that the others were twice their number: but God strengthens with His succour whom He wills. In this, there is indeed a lesson for all who have eyes to see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of a surety there hath been unto you a sign, the two hosts that met, one host fighting in the way of Allah, and the other disbelieving, beholding themselves, with their own eyes, twice as many as they. And Allah aideth with His succour whomsoever He will. Verily herein is a lesson for men of insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was certainly a sign for you in the two hosts that met: one host fighting in the way of Allah and the other faithless, who saw them as visibly twice as many. Allah strengthens whomever He wishes with His help. There is indeed a moral in that for those who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has already been for you a Sign in the two armies that met (in combat): One was fighting in the cause of Allah, the other resisting Allah; these saw with their own eyes Twice their number. But Allah doth support with His aid whom He pleaseth. In this is a warning for such as have eyes to see.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has already been a sign for you (O Jews) in the two armies that met (in combat i.e. the battle of Badr): One was fighting in the Cause of Allah, and as for the other (they) were disbelievers. They (the believers) saw them (the disbelievers) with their own eyes twice their number (although they were thrice their number). And Allah supports with His Victory whom He pleases. Verily, in this is a lesson for those who understand. (See Verse 8:44). (Tafsir At-Tabari)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there was a sign for you in the two armies which met on the battlefield. One was fighting in the way of Allah, and another unbelieving. They (the believers) saw with their eyes that they were twice their own number. Allah strengthens with His victory whom He will. Surely, in that there was a lesson for those possessed of eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was a sign for you in the two parties that met. One party fighting in the way of God, and the other was disbelieving. They saw them with their own eyes twice their number. But God supports with His help whomever He wills. In that is a lesson for those with insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already there has been for you a sign in the two armies which met - one fighting in the cause of Allah and another of disbelievers. They saw them [to be] twice their [own] number by [their] eyesight. But Allah supports with His victory whom He wills. Indeed in that is a lesson for those of vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:13] There has already been a sign, an example (the verb qad kāna, ‘there has been’, is used to separate [the statement to follow from the previous one]), for you in two hosts, two parties, that met, one another in battle, on the day of Badr; one company fighting in the way of God, in obedience to Him, namely, the Prophet and his Companions, who numbered three hundred and thirteen men, most of them on foot, with two horses, six plates of armour and eight swords; and another unbelieving; they, the disbelievers, numbering almost a thousand, saw them, the Muslims, twice the like of them, that is, more numerous than themselves, as the eye sees, in manifest vision, witnessing; and God granted them victory despite their fewer number; for God confirms, He strengthens, with His help whom He will, granting him victory. Surely in   that, which is mentioned, is a lesson for people of vision, those who are discerning: so will you not be warned by this and become believers?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There was a token) a sign confirming the prophethood of Muhammad (pbuh) (for you) people of Mecca (in two hosts) in two groups: that of Muhammad and that of Abu Sufyan (which met) on the Day of Badr: (one army fighting in the way of Allah) in obedience of Allah: Muhammad and his Companions who were 313 men, (and another disbelieving) and another group of disbelievers in Allah and the Messenger: Abu Sufyan and his army which consisted of 950 men, (whom they saw) they saw themselves (as twice their number) as twice the number as that of the Companions of Muhammad (pbuh) (clearly, with their very eyes). It is also said that this can be understood in this way: Say, Muhammad, to the unbelievers-the Banu Qurayzah and Banu'l-Nadir-you shall be overcome and killed and expelled, and after you die, you will be mustered in Gehenna, an evil abode and end. Allah informed them of this two years before the Battle of Badr took place. Then He revealed: Jews! You had a sign for the prophethood of Muhammad (pbuh) in the form of two groups-that of Muhammad and that of Abu Sufyan-who met on the Day of Badr. One group (Muhammad (pbuh) and his Companions) fought in obedience of Allah, and the other group consisted of unbelievers in Allah and His Messenger (Abu Sufyan and his group). You saw with your very eyes, Jews, that the unbelievers were twice the number of the Companions of Muhammad. (Thus Allah strengtheneth with His succour whom He will) i.e. Muhammad. (Lo! Herein) in Allah enabling Muhammad to triumph on the Day of Badr (verily is a lesson for those who have eyes) concerning Religion, i.e. the believers; it is also said that this means: it was a lesson for those who saw it with their own eyes.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَرَوْنَهُمْ مِّثْلَيْهِمْ رَأْيَ ٱلْعَيْنِ } معناهُ ظَاهراتٌ\n\n\n\n\nوقوله تعالى: { وَٱللَّهُ يُؤَيِّدُ بِنَصْرِهِ مَن يَشَآءُ } معناهُ يُقوّي ويَنصُرُ\n\n\n\n\nوقوله تعالى: { إِنَّ فِي ذٰلِكَ لَعِبْرَةً لأُوْلِي ٱلأَبْصَارِ } معناهُ معرِفَةٌ لأولِي العُقولِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قد كان لكم آية } يا معشر السالكين دالة على كمالكم وبلوغكم إلى التوحيد { في فئتين التقتا فئة } القوى الروحانية الذين هم أهل الله وجنوده { تقاتل في سبيل الله وأخرى } هي جنود النفس وأعوان الشياطين محجوبة عن الحقّ\n ترى الفئة الأولى، مع قلّة عددهم، مثليهم عند التقائهما في معركة البدن لتأييد الفئة الأولى بنور الله وتوفيقه وخذلان الفئة الثانية وذلهم وعجزهم وضعفهم وانقطاعهم عن عالم الأيد والقدرة\n فغلبت الأولى الثانية وقهروهم بتأييد الله ونصره، وصرفوا أموالهم التي هي مدركاتهم ومعلوماتهم في سبيل معرفة الله وتوحيده { والله يؤيد بنصره من يشاء } من أهل عنايته المستعدّين للقائه { إنّ في ذلك لَعِبرة } أي: اعتباراً أو أمراً يُعْتبر به في الوصول إلى الحقيقة للمستبصرين الذين انفتحت أعين بصائرهم واكتحلت بنور الإيقان العلميّ من أهل الطريقة يعتبرون به أحوالهم في النهاية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ كَانَ لَكُمْ } أيها الضالون في تيه الحرمان { آيَةٌ } ظاهرة دالة على الهدى الحقيقي { فِي } التقاء { فِئَتَيْنِ } حين { ٱلْتَقَتَا } إحداهما { فِئَةٌ تُقَاتِلُ فِي سَبِيلِ ٱللَّهِ } لإعلاء كلمته وإظهار توحيده { وَأُخْرَىٰ كَافِرَةٌ } تقاتل مع الموحدين مكابرة وعناداً، ومع كونكم أيها الكافرون المعاندون بأضعاف المؤمنين الموحدين، وكثرة عددكم وعُددكم { يَرَوْنَهُمْ } أي: الموحدون { مِّثْلَيْهِمْ رَأْيَ ٱلْعَيْنِ } أي: في بادي النظر ويرهبون منهم رهبة شديدة بتأييد الله ونصره { وَٱللَّهُ } المحيط بجميع ما جرى في ملكه { يُؤَيِّدُ بِنَصْرِهِ } العزيز { مَن يَشَآءُ } من عباده المخلصين في إطاعته وانقياده { إِنَّ فِي ذٰلِكَ } التأييد والنصر مع ظهور عكسه { لَعِبْرَةً } تبصرة وتذكرة { لأُوْلِي ٱلأَبْصَارِ } [آل عمران: 13] المستبصرين بنظر الاعتبار عن سرائر الأمور وأسرارها بلا التفات إلى مزخرفات الدنيا الدنية من شهواتها ولذاتها، لا للمنهمكين المستغرقين في بحر الغفلة والغرور إذ:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ندبهم للاعتبار بما وقع من النصر للمسلمين يوم بدر فقال لهم: { قد كان لكم } يا معشر اليهود، { آية } أي: عبرة ظاهرة، ودلالة على صدق ما أقول لكم: إنكم ستغلبون، { في فئتين } أي: جماعتين { التقتا } يوم بدر، وهم المسلمون، وكانوا ثلاثمائة وأربعة عشر، والمشركون كانوا زهاء ألف، { فئة تقاتل في سبيل الله } وهم المؤمنون، { وأخرى كافرة } ، وهم المشركون، { ترونهم مثليهم } أي: ترون، يا معشر اليهود، الكفارَ مثلي عدد المسلمين رأي تحقيق، ومع ذلك أيدهم الله بالنصر والمدد حتى نصرهم على عدوهم، وكذلك يفعل بهم معكم\n والرؤية، على هذا، علمية\n ومن قرأ بالياء يكون الضمير راجعاً للكفار، أي: يرى الكفارُ المسلمين مثليهم، وذلك بعد أن قللهم الله في أعينهم حتى اجترأوا عليهم، وتوجهوا إليهم، فلما لاقوهم كثروا في أعينهم حتى غلبوا، مدداً من الله للمؤمنين\n أو: يرى المؤمنون المشركين مثلي المؤمنين، وكانوا ثلاثة أمثالهم، ليثبتوا لهم، ويتيقنوا بالنصر الذي وعدهم الله بقوله:\n",
      "translations": []
    }
  ]
}