{
  "chapter": "آل عمران",
  "text": "زين للناس حب الشهوت من النساء والبنين والقنطير المقنطرة من الذهب والفضة والخيل المسومة والانعم والحرث ذلك متع الحيوة الدنيا والله عنده حسن المـاب",
  "translations": [
    {
      "translation": "Enamoured are the people of the lust of (earthly) pleasures, of women and of children and hoarded heaps of gold and silver, well-bred horses, and tilled land and cattle, all (vain) goods and chattels of the life of this world, while the best of abodes is with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are naturally tempted by the lure of women, children, treasures of gold and silver, horses of mark, cattle and plantations. These are the enjoyments in the life of this world; but with Allah lies a goodly abode to return to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worldly desires, wives, children, accumulated treasures of gold and silver, horses of noble breed, cattle, and farms are all made to seem attractive to men. All these are the bounties of the worldly life but in the life to come God has the best place for people to dwell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified is for mankind the love of these desires – women, and sons, and heaps of gold and piled up silver, and branded horses, and cattle and fields; this is the wealth of the life of this world; and it is Allah, with Whom is the excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for men is the love of things they covet; women, children, Qanatir Al-Muqantarah of gold and silver, branded beautiful horses (Musawwamah), cattle and fertile land. This is the pleasure of the present world's life; but Allah has the excellent return with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The love of desires, of women and sons and hoarded treasures of gold and silver and well bred horses and cattle and tilth, is made to seem fair to men; this is the provision of the life of this world; and Allah is He with Whom is the good goal (of life).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Decked out fair to men is the love of lusts -- women, children, heaped-up heaps of gold and silver, horses of mark, cattle and tillage. That is the enjoyment of the present life; but God -- with Him is the fairest resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for mankind is love of the joys (that come) from women and offspring; and stored-up heaps of gold and silver, and horses branded (with their mark), and cattle and land. That is comfort of the life of the world. Allah! With Him is a more excellent abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The satisfaction of worldly desires through women, and children, and heaped-up treasures of gold and silver, and pedigreed horses, and cattle and lands is attractive to people. All this is the provision of the worldly life; but the most excellent abode is with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fair-seeming is made unto men the love of pleasurable things from women and children and talents heaped-up of gold and silver and horses branded up and cattle and tilth. All that is the enjoyment of the life of the World, and Allah! with Him is the best resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The love of [worldly] allures, including women and children, accumulated piles of gold and silver, horses of mark, livestock, and farms has been made to seem decorous to mankind. Those are the wares of the life of this world, but the goodness of one’s ultimate destination lies near Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fair in the eyes of men is the love of things they covet: Women and sons; Heaped-up hoards of gold and silver; horses branded (for blood and excellence); and (wealth of) cattle and well-tilled land. Such are the possessions of this world's life; but in nearness to Allah is the best of the goals (To return to).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for men is the love of things they covet; women, children, much of gold and silver (wealth), branded beautiful horses, cattle and well-tilled land. This is the pleasure of the present world's life; but Allah has the excellent return (Paradise with flowing rivers, etc.) with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Decorated for people are the desires of women, offspring, and of heaped up piles of gold and silver, of pedigree horses, cattle, and sown fields. These are the enjoyments of the worldly life, but with Allah is the best return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adorned for the people is the love of desires, such as women, and children, and piles upon piles of gold and silver, and branded horses, and livestock, and fields. These are the conveniences of the worldly life, but with God lies the finest resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beautified for people is the love of that which they desire - of women and sons, heaped-up sums of gold and silver, fine branded horses, and cattle and tilled land. That is the enjoyment of worldly life, but Allah has with Him the best return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:14] Beautified for mankind is love of lusts, that which the self lusts after and calls for, beautified by Satan, or by God as a test — of women, children, stored-up heaps of gold and silver, horses of mark, fine [horses], cattle, namely, camels, cows and sheep, and tillage, the cultivation of land. That, which is mentioned, is the comfort of the life of this world, enjoyed while it lasts, but then perishes; but God — with Him is the more excellent abode, place of return, which is Paradise, and for this reason one should desire none other than this [abode].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentions the bounties of the life of this world that He has made attractive for the unbelievers, saying: (Beautified for mankind is) what people's hearts find desirable is (love of the joys (that come) from women) meaning slave women and wives (and offspring) slaves and children, (and stored up heaps) amassed wealth (of gold and silver) it is also said that this means: minted or engraved gold and silver, (and horses branded (with their mark)) beautiful branded horses and grazing in pastures, (and cattle) i.e. sheep, cows and camels (and land) cultivation and cultivated lands. (That) which is mentioned above (is comfort of the life of the world) is of benefit to people in the life of this world and then it vanishes; it is also said that this means: the joys of this world last only for as long as the stuff of any home, a bowl, a plate and the like. (Allah! With Him is a more excellent abode) in the Hereafter, i.e. Paradise, to whoever shun such joys.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلْقَنَاطِيرِ ٱلْمُقَنْطَرَةِ } واحدُها قِنْطَارٌ\n فالقِنْطَارُ: أَلفٌ ومَائَتا أُوقيةٍ\n والقِنْطَارُ مائةٌ رطلٍ\n والقِنْطَارُ ألفُ دينارٍ\n ومن الوَرقِ اثنا عَشَر أَلفاً مِثل الدِيَّةِ\n وقَدْ قِيلَ القِنْطَارُ: ثَمانونَ أَلفَ دِينارٍ\n وقدْ قيلَ القِنْطارُ: سَبعونَ أَلفَ دِينارٍ\n\n\n\n\nوقوله تعالى: { وَٱلْخَيْلِ ٱلْمُسَوَّمَةِ } معناهُ المُعلَّمَةُ المُسيَمَةُ\n ويقالُ: المُطَهَّمةُ: الحِسانُ\n والمُطَهَّمةُ: التي كُل شَيءٍ مِنْهَا حَسِنٍ عَلى حَدهِ والمُسَوَّمةُ: الرَّاعيةُ [ { وَٱلأَنْعَامِ وَٱلْحَرْثِ } ] والأَنْعَامُ: جَماعةُ النَّعمِ وهيَ الإِبل\n والحَرْثُ: الزَّرعُ\n\n\n\n\nوقوله تعالى: { مَتَاعُ ٱلْحَيَاةِ ٱلدُّنْيَا } معناهُ قِوامُهم\n\n\n\n\nوقوله تعالى: { وَٱللَّهُ عِنْدَهُ حُسْنُ ٱلْمَآبِ } معناه المرجعُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { زُين للناس حبّ الشهوات } لأن الإنسان مركب من العالم العلويّ والسفليّ، ومن نشأته وولادته تحجبت فطرته وخمدت نار غريزته وانطفأ نور بصيرته بالغشاوات الطبيعية والغواشي البدنية، والماء الأجاج من الذّات الحسيّة، والرياح العواصف من الشهوات الحيوانية، فبقي مهجوراً من الحق في أوطان الغربة وديار الظلمة يسار به، مبلوّاً بأنواع النصب والتعب، فإذا هو بشعشعة نور من التميز ولمعان برق من عالم العقل، وداعٍ ينادينه من الهوى والشيطان، فتبعه فصادف منزلاً نزهاً، وروضة أنيقة، فيها ما تشتهي الأنفس وتلذّ الأعين، فاستوطنه وشكر سعيه ورضيه مسكناً وقال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ زُيِّنَ } حبب وحسن { لِلنَّاسِ } المغرورين بزخرفة الدنيا { حُبُّ ٱلشَّهَوَاتِ } أي: مشتهياتها المنحصرة أصولها في هذه المذكورات { مِنَ ٱلنِّسَاءِ } اللاتي هن لمن اشتهاها؛ إذ هو للوقاع الذي هو من ألذ الملذات النفسانية { وَٱلْبَنِينَ } للمظاهرة والمفاخرة والغلبة على الخصوم { وَٱلْقَنَاطِيرِ } الأموال الكثيرة { ٱلْمُقَنْطَرَةِ } المجتمعة المزخرفة { مِنَ ٱلذَّهَبِ وَٱلْفِضَّةِ } لكونها وسائل إلى المشتهيات التي مالت القلوب إليها بالطبع { وَٱلْخَيْلِ ٱلْمُسَوَّمَةِ } المعلمة المنسوبة إليهم ليركبوها ويبطروا عليها { وَٱلأَنْعَامِ } من الإبل والبقر والغنم ليحملوها، ويأكلوا منها ويزرعوا بها { وَٱلْحَرْثِ } ليقتاتوا بها ويعيشوا بأكملها { ذٰلِكَ } الأصول المذكورة { مَتَاعُ ٱلْحَيَاةِ ٱلدُّنْيَا } الفانية المانعة من الوصول إلى الجنة، الماوى التي هي دار القرار والخلود، وموعد لقاء الخلاق الودود { وَٱللَّهُ } الهادي إلى سبيل الصواب { عِنْدَهُ } لمن توجه نحوه واستقبل جنابه { حُسْنُ ٱلْمَآبِ } [آل عمران: 14] وخير المنقلب والمئاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { زُين }: بحذف الفاعل، وهو الله، حقيقة إذ لا فاعل سواه، أو الشيطان، شَريعَةً إذ هو منديل لمسح أوساخ الأقذار\n والقنطار: المال الكثير، وقيل: مائة ألف دينار، وقيل: ملء مسك الثور\n وروى عنه - عليه الصلاة والسلام - أنه قال:\n\n \" القنطار: ألف دينار \" \n\n، وفي رواية:\n\n \" ألفا دينار \" \n\n، وفي عرفنا اليوم: ألف مثقال\n والمقنطرة: المنضدة بعضها فوق بعض، وسمي الذهب ذهباً لذهابه وفنائه، أو لذهابه بالقلوب عن حضرة الغيوب، وسميت الفضة فضة لأنها تَنْفَضُّ أي: تنفرق، أو تفرق القلوب لمن اشتغل بها\n والمسوَّمة: المعلمة أو الراعية أو المطهمة الحسان\n يقول الحقّ جلّ جلاله: { زُين للناس حب الشهوات } والركون إلى المألوفات، حتى صرفهم ذلك عن النظر والاعتبار، أو الشهود والاستبصار، وذلك لمن وقف مع متعتها، وغرته شهوة لذتها، وأما من ذكرته نعيم الجنان، وأعانته على طاعة الملك الديان، فلم يقف مع متعتها، ولا التفت إلى عاجل شهوتها، بل نزل إليها بالإذن والتمكين، والرسوخ في اليقين، فلا يشمله تحذير الآية لقوله - عليه الصلاة والسلام -:\n\n \" حُبِّبَ إلِيَّ من دنياكم ثلاث\n\n\n \" \n\nالحديث\n وقال بعض الأولياء: [كل شهوة تحجب القلب عن الله، إلا شهوة الجماع] يعني الحلال، وقال الورتجبي: ابتلاهم حتى يظهر الصادق بترك هذه الشهوات، من الكاذب بالشروع في طلبها، قيل: من اشتغل بهذه الأشياء قطعته عن طريق الحق، ومن استصغرها وأعرض عنها، عوض عليها السلامة منها، وفتح له الطريق إلى الحقائق\n هـ\n ثم بدأ برأس الشهوات فقال: { من النساء } وذلك لمن شُغف بهن فصرف عن ذكر الله، أو تناولهن على وجه الحرام\n وفي الخبر عنه - عليه الصلاة والسلام -:\n\n \" مَا تَرَكْتُ في الناس بَعْدِي فِتْنَةً أَضَرُّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ \" \n\nوفي خبر آخر:\n\n \" النظر إلى محاسن المرأة من سهام إبليس \" \n\nومَنْ ثَمَّ جُعِلْنَ في القرآن عين الشهوات، قال تعالى: { زيّن للناس حب الشهوات من النساء }\n وقال بعض العارفين: ما أيس الشيطانُ من إنسان قط إلا أتاه من قبل النساء\n وقال عليّ رضي الله عنه: أيها الناس، لا تطيعوا للنساء أمراً، ولا تَدَعُوهُنَّ يدبرن أمر عيش، فإنهن إن تُرِكْنَ وما يُرِدْن أفسدن الملك، وعصَين المالك، وجدناهن لا دين لهن في خلَواتهن، ولا ورع لهن عن شهواتهن اللذة بهن يسيرة، والحيرة بهن كثيرة، فأما صوالحهن ففاجرات، وأما طوالحهن فعاهرات - أي: زانيات -، وأما المعصومات فهن المعدومات، يتظلمن وهن الظالمات، ويتمنعن وهن الراغبات، ويحلفن وهن الكاذبات، فاستعيذوا بالله من شرارهن، وكونوا على وجل من خيارهن، والسلام\n هـ\n { والبنين }: قال - عليه الصلاة والسلام -:\n\n \" إنهم لثمرة القلوب، وقُرَّةُ الأعيُن، وأنهم مع ذلك لَمَجْبَنَةٌ مَبْخَلَةٌ مَحْزَنَةٌ \" \n\n \n\n{ والقناطير المقنطرة }: أي: المجموعة المنضدة، { من الذهب والفضة\n والخيل المسومة } أي: المعلمة: وهي البلق، أو غيرها، وفي الحديث عنه صلى الله عليه وسلم:\n\n \" الخَيْلُ معقودٌ في نَواصِيها الخَيْرُ إلى يوْمِ القِيَامةِ، الأجرُ والمَغْنمُ \"\n \n\nوعن أنس قال: لم يكن شيء أحب إلى النبيّ صلى الله عليه وسلم بعد النساء، من الخيل\n وعن أبي وهب الجشمي قال النبيّ صلى الله عليه وسلم:\n\n \" ارتبطوا الخيل، وامسحوا بنواصيها، وقَلِّدُوها، ولا تقلدوها الأوتار، وعليكم بكل كُمَيْت أغر مُحَجِّلِ، أو أشقر أغر محجل، أو أدهم أغر مُحَجَّل \" \n\nوعن خباب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:\n\n \" الخيل ثلاثة: فرس للرحمن، وفرس للإنسان، وفرس للشيطان، فأما فرس الرحمن فما اتخذ لله في سبيل الله، وقوتل عليه أعداء الله، وأما فرس الإنسان فما استطرق عليه \" \n\n- أي: ركب عليه في طريق حوائجه،\n\n \" وأما فرس الشيطان فما روهن عليه، وقومر عليه \" \n\nوفي البخاري ما يشهد لهذا\n ومما زُيِّن للناس أيضاً: حب { الأنعام } ، وهي الإبل والبقر والغنم، إن شغلته عن ذكر الله، ومنع منها حق الله، { والحرث } أي: الزراعة والغراسة، { ذلك } الذي ذكرت { متاع الحياة الدنيا } الفانية الزائلة، { والله عنده حسن المآب } ، أي: المرجع في دار البقاء التي لا يفنى نعيمها، ولا تنقطع حياتها إلى أبد الأبد\n الإشارة: كل ما يقطع القلبّ عن الشهود، أوُ يُفَتِّرُهُ عن السير إلى الملك المعبود، فهو شهوة، كائناً ما كان، أغياراً أو أنواراً، أو علوماً أو أحوالاً، أو غير ذلك، فالنساء الأغيار، والبنون الأنوار، والقناطير المقنطرة من الذهب علوم الطريقة، والفضة علوم الشريعة، والخيل المسومة هي الأحوال، والأنعام الأذكار، والحرب استعمال الفكرة\n فكل مَنْ وقف مع حلاوة شيء من هذا، ولم يُفْضِ إلى راحة الشهود والعيان، فهي في حقه شهوة\n وبعد أن ذكر الحق تعالى أنواعاً من الشهوات، زَهَّدَ فيها فقال: { ذلك متاع الحياة الدنيا والله عنده حسن المآب } قال أبو هاشم الزاهد رضي الله عنه: وَسَمَ اللّهُ الدنيا بالوحشة ليكون أنس المريد بربه دونها، وليقبل المطيعون بالإعراض عنها، وأهلُ المعرفة بالله من الدنيا مستوحشون، وإلا الله مشتاقون\n هـ\n وقد تعوّذ النبيّ صلى الله عليه وسلم من شر فتنتها، غناها وفقرها\n وأكثرُ القرآن مشتملٌ على ذمها، وتحذير الخلق منها، بل ما من داع يدعو إلى الله تعالى إلا وقد حذر منها، ورغَّب في الآخرة، بل هو المقصود بالذات من بيان الشرائع، وكيف لا - وهي عدوة الله لقطعها طريق الوصلة إليه، ولذلك لم ينظر إليها منذ خلقها\n وعدوة لأوليائه لأنها تزينت بزينتها حتى تجرعوا مرارة الصبر في مقاطعتها، وعدوة لأعدائه لأنها استدرجتهم بمكرها، واقتنصتهم بشبكتها، فوثقوا بها، فخذلتهم أحوج ما كانوا إليها، كفانا الله شرّها بمنِّه وكرمه\n\n",
      "translations": []
    }
  ]
}