{
  "chapter": "آل عمران",
  "text": "الذين يقولون ربنا اننا ءامنا فاغفر لنا ذنوبنا وقنا عذاب النار",
  "translations": [
    {
      "translation": "who say: \"O Lord, we believe; forgive our trespasses and save us the torment of Hell.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones who pray: 'Our Lord! We do indeed believe, so forgive us our sins and keep us safe from the chastisement of the Fire';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such will be the reward of) those who say, \"Lord, we have believed in you. Forgive us our sins and save us from the torment of fire,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, “Our Lord! we have accepted faith, so forgive us our sins and save us from the punishment of fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: \"Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: Our Lord! surely we believe, therefore forgive us our faults and save us from the chastisement of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who say, 'Our Lord, we believe; forgive us our sins, and guard us against the chastisement of the Fire' --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: Our Lord! Lo! we believe. So forgive us our sins and guard us from the punishment of Fire;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who say, \"Lord, we believe in You, forgive us our sins and keep us from the punishment of the Fire,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say our Lord! verify we! we have believed, wherefore forgive us our sins, and protect us from the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, ‘Our Lord! Indeed, we have faith. So forgive us our sins, and save us from the punishment of the Fire.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Namely), those who say: \"Our Lord! we have indeed believed: forgive us, then, our sins, and save us from the agony of the Fire;\"-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say: \"Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they who say: 'Lord, we believe in You, forgive us our sins and save us from the punishment of the Fire',\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, “Our Lord, we have believed, so forgive us our sins, and save us from the suffering of the Fire.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say, \"Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:16] Those (alladhīna is either an adjectival qualification of, or a substitution for, the previous alladhīna) who say: “O, Our Lord, we believe, in You and in Your Prophet; so forgive us our sins, and guard us from the chastisement of the Fire”.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then proceeds to describe them, saying: (Those who say) in the life of this world: (Our Lord!) our Lord! (Lo! we believe) in You and in Your Messenger. (So forgive us our sins) that we committed in the pre- Islamic period as well as after the advent of Islam (and guard us from the punishment of Fire) drive away from us the punishment of hell;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ يَقُولُونَ } بألسنتهم موافقاً لما في قلوبهم عند مناجاتهم مع ربهم { رَبَّنَآ إِنَّنَآ آمَنَّا } بمقتضى توفيقك بوحدانيتك وبكتبك ورسلك { فَٱغْفِرْ لَنَا } بلطفك { ذُنُوبَنَا } التي صدرت عنا من أنانيتنا واستر عيوبنا التي كنا عليها قل انكشافنا بتوحيدك { وَقِنَا } بلطفك، واحفظنا بفضلك { عَذَابَ ٱلنَّارِ } [آل عمران: 16] المعد لأصحاب البعد الخذلان عن ساحة عز حضورك، واجعلنا بفضلك من:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الذين يقولون ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار }\n وفي ترتيب السؤال على مجرد الإيمان دليل على أنه كاف في استحقاق المغفرة والاستعداد لها",
      "translations": []
    }
  ]
}