{
  "chapter": "آل عمران",
  "text": "شهد الله انه لا اله الا هو والملئكة واو۟لوا۟ العلم قائمۢا بالقسط لا اله الا هو العزيز الحكيم",
  "translations": [
    {
      "translation": "God is witness there is no god but He, and so are the angels and men full of learning. He is the upholder of justice. There is no god but He, the mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah Himself bears witness that there is no God but He; and likewise do the angels and the men possessed of knowledge bear witness in truth and justice that there is no God but He, the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God Himself testifies that He is the only Lord. The angels and the men of knowledge and justice testify that God is the only Lord, the Majestic, and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has given witness that there is none worthy of worship (God) except Him – and the angels and the scholars also give witness, established with justice (with truth) – there is no God except Him, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that none has the right to be worshipped but He, and the angels, and those having knowledge (also bear witness to this); (He always) maintains His creation in justice. None has the right to be worshipped but He, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that there is no god but He, and (so do) the angels and those possessed of knowledge, maintaining His creation with justice; there is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no god but He -- and the angels, and men possessed of knowledge -- upholding justice; there is no god but He, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah (Himself) is Witness that there is no Allah save Him. And the angels and the men of learning (too are witness). Maintaining His creation in justice, there is no Allah save Him the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no deity save Him, as do the angels and those who possess knowledge. He is the upholder of justice. There is no diety save Him, the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah beareth witness - and also the angles and those endued with knowledge that there is no god but He, the Maintainer of equity: there is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, maintainer of justice, the Almighty and the All-wise, besides whom there is no god, bears witness that there is no god except Him, and [so do] the angels and those who possess knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but He: That is the witness of Allah, His angels, and those endued with knowledge, standing firm on justice. There is no god but He, the Exalted in Power, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He is always) maintaining His creation in Justice. La ilah illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah bears witness that there is no god except He, and so do the angels and the knowledgeable. He upholds justice there is no god except He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God bears witness that there is no god but He, as do the angels, and those endowed with knowledge—upholding justice. There is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah witnesses that there is no deity except Him, and [so do] the angels and those of knowledge - [that He is] maintaining [creation] in justice. There is no deity except Him, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:18] God bears witness, [that is to say] He has made it clear to His creation through proofs and signs, that there is no god, none that is truly worshipped in existence, except Him, He has borne witness to this, and the angels, [have also borne witness to this] by affirming it, and those of knowledge, from among the prophets and the believers, through [their] conviction and in words; upholding, constantly and uniquely maintaining His creations with justice, (qā’iman, ‘upholding’, is in the accusative because it is a circumstantial qualifier and is governed by the import of the statement [implied to be something like] tafarrada, ‘He alone is [upholding]…’); there is no god except Him (He has repeated it for emphasis); the Mighty, in His Kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah declared then His divine Oneness, saying: (Allah (Himself) is witness) even if no one else bears witness (that there is no God save Him. And the angels) do also bear witness to that (and the men of learning) and the prophets and the believers bear witness to that. (Maintaining His creation in justice, there is no God save Him, the Almighty) in His vengeance against those who do not believe in Him, (the Wise) and He has commanded that none shall be worshipped except Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { شَهِدَ ٱللَّهُ } معناه بيَّنَ الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلصَّابِرِينَ } على عموم ما أصابهم من البأساء والضرءا في طريق توحيدك { وَٱلصَّادِقِينَ } عن الكذب مطلقاً في أقوالهم المعتبرة، المعربة عن أفئدتهم المطمئنة بالإيمان { وَٱلْقَانِتِينَ } الخاضعين الخاشعين إليك بظواهرهم وبواطنهم { وَٱلْمُنْفِقِينَ } من طيبات ما رزقت لهم؛ طلباً لمرضاتك بلا شوب المنة والأذى { وَٱلْمُسْتَغْفِرِينَ } لك الخائفين من سخطك وجلالك، الراجين العفو من عموم أوقاتهم خصوصاً { بِٱلأَسْحَارِ } [آل عمران: 17] الخالية عن جميع الموانع العائقة عن التوجه إلى جنابك الشاهدين بوحدانيتك بما: { شَهِدَ ٱللَّهُ } به لذاته، وهو { أَنَّهُ لاَ إِلَـٰهَ } أي: لا موجود ولا وجود ولا كون ولا تحقق ولا كائن ولا ثابت { إِلاَّ هُوَ } الحي الحقيق بالحقية، الوحيد بالقيومية، الفريد بالديمومية، لا شيء سواه { وَ } بما شهد بوحدته { ٱلْمَلاَئِكَةُ } أي: الأسماء والصفات القائمة بالذات الأحدية؛ إذ الكل قائم به ثابت له لا مرجع لها سواه { وَ } بما شهد به { أُوْلُواْ ٱلْعِلْمِ } من مظاهر المخلوقات على صورته المتأثرة من أوصافه وأسمائه، وإن كانت شهادة كل منها راجعة إلى شهادته؛ لكون الكل { قَآئِمَاً } مقوماً متحققاً { بِٱلْقِسْطِ } أي: العدل الإلهي المنبسط على ظواهر الكائنات أزلاً وأبداً؛ إذ { لاَ إِلَـٰهَ } أي: لا مظهر لها { إِلاَّ هُوَ ٱلْعَزِيزُ } الغالب القادر على إظهارها { ٱلْحَكِيمُ } [آل عمران: 18] المتقن في تربيتها وتدبيرها، القائلين طوعاً ورغبة بعدما تحققوا بمقام العبودية:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قائماً }: حال مِن { الله } ، وإنما جاز من بعض المعطوفات لعدم اللبس، كقوله:\n\n[الأنبيَاء: 72]، ولا يجوز: جاء زيد وعمر راكباً لعدم القرينة، أو مِن { هو } ، والعامل الجملة لأنه حال مؤكدة، أي: تفرد قائماً، أو حقه قائماً، { بالقسط } أي: العدل، و { إن الدين }: جملة مستأنفة مؤكدة للأولى، أي: لا دين مرضى عند الله سوى الإقرار بالشهادة والدخول فيما جاء به محمد صلى الله عليه وسلم، ومن قرأ بالفتح فهو بدل من { أنه } ، بدل الكل، إن فسر الإسلام بالإيمان، وبدل الاشتمال إن فسر بالشريعة\n يقول الحقّ جلّ جلاله: { شهد الله أنه لا إله إلا هو } أي: بيَّن وحدانيتَه بنصب الدلالئل الدالة عليها وإنزال الآيات الناطقة بها، أو بتدبيره العجيب وصنعته المتقنة وأموره المحكمة، وفي ذلك يقول القائل:\n\nوقيل لبعض العرب: ما الدليل على أن للعالم صانعاً؟ فقال: البعرة تدل على البعير، وآثار القدم تدل على المسير، فهيكل علوي بهذه اللطافة، ومركز سفلي بهذه الكثافة، أمَا يدلان على الصانع الخبير؟! { و } شهدت { الملائكة } أيضاً بالإقرار بالوحدانية والإخبار بها، { وأولوا العلم } وهم: الأنبياء والعلماء بالله، بالإيمان بها والاحتجاج عليها، شبه ذلك في البيان والكشف بشهادة الشاهد\n وفيه دليل شرف أهل العلم وفضلهم، حيث قرن شهادتهم بشهادته لأن العلم صفة الله العليا ونعمته العظمى، والعلماء أعلام الإسلام، والسابقون إلى دار السلام، وسُرج الأمكنة وحجج الأزمنة\n وعن جابر قال: قال النبيّ صلى الله عليه وسلم:\n\n \" سَاعَةٌ مِنْ عَالمِ يتَّكِئ على فِرَاشِهِ، ينظُرُ في علمهِ، خَيرٌ مِنْ عِبَادَة العَابِد سَبعينَ عاماً \" \n\nوعن معاذ قالَ: قال النبيّ صلى الله عليه وسلم:\n\n \" تعلموا العلم فإن تعلمه لله خشيةٌ، ومدارستَه تسبيحٌ، والبحث فيه جهادٌ، وتعليمه مَنْ لا يعلمه صدقةٌ، وتذكُّره في أهله قُرْبَة \" \n\nثم قال في آخر الحديث في فضل أهل العلم:\n\n \" وتَرْغَبُ الملائكة في خُلتِهم، وبأجنحتها تمسحُهم، وفي صلاتها تستغفر لهم، وكلُّ رطب ويابس يستغفر لهم\n حتى حيتان البحر وهوامه، وسباع الأرضين وأنعامها، والسماء ونجومها، ألا وإن العلم حياةُ القلوب من العمى، ونورُ الأبصار من الظلم، وقوة الأبدان من الضعف، يبلغ بالعبد منزل الأحرار ومجالسة الملوك، والفكر فيه يُعْدل بالصيام، ومدارسته بالقيام، وبه يُعرف الحلال والحرام، وبه تُوصلَ الأرحام، العلم إمام والعمل تابعه، يُلْهَمُه بالسعداء، ويُحْرَمه الأشقياء \"\n \n\nحال كون الحقّ تعالى { قائماً بالقسط } أي: مُدبراً لأمر خلقه بالعدل، فيما حكم وأبرم، { لا إله إلا هو } ، كرر الشهادة للتأكيد، ومزيد الاعتبار بأمر التوحيد، والحكم به، بعد إقامته الدليل\n\n\nعليه وقال جعفر الصادق: الأُولى وصف وتوحيد، والثانية رسم وتعليم\n أي: قولوا: { لا إله إلا هو } ، أو ليرتب عليه قوله: { العزيز الحكيم } ، فيعلم أنه الموصوف بهما، وقدَّم { العزيز } ليتقدم العلم بقدرته على العلم بحكمته",
      "translations": []
    }
  ]
}