{
  "chapter": "آل عمران",
  "text": "ان الدين عند الله الاسلم وما اختلف الذين اوتوا۟ الكتب الا منۢ بعد ما جاءهم العلم بغيۢا بينهم ومن يكفر بـايت الله فان الله سريع الحساب",
  "translations": [
    {
      "translation": "The true way with God is peace; and the people of the Book did not differ until knowledge (of this revelation) had come to them, out of mutual opposition. But those who deny the signs of God (should remember) He is swift in the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true religion with Allah is Islam. The People of the Book adopted many different ways rather than follow the true way of Islam even after the knowledge of truth had reached them, and this merely to commit excesses against one another. Let him who refuses to follow the ordinances and directives of Allah know that Allah is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the sight of God Islam is the religion. The People of the Book created differences in the matters (of religion) because of their hostility among themselves, only after knowledge had come to them. Let whoever denies the revelations of God know that the reckoning of God is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the only true religion in the sight of Allah is Islam; those who had received the Books differed only after the knowledge came to them, due to their hearts’ envy; and whoever disbelieves in the signs of Allah, then Allah is Swift At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the religion with Allah is Islam. Those who were given the Scripture (Jews and Christians) did not differ except out of rivalry, after knowledge had come to them. And whoever disbelieves in the Ayat of Allah, then surely, Allah is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the (true) religion with Allah is Islam, and those to whom the Book had been given did not show opposition but after knowledge had come to them, out of envy among themselves; and whoever disbelieves in the communications of Allah then surely Allah is quick in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true religion with God is Islam. Those who were given the Book were not at variance except after the knowledge came to them, being insolent one to another. And whoso disbelieves in God's signs. God is swift at the reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! religion with Allah (is) the Surrender (to His Will and Guidance). Those who (formerly) received the Scripture differed only after knowledge came unto them, through transgression among themselves. Whoso disbelieveth the revelations of Allah (will find that) lo! Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only true religion in God's sight is complete submission to God. And those who were given the Book disagreed only out of rivalry, after knowledge had been given to them -- he who denies God's signs should know that God is swift in His reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the religion with Allah is Islam and those Who Were vouchsafed the Book differed Not save after the knowledge had come unto them, out of spite among themselves. And whosoever disbelieveth in the revelations of Allah, then verily Allah swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, with Allah religion is Islam, and those who were given the Book did not differ except after knowledge had come to them, out of envy among themselves. And whoever denies Allah’s signs [should know that] Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Religion before Allah is Islam (submission to His Will): Nor did the People of the Book dissent therefrom except through envy of each other, after knowledge had come to them. But if any deny the Signs of Allah, Allah is swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, the religion with Allah is Islam. Those who were given the Scripture (Jews and Christians) did not differ except, out of mutual jealousy, after knowledge had come to them. And whoever disbelieves in the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah, then surely, Allah is Swift in calling to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only religion with Allah is Islam (submission). Those to whom the Book was given disagreed among themselves only after knowledge had been given to them being insolent among themselves. He who disbelieves the verses of Allah indeed Allah is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Religion with God is Islam. Those to whom the Scripture was given differed only after knowledge came to them, out of envy among themselves. Whoever rejects the signs of God—God is quick to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the religion in the sight of Allah is Islam. And those who were given the Scripture did not differ except after knowledge had come to them - out of jealous animosity between themselves. And whoever disbelieves in the verses of Allah, then indeed, Allah is swift in [taking] account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:19] Lo!, the religion with God, pleasing [to Him], is submission [to the One God], (al-islām), that is to say, the Divine Law with which the messengers were sent, founded upon the affirmation of God’s Oneness (a variant reading [for inna, ‘lo!’] has anna, ‘that’, as an inclusive substitution for annahu to the end [of that verse, sc. shahida Llāhu … anna l-dīna ‘inda Llāhi l-islām, ‘God bears witness that religion with God is Islām]). Those who were given the Scripture, the Jews and the Christians, differed, in religion, some affirming God’s Oneness, others rejecting it, only after the knowledge, of Oneness, came to them through transgression, on the part of the disbelievers, among themselves. And whoever disbelieves in God’s signs, God is swift at reckoning, that is, at requiting him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Religion) that is accepted (with Allah (is) the Surrender (to His will and guidance)). It is also said that this should be understood as: Allah bears witness that Religion with Him is Islam (the Surrender), and the angels, the prophets and the believers also bear witness to this. This verse was revealed about two men from Historic Syria who asked the Prophet (pbuh) which is the greatest witness in the Book of Allah. When he informed them about it, they embraced Islam. (Those who (formerly) received the Scripture) the Jews and Christians (differed) about Islam and Muhammad (only after knowledge) the exposition of what is in their Scripture (came unto them, through transgression among themselves) out of resentful envy. (Whoso disbelieveth the revelations of Allah) Muhammad and the Qur'an ((will find that) Lo! Allah is swift at reckoning) severe in His punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلدِّينَ } القيوم والشرع المستقيم المقبول المرضي { عِندَ ٱللَّهِ } الهادي للعباد إلى طريق الرشاد هو { ٱلإِسْلاَمُ } المنزل من عنده إلى خير الأنام سيدنا محمد صلى الله عليه وسلم { وَمَا ٱخْتَلَفَ } المعاندون المنكرون لدين الإسلام من { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ } أي: اليهود والنصارى { إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ } اليقيني في كتبهم المنزلة من عند الله بأنه سيظهر النبي الحق، والدين الحق الناسخ لجميع الأديان السابقة، وعلموا حين ظهوره حقيته بالدلائل والعلامات المبينة في كتابهم، ومع ذلك ينكرونه { بَغْياً } حسداً ثابتاً { بَيْنَهُمْ } ناشئاً من طلب الرئاسة والاستكبار والعتو الإصرار { وَمَن يَكْفُرْ بِآيَاتِ ٱللَّهِ } بأمثال هذه الأباطيل المموهة يجازيهم على كل منها بلا فوت شيء { فَإِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ } [آل عمران: 19] لا ي عزب عن علمه شيء، شديد العقاب لمن أنكر آياته بعد ظهور حقيتها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن الدين عند الله الإسلام } أي: إن الدين المرضى عند الله هو الانقياد لأمر التوحيد والإذعان لمن جاء به\n ورُوِيَ عن أنسَ رضي الله عنه قال: قال النبيّ صلى الله عليه وسلم:\n\n \" من قرأَ هذه الآيةَ عند منامه خَلَقَ اللَّهَ تعالى سبعين ألف خَلْقٍ يستغفرون الله له إلى يوم القيامة \" \n\nوهي أعظم شهادة في كتاب الله،\n\n \" من قرأها إلى الحكيم وقال: وأنا أشهد بما شهد الله به، وأستودِعُ اللّهَ هذه الشهادة، وهي لي عند الله وديعة، يقول الحق تعالى: إن لعبدي هذا عندي عهداً وأنا أحقُّ مَنْ وفى بالعهد، أدخِلوا عبدي الجنة \"\n \n\nالإشارة: صدرُ الآية يشير إلى الفرق، وعَجُزُها يشير إلى الجمع، كما هي عادته تعالى في كتبه العزيز، يشرع أولاً، ويُحَقِّق ثانياً، فأثبت الحق - جلّ جلاله - شهادة الملائكة وأولى العلم مع شهادته لإثبات سر الشريعة، ثم محاها بقوله: { لا إله إلا هو العزيز الحكيم } بحكم الحقيقة\n فإثبات الرسوم شريعة، ومحوها حقيقة، فتوحيد أهل الرسوم والأشكال دلالة من وراء الحجاب، وتوحيد أهل المحو والاضمحلال شهادة من داخل الحجاب، وتوحيد أهل الرسوم دلالة وبرهان، وتوحيد أهل المحو شهادة وعيان، أهل الدليل والبرهان عموم عند أهل الشهود والعيان\n إثبات الرسوم إسلام وإيمان، ومحوها شهود وإحسان، وكل توحيد لم تظهر ثمرته على الجوارح من الإذعان والانقياد لأحكام العبودية فهو مخدج، لقوله تعالى:\n\n[آل عِمرَان: 19] أي، الانقياد والإذعان، ظاهراً وباطناً، لأحكام القهرية والتكليفية، فمن لا انقياد له لا دين له كاملاً\n ثم ذكر من سبق له الخذلان بعد سطوع الدليل والبُرهان، فقال: {\n\n\n وَمَا ٱخْتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ بَغْياً بَيْنَهُمْ وَمَن يَكْفُرْ بِآيَاتِ ٱللَّهِ فَإِنَّ ٱللَّهِ سَرِيعُ ٱلْحِسَابِ }  قلت: { بغياً }: مفعول له، علة للاختلاف\n يقول الحقّ جلّ جلاله: { وما اختلف } اليهود والنصارى في حقيقة الإسلام والتدين به، { إلا من بعد ما جاءهم العلم } أي: من بعد ما تمكنوا من العلم بصحته، وأن الدين عند الله هو الإسلام، فجحدوه ظلماً وحسداً\n أو ما اختلف أرباب الكتب المتقدمة في دين الإسلام فأثبته قوم، وقال قوم: إنه مخصوص بالعرب، ونفاه آخرون مطلقاً، إلا من بعد ما ثبت لهم بصحته وعموم الدعوة له\n أو في التوحيد فثلث النصارى، وقالت اليهود: عزير ابن الله، بعد ما صح لهم العلم بالتوحيد فغيروا\n وقال الربيع: إن موسى عليه السلام لما حضره الموت، دعا سبعين حبراً من قومه، فاستودعهم التوراة، فلما مضى القرن الأول والثاني والثالث وقعت بينهم الفرقة، وهم: الذين أوتوا الكتاب من أبناء السبعين، فأراقوا الدماء ووقع بينهم الشر والاختلاف\n\n\nوذلك من بعد ما جاءهم العلم، يعني بيان ما في التوراة، { بغياً بينهم } أي: طلباً للملك والرئاسة والتحاسد، فسلّط عليهم الجبابرة، { ومن يكفر بآيات الله } المنزلة على رسوله، أو الدالة على وحدانيته، { فإن الله سريع الحساب } لا يشغله شأن عن شأن، وفيه تهديد لأهل الاختلاف\n الإشارة: الاختلاف على الصوفية، والإنكار عليهم، إن كان بغياً وحسداً وخوفاً على زوال رئاسة المنكر، فهذا معرض لمقت الله، فقد آذن بحرب الله، وبالُه سوء الخاتمة، والعياذ بالله، وفي ذلك يقول القائل:\n\nوإن كان غيره على الشريعة، وسدّاً لباب الذريعة، فهذا معذور أو مأجور إن صح قصده، وهو منخرط في سلك الضعفاء، قال تعالى:\n\n[التوبة: 91]، ولا ينكر على الفقير إلا المُحرَّم المجمع على تحريمه، وليس فيه تأويل، كالزنى بالمعينة، واللواط وشبهه، والمؤمن يلتمس المعاذر، والمنافق يلتمس العيوب، وبالله التوفيق وهو الهادي إلى سواء الطريق\n\n",
      "translations": []
    }
  ]
}