{
  "chapter": "آل عمران",
  "text": "ان الذين يكفرون بـايت الله ويقتلون النبين بغير حق ويقتلون الذين يامرون بالقسط من الناس فبشرهم بعذاب اليم",
  "translations": [
    {
      "translation": "To those who deny the signs of God, and slay the apostles unjustly, and slay the upholders of justice, give news of painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give those who refuse to follow the directives of Allah, who slay the Prophets unjustly, and who slay those who enjoin justice, give them glad tidings of a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn those who deny the revelations of God and unjustly slay the Prophets and those who call people to be just, that they will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in the signs of Allah, and wrongfully martyr the Prophets, and slay people who enjoin justice – so give them the glad tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve in the Ayat of Allah and kill the Prophets without right, and kill those men who order just dealings, then announce to them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who disbelieve in the communications of Allah and slay the prophets unjustly and slay those among men who enjoin justice, announce to them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in the signs of God and slay the Prophets without right, and slay such men as bid to justice -- do thou give them the good tidings of a painful chastisement;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve the revelations of Allah, and slay the prophets wrongfully, and slay those of mankind who enjoin equity: promise them a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny God's signs and kill the prophets unjustly and kill those who enjoin justice, give them warning of a woeful punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve in the revelations of Allah and slay the prophets without justice and slay those among men who command equity thou unto them a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Allah’s signs and kill the prophets unjustly and kill those who call for justice from among the people, inform them of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who deny the Signs of Allah and in defiance of right, slay the prophets, and slay those who teach just dealing with mankind, announce to them a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Those who disbelieve in the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah and kill the Prophets without right, and kill those men who order just dealings,  announce to them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve the verses of Allah and slay the Prophets unjustly, and slay those who bid to justice give them the glad tidings of a painful punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who defy God’s revelations, and kill the prophets unjustly, and kill those who advocate justice among the people—promise them a painful retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in the signs of Allah and kill the prophets without right and kill those who order justice from among the people - give them tidings of a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:21] Those who disbelieve in the signs of God and slay (yaqtulūna, is also read as yuqātilūna, ‘they fight against’) the prophets without right, and slay those who enjoin to equity, to justice, and these are the Jews, who are reported to have killed forty–three prophets and to have been forbidden this by a hundred and seventy devout worshippers among them, each of whom was killed immediately. So give them good tidings, let them know, of a painful chastisement. The use of ‘good tidings’ here is meant as a sarcastic ridicule of them (the fā’ [of fa-bashshirhum, so give them good tidings] is considered part of the predicate of inna because its noun, that is, its relative clause, resembles a conditional [sc. in yakfurūna, ‘if they disbelieve…’, fabashshirhum, ‘then, give them good tidings…’]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who disbelieve the revelations of Allah) in Muhammad and the Qur'an, (and slay the Prophets) i.e. ally themselves with those who slay the prophets (wrongfully) without them having committed any crime, (and slay those of mankind) who believed in the prophets (who enjoin equity) Allah's divine Oneness: (promise them a painful doom) which will spread out to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوقل لهم أيضاص تذكيراً واستحضاراً حكاية عن حال أسلافهم الماضين: { إِنَّ ٱلَّذِينَ يَكْفُرُونَ } ينكرون { بِآيَاتِ ٱللَّهِ } المنزلة على أنبيائه بعد ظهور صدقها وحقيتها { وَ } مع ذلك { يَقْتُلُونَ ٱلنَّبِيِّينَ } الذين أنزل عليهم الآيات من عنده سبحانه { بِغَيْرِ حَقٍّ } بلا رخصة شرعية أي: موافقة بشرع ودين { وَيَقْتُلُونَ } أيضاً { ٱلَّذِينَ يَأْمُرُونَ بِٱلْقِسْطِ } بالعدل { مِنَ ٱلنَّاسِ } الذين يتبعون شرائعهم وينقادون بأديانهم، ويمتثلون بأديانهم ويمتثلون بأوامرهم وأحكامهم، جرى عليهم في الدنيا ما جرى، في الآخرة ما جرى بأضعاف ذلك لعلهم ينتبهوا ويمتنعوا، وإلا { فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ } [آل عمران: 21] جزاء لإصرارهم وعنادهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: إنما دخلت الفاء في خبر إنَّ لتضمن اسمها معنى الشرط لعموم الموصول وإبهامه، وهو خاص بإنَّ، دون ليت ولعل لأن \" إن \" لا تغير معنى الابتداء، وإنما تؤكده\n وقيل: الخبر: { أولئك\n\n\n } الخ\n يقول الحقّ جّل جلاله: { إن الذين يكفرون بآيات الله } أي: بحُججه الدالة على توحيده، وصحة نبوة رسله، أو بكلامه، وهم اليهود، { ويقتلون النبيين بغير حق } بل بغياً { ويقتلون الذين يأمرون } بالعدل وترك الظلم من الأحبار { فبشرهم بعذاب أليم } موجع، { أولئك الذين حبطت أعمالهم } أي: بطلت، { في الدنيا والآخرة } فلا ينتفعون بها في الدارين، { وما لهم من ناصرين } يمنعونهم من العذاب\n\n \"\n وعن أبي عبيدة بن الجراح رضي الله عنه قال: سألت النبيّ صلى الله عليه وسلم أيُّ النَّاسِ أشَدُّ عَذَاباً يَوْمَ القيامة؟ قال: رَجُلٌ قَتَلَ نَبِيّاً، أو رَجل أمَرَ بالمُنكَر ونَهَى عن المَعْرُوفِ، ثم قرأ النبيّ صلى الله عليه وسلم { ويقتلون النبيين بغير حق } الآية، ثم قال: يا أبَا عُبَيْدَةَ، قتلَتْ بَنُوا إسْرَائِيلَ ثلاثةً وأرْبَعِين نبيّاً أوَّل النَّهَار في سَاعَةٍ، فقام مائة وعشرون من عُبَّادِ بَني إسْرَائِيل فأَمرُوهم بالمَعرُوف ونَهوهُمْ عن المنكر، فقتلوهم جميعاً مِنْ آخِرِ النَّهارِ من ذلك اليوم، فهم الذين ذكرهم في كتابه، وأنزل الآية فيهم \" \n",
      "translations": []
    }
  ]
}