{
  "chapter": "آل عمران",
  "text": "او۟لئك الذين حبطت اعملهم فى الدنيا والءاخرة وما لهم من نصرين",
  "translations": [
    {
      "translation": "Their good deeds will be wasted in this world and in the next, and none will they have to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the people whose works have gone to waste in this world and in the World to Come. They have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deeds of such people are made devoid of all virtue in both this life and the life to come. There will be no one to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose deeds are wasted in this world and in the Hereafter; and they do not have any aides.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose works will be lost in this world and in the Hereafter, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they whose works shall become null in this world as well as the hereafter, and they shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their works have failed in this world and the next; they have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they whose works have failed in the world and the Hereafter; and they have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their deeds will come to nothing in this world as well as in the hereafter; they will have no supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they whose works have Come to naught in the world and the Hereafter, nor have they helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones whose works have failed in this world and the Hereafter, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose works will bear no fruit in this world and in the Hereafter nor will they have anyone to help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose works will be lost in this world and in the Hereafter, and they will have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their works shall be annulled in this world and in the Everlasting Life, and there shall be none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whose deeds will come to nothing, in this world and in the Hereafter; and they will have no saviors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones whose deeds have become worthless in this world and the Hereafter, and for them there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:22] Those are the ones whose works, what good they did in the way of charity and kindness to kin, have failed, [whose works] are invalid, in this world and the Hereafter, and so they have nothing to reckon with, since these [works] are of no consequence; they have no helpers, [no] protectors from the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they whose works) good deeds (have failed) made void (in the world and the Hereafter) that is, they will not be given reward for them in the Hereafter; (and they have no helpers) who will save them from Allah's punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُولَـٰئِكَ } المصرون المعاندون هم { ٱلَّذِينَ حَبِطَتْ } ضاعت { أَعْمَالُهُمْ } كلها بحيث لا ينفع لهم عند الله لا { فِي ٱلدُّنْيَا وَ } ولا في { ٱلآخِرَةِ وَمَا لَهُمْ } عند ربهم من يشفع لهم أو يعين عليهم { مِّن نَّاصِرِينَ } [آل عمران: 22] الذين يدعون الاقتداء بهم ويستنصرون منهم لكونهمه ضالين منهمكين في الغفلة، لاحظ لهم من الهداية أصلا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}