{
  "chapter": "آل عمران",
  "text": "الم تر الى الذين اوتوا۟ نصيبا من الكتب يدعون الى كتب الله ليحكم بينهم ثم يتولى فريق منهم وهم معرضون",
  "translations": [
    {
      "translation": "Have you not seen the people who have received a part of Revelation who are called to the Book of God that it may judge (in their disputes) between them? But some, being averse turn away,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not noticed those who have been given a portion of the Book? Whenever their learned men are summoned to the Book of Allah to judge the differences between them, a party of them turns away in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), consider those who have received a share of the Book. When they refer to the Book in order to judge amongst themselves, a group of them turn away with disregard\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see them who have received a part of the Book – when called towards the Book of Allah for judging between them, a group of them opposes it and turns away?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have been given a portion of the Scripture They are being invited to the Book of Allah to settle their dispute, then a party of them turned away, and they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those (Jews) who are given a portion of the Book? They are invited to the Book of Allah that it might decide between them, then a part of them turn back and they withdraw.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who were given a portion of the Book, being called to the Book of God, that it might decide between them, and then a party of them turned away, swerving aside?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen how those who have received a portion of the Scripture invoke the Scripture of Allah (in their disputes) that it may judge between them; then a faction of them turn away, being opposed (to it)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who received a portion of the Book? When they are invited to accept the judgement of God's Book, a group of them turns away in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those vouchsafed a portion of the Book called to the Book of Allah that it may judge between them? Then a party of them turn away and they are backsliders\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who were given a share of the Book, who are summoned to the Book of Allah in order that it may judge between them, whereat a part of them refuse to comply and they are disregardful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned Thy vision to those who have been given a portion of the Book? They are invited to the Book of Allah, to settle their dispute, but a party of them Turn back and decline (The arbitration).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have been given a portion of the Scripture? They are being invited to the Book of Allah to settle their dispute, then a party of them turn away, and they are averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have received a portion of the Book being called to the Book of Allah, that it might judge between them, and some turned away, swerving aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were given a share of the Scripture, as they were called to the Scripture of God to arbitrate between them; then some of them turned back, and declined?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not consider, [O Muhammad], those who were given a portion of the Scripture? They are invited to the Scripture of Allah that it should arbitrate between them; then a party of them turns away, and they are refusing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:23] Have you not seen those who were given a portion, a share, of the Book, the Torah, being called to the Book of God (yud‘awna, ‘being called’, is a circumstantial qualifier), that it might decide between them, and then a party of them turned away, opposed? to the acceptance of its rulings. This was revealed concerning the Jews: two of them fornicated and they [the Jews] asked the Prophet (s) to adjudicate the case. He ruled that they be stoned, but they [the Jews] refused to do so. When the Torah was brought and consulted, the same verdict was found, and so the two were stoned, but they [the Jews] became wrathful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah mentions after this the rejection of stoning by the Banu Qurayzah and Banu'l-Nadir from among the people of Khaybar, saying: (Hast thou not seen) Muhammad! (how those who have received the Scripture) were given knowledge about what is in the Torah regarding stoning and other things (invoke the Scripture of Allah) the Qur'an ((in their disputes) that it may judge between them) about stoning the married man and married woman who committed adultery in Khaybar, as is in their Scripture; (then a faction of them) from Banu Qurayzah and the people of Khaybar (turn away) from the judgement, (being opposed (to it)) denying that judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي { إِلَى ٱلَّذِينَ } أي: إلى إصرار اليهود وعنادهم مع كونهم { أُوتُواْ نَصِيباً } كاملاً { مِّنَ ٱلْكِتَابِ } أي: التوراة في زعمهم حين { يُدْعَوْنَ } في الوقائع { إِلَىٰ } رجوع { كِتَابِ ٱللَّهِ } الذي يدعون الإيمان والعمل بمقتضاه { لِيَحْكُمَ بَيْنَهُمْ } بمقتضى ما أمره الله في كتابه كيف يتكاسلون ويتهاونون { ثُمَّ } يترقى تكاسلهم وتهاونهم إلى أن { يَتَوَلَّىٰ } يستدبر ونبذ { فَرِيقٌ مِّنْهُمْ } الكتاب وراء ظهروهم { وَهُمْ مُّعْرِضُونَ } [آل عمران: 23] عنه وعن أحكامه بالمرة\n\n\n\n\nروي أنه صلى الله عليه وسلم دخل مدارس اليهود، فقال لهم نعيم بن عمرو والحارث بن زيد: على أي دين أنت يا محمد؟ فقال: \" على دين أبي إبراهيم عليه السلام \" ، فقال: إن إبراهيم يهودي، فقال صلى الله عليه وسلم: \" هلموا كتابكم ليحكم بيننا وبينكم، فأنكروا عليه وامتنعا عن إحضاره فنزلت \":\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: التنكير في { نصيب } يحتمل التحقير والتعظيم، والأول أقرب\n وجملة: { وهم معرضون } حال من { فريق } يتخصيصه بالصفة\n يقول الحقّ جلّ جلاله: { ألم تر } يا محمد، أو مَنْ تصح منه الرؤية، { إلى الذين أوتوا نصيباً من الكتاب } وهم: اليهود، تمسكوا بشيء من التوارة، ولم يعملوا به كلّه، كيف { يدعون إلى كتاب الله } القرآن { ليحكم بينهم } فيما اختلفوا فيه من أمر التوحيد وصحة نبوته - عليه الصلاة والسلام -، فأعرضوا عنه، أو المراد بكتاب الله: التوراة\n قال ابن عباس رضي الله عنه: دخل النبيّ صلى الله عليه وسلم على جماعة من اليهود، فَدَعاهُمْ إلى الله تعالى، فقال نُعَيْمُ بْنُ عَمِرْو والحَارِثُ بَنْ زَيْد: على أيِّ دين أنْتَ يا مُحَمَّدُ؟ قال:\n\n \" على مِلَّةِ إبْرَاهِيم \" \n\nقالا: إنَّ إبرَاهِيم كان يَهُودِيّاً، فقال لهما النبيّ صلى الله عليه وسلم:\n\n \" فَهَلمُّوا إلى التَّوراةِ فهي بَيْنَنَا وبينكم \" \n\nفأبَيا عليه، فنزلت الآية\n وقيل: نزلت في الرجم، على ما يأتي في العقود",
      "translations": []
    }
  ]
}