{
  "chapter": "آل عمران",
  "text": "تولج اليل فى النهار وتولج النهار فى اليل وتخرج الحى من الميت وتخرج الميت من الحى وترزق من تشاء بغير حساب",
  "translations": [
    {
      "translation": "You make the night succeed the day, the day succeed the night, raise the living from the dead, the dead from the living, and give whomsoever You please, and in measure without number.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cause the night to pass into the day and the day to pass into the night. You bring forth the living out of the dead, and You bring the dead out of the living, and You give sustenance to whom You will beyond all reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cause the day to enter into the night and the night to enter into the day. You cause the living to come out of the dead and the dead to come out of the living. You give sustenance to whomever You want without keeping an account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You cause part of the night to pass into the day, and You cause part of the day to pass into the night; and You bring forth the living from the dead, and You bring forth the dead from the living; and You give to whomever You will, without account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You make the night to enter into the day, and You make the day to enter into the night, You bring the living out of the dead, and You bring the dead out of the living. And You give wealth and sustenance to whom You will, without limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou makest the night to pass into the day and Thou makest the day to pass into the night, and Thou bringest forth the living from the dead and Thou bringest forth the dead from the living, and Thou givest sustenance to whom Thou pleasest without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou makest the night to enter into the day and Thou makest the day to enter into the night, Thou bringest forth the living from the dead and Thou bringest forth the dead from the living, and Thou providest whomsoever Thou wilt without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou causest the night to pass into the day, and Thou causest the day to pass into the night. And Thou bringest forth the living from the dead, and Thou bringest forth the dead from the living. And Thou givest sustenance to whom Thou choosest, without stint.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cause the night to pass into the day, and the day into the night; You bring forth the living from the lifeless and the lifeless from the living. You give without measure to whom You will.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou plungest night into day and Thou plungest day into night, and Thou bringest forth the living from the lifeless, and Thou bringest forth the lifeless from the living; and Thou providest for whomsoever Thou wilt without reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘You make the night pass into the day and You make the day pass into the night. You bring forth the living from the dead and You bring forth the dead from the living, and You provide for whomever You wish without any reckoning.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou causest the night to gain on the day, and thou causest the day to gain on the night; Thou bringest the Living out of the dead, and Thou bringest the dead out of the Living; and Thou givest sustenance to whom Thou pleasest, without measure.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You make the night to enter into the day, and You make the day to enter into the night (i.e. increase and decrease in the hours of the night and the day during winter and summer), You bring the living out of the dead, and You bring the dead out of the living. And You give wealth and sustenance to whom You will, without limit (measure or account).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cause the night to enter into the day, and the day to enter into the night. You bring forth the living from the dead and the dead from the living. You provide without reckoning to whom You will'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You merge the night into the day, and You merge the day into the night; and you bring the living out of the dead, and You bring the dead out of the living; and You provide for whom you will without measure.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cause the night to enter the day, and You cause the day to enter the night; and You bring the living out of the dead, and You bring the dead out of the living. And You give provision to whom You will without account.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:27] You make the night to pass, to enter, into the day and You make the day to pass, to enter, into the night, each of them increasing by the amount by which the other decreases; You bring forth the living from the dead, such as humans and birds, from sperm-drops and eggs [respectively]; and You bring forth the dead, the sperm-drop and the egg, from the living, and You provide, with abundant provision, whom You will without reckoning’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then he showed Allah's might by saying: (Thou causest the night to pass into the day) You increase the 55 length of the day over the length of the night, such that the day is longer than the night, (and Thou causest the day to pass into the night) You increase the length of the night over the length of the day, such that the night is longer than the day. (And Thou bringest forth the living from the dead) He says: You bring forth a living creature from a sperm drop, (and Thou bringest forth the dead from the living) and You bring forth a sperm drop from man; it is also said that this verse means: You bring forth the living (a chicken) from the dead (an egg), and You bring forth the dead (a grain) from the living (a spike of grain). (And Thou givest sustenance to whom Thou choosest, without stint) without measure, exerting power or showing off Your blessings; it is also said that this means: You give wealth in abundance to whomever You choose without straitness or inconvenience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُولِجُ ٱللَّيْلَ فِي ٱلْنَّهَارِ } معناهُ تَنْقُصُ مِن اللَّيلِ فتُزيدُ فِي النَّهارِ وكَذَلِكَ النَّهارُ فِي اللَّيلِ\n\n\n\n\nوقوله تعالى: { تُخْرِجُ ٱلْحَيَّ مِنَ ٱلْمَيِّتِ } معناهُ الطَّيبُ مِنَ الخَبِيثِ والمُسْلِمُ من الكَافِرِ\n ويقالُ: تُخرجُ الحَيَّ مَن النُطْفَةِ المَيتَةِ، وتُخْرِجُ النُطْفَةَ المَيتةَ مِن الحَيِّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ تُولِج الليل في النهار وتُولج النهار في الليل } تدخل ظلمة النفس في نور القلب فيظلم، وتدخل نور القلب في ظلمة النفس فتستنير بخلطهما معاً مع بعد المناسبة بينهما { وتُخرج الحيّ } أي: حيّ القلب { من الميت } أي: من ميت النفس، وميت النفس من حيّ القلب، بل تخرج حيّ العلم والمعرفة من ميت الجهل، وتخرج ميت الجهل من حيّ العلم تحجبه عن النور، كحال بلعم بن باعورا { وترْزق من تَشاء } من النعمة الظاهرة والباطنة جميعاً، أو من إحداهما { بِغَير حِسَاب }  { لا يتخذ المؤمنون الكافرين أوْلِياء من دون المُؤْمنين } إذ لا مناسبة بينهم في الحقيقة، والولاية لا تكون إلاّ بالجنسية والمناسبة، فحينئذ لا يمكن أن تكون المحبة بينهم ذاتيّة، بل مجعولة مصنوعة بالتصنع والرياء والنفاق وهي خصال مبعدة عن الحق إذ كلها حجب ظلمانية ولو لم يكن فيهم ظلمة تناسب حال الكفرة ما قدروا على مخالطتهم ومصاحبتهم { ومن يفعل ذلك فليس من الله في شيء } أي: من ولاية الله في شيء، معتدّ به، إذ ليس فيهم نورية صافية يناسبون بها الحضرة الإلهية { إلا أن تتقوا منهم تقاة } أي: إلا أن تخافوا من جهتهم أمراً يجب أن يتقى، فتوالوهم ظاهراً ليس في قلوبكم شيء من محبّتهم، وذلك أيضاً لا يكون إلا لضعف اليقين\n إذ لو باشر قلوبهم اليقين لما خافوا إلا الله تعالى وشاهدوا معنى قوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن جملة مقدوراتك: إنك { تُولِجُ } تدخل وتدرج { ٱللَّيْلَ } أي: العدم { فِي } صورة { ٱلْنَّهَارِ } أي: الوجود إظهاراً لقدرتك وجمالك { وَتُولِجُ } أيضاً { ٱلنَّهَارَ } نور الوجود { فِي ٱلْلَّيْلِ } أي: مشكاة العدم؛ إظهاراً لقدرتك وجلالك { وَتُخْرِجُ } تظهر { ٱلْحَيَّ } والحق الحقيق مع غاية صفائها وظهورها { مِنَ ٱلْمَيِّتِ } العدم الأصلي الذي هو مرآة التعينات { وَ } أيضاً { تُخْرِجُ ٱلَمَيِّتَ } أي: العدم الجامد الذي ما شم رائحة الحياة أصلاً بامتداد أضلال أسمائك وصفاتك عليه { مِنَ ٱلْحَيِّ } الذي لا يموت أبداً وهو ذاتك { وَتَرْزُقُ } بلطفك { مَن تَشَآءُ } من مظاهرك من موائد فضلك وإنعامك ونوال جودك وإحسانك { بِغَيْرِ حِسَابٍ } [آل عمران: 27] تفضلاً لهم وامتناناً عليهم بلا مظاهرة أحد\n\n\n\n\nهب لنا بلطفك من لدنك رحمة إنك أنت الوهاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وتخرج الحي من الميت وتخرج الميت من الحي } كالحيوانات من النُّطَف، وبالعكس، والنباتات من الحبوب، وبالعكس، أو المؤمن من الكافر والعالم من الجاهل، وبالعكس، { وترزق من تشاء } من الأقوات والعلوم والأسرار، { بغير حساب } ، ولا تقدير ولا حصر\n اللهم ارزقنا من ذلك الحظ الأوفر، { إنك على كل شيء قدير }\n\n\n \" روى معاذ رضي الله عنه أن النبيّ صلى الله عليه وسلم قال له: يا معاذُ، أتحبُّ أن يقضيَ اللّهُ عنك دَيْنك؟ قال: نعم يا رسول الله، قال: قل \" { اللهم مالك الملك } إلى قوله: { بغير حساب } ، رحمن الدنيا والآخرة ورحيمهما، تعطي منهما ما تشاء، وتمنع منهما ما تشاء اقضِ عني ديني، فلو كان عليك ملءُ الأرض ذهباً وفضة لأدَّاه الله عنك \"\n \n\nورُوِيَ عن عليّ رضي الله عنه أنه قال: الفاتحة، وآية الكرسي، و { شهد الله } ، و { قل اللهم مالك الملك\n\n\n } إلى {\n\n\n بغير حساب } ، لمّا أراد الله أن ينزلهن، تعلقن بالعرش وقلن: تهبطنا إلى دار الذنوب فقال الله عزّ وجلّ:\n\n \" وعزّتي وجلالي لا يقرؤكن عبد، دبر كل صلاة مكتوبة، إلا أسكنته حظيرة القدس، على ما كان فيه، وإلا نظرت إليه بعيني المكنونة في كل يوم سبعين نظرة، وقضيت له في كل يوم سبعين حاجة، وأعززته من كل عدو، نصرته عليه\n\n\n \" \n\nالحديث\n انظر الثعلبي\n الإشارة: من ملك نفسه وهواه فقد ملكه الله ملك الدارين، ومن ملكته نفسه وهواه فقد أذلّه الله في الدراين ومن ملك نفسه لله فقد مكنه الله من التصرف في الكون بأسره، وكان حرّاً حقيقة، وفي ذلك يقول الشاعر:\n\nومن أذلَّ نفسه لله فقد أعزّه الله، قال الشاعر:\n\nقال ابن المبارك: قلت لسفيان الثوري: من الناس؟ قال: الفقهاء، قلت: فمن الملوك؟ قال: الزهادن قلت: فمن الأشراف؟ قال: الأتقياء، قلت: فمن الغوغاء؟ قال: الذين يكتبون الحديث ليستأكلوا به أموال الناس، قلت: أخبرني ما السفلة؟ قال: الظلمة\n وقال الشبلي: المُلك هو الاستغناء بالمكون عن الكونين\n وقال الوراق: تُعز من تشاء بقهر النفس ومخالفة الهوى، وتذل من تشاء باتباع الهوى\n قلت: وفي ذلك يقول البرعي رضي الله عنه:\n\nوقال وهب: \" خرج الغِنَى والعز يجولان، فلقيا القناعة فاستقرا \"\n وقال عيسى عليه السلام لأصحابه: أنتم أغنى من الملوك، قالوا: يا روح الله كيف، ولسنا نملك شيئاً؟ قال: أنتم ليس عنكم شيء ولا تريدونها، وهم عندهم أشياء ولا تكفيهم هـ\n\n\nقال الشافعي رضي الله عنه:\n\nوقال آخر:\n\nوقال عليه الصلاة والسلام:\n\n \" مِن أَصْبَحَ آمِناً فِي سِرْبِه، مُعَافى فِي بَدنه، عِنْدَهُ قُوتُ يَوْمِهِ، فَكَأَنَّمَا حِيزَتْ لَهُ الدُّنْيا بحذافيرها \"\n \n\nتولج ليل القبض في نهار البسط، وتولج نهار البسط في ليل القبض، وترزق من تشاء فيهما من العلوم والأسرار، بغير حساب ولا مقدار، أو تولج ليل العبودية في نهار الحرية، وتولج نهار الحرية في ليلة العبودية، فمن كان في نهار الحرية تاه على الوجود، ومن كان في ليل العبودية عطل ذله ذل اليهود، والعبد لا يخلو من هذين الحالين، يتعاقبان عليه تعاقب الليل والنهار، والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}