{
  "chapter": "آل عمران",
  "text": "ان الله لا يخفى عليه شىء فى الارض ولا فى السماء",
  "translations": [
    {
      "translation": "There is nothing in the earth and the heavens that is hidden from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing in the earth and in the heavens is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing in the heavens or the earth is hidden from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed nothing is hidden from Allah, neither in the earth nor in the heavens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, nothing is hidden from Allah, in the earth or in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah-- surely nothing is hidden from Him in the earth or in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From God nothing whatever is hidden in heaven and earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! nothing in the earth or in the heavens is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing on earth or in the heavens is hidden from God:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah aught is concealed from Him in the earth or in the\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is indeed hidden from Allah in the earth or in the sky.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From Allah, verily nothing is hidden on earth or in the heavens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, nothing is hidden from Allah, in the earth or in the heavens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing on earth or in heaven is hidden from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is hidden from God, on earth or in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, from Allah nothing is hidden in the earth nor in the heaven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:5] Nothing, no existent thing, whatever is hidden in heaven and earth from God, on account of His knowledge of universals and particulars. God specifies them [heaven and earth] because sensory perception does not go beyond these.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! nothing in the earth) of the story of the delegation of Najran (or in the heavens) concerning the angels (is hidden from Allah).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱللَّهَ } المحيط بجميع ما كان ويكون { لاَ يَخْفَىٰ عَلَيْهِ شَيْءٌ } مما حدث { فِي ٱلأَرْضِ }  { وَلاَ فِي } ما حدث { ٱلسَّمَآءِ } [آل عمران: 5] من الإيمان والكفر والهداية والضلالة، وغير ذلك من الأعمال والأحوال الصادرة من العباد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إن الله لا يخفى عليه شيء } من أمر خلقه، إيماناً أو كفراناً، طاعة أو عصياناً، أحاط علمه بما في السماوات العلي وما في الأرضين السفلى، كليّاً كان أو جزئيّاً، حسيّاً أو معنوياً، يعلم عدد الحصى والرمال، ومكاييل المياه ومثاقيل الجبال، ويعلم حوادث الضمائر، وهواجس الخواطر، بعلم قديم أزلي، وله قدرة نافذة وحكمة بالغة، فبقدرة صَوَّرَ النُّطَف في الأرحام كيف شاء سبحانه من نقص أو تمام، وأتقنها بحكمته، وأبرزها إلى ما يَسَّرَ لها من رزقه، سبحانه من مدبر عليم، عزيز حكيم، لا يُعجزه شيء، ولا يخرج عن دائرة علمه شيء، لا موجود سواه، ولا نعبد إلا إياه، وبالله التوفيق، وهو الهادي إلى سواء الطريق\n الإشارة: مَنْ تحقق أن الله واحدٌ في ملكه، لا شريك له في ذاته ولا في صفاته ولا في أفعاله، وأنه أحاط به علماً وسمعاً وبصراً، وأن أمره بين الكاف والنون،\n",
      "translations": []
    }
  ]
}