{
  "chapter": "آل عمران",
  "text": "هو الذى يصوركم فى الارحام كيف يشاء لا اله الا هو العزيز الحكيم",
  "translations": [
    {
      "translation": "He shapes you in the womb of the mother as He wills. There is no god but He, the all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who fashions you in the wombs as He wills. There is no God but He; the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who shapes you in the wombs as He wills. He is the only Lord, the Majestic, and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who fashions (moulds) you in your mothers’ wombs as He wills; none is worthy of worship except Him, the Almighty (the Most Honourable), the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shapes you in the wombs as He wills. None has the right to be worshipped but He, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shapes you in the wombs as He likes; there is no god but He, the Mighty, the Wise\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who forms you in the womb as He will. There is no god but He, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who fashioneth you in the wombs as pleaseth Him. There is no Allah save Him, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is He who shapes you in the womb as He will. There is no deity save Him, the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who fashionoth You in the Wombs as He will: there is no god but He, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who forms you in the wombs [of your mothers] however He wishes. There is no god except Him, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shapes you in the wombs as He pleases. There is no god but He, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who shapes you in the wombs as He pleases. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who shapes you in your mothers' wombs as He wills. There is no god except Him, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who forms you in the wombs as He wills. There is no god except He, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who forms you in the wombs however He wills. There is no deity except Him, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:6] He it is Who forms you in the wombs as He will, as males or females, white, black or otherwise. There is no god except Him, the Mighty, in His Kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who fashioneth you) creates you (in the wombs as pleaseth Him) short or tall, pretty or ugly, male or female, felicitous or damned. (There is no God) there is no fashioner or creator (save Him, the Almighty) Who is vengeful against whoever does not believe in Him, (the Wise) in creating what is in wombs.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفيكف يخفى عليه؛ إذ { هُوَ ٱلَّذِي يُصَوِّرُكُمْ } بقدرته ابتداء { فِي ٱلأَرْحَامِ } بعد انصبابكم من أصلاب آبائكم إليها { كَيْفَ يَشَآءُ } أي: كيف تتعلق مشيئته وإرادته بلا مزاحمة ضد، ومشاركة أحد من شريك وند؛ إذ { لاَ إِلَـٰهَ } أي: لا مصور ولا موجد { إِلاَّ هُوَ } يفعل ما يشاء ويحكم ما يريد، لا منازع له ولا مخاصم دونه بل هو { ٱلْعَزِيزُ } الغالب على كل ما يشاء { ٱلْحَكِيمُ } [آل عمران: 6] المتقن في كل ما يريد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}