{
  "chapter": "آل عمران",
  "text": "هو الذى انزل عليك الكتب منه ءايت محكمت هن ام الكتب واخر متشبهت فاما الذين فى قلوبهم زيغ فيتبعون ما تشبه منه ابتغاء الفتنة وابتغاء تاويله وما يعلم تاويله الا الله والرسخون فى العلم يقولون ءامنا به كل من عند ربنا وما يذكر الا او۟لوا۟ الالبب",
  "translations": [
    {
      "translation": "He has sent down this Book which contains some verses that are categorical and basic to the Book, and others allegorical. But those who are twisted of mind look for verses metaphorical, seeking deviation and giving to them interpretations of their own; but none knows their meaning except God; and those who are steeped in knowledge affirm: \"We believe in them as all of them are from the Lord.\" But only those who have wisdom understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has revealed the Book to you. Some of its verses are absolutely clear and lucid, and these are the core of the Book. Others are ambiguous. Those in whose hearts there is perversity, always go about the part which is ambiguous, seeking mischief and seeking to arrive at its meaning arbitrarily, although none knows their true meaning except Allah. On the contrary, those firmly rooted in knowledge say: 'We believe in it; it is all from our Lord alone.' No one derives true admonition from anything except the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has revealed the Book to you in which some verses are clear statements (which accept no interpretation) and these are the fundamental ideas of the Book, while other verses may have several possibilities. Those whose hearts are perverse, follow the unclear statements in pursuit of their own mischievous goals by interpreting them in a way that will suit their own purpose. No one knows its true interpretations except God and those who have a firm grounding in knowledge say, \"We believe in it. All its verses are from our Lord.\" No one can grasp this fact except the people of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent down to you (O dear Prophet Mohammed – peace and blessings be upon him) this Book (the Qur’an) containing the verses that have a clear meaning – they are the core of the Book – and other verses the meanings of which are indistinct; those in whose hearts is deviation pursue the verses having indistinct meanings, in order to cause turmoil and seeking its (wrongful) interpretation; and only Allah knows its proper interpretation; and those having sound knowledge say, “We believe in it, all of it is from our Lord”; and none accept guidance except the men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent down to you the Book. In it are verses that are entirely clear, they are the foundations of the Book; and others not entirely clear. So as for those in whose hearts there is a deviation (from the truth) they follow (only) that which is not entirely clear thereof, seeking Al-Fitnah, and seeking its Ta'wil, but none knows its Ta'wil except Allah. And those who are firmly grounded in knowledge say: \"We believe in it; all of it is from our Lord.\" And none receive admonition except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has revealed the Book to you; some of its verses are decisive, they are the basis of the Book, and others are allegorical; then as for those in whose hearts there is perversity they follow the part of it which is allegorical, seeking to mislead and seeking to give it (their own) interpretation. but none knows its interpretation except Allah, and those who are firmly rooted in knowledge say: We believe in it, it is all from our Lord; and none do mind except those having understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down upon thee the Book, wherein are verses clear that are the Essence of the Book, and others ambiguous. As for those in whose hearts is swerving, they follow the ambiguous part, desiring dissension, and desiring its interpretation; and none knows its interpretation, save only God. And those firmly rooted in knowledge say, 'We believe in it; all is from our Lord'; yet none remembers, but men possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath revealed unto thee (Muhammad) the Scripture wherein are clear revelations - they are the substance of the Book - and others (which are) allegorical. But those in whose hearts is doubt pursue, forsooth, that which is allegorical seeking (to cause) dissension by seeking to explain it. None knoweth its explanation save Allah. And those who are of sound instruction say: We believe therein; the whole is from our Lord; but only men of understanding really heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent down the Book to you. Some of its verses are clear and precise in meaning, they are the basis of the Book, while others are allegorical. Those with deviation in their hearts pursue the allegorical, so as to create dissension by seeking to explain it: but no one knows its meaning except God. Those who are firmly grounded in knowledge say, \"We believe in it: it is all from our Lord.\" But only the wise take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who hath sent down unto thee the Book, wherein some verses are firmly constructed they are the mother of the Book: and others consimilar. But those in whose hearts is and deviation follow that which is consimilar therein, seeking discord and seeking to misinterpret the same whereas none knoweth the interpretation thereof a save Allah. And the firmly- grounded in knowledge Say: we believe therein, the whole is from our Lord. And none receiveth admonition save men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent down to you the Book. Parts of it are definitive verses, which are the mother of the Book, while others are metaphorical. As for those in whose hearts is deviance, they pursue what is metaphorical in it, courting temptation, and seeking its interpretation. But no one knows its interpretation except Allah and those firmly grounded in knowledge; they say, ‘We believe in it; all of it is from our Lord.’ And none takes admonition except those who possess intellect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent down to thee the Book: In it are verses basic or fundamental (of established meaning); they are the foundation of the Book: others are allegorical. But those in whose hearts is perversity follow the part thereof that is allegorical, seeking discord, and searching for its hidden meanings, but no one knows its hidden meanings except Allah. And those who are firmly grounded in knowledge say: \"We believe in the Book; the whole of it is from our Lord:\" and none will grasp the Message except men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent down to you (Muhammad SAW) the Book (this Quran). In it are Verses that are entirely clear, they are the foundations of the Book [and those are the Verses of Al-Ahkam (commandments, etc.), Al-Fara'id (obligatory duties) and Al-Hudud (legal laws for the punishment of thieves, adulterers, etc.)]; and others not entirely clear. So as for those in whose hearts there is a deviation (from the truth) they follow that which is not entirely clear thereof, seeking Al-Fitnah (polytheism and trials, etc.), and seeking for its hidden meanings, but none knows its hidden meanings save Allah. And those who are firmly grounded in knowledge say: \"We believe in it; the whole of it (clear and unclear Verses) are from our Lord.\" And none receive admonition except men of understanding. (Tafsir At-Tabari).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent down to you the Book. Some of its verses are precise in meaning they are the foundation of the Book and others obscure. Those whose hearts are swerving with disbelief, follow the obscure desiring sedition and desiring its interpretation, but no one knows its interpretation except Allah. Those who are wellgrounded in knowledge say: 'We believe in it, it is all from our Lord. And none remember except those who are possessed of minds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who revealed to you the Book. Some of its verses are definitive; they are the foundation of the Book, and others are unspecific. As for those in whose hearts is deviation, they follow the unspecific part, seeking descent, and seeking to derive an interpretation. But none knows its interpretation except God and those firmly rooted in knowledge say, “We believe in it; all is from our Lord.” But none recollects except those with understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent down to you, [O Muhammad], the Book; in it are verses [that are] precise - they are the foundation of the Book - and others unspecific. As for those in whose hearts is deviation [from truth], they will follow that of it which is unspecific, seeking discord and seeking an interpretation [suitable to them]. And no one knows its [true] interpretation except Allah. But those firm in knowledge say, \"We believe in it. All [of it] is from our Lord.\" And no one will be reminded except those of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:7] He it is Who revealed to you the Book, wherein are verses [that are] clear, lucid in proof, forming the Mother Book, the original basis for rulings, and others allegorical, whose meanings are not known, such as the opening verses of some sūras. He [God] refers to the whole [Qur’ān] as: 1) ‘clear’ [muhkam] where He says [A Book] whose verses have been made clear [Q. 11:1], meaning that it contains no imperfections; and as 2) ‘allegorical’ [mutashābih], where He says A Book consimilar [Q. 39:23], meaning that its parts resemble each other in terms of beauty and veracity. As for those in whose hearts is deviation, inclination away from truth, they follow the allegorical part, desiring sedition, among the ignorant of them, throwing them into specious arguments and confusion, and desiring its interpretation, its explanation, and none knows its interpretation, its explanation, save God, Him alone. And those firmly rooted, established and capable, in knowledge (al-rāsikhūna fī’l-‘ilm is the subject, the predicate of which is [what follows]) say, ‘We believe in it, the allegorical part, that it is from God, and we do not know its meaning; all, of the clear and the allegorical, is from our Lord’; yet none remembers (yadhdhakkar, the initial tā’ [of yatadhakkar] has been assimilated with the dhāl), that is, none is admonished, but people of pith, possessors of intellect, who, when they see those following that [allegorical part only], also say:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath revealed unto thee (Muhammad) the Scripture) who sent you Gabriel with the Scripture (wherein are clear revelations) expositing the lawful and unlawful which are not abrogated and which are acted upon. (They are the substance of the Book) they are the foundation of the Book as they are the leading theme in each book. They are all acted upon. An example of this is the saying of Allah: (Say: Come, I will recite unto you that which your Lord hath made a sacred duty for you...) [6:151]. (And others (which are) allegorical) vague in their meanings to the Jews, like the use of the letters of the alphabet according to their numerical value (hisab al-Jumal) in such instances as Alif. Lam. Mim, Alif. Lam. Mim. Sad, Alif. Lam Mim. Ra; and Alif. Lam. Ra; it is also said that (others (which are) allegorical) means: other verses that are abrogated and no longer acted upon. (But those) the Jews Ka'b Ibn al-Ashraf, Huyayy Ibn Akhtab and Judayy Ibn Akhtab (in whose hearts is doubt) scepticism, opposition and deviance from guidance (pursue, forsooth, that which is allegorical seeking) in the Qur'an ((to cause) dissension) pursuing disbelief, ascribing partners to Allah, and holding fast to the error they are in (by seeking to explain it) to determine the future of this nation so that dominion reverts back to them. (None knoweth its explanation) the future of this nation (save Allah). Here Allah interrupts His speech and then resumes it by saying: (And those who are of sound instruction) those who have a sound grasp of the knowledge of the Torah: 'Abdullah Ibn Salam and his fellow companions (say: We believe therein) in the Qur'an; (the whole is from our Lord) Allah has revealed both those verses which are clear and those which are ambiguous; (but only men of understanding) who have sound minds such as 'Abdullah Ibn Salam and his fellow companions (really heed) take admonition from the simile of the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقولهِ تعالى: { في قُلُوبِهِمْ زَيْغٌ } معناهُ جَورٌ\n\n\n\n\nوقوله تعالى: { ٱبْتِغَاءَ ٱلْفِتْنَةِ } معناهُ: الكفرُ\n و: { ٱبْتِغَاءَ تَأْوِيلِهِ } معناهُ تَفسيرُهُ\n والابتِغَاءُ: الطَّلبُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nسمت من أن يتطرق إليها الاحتمال والاشتباه لا يحتمل إلا معنى واحداً { هنّ أمّ } أي: أصل { الكتاب وأُخَر مُتَشابهات } تحتمل معنيين فصاعداً ويشتبه فيها الحق والباطل، وذلك أنّ الحق تعالى له وجه هو الوجه المطلق الباقي بعد فناء الخلق لا يحتمل التكثر والتعدّد، وله وجوه متكثرة إضافية متعدّدة بحسب مرائي المظاهر\n وهي ما يظهر بحسب استعداد كل مظهر فيه من ذلك الوجه الواحد، يلتبس فيها الحق بالباطل، فورد التنزيل كذلك لتنصرف المتشابهات إلى وجوه الاستعدادات فيتعلق كل بما يناسبه، ويظهر الابتلاء والامتحان\n فأمّا العارفون المحققون الذين يعرفون الوجه الباقي في أية صورة وأي شكل كان، فيعرفون الوجه الحق من الوجوه التي تحتملها المتشابهات فيردونها إلى المحكمات متمثلين بمثل قول الشاعر:\n\nوأمّا المحجوبون { الذين في قُلُوبهم زَيغ } عن الحق { فيتبعون ما تَشَابه } لاحتجابهم بالكثرة عن الوحدة\n كما أن المحققين يتبعون المحكم، ويتبعونه المتشابه، فيختارون من الوجوه المحتملة ما يناسب دينهم ومذهبهم { ابْتِغاء الفِتْنة } أي: طلب الضلال والإضلال الذي هم بسبيله { وابْتِغَاء تَأْويله } بما يناسب حالهم وطريقتهم\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هُوَ ٱلَّذِيۤ } اصفاك يا أكمل الرسل لرسالته واجتباك لنيابته وخلافته، بأن { أَنزَلَ } تفضلاً وامتناً { عَلَيْكَ } من عنده لتصديقك وتأييدك { ٱلْكِتَابَ } المعجز لجميع من تحدى وتعارض معك تعظيماً لشأنك، وفصله بالسور والآيات الدالة على الأمور المتعلقة لأحوال العباد، وفي النشأة الأولى والأخرى؛ إذ { مِنْهُ آيَاتٌ مُّحْكَمَاتٌ } متعلقة بعموم أحوال العباد على اختلاف طبقاتهم في معاشهم معادهم من الأحكام والمعاملات والمعتقدات الجارية فيما بينهم بحسب النشأتين { هُنَّ أُمُّ ٱلْكِتَابِ } واجبة الاقتداء والامتثال لكافة الأنام { وَأُخَرُ مُتَشَابِهَاتٌ } متعلقة بالمعارف والحقائق المتربتة على الحكم والمصالح المودعة في إيجاب التكليفات، والطاعات والعبادات المؤدية إليها بالنسبة إلى أولى العزائم الصحيحة المتوجهة إلى بحر التوحيد\n\n\n\n\n{ فَأَمَّا الَّذِينَ في قُلُوبِهِمْ زَيْغٌ } ميل وعدول عن طريق الحق الجامع بين الظاهر والباطن { فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ } ويتركون الامتثال بمحكماته جهلاً وعناداً، ولم يعلموا أن الوصول إلى المعارف والحقائق إنما تنال بتهذيب الظاهر بامتثال المحكمات، وليس غرضهم من تلك المتابعة { ٱبْتِغَاءَ ٱلْفِتْنَةِ } أي: طلب إيقاع الفتنة بين الناس إفساد عقائدهم عن منهج التوحيد { وَٱبْتِغَاءَ تَأْوِيلِهِ } إلى ما يرتضيه عقولهم وتشتهيه نفوسهم، كالمبتدعة خذلهم الله { وَ } الحال أنه { مَا يَعْلَمُ تَأْوِيلَهُ } على ما ينبغي { إِلاَّ ٱللَّهُ } المنزل؛ إذ تأويل كلامه لا يسع لغيره إلا بتوفيقه وإعانته { وَٱلرَّاسِخُونَ فِي ٱلْعِلْمِ } اللدني المؤيدون من عنده بإلهامه ووحيه بمعارف وحقائق لا تحصل بمجرد القوة البشرية إلا بتأييد منه، وجذب من جانبه { يَقُولُونَ آمَنَّا بِهِ } أي: أيقنا وأذعنا بمحكمات الكتاب ومتشابهاته جميعاً؛ إذ { كُلٌّ } منزل { مِّنْ عِندِ رَبِّنَا } ومالنا أن يتفاوت فيه { وَمَا يَذَّكَّرُ } يتعظ ويتيقظ منه { إِلاَّ أُوْلُواْ ٱلأَلْبَابِ } [آل عمران: 7] المجبولون على لب التوحيد، المعرضون عن قشوره التي هي من مقتضيات القوى النفسانية، التي هي من جنود شياطين الأهواء الباطلة والآراء الفاسدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { منه }: خبر مقدم، و { آيات }: مبتدأ، فيوقف على { الكتاب } ، وقيل: { منه }: نعت لكتاب، وهو بعيد\n قال البن السبكي: المحكَم: المتضح المعنى، والمتشابه: ما استأثر الله بعلمه، وقد يُطْلعُ عليه بعضَ أصفيائه\n و { هن أم الكتاب }: جملة، وحق الخبر المطابقة فيقول: أمهات، وإنما أفرده على تأويل كل واحد، أو على أن الكل بمنزلة آية واحدة\n والزيغ: الميل عن الحق\n و { الراسخون في العلم }: معطوف على { الله } ، أو مبتدأ إن فسر المتشابه بما استأثر الله بعلمه، كمدة بقاء الدنيا ووقت قيام الساعة، أو بما دلّ القاطع على أن ظاهره غير مراد\n قاله البيضاوي",
      "translations": []
    }
  ]
}