{
  "chapter": "آل عمران",
  "text": "ربنا لا تزغ قلوبنا بعد اذ هديتنا وهب لنا من لدنك رحمة انك انت الوهاب",
  "translations": [
    {
      "translation": "Let us not go astray, O Lord, having guided us already. Bestow on us Your blessings for You are the benevolent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They pray to Allah: 'Our Lord! Do not let our hearts swerve towards crookedness after You have guided us to the right way, and. bestow upon us Your mercy. Surely You, only You, are the Munificent Giver!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"Lord, do not cause our hearts to deviate from Your guidance, and grant us mercy. You are the Most Awarding One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord! Do not deviate our hearts after You have guided us, and bestow mercy on us from Yourself; indeed You only are the Great Bestower.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They say): \"Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! make not our hearts to deviate after Thou hast guided us aright, and grant us from Thee mercy; surely Thou art the most liberal Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, make not our hearts to swerve after that Thou hast guided us; and give us mercy from Thee; Thou art the Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Cause not our hearts to stray after Thou hast guided us, and bestow upon us mercy from Thy Presence. Lo! Thou, only Thou, art the Bestower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, do not let our hearts deviate after You have guided us. Bestow upon us Your mercy. Surely You are a Munificent Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord Suffer not our hearts to deviate after that Thou hast guided US, and bestow from Thine presence mercy. Verily Thou! Thou art the Bestower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They say,] ‘Our Lord! Do not make our hearts swerve after You have guided us, and bestow Your mercy on us. Indeed, You are the All-munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord!\" (they say), \"Let not our hearts deviate now after Thou hast guided us, but grant us mercy from Thine own Presence; for Thou art the Grantor of bounties without measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They say): \"Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, do not cause our hearts to swerve after You have guided us. Grant us Your Mercy. You are the Embracing Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Our Lord, do not cause our hearts to swerve after You have guided us, and bestow on us mercy from Your presence; You are the Giver.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Who say], \"Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[3:8] Our Lord, do not cause our hearts to deviate, do not cause them to incline away from the truth, in [their] desire to interpret it, such as is inappropriate for us — as You caused the hearts of those [others] to deviate — after You have guided us, [after] You have shown us the way to it; and give us mercy from You, as a strengthening; You are the Bestower.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) these also say: our Lord! (Cause not our hearts to stray) do not make our hearts deviate from Your Religion (after Thou hast guided us) to Your Religion, (and bestow upon us mercy from Thy Presence) make us firm in holding to Your religion. (Lo! Thou, only Thou art the Bestower) to the believers before us; it is also said that this means: You are the Bestower of prophethood and Islam to Muhammad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن لَّدُنْكَ } معناه من عِنْدِكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ رَبَّنَا } يا من ربانا بلطفك على نشأة توحيدك { لاَ تُزِغْ } ولا تمل { قُلُوبَنَا } عن طريقك { بَعْدَ إِذْ هَدَيْتَنَا } عليه بإنزال الكتب وإرسال الرسل { وَهَبْ لَنَا } وتفضل علينا { مِن لَّدُنْكَ رَحْمَةً } علماً وعيناً وحقاً { إِنَّكَ أَنْتَ ٱلْوَهَّابُ } [آل عمران: 8] بلا إعراض وأغراض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إذ هديتنا }: ظرف مجرور بالإضافة مسبوك بالمصدر، أي: بعد هدايتك إيانا\n يقول الحقّ جلّ جلاله: إن الذي انفرد بالوحدانية والقيومية، ولا يخفى عليه شيء في العالم العلوي والسفلي { هو الذي أنزل عليك الكتاب } المبين، فمنه ما هو { آيات محكمات } واضحات المعنى، لا اشتباه فيها ولا إجمال، { هن أم الكتاب } أي: أصله، يُرد إليها غيرها، { و } منه آيات { أُخَر متشابهات } أي: محتملات، لا يتضح مقصودها لإجماله أو مخالفة ظاهر إلا بالفحص وجودة الفكر، ليظهر فضل العلماء النُقاد، ويزداد حرصهم على الاجتهاد في تَدبُرها وتحصيل العلوم المتوقف عليها استنباط المراد بها، فينال بها، وبإتعاب القرائح في استخراج معانيها، والتوفيق بينها وبين المحكمات، أعلى الدرجات وأرفع المقامات\n قال في نوادر الأصول: لمّا تكلم على المتشابه قسّمه على قسمين منه ما طوى علمه إلاَّ على الخواص كعلم فواتح السور، ومنه ما لم يصل إليه أحد من الرسل فمَنْ دُونَهم، وهو سر القدر لا يستقيم لهم مع العبودية، ولو كُشِفَ لفسدت العبودية، فطواه عن الرّسل والملائكة لأنهم في العبودية، فإذا زالت العبودية احتمولها أي: أسرار القدر\n هـ\n ولمثل هذا يشير قول سهل: للألوهية سر - لو انكشف لبطلت النبوة، وللنبوة سر - لو انكشف لبطل العلم، وللعلم سر لو انكشف لبطلت الأحكام\n هـ\n قلت: فَتَحَصَّل أن الكتاب العزيز مشتمل على المحكم والمتشابه\n وأما قوله تعالى:\n\n[هُود: 1] فمعناه: أنها حُفظت من فساد المعنى وركاكة اللفظ، وقوله تعالى:\n\n[الزُّمَر: 23] معناه: أنه يشبه بعضه بعضاً في صحة المعنى وجزالة اللفظ\n ثم إن الناس في شأن المتشابه على قسمين: { فأما الذين في قلوبهم زيغ }: أي: شك، أو ميل عن الحق، كالمبتدعة وأشباههم، { فيتبعون ما تشابه منه } ، فيتعلقون بظاهره، أو بتأويل باطل، { ابتغاء الفتنة } أي: طلباً لفتنة الناس عن دينهم: بالتشكيك والتلبيس، ومناقضة المحكم بالمتشابه، { وابتغاء تأويله } على ما يشتهون ليوافق بدعتهم\n رُوِيَ عن عائشة - رضي الله عنها-:أن النبيّ صلى الله عليه وسلم - قرأ هذه الآية فقال:\n\n\n\n \" إِذَا رَأَيتُم الذِينَ يَسألُون عن المتشابه منه، ويجادلون فيه، فهم الذين عَنَا الله تعالى، فاحذروهم، ولا تجالسوهم \"\n \n\n{ وما يعلم تأويله } على الحقيقة { إلا الله } تعالى، وقد يُطلع عليه بعضَ خواص أوليائه، وهم { الراسخون } أي: الثابتون في العلم، وهم العارفون بالله أهل الفناء والبقاء، وهم أهل التوحيد الخاص\n\n\n فقد أطلعهم تعالى على أسرار غيبه، فلم يبق عندهم متشابه في الكتاب ولا في السنة، حال كونهم { يقولون آمنا به } ، وصدقنا أنه من كلامه، { كُلّ من عند ربنا } المحكم والمتشابه، وقد فهمنا مراده في القسمين، وهم أولو الألباب، ولذلك مدحهم فقال: { وما يَذَكَّرَ إلا أُولوا الألباب } أي: القلوب الصافية من ظلمة الهوى وغَبَش الحس\n سُئل عليه الصلاة والسلام: مَن الراسخون في العلم؟ فقال:\n\n \" من برَّ يمينُه، وصدق لسانُه، واستقام قلبُه، وعفَّ بطنُه وفرجه، فذلك الراسخ في العلم \" \n\nوقال نافع بن يزيد: الراسخون في العلم: المتواضعون لله، المتذللون في طلب مرضات الله، لا يتعظمون على مَنْ فوقهم، ولا يحقرون من دونهم\n هـ\n وقيل: الراسخ في العلم: من وجُد فيه أربعة أشياء: التقوى بينه وبين الله، والتواضع بينه وبين الخلق، والزهد بينه وبين الدنيا، والمجاهدة بينه وبين نفسه\n هـ\n قلت: ويجمع هذ الأوصاف العارف بالله، فهو الراسخ في العلم كما تقدم\n ويقولون أيضاً في تضرعهم إلى الله: { ربنا لا تزغ قلوبنا } عن نهج الحق بالميل إلى اتباع الهوى، { بعد إذ هديتنا } إلى طريق الوصول إلى حضرتك، { وهب لنا من لدنك رحمة } تجمع قلوبنا بك، وتضم أرواحنا إلى مشاهدة وحدانيتك، { إنك أنت الوهاب } تهب للمؤمل فوق ما يؤمل",
      "translations": []
    }
  ]
}